Функция ПолучитьКартинкуПриоритетаБольшая(Приоритет) Экспорт

	Запрос = Новый Запрос;
	
	Запрос = ПолучитьЗапрос(, Ложь);
	
	Запрос.УстановитьПараметр("Приоритет", Приоритет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Картинка;	
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции 

Функция ПолучитьЗапрос(БольшаяКартинка = Истина, МалаяКартинка = Истина)

	ЗапросТекст = 
		"ВЫБРАТЬ
		|	ПриоритетыСтатус.БольшаяКартинка КАК Картинка
		|ИЗ
		|	Справочник.ПриоритетыСтатус КАК ПриоритетыСтатус
		|ГДЕ
		|	ПриоритетыСтатус.Ссылка = &ПриоритетыСтатус";
	
	Если БольшаяКартинка И НЕ МалаяКартинка Тогда
	
		Возврат ЗапросТекст;	
	
	ИначеЕсли БольшаяКартинка И НЕ МалаяКартинка Тогда
	
		Возврат СтрЗаменить(ЗапросТекст, 
		"ПриоритетыСтатус.БольшаяКартинка КАК Картинка", "ПриоритетыСтатус.БольшаяКартинка КАК БольшаяКартинка,	ПриоритетыСтатус.МалаяКартинка КАК МалаяКартинка");
	
	Иначе
	
		Возврат СтрЗаменить(ЗапросТекст, 
		"БольшаяКартинка", "МалаяКартинка");
	
	КонецЕсли;

КонецФункции // ПолучитьЗапрос()

