&НаКлиенте
Процедура ВывестиЦвет()
	Цвет = омЦветНаКлиенте.ПолучитьХТМЛЦвета(Объект.КодКрасный, Объект.КодЗеленый, Объект.КодСиний);
КонецПроцедуры // ВывестиЦвет()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВывестиЦвет();
КонецПроцедуры

&НаКлиенте
Процедура КодКрасныйПриИзменении(Элемент)
	ВывестиЦвет();
КонецПроцедуры

&НаКлиенте
Процедура КодЗеленыйПриИзменении(Элемент)
	ВывестиЦвет();
КонецПроцедуры

&НаКлиенте
Процедура КодСинийПриИзменении(Элемент)
	ВывестиЦвет();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
КонецПроцедуры

