&НаКлиенте
Процедура ВывестиЦвет()
	ЭтаФорма.Цвет = омЦветНаКлиенте.ПолучитьХТМЛЦвета(ЭтаФорма.Объект.КодКрасный,ЭтаФорма.Объект.КодЗеленый,ЭтаФорма.Объект.КодСиний);
КонецПроцедуры // ВывестиЦвет()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВывестиЦвет();
КонецПроцедуры


&НаКлиенте
Процедура КодКрасныйПриИзменении(Элемент)
	ВывестиЦвет();
КонецПроцедуры


&НаКлиенте
Процедура КодЗеленыйПриИзменении(Элемент)
	ВывестиЦвет();
КонецПроцедуры


&НаКлиенте
Процедура КодСинийПриИзменении(Элемент)
	ВывестиЦвет();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
КонецПроцедуры

