
Функция СоздатьДлительноеДействие(ОбъектДействия, НаименованиеДействия) Экспорт

	УИДДействия = Строка(Новый УникальныйИдентификатор());
	
	МенеджерЗаписи = РегистрыСведений.ДлительныеДействия.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОбъектДействия 		= ОбъектДействия;
	МенеджерЗаписи.УИДДействия 			= УИДДействия;
	МенеджерЗаписи.АвторДействия 		= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Дата 				= ТекущаяДата();
	МенеджерЗаписи.НаименованиеДействия = НаименованиеДействия;
	
	МенеджерЗаписи.Записать();
	
	Возврат УИДДействия;

КонецФункции // СоздатьДействие()


Функция СоздатьДлительноеДействиеДляКорректиовки(СтруктураПараметров, ДействиПриЗавершении) Экспорт
	
	Задача 					= СтруктураПараметров.ЗадачаСсылка;
	
	УИДДействия = Строка(Новый УникальныйИдентификатор());
	
	МенеджерЗаписи = РегистрыСведений.ДлительныеДействия.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОбъектДействия 		= Задача.ОбъектТЗ;
	МенеджерЗаписи.УИДДействия 			= УИДДействия;
	МенеджерЗаписи.АвторДействия 		= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Дата 				= ТекущаяДата();
	МенеджерЗаписи.НаименованиеДействия = СтруктураПараметров.НаименованиеДействия;
	МенеджерЗаписи.ИмяДействияДляФайла 	= СтруктураПараметров.ИмяДействияДляФайла;
	
	Попытка
		НачатьТранзакцию();
		
		МенеджерЗаписи.Записать();
		
		МенеджерЗаписи = РегистрыСведений.ДлительныеДействияЗадача.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Задача 				= Задача;
		МенеджерЗаписи.УИДДействия 			= УИДДействия;
		МенеджерЗаписи.ДействиПриЗавершении = ДействиПриЗавершении;
		
		МенеджерЗаписи.Записать();
		
		ЗафиксироватьТранзакцию();
		Возврат УИДДействия;
	Исключение
		ОтменитьТранзакцию();
		Возврат "";
	КонецПопытки;
	
	Возврат УИДДействия;
	
КонецФункции // СоздатьДействие()

Функция СоздатьДлительноеДействиеДляЗадачи(СтруктураПараметров, ДействиПриЗавершении) Экспорт
	
	Задача 					= СтруктураПараметров.ЗадачаСсылка;
	
	УИДДействия = Строка(Новый УникальныйИдентификатор());
	
	МенеджерЗаписи = РегистрыСведений.ДлительныеДействия.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОбъектДействия 		= Задача.ОбъектТЗ;
	МенеджерЗаписи.УИДДействия 			= УИДДействия;
	МенеджерЗаписи.АвторДействия 		= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Дата 				= ТекущаяДата();
	МенеджерЗаписи.НаименованиеДействия = СтруктураПараметров.НаименованиеДействия;
	МенеджерЗаписи.ИмяДействияДляФайла 	= СтруктураПараметров.ИмяДействияДляФайла;
	
	Попытка
		НачатьТранзакцию();
		
		МенеджерЗаписи.Записать();
		
		МенеджерЗаписи = РегистрыСведений.ДлительныеДействияЗадача.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Задача 				= Задача;
		МенеджерЗаписи.УИДДействия 			= УИДДействия;
		МенеджерЗаписи.ДействиПриЗавершении = ДействиПриЗавершении;
		
		МенеджерЗаписи.Записать();
		
		ЗафиксироватьТранзакцию();
		Возврат УИДДействия;
	Исключение
		ОтменитьТранзакцию();
		Возврат "";
	КонецПопытки;
	
	Возврат УИДДействия;
	
КонецФункции // СоздатьДействие()
