
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.СтатусИзменен = 0 Тогда
	
		Отказ = Истина;
		ПоказатьПредупреждение(,"Не указано действие");
	
	ИначеЕсли Объект.СтатусИзменен = 2 Тогда
		Если ЗначениеЗаполнено(ИсполнительДоработки) Тогда
			
			Объект.ДополнительныеДанные.Очистить();
			
			НС = Объект.ДополнительныеДанные.Добавить();
			НС.Наименование = "ИсправитьПрользователь";
			НС.Значение = ИсполнительДоработки;
			
			НС = Объект.ДополнительныеДанные.Добавить();
			НС.Наименование = "ИсправитьКомментарий";
			НС.Значение = КомментарийДоработки;
			
			НС = Объект.ДополнительныеДанные.Добавить();
			НС.Наименование = "КрайняяДатаИсполнения";
			НС.Значение = КрайняяДатаДоработки;
			
		Иначе
			
			Отказ = Истина;
			ПоказатьПредупреждение(,"Не указан исполнитель доработки");			
			
		КонецЕсли;
	Иначе
		Объект.ДополнительныеДанные.Очистить();
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	
	Если Объект.СтатусИзменен = 0 Тогда
	
		Отказ = Истина;
		ПоказатьПредупреждение(,"Не выбран статус");
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если Объект.СтатусИзменен = 1 И Объект.Выполнена Тогда
	
		стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Объект.ГабаритныйЧертеж, "СтатусГЧ");
		
		Если НЕ ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
			Сообщить(стВозврата.ОписаниеОшибки);
		КонецЕсли;
	
	КонецЕсли;
	
	Оповестить("ИзменениеЗамеров");
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусИзмененПриИзменении(Элемент)
	
	Если Объект.СтатусИзменен = 2 Тогда
		
		Элементы.ГруппаДоработка.Видимость = Истина;	
	
	Иначе
	
		Элементы.ГруппаДоработка.Видимость = Ложь;	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для каждого х Из  Объект.ДополнительныеДанные Цикл
		
		Если х.Наименование = "ИсправитьПрользователь" Тогда
			
			ИсполнительДоработки = х.Значение;
			
		ИначеЕсли х.Наименование = "ИсправитьКомментарий" Тогда
			
			КомментарийДоработки = х.Значение;
			
		ИначеЕсли х.Наименование = "КрайняяДатаИсполнения" Тогда
			
			КрайняяДатаДоработки = х.Значение;
			
		КонецЕсли;	
		
	КонецЦикла; 
	
	СтатусИзмененПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадачу(Команда)
	Объект.Выполнена = Истина;
	Записать();
	Закрыть();
КонецПроцедуры
