
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.СтатусИзменен = 0 Тогда
	
		Отказ = Истина; 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указано действие";
		Сообщение.Поле = "СтатусИзменен";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();
		

	ИначеЕсли Объект.СтатусИзменен = 2 Тогда
		Если ЗначениеЗаполнено(ИсполнительДоработки) Тогда
			
			Объект.ДополнительныеДанные.Очистить();
			
			НС = Объект.ДополнительныеДанные.Добавить();
			НС.Наименование = "ИсправитьПрользователь";
			НС.Значение = ИсполнительДоработки;
			
			НС = Объект.ДополнительныеДанные.Добавить();
			НС.Наименование = "ИсправитьКомментарий";
			НС.Значение = КомментарийДоработки;
			
			НС = Объект.ДополнительныеДанные.Добавить();
			НС.Наименование = "КрайняяДатаИсполнения";
			НС.Значение = КрайняяДатаДоработки;
			
		Иначе
			
			Отказ = Истина;
			ПоказатьПредупреждение(,"Не указан исполнитель доработки");			
			
		КонецЕсли;
	Иначе
		Объект.ДополнительныеДанные.Очистить();
	КонецЕсли;
	
	Если НЕ (Отказ ИЛИ Объект.Выполнена) Тогда
		
		Элементы.ВыполнитьЗадачу.Доступность 				= Истина;	
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	
	Если Объект.СтатусИзменен = 0 Тогда
	
		Отказ = Истина;
		ПоказатьПредупреждение(,"Не выбран статус");
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзменениеЗамеров");
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусИзмененПриИзменении(Элемент)
	
	Если Объект.СтатусИзменен = 2 Тогда
		
		Элементы.ГруппаДоработка.Видимость = Истина;	
	
	Иначе
	
		Элементы.ГруппаДоработка.Видимость = Ложь;	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для каждого х Из  Объект.ДополнительныеДанные Цикл
		
		Если х.Наименование = "ИсправитьПрользователь" Тогда
			
			ИсполнительДоработки = х.Значение;
			
		ИначеЕсли х.Наименование = "ИсправитьКомментарий" Тогда
			
			КомментарийДоработки = х.Значение;
			
		ИначеЕсли х.Наименование = "КрайняяДатаИсполнения" Тогда
			
			КрайняяДатаДоработки = х.Значение;
			
		КонецЕсли;	
		
	КонецЦикла; 
	
	СтатусИзмененПриИзменении(Неопределено); 
	
	Если Параметры.Ключ.Пустая() ИЛИ Объект.Выполнена Тогда
	
		Элементы.ВыполнитьЗадачу.Доступность 				= Ложь;	
	
	КонецЕсли; 
	
	ТолькоПросмотр 									= Объект.Выполнена;
	Элементы.ФормаЗаписатьЗадачу.Доступность 		= НЕ ТолькоПросмотр;	
	Элементы.ДекорацияЗадачаВыполнена.Видимость 	= ТолькоПросмотр;	
	
КонецПроцедуры     

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадачу(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.НовыйСтатус) Тогда
	
		ПоказатьПредупреждение(, "Не обходимо заполнить новый статус!");
		Возврат;
	
	КонецЕсли;
	
	Если Модифицированность Тогда	
		Записать(); 
	КонецЕсли;
	
	ЗаписатьВыполнениеНаСервере();
	
	Закрыть();
КонецПроцедуры  

&НаСервере
Процедура ЗаписатьВыполнениеНаСервере()
	
	ЗадачаОбъект = Объект.Ссылка.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецПроцедуры // ЗапмсатьВыполнениеНаСервере()  

&НаКлиенте
Процедура ЗадачуРКДВОжидание(Команда)
	ЗадачуРКДВОжиданиеНаСервере();
КонецПроцедуры                    

Процедура ЗадачуРКДВОжиданиеНаСервере()
	
	об = РеквизитФормыВЗначение("Объект");
	об.ПеревестиЗадачуРКДВОжидание(); 

КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Строка(ПараметрыСеанса.ТекущийПользователь) = "Программист" Тогда
	
		Элементы.ПеревестиЗадачуРКДВОжидание.Видимость = Ложь;	
	
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроектНаСервере(ГабаритныйЧертеж)
	
	СтруктурвВзврата = Новый Структура("Проект, Наименование", Справочники.Проекты.ПустаяСсылка(), "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежи.Наименование КАК Наименование,
		|	ГабаритныеЧертежи.Проект КАК Проект
		|ИЗ
		|	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
		|ГДЕ
		|	ГабаритныеЧертежи.Ссылка = &ГабаритныйЧертеж";
	
	Запрос.УстановитьПараметр("ГабаритныйЧертеж", ГабаритныйЧертеж);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктурвВзврата, Выборка);
	КонецЦикла;

	Возврат СтруктурвВзврата
	
КонецФункции

&НаКлиенте
Процедура ГабаритныйЧертежПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ГабаритныйЧертеж) Тогда
		
		СтруктурвВзврата 	= ПолучитьПроектНаСервере(Объект.ГабаритныйЧертеж);
		Объект.Наименование = СтруктурвВзврата.Наименование;
		Объект.Проект 		= СтруктурвВзврата.Проект;
		
	Иначе
	
		Объект.Наименование = "";
		Объект.Проект 		= ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
	
	КонецЕсли;
КонецПроцедуры


