
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ПлановаяГотовностьПомещений
	Движения.ПлановаяГотовностьПомещений.Записывать = Истина;
	Для Каждого ТекСтрокаПомещения Из Помещения Цикл
		Движение = Движения.ПлановаяГотовностьПомещений.Добавить(); 
		Движение.Период = Дата;
		Движение.Проект = Проект;
		Движение.Помещение = ТекСтрокаПомещения.Помещение;
		Движение.ДатаГотовности = ТекСтрокаПомещения.ДатаГотовности;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		Префикс = Проект.Префикс + "-";
		УстановитьНовыйНомер(Префикс); 
	КонецЕсли;
КонецПроцедуры
 
