
Функция ПолучитьТаблицуПроведения() Экспорт

	МасиивТипов = Новый Массив;
	МасиивТипов.Добавить(Тип("СправочникСсылка.ИзделияКомплект"));
	МасиивТипов.Добавить(Тип("СправочникСсылка.Композиции"));
	
	ТаблицаПроводок = Новый ТаблицаЗначений;
	ТаблицаПроводок.Колонки.Добавить("Комплект", 			Новый ОписаниеТипов(МасиивТипов));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийСостояние", Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЗадач"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийСтатус", 	Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийТипЗадачи", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадачКонструирования"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущаяСтадия", 	Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	ТаблицаПроводок.Колонки.Добавить("ЗадачаДляБлокировки", Новый ОписаниеТипов("ЗадачаСсылка"));
	
	Возврат ТаблицаПроводок;

КонецФункции // ПолучитьТаблицуПроведения()

Процедура РасчитатьКомплект(СтруктураТаблиц, Комплект) Экспорт

	ТаблицаСтатусов = СтруктураТаблиц.ТаблицаСтатусов;
	ТаблицаПроводок = СтруктураТаблиц.ТаблицаПроводок;
	
	НС 			= ТаблицаПроводок.Добавить();
	НС.Комплект	= Комплект; 
	
	СтрокаСостояния = ТаблицаСтатусов.Найти(Комплект, "Комплект");
	Если НЕ СтрокаСостояния = Неопределено Тогда
		
		НС.ПредыдущийСостояние 	= СтрокаСостояния.Состояние;
		НС.ПредыдущийСтатус 	= СтрокаСостояния.Статус;
		НС.ПредыдущийТипЗадачи 	= СтрокаСостояния.ТипЗадачи;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТекущиеСтатусы(МассивКомплектов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадачСрезПоследних.Задача КАК Задача,
		|	ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ КАК Комплект,
		|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние,
		|	ТаймингЗадачСрезПоследних.Статус КАК Статус,
		|	ТаймингЗадачСрезПоследних.ТипЗадачи КАК ТипЗадачи
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача.ОбъектТЗ В (&ОбъектТЗ)) КАК ТаймингЗадачСрезПоследних
		|ГДЕ
		|	НЕ ТаймингЗадачСрезПоследних.Задача.Выполнена";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", 	МассивКомплектов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьЗадачи(МассивКомплектов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПринятьТЗ.Ссылка КАК Задача
		|ИЗ
		|	Задача.ПринятьТЗ КАК ПринятьТЗ
		|ГДЕ
		|	ПринятьТЗ.ОбъектТЗ = &ОбъектТЗ
		|	И ПринятьТЗ.Выполнена";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", МассивКомплектов);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьКорточкиТЗ(МассивКомплектов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадачСрезПоследних.Задача КАК Задача,
		|	ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ КАК Комплект,
		|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние,
		|	ТаймингЗадачСрезПоследних.Статус КАК Статус,
		|	ТаймингЗадачСрезПоследних.ТипЗадачи КАК ТипЗадачи
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача.ОбъектТЗ В (&ОбъектТЗ)) КАК ТаймингЗадачСрезПоследних
		|ГДЕ
		|	НЕ ТаймингЗадачСрезПоследних.Задача.Выполнена";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", МассивКомплектов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьКарточкиПроизводства(МассивКомплектов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадачСрезПоследних.Задача КАК Задача,
		|	ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ КАК Комплект,
		|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние,
		|	ТаймингЗадачСрезПоследних.Статус КАК Статус,
		|	ТаймингЗадачСрезПоследних.ТипЗадачи КАК ТипЗадачи
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача.ОбъектТЗ В (&ОбъектТЗ)) КАК ТаймингЗадачСрезПоследних
		|ГДЕ
		|	НЕ ТаймингЗадачСрезПоследних.Задача.Выполнена";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", МассивКомплектов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

