
Функция ПолучитьТаблицуПроведения() Экспорт

	МасиивТипов = Новый Массив;
	МасиивТипов.Добавить(Тип("СправочникСсылка.ИзделияКомплект"));
	МасиивТипов.Добавить(Тип("СправочникСсылка.Композиции"));
	
	ТаблицаПроводок = Новый ТаблицаЗначений;
	ТаблицаПроводок.Колонки.Добавить("Комплект", 			Новый ОписаниеТипов(МасиивТипов));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийСостояние", Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЗадач"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийСтатус", 	Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийТипЗадачи", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадачКонструирования"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущаяСтадия", 	Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	ТаблицаПроводок.Колонки.Добавить("ЗадачаДляБлокировки");
	
	Возврат ТаблицаПроводок;

КонецФункции // ПолучитьТаблицуПроведения()

Процедура РасчитатьКомплект(СтруктураТаблиц, Комплект) Экспорт

	ТаблицаСтадия 		= СтруктураТаблиц.ТаблицаСтадия;
	ТаблицаСтатусов 	= СтруктураТаблиц.ТаблицаСтатусов;
	ТаблицаПроводок 	= СтруктураТаблиц.ТаблицаПроводок;
	ТаблицаЗадач 		= СтруктураТаблиц.ТаблицаЗадач;
	
	НС 			= ТаблицаПроводок.Добавить();
	НС.Комплект	= Комплект; 
	
	СтрокаСостояния = ТаблицаСтатусов.Найти(Комплект, "Комплект");
	Если НЕ СтрокаСостояния = Неопределено Тогда
		
		НС.ПредыдущийСостояние 	= СтрокаСостояния.Состояние;
		НС.ПредыдущийСтатус 	= СтрокаСостояния.Статус;
		НС.ПредыдущийТипЗадачи 	= СтрокаСостояния.ТипЗадачи;
		
	КонецЕсли;
	
	СтрокаСостояния = ТаблицаСтадия.Найти(Комплект, "Комплект");
	Если НЕ СтрокаСостояния = Неопределено Тогда
		НС.ПредыдущаяСтадия 	= СтрокаСостояния.ТекущаяСтадия;
	КонецЕсли;
	
	СтрокаСостояния = ТаблицаЗадач.Найти(Комплект, "Комплект");
	Если НЕ СтрокаСостояния = Неопределено Тогда
		НС.ЗадачаДляБлокировки 	= СтрокаСостояния.Задача;
	КонецЕсли;
	
	
КонецПроцедуры

Функция ПолучитьТекущиеСтатусы(МассивКомплектов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадачСрезПоследних.Задача КАК Задача,
		|	ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ КАК Комплект,
		|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние,
		|	ТаймингЗадачСрезПоследних.Статус КАК Статус,
		|	ТаймингЗадачСрезПоследних.ТипЗадачи КАК ТипЗадачи
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача.ОбъектТЗ В (&ОбъектТЗ)) КАК ТаймингЗадачСрезПоследних
		|ГДЕ
		|	НЕ ТаймингЗадачСрезПоследних.Задача.Выполнена";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", 	МассивКомплектов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьЗадачи(МассивКомплектов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПринятьТЗ.Ссылка КАК Задача,
		|	ПринятьТЗ.ОбъектТЗ КАК Комплект
		|ИЗ
		|	Задача.ПринятьТЗ КАК ПринятьТЗ
		|ГДЕ
		|	ПринятьТЗ.ОбъектТЗ В(&ОбъектТЗ)
		|	И НЕ ПринятьТЗ.Выполнена";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", МассивКомплектов);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьКорточкиТЗ(МассивКомплектов) Экспорт
	Возврат ПолучитьКарточкиКанбан(омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиДляТЗ"), МассивКомплектов);
КонецФункции

Функция ПолучитьКарточкиПроизводства(МассивКомплектов) Экспорт
	Возврат ПолучитьКарточкиКанбан(омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство"), МассивКомплектов);
КонецФункции  

Функция ПолучитьКарточкиКанбан(УИД_доски, МассивКомплектов)

	ПереопределенныеКолонки 	= Новый Массив(3);
	//"1"  выполнена. "100"  корзина "200" приостановлена.
	ПереопределенныеКолонки[0] 	= "1";  
	ПереопределенныеКолонки[1] 	= "100";
	ПереопределенныеКолонки[2] 	= "200";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКарточки.УИД КАК УИДКарточка,
		|	КанбанКарточки.Ресурс КАК Ресурс
		|ИЗ
		|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|ГДЕ
		|	КанбанКарточки.Ресурс В(&Ресурс)
		|	И КанбанКарточки.Доска = &Доска";
	
	Запрос.УстановитьПараметр("Ресурс", МассивКомплектов);
	Запрос.УстановитьПараметр("Доска", УИД_доски);
	
	Возврат Запрос.Выполнить().Выгрузить();
	

КонецФункции // получитьКарточкиКанбан()

Функция ПолучитьСтадииКомплектов(МассивКомплектов) Экспорт	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия.ОсновнойЭтап КАК ОсновнойЭтап
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект В (&МассивКомплектов)) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("МассивКомплектов", МассивКомплектов);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ПолучитьСтадииКомплектов()

Функция СоздатьМассивыКомплектов(ТаблицаСтадия) Экспорт	

	ОсновныеЭтапыКонструирования = Новый Массив(3);
	ОсновныеЭтапыКонструирования[0]	= Перечисления.ОсновныеЭтапы.ПКД;  
	ОсновныеЭтапыКонструирования[1]	= Перечисления.ОсновныеЭтапы.РКД;  
	ОсновныеЭтапыКонструирования[2]	= Перечисления.ОсновныеЭтапы.Согласование;  

	
	СтркутураМассивовКомплеты = Новый Структура("МассивовКомплетыКонструирование, МассивовКомплетыПрочие",
								Новый Массив,
								Новый Массив);
								
	Для каждого х Из ТаблицаСтадия Цикл
	
		Если ОсновныеЭтапыКонструирования.Найти(х.ОсновнойЭтап) = Неопределено Тогда
		
			СтркутураМассивовКомплеты.МассивовКомплетыПрочие.Добавить(х.Комплект);	
		
		Иначе
		
			СтркутураМассивовКомплеты.МассивовКомплетыПрочие.Добавить(х.Комплект);	
		
		КонецЕсли;	
	
	КонецЦикла;
	
	Возврат СтркутураМассивовКомплеты;

КонецФункции // ПолучитьСтадииКомплектов()

