Процедура ПолучитьДанныеЛегенды()
   
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Приоритеты.ЦветФона КАК ЦветФона,
		|	Приоритеты.ЦветТекста КАК ЦветТекста,
		|	Приоритеты.ВсегоЗадач КАК ВсегоЗадач,
		|	Приоритеты.КоличествоЗадачУКонструктора КАК КоличествоЗадачУКонструктора,
		|	Приоритеты.Наименование КАК Наименование,
		|	Приоритеты.Ссылка КАК Приоритет
		|ИЗ
		|	Справочник.Приоритеты КАК Приоритеты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритеты.НомерПоПорядку";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Легенда = омHTML.ПолучитьЗаголовокHTML();
	
	Легенда = Легенда + омHTML.ПолучитьHeadHTML("Легенда", 2);
	
	Легенда = Легенда + "<table style=""width: 100%;"">
							|<colgroup>
								|<col style=""width: 60%;"">
								|<col style=""width: 20%;"">
								|<col style=""width: 20%;"">
							|</colgroup>";
	Легенда = Легенда + "<tr><th>Приоритет</th><th>Всего задач</th><th>У Констр.</th></tr>";
	
	ШаблонСтроки = "<tr style=""background-color:%1"" style=""color:%2""><td>%3</td><td>%4</td><td>%5</td></tr>";
	
	Пока Выборка.Следующий() Цикл
		
		ВебЗначениеЦветаФона = омЦвет.ПолучитьВебПредставленияЦвета(Выборка.ЦветФона, Ложь);
		ВебЗначениеЦветТекст = омЦвет.ПолучитьВебПредставленияЦвета(Выборка.ЦветТекста);
		Легенда = Легенда + СтрШаблон(ШаблонСтроки, ВебЗначениеЦветаФона, ВебЗначениеЦветТекст, Выборка.Наименование, Выборка.ВсегоЗадач, Выборка.КоличествоЗадачУКонструктора);
		
		НС 				= ТаблицаЦветов.Добавить();
		НС.ВсегоЗадач 	= Выборка.ВсегоЗадач;
		НС.Приоритет 	= Выборка.Приоритет;
		НС.ЦветФона 	= омЦвет.ПолучитьЦветИзСтрокиСПрефиксом(Выборка.ЦветФона);
		НС.ЦветТекста 	= омЦвет.ПолучитьЦветИзСтрокиСПрефиксом(Выборка.ЦветТекста);
		
	КонецЦикла;
	
	Легенда = Легенда + "</table>";
	
	Легенда = Легенда + омHTML.ПолучитьХвостHTML();
	
КонецПроцедуры // ПолучитьДанныеЛегенды()

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолучитьДанныеЛегенды(); 
	ОбновитьНаСервере();
	
	ПоказатьПоКомплектам 	= Истина;
	ПоказатьПоКонструкторам = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьПриоритеты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.Приоритет КАК Приоритет,
		|	ДанныеКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	ДанныеКомплектаСрезПоследних.Комплект.Наименование КАК КомплектНаименование,
		|	ДанныеКомплектаСрезПоследних.Конструктор.Наименование КАК КонструкторНаименование,
		|	ДанныеКомплектаСрезПоследних.Приоритет.Наименование КАК ПриоритетНаименование,
		|	ВЫБОР
		|		КОГДА Задачи_РКД.Ссылка ЕСТЬ NULL
		|			ТОГДА Задачи_ПКД.Ссылка
		|		ИНАЧЕ Задачи_РКД.Ссылка
		|	КОНЕЦ КАК Задача,
		|	ВЫБОР
		|		КОГДА Задачи_РКД.Ссылка ЕСТЬ NULL
		|			ТОГДА Задачи_ПКД.Заголовок
		|		ИНАЧЕ Задачи_РКД.Заголовок
		|	КОНЕЦ КАК ЗадачаНаименование,
		|	ДанныеКомплектаСрезПоследних.Приоритет.НомерПоПорядку КАК НомерПоПорядку
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Задачи_РКД КАК Задачи_РКД
		|		ПО ДанныеКомплектаСрезПоследних.Комплект = Задачи_РКД.ОбъектТЗ
		|			И (НЕ Задачи_РКД.Выполнена)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ПО ДанныеКомплектаСрезПоследних.Комплект = Задачи_ПКД.ОбъектТЗ
		|			И (НЕ Задачи_ПКД.Выполнена)
		|ГДЕ
		|	НЕ ДанныеКомплектаСрезПоследних.Приоритет = ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка)";
	
	Приоритеты.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры 

Процедура ВывестиТаблицу()

	Приоритеты.Сортировать("НомерПоПорядку, КомплектНаименование");
	ВывестиПоКомплектам();
	Приоритеты.Сортировать("КонструкторНаименование, НомерПоПорядку, КомплектНаименование");
	ВывестиПоКонструкторам();

КонецПроцедуры

Процедура ВывестиПоКонструкторам()

	ПолеВыводаКонструкторы.Очистить(); 
	
	Макет = Отчеты.ПриоритетныеЗадачи.ПолучитьМакет("МакетПриоритет");
	ПолеВыводаКонструкторы.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	обСтрокаКонструктор	= Макет.ПолучитьОбласть("СтрокаКонструктор"); 
	обСтрока			= Макет.ПолучитьОбласть("Строка"); 
	
	текКонструктор 		= Неопределено;
	стОтбор 			= Новый Структура("Конструктор", );
	стОтборПриоритет	= Новый Структура("Приоритет", );
	
	ЧерныйЦвет		= Новый Цвет(0,   0,   0);
	БелыйЦвет		= Новый Цвет(255, 255, 255);
	
	Для каждого х Из Приоритеты Цикл
	
		Если НЕ текКонструктор = х.Конструктор Тогда
			
			текКонструктор 		= х.Конструктор;
			стОтбор.Конструктор = текКонструктор;
			стПриоритет 		= ПолучитьДанныеКонструктора(стОтбор);
			
			обСтрокаКонструктор.Параметры.КонструкторНаименование = х.КонструкторНаименование + ПолучитьДанныеКонструктора(стОтбор); 
			
			ПолеВыводаКонструкторы.Вывести(обСтрокаКонструктор); 
			
		КонецЕсли;
		
		обСтрока.Параметры.Заполнить(х);
		
		стОтборПриоритет.Приоритет = х.Приоритет;
		НайденыеСтроки = ТаблицаЦветов.НайтиСтроки(стОтборПриоритет);
		
		Если НайденыеСтроки.Количество() = 0 Тогда
			
			ЦветТекста 	= ЧерныйЦвет;
			ЦветФона 	= БелыйЦвет;
			
		Иначе
			
			текСтрока = НайденыеСтроки[0];
			ЦветТекста 	= текСтрока.ЦветТекста;
			ЦветФона 	= текСтрока.ЦветФона;
			
		КонецЕсли;
		
		обСтрока.Области.СтрокаЦвет.ЦветТекста 	= ЦветТекста;
		обСтрока.Области.СтрокаЦвет.ЦветФона 	= ЦветФона;
		
		ПолеВыводаКонструкторы.Вывести(обСтрока); 
		
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьДанныеКонструктора(стОтбор)

    НайденыеСтроки = Приоритеты.НайтиСтроки(стОтбор);
	

КонецФункции // ПолучитьДанныеКонструктора()



Процедура ВывестиПоКомплектам()

	ПолеВывода.Очистить(); 
	
	Макет = Отчеты.ПриоритетныеЗадачи.ПолучитьМакет("Макет");
	ПолеВывода.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	обСтрокаПриоритет	= Макет.ПолучитьОбласть("СтрокаПриоритет"); 
	обСтрока			= Макет.ПолучитьОбласть("Строка"); 
	
	текПриоритет 	= Неопределено;
	стОтбор 		= Новый Структура("Приоритет", );
	
	ЧерныйЦвет		= Новый Цвет(0,   0,   0);
	БелыйЦвет		= Новый Цвет(255, 255, 255);
	
	Для каждого х Из Приоритеты Цикл
	
		Если НЕ текПриоритет = х.Приоритет Тогда
			
			текПриоритет 		= х.Приоритет;
			
			стОтбор.Приоритет 	= текПриоритет;
			
			НайденыеСтроки = ТаблицаЦветов.НайтиСтроки(стОтбор);
			Если НайденыеСтроки.Количество() = 0 Тогда
			
				ВсегоЗадач 	= " из любого количества.";
				ЦветТекста 	= ЧерныйЦвет;
				ЦветФона 	= БелыйЦвет;
			
			Иначе
				
				текСтрока = НайденыеСтроки[0];
				Если текСтрока.ВсегоЗадач = 0 Тогда
					ВсегоЗадач 	= " из любого количества.";
				Иначе
					ВсегоЗадач 	= " из " + Формат(текСтрока.ВсегоЗадач, "ЧН=0; ЧГ=0");
				КонецЕсли;
				ЦветТекста 	= текСтрока.ЦветТекста;
				ЦветФона 	= текСтрока.ЦветФона;
			
			КонецЕсли;
		
			обСтрокаПриоритет.Области.Приоритет.ЦветТекста 	= ЦветТекста;
			обСтрокаПриоритет.Области.Приоритет.ЦветФона 	= ЦветФона;

			стПриоритет 		= ПолучитьДанныеПриоритета(стОтбор);
			обСтрокаПриоритет.Параметры.ПриоритетНаименование = х.ПриоритетНаименование + " задач " 
			+ Формат(стПриоритет.Количество, "ЧН=0; ЧГ=0") + ВсегоЗадач;
			
			ПолеВывода.Вывести(обСтрокаПриоритет); 
			
		КонецЕсли;
		
		обСтрока.Области.СтрокаЦвет.ЦветТекста 	= ЦветТекста;
		обСтрока.Области.СтрокаЦвет.ЦветФона 	= ЦветФона;
		
		обСтрока.Параметры.Заполнить(х);
		
		ПолеВывода.Вывести(обСтрока); 
			
	КонецЦикла;

КонецПроцедуры


Функция ПолучитьДанныеПриоритета(стОтбор)

	стПриоритет = Новый Структура("Количество", 0);
	стПриоритет.Количество = Приоритеты.НайтиСтроки(стОтбор).Количество();
	
	Возврат стПриоритет; 

КонецФункции // ПолучитьДанныеПриоритета()


&НаСервере
Процедура ОбновитьНаСервере()
	
	ЗаполнитьПриоритеты();
	ВывестиТаблицу();
	
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьПоКомплектамПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементов()
	
	Элементы.ПолеВывода.Видимость 				= ПоказатьПоКомплектам;
	Элементы.ПолеВыводаКонструкторы.Видимость 	= ПоказатьПоКонструкторам;
	Элементы.Легенда.Видимость 					= ПоказатьЛегенду;
	
КонецПроцедуры // ВидимостьЭлементов()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПоКонструкторамПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЛегендуПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыводаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	// Вставить содержимое обработчика.
КонецПроцедуры


