Процедура ПолучитьДанныеЛегенды()
   
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Приоритеты.ЦветФона КАК ЦветФона,
		|	Приоритеты.ЦветТекста КАК ЦветТекста,
		|	Приоритеты.ВсегоЗадач КАК ВсегоЗадач,
		|	Приоритеты.КоличествоЗадачУКонструктора КАК КоличествоЗадачУКонструктора,
		|	Приоритеты.Наименование КАК Наименование,
		|	Приоритеты.Ссылка КАК Приоритет
		|ИЗ
		|	Справочник.Приоритеты КАК Приоритеты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритеты.НомерПоПорядку";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Легенда = омHTML.ПолучитьЗаголовокHTML();
	
	Легенда = Легенда + омHTML.ПолучитьHeadHTML("Легенда", 2);
	
	Легенда = Легенда + "<table style=""width: 100%;"">
							|<colgroup>
								|<col style=""width: 60%;"">
								|<col style=""width: 20%;"">
								|<col style=""width: 20%;"">
							|</colgroup>";
	Легенда = Легенда + "<tr><th>Приоритет</th><th>Всего задач</th><th>У Констр.</th></tr>";
	
	ШаблонСтроки = "<tr style=""background-color:%1"" style=""color:%2""><td>%3</td><td>%4</td><td>%5</td></tr>";
	
	Пока Выборка.Следующий() Цикл
		
		ВебЗначениеЦветаФона = омЦвет.ПолучитьВебПредставленияЦвета(Выборка.ЦветФона, Ложь);
		ВебЗначениеЦветТекст = омЦвет.ПолучитьВебПредставленияЦвета(Выборка.ЦветТекста);
		Легенда = Легенда + СтрШаблон(ШаблонСтроки, ВебЗначениеЦветаФона, ВебЗначениеЦветТекст, Выборка.Наименование, Выборка.ВсегоЗадач, Выборка.КоличествоЗадачУКонструктора);
		
		НС 				= ТаблицаЦветов.Добавить();
		НС.Приоритет 	= Выборка.Приоритет;
		НС.ЦветФона 	= омЦвет.ПолучитьЦветИзСтрокиСПрефиксом(Выборка.ЦветФона);
		НС.ЦветТекста 	= омЦвет.ПолучитьЦветИзСтрокиСПрефиксом(Выборка.ЦветТекста);
		
	КонецЦикла;
	
	Легенда = Легенда + "</table>";
	
	Легенда = Легенда + омHTML.ПолучитьХвостHTML();
	
КонецПроцедуры // ПолучитьДанныеЛегенды()

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолучитьДанныеЛегенды(); 
	ЗаполнитьПриоритеты();
	ВывестиТаблицу();
	
КонецПроцедуры

Процедура ЗаполнитьПриоритеты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.Приоритет КАК Приоритет,
		|	ДанныеКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	ДанныеКомплектаСрезПоследних.Комплект.Наименование КАК КомплектНаименование,
		|	ДанныеКомплектаСрезПоследних.Конструктор.Наименование КАК КонструкторНаименование
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|ГДЕ
		|	НЕ ДанныеКомплектаСрезПоследних.Приоритет = ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеКомплектаСрезПоследних.Приоритет.НомерПоПорядку,
		|	ДанныеКомплектаСрезПоследних.Комплект.Наименование";
	
	Приоритеты.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры 

Процедура ВывестиТаблицу()

	ПолеВывода.Очистить(); 
	
	Макет = Отчеты.ПриоритетныеЗадачи.ПолучитьМакет("Макет");
	ПолеВывода.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	обСтрокаПриоритет	= Макет.ПолучитьОбласть("СтрокаПриоритет"); 
	обСтрока			= Макет.ПолучитьОбласть("Строка"); 
	обПриоритет			= Макет.ПолучитьОбласть("Приоритет"); 
	обСтрокаЦвет		= Макет.ПолучитьОбласть("СтрокаЦвет"); 
	
	текПриоритет = Неопределено;
	стОтбор = Новый Структура("Приоритет", );
	
	Для каждого х Из Приоритеты Цикл
	
		Если НЕ текПриоритет = х.Приоритет Тогда
		
			текПриоритет 		= х.Приоритет;
			стОтбор.Приоритет 	= текПриоритет; 
			стПриоритет 		= ПолучитьДанныеПриоритета(стОтбор);		
		
		КонецЕсли;	
	
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьДанныеПриоритета(стОтбор)

	стПриоритет = Новый Структура("Количество", 0);
	НайденыеСтроки = Приоритеты.НайтиСтроки(стОтбор);
	
	

КонецФункции // ПолучитьДанныеПриоритета()

