Процедура ПолучитьДанныеЛегенды()
   
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Приоритеты.ЦветФона КАК ЦветФона,
		|	Приоритеты.ЦветТекста КАК ЦветТекста,
		|	Приоритеты.ВсегоЗадач КАК ВсегоЗадач,
		|	Приоритеты.КоличествоЗадачУКонструктора КАК КоличествоЗадачУКонструктора,
		|	Приоритеты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Приоритеты КАК Приоритеты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритеты.НомерПоПорядку";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Легенда = омHTML.ПолучитьЗаголовокHTML();
	
	Легенда = Легенда + омHTML.ПолучитьHeadHTML("Легенда", 2);
	
	Легенда = Легенда + "<table style=""width: 100%;"">
							|<colgroup>
								|<col style=""width: 60%;"">
								|<col style=""width: 20%;"">
								|<col style=""width: 20%;"">
							|</colgroup>";
	Легенда = Легенда + "<tr><th>Приоритет</th><th>Всего задач</th><th>У Констр.</th></tr>";
	
	ШаблонСтроки = "<tr style=""background-color:%1"" style=""color:%2""><td>%3</td><td>%4</td><td>%5</td></tr>";
	
	Пока Выборка.Следующий() Цикл
		ВебЗначениеЦветаФона = омЦвет.ПолучитьВебПредставленияЦвета(Выборка.ЦветФона, Ложь);
		ВебЗначениеЦветТекст = омЦвет.ПолучитьВебПредставленияЦвета(Выборка.ЦветТекста);
		Легенда = Легенда + СтрШаблон(ШаблонСтроки, ВебЗначениеЦветаФона, ВебЗначениеЦветТекст, Выборка.Наименование, Выборка.ВсегоЗадач, Выборка.КоличествоЗадачУКонструктора);	
	КонецЦикла;
	
	Легенда = Легенда + "</table>";
	
	Легенда = Легенда + омHTML.ПолучитьХвостHTML();
	
КонецПроцедуры // ПолучитьДанныеЛегенды()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьДанныеЛегенды();
КонецПроцедуры
