
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КИ_Объекты = Справочники.ВидыКонтактнойИнформации.СправочникОбъекты.ПолучитьОбъект();
	КИ_Объекты.Используется = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(КИ_Объекты);
	
	КИ_Проекты = Справочники.ВидыКонтактнойИнформации.СправочникСотрудники.ПолучитьОбъект();
	КИ_Проекты.Используется = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(КИ_Проекты);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailСотрудника;
	ПараметрыВида.Наименование = НСтр("ru='E-mail Сотрудника'");
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника;
	ПараметрыВида.Наименование = НСтр("ru='Телефон сотрудника'");
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.АдресСотрудника;
	ПараметрыВида.Наименование = НСтр("ru='Адрес Сотрудника'");
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 3;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры
