//Статус 1 принят, 2 отказ, 0 Ожидание, -1 новый
&НаКлиенте                     
Перем ПолноеИмяФайла;

&НаКлиенте                     
Процедура Принять(Команда)
	
	Если НЕ КонтрольКонструкторов() Тогда
	    Возврат;
	КонецЕсли;
	
	Объект.Выполнена 	= Истина;
	Объект.Статус 		= 1;
	Записать();
	
	ИзменитьСтатусНаСервере(Объект.Статус, Объект.ОбъектТЗ, Объект.Версия, Объект.Комментарий);
	
	КоличествоЗадач = СоздатьЗадачиПКД();
	
КонецПроцедуры

Функция СоздатьЗадачиПКД()
	
	ТипыВнешнегоПроизводства = омВнешнееПроизводство.ТипВнешнегоПроизводства(Объект.ОбъектТЗ);
	
	Если НЕ ТипыВнешнегоПроизводства.ПКД Тогда
		
		тзКомплекты = Комплекты.Выгрузить();
		
		мКомплекты = тзКомплекты.ВыгрузитьКолонку("Комплект");
		мКомплекты.Добавить(Объект.ОбъектТЗ);
		
		мКонструкторы = тзКомплекты.ВыгрузитьКолонку("Конструктор");
		мКонструкторы.Добавить(КонструкторКомпозиции);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Задачи_ПКД.ОбъектТЗ КАК ОбъектТЗ
			|ИЗ
			|	Задача.Задачи_ПКД КАК Задачи_ПКД
			|ГДЕ
			|	Задачи_ПКД.ОбъектТЗ В(&ОбъектТЗ)
			|	И Задачи_ПКД.Основание = &Основание
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(Пользователи.Ссылка, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Пользователи,
			|	Сотрудники.Ссылка КАК Сотрудники
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО (Пользователи.Сотрудник = Сотрудники.Ссылка)
			|ГДЕ
			|	Сотрудники.Ссылка В(&мКонструкторы)";
		
		Запрос.УстановитьПараметр("Основание", 		Объект.Ссылка);
		Запрос.УстановитьПараметр("ОбъектТЗ", 		мКомплекты);
		Запрос.УстановитьПараметр("мКонструкторы", 	мКонструкторы);
		
		Результат = Запрос.ВыполнитьПакет();
		
		мСуществующиеЗадачи 	= Результат[0].Выгрузить().ВыгрузитьКолонку("ОбъектТЗ");
		
		тзСотрудникПользователь = Результат[1].Выгрузить();
		
		стПараметры = омЗадачиПКДСервер.ПолучитьСтркутуркДляСозданияПКД(Объект.ОбъектТЗ, Объект.Проект);
		
		КомплектыКоличество = 0;
		
		Если мСуществующиеЗадачи.Найти(Объект.ОбъектТЗ) = Неопределено Тогда
			
			ПользовательКонструкторЭлемент = тзСотрудникПользователь.Найти(КонструкторКомпозиции, "Сотрудники");
			
			Если ПользовательКонструкторЭлемент = Неопределено Тогда
				ПользовательКонструктор = Справочники.Пользователи.ПустаяСсылка();	
			Иначе	
				ПользовательКонструктор = ПользовательКонструкторЭлемент.Пользователи;	
			КонецЕсли;
			
			омЗадачиПКДСервер.СоздатьЗадачуПКД(Объект.ОбъектТЗ, ПользовательКонструктор, стПараметры, Объект.Ссылка);
			КомплектыКоличество = КомплектыКоличество + 1; 
			
		КонецЕсли;
		
		Для каждого х Из Комплекты Цикл
			
			Если НЕ мСуществующиеЗадачи.Найти(х.Комплект) = Неопределено Тогда
				Возврат Ложь;	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(стПараметры.Композиция) И КонструкторКомпозиции = х.Конструктор Тогда
				стПараметры.ОбобщеннаяЗадача	= Истина;
			Иначе
				стПараметры.ОбобщеннаяЗадача	= Ложь;
			КонецЕсли;
			
			ПользовательКонструкторЭлемент = тзСотрудникПользователь.Найти(х.Конструктор, "Сотрудники");
			
			Если ПользовательКонструкторЭлемент = Неопределено Тогда
				ПользовательКонструктор = Справочники.Пользователи.ПустаяСсылка();	
			Иначе	
				ПользовательКонструктор = ПользовательКонструкторЭлемент.Пользователи;	
			КонецЕсли;
			
			Результат = омЗадачиПКДСервер.СоздатьЗадачуПКД(х.Комплект, ПользовательКонструкторЭлемент, стПараметры, Объект.Ссылка); 
			КомплектыКоличество = КомплектыКоличество + 1; 
		КонецЦикла;
		
	ИначеЕсли ЗначениеЗаполнено(ТипыВнешнегоПроизводства.ЗадачаВнешнегоПроизводства) Тогда
		КомплектыКоличество = 0;	
	Иначе
		КомплектыКоличество = 0;
		омВнешнееПроизводство.СоздатьЗадачуВнешнегоПроизводства(Объект.ОбъектТЗ, Объект.Проект, , , Истина);
	КонецЕсли;
	
	
	Возврат КомплектыКоличество;
	
КонецФункции

&НаКлиенте
Функция КонтрольКонструкторов()
	
	Если НЕ ВыгруженВPDM Тогда
		ПоказатьПредупреждение(, Строка(Объект.ОбъектТЗ) + " нет выгрузки в PDM.");
		Возврат Ложь;
	КонецЕсли;
	
	Для каждого х Из Комплекты Цикл
		
		Если НЕ х.ВыгруженВPDM Тогда
			ПоказатьПредупреждение(, "Комплект " + Строка(х.Комплект) + " не выгружен в PDM.");
			Возврат Ложь;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // КонтрольКонструкторов()

&НаКлиенте
Процедура Отказать(Команда)
	Если ПустаяСтрока(Объект.Комментарий) Тогда
		
		ПоказатьПредупреждение(, "Для отказа необходимо заполнить комментарий");	
		
	Иначе
		
		Объект.Выполнена = Истина;
		Объект.Статус = 2;
		Записать();
		Закрыть();
		
		ИзменитьСтатусНаСервере(Объект.Статус, Объект.ОбъектТЗ ,Объект.Версия, Объект.Комментарий);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТЗ(Команда)
	
	ЗапуститьПриложение(ПутьКФайлуТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписанФайлТЗ" Тогда
		
		Если ПустаяСтрока(Параметр.ПолноеИмяФайла) Тогда
			ПоказатьПредупреждение(, "Не удалось получить файл ТЗ");
		ИначеЕсли Параметр.ПараметрыСохранения = "Открыть" Тогда
			ЗапуститьПриложение(Параметр.ПолноеИмяФайла);
		ИначеЕсли Параметр.ПараметрыСохранения = "Выгрузить" Тогда
			
			стПараметры = Новый Структура("ПолноеИмяФайла, Версия", Параметр.ПолноеИмяФайла, Объект.Версия);
			
			Результат = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Объект.ОбъектТЗ, "ЗагрузкаТЗ", стПараметры);
			
			Если ПустаяСтрока(Результат.ОписаниеОшибки) Тогда
				Сообщить(Формат(ТекущаяДата(), "ДЛФ=DT") + " Не удалось перенести файла ТЗ " + Параметр.ПолноеИмяФайла + ". " + Результат.ОписаниеОшибки);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзделиеКомплектИзменено" Тогда
		
		Для каждого х Из Комплекты Цикл
			
			Если х.Комплект = Параметр Тогда
				
				Обновить(Неопределено);
				Прервать;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьСтатусНаСервере(Статус, ОбъектТЗ ,Версия, Комментарий)
	
	МенеджерЗаписей = РегистрыСведений.ТЗ_Изделий.СоздатьМенеджерЗаписи();
	МенеджерЗаписей.ОбъектТЗ 	= ОбъектТЗ;
	МенеджерЗаписей.Версия 		= Версия;
	
	МенеджерЗаписей.Прочитать();
	
	МенеджерЗаписей.ОбъектТЗ 	= ОбъектТЗ;
	МенеджерЗаписей.Версия 		= Версия;
	МенеджерЗаписей.Статус 		= Статус;
	МенеджерЗаписей.Комментарий = Комментарий; 
	
	МенеджерЗаписей.Записать();
	
	Если Статус = 2 Тогда //Вернуть в канбан
		УИДКарточка = омКанбанТЗ.ПереместитьРеквизитВВозврат(ОбъектТЗ, Комментарий);	
		Если НЕ ПустаяСтрока(Комментарий) Тогда
			омКанбанТЗ.СоздатьКомментарий(УИДКарточка, Комментарий);	
		КонецЕсли;
	ИначеЕсли Статус = 1 Тогда //Завершить в канбан
		омКанбанТЗ.ПеревестиРеквизитВЗавершенный(ОбъектТЗ, Комментарий);	
	КонецЕсли;
	
КонецПроцедуры // ИзменитьСтатусНаСервере()

&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	ТД = Элементы.Комплекты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(Неопределено, ТД.Комплект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(Объект.ОбъектТЗ) = Тип("СправочникСсылка.Композиции") Тогда
		
		Комплекты.Загрузить(ЗаполнитьКомплекты(Объект.ОбъектТЗ, Истина));
		Элементы.ОбъектТЗ.Заголовок = "Композиция";
		
	Иначе 
		
		Элементы.ГруппаКомплекты.Видимость 	= Ложь;
		Элементы.ОбъектТЗ.Заголовок = "Комплект";
		
	КонецЕсли;
	
	стДанные = ПолучитьКонструктораОбъекта(Объект.ОбъектТЗ);
	КонструкторКомпозиции 	= стДанные.Конструктор;
	ВыгруженВPDM			= стДанные.ВыгруженВPDM;
	
	Элементы.ДекорацияОк.Видимость 		= ВыгруженВPDM;
	Элементы.ДекорацияСтоп.Видимость 	= НЕ ВыгруженВPDM;
	
	НаименованиКомплекта = "";
	
	ПутьКФайлуТЗ = омФайлы.ПолучитьПутьКФайлуТЗ(Объект.ОбъектТЗ, Объект.Проект, НаименованиКомплекта, Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГлабольныеСостояниеКомплектаСрезПоследних.ГлобальныйСтатус КАК ГлобальныйСтатус
	|ИЗ
	|	РегистрСведений.ГлабольныеСостояниеКомплекта.СрезПоследних КАК ГлабольныеСостояниеКомплектаСрезПоследних
	|ГДЕ
	|	ГлабольныеСостояниеКомплектаСрезПоследних.ЗадачаДляБлокировки = &ЗадачаДляБлокировки";
	
	Запрос.УстановитьПараметр("ЗадачаДляБлокировки", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Элементы.ДекорацияНаСтопе.Видимость = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ГлобальныйСтатус = Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы Тогда
			ТолькоПросмотр = Истина;	
			Элементы.ДекорацияНаСтопе.Видимость = Истина; 
			Элементы.Группа7.Доступность = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьКомплекты(Композиция, ВозвратВТаблице)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИзделияКомплект.Ссылка КАК Комплект,
	|	ВЫБОР
	|		КОГДА ДатыКомплекта.Код_в_PDM = 0
	|				ИЛИ ДатыКомплекта.Код_в_PDM ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВыгруженВPDM,
	|	ДанныеКомплекта.Конструктор КАК Конструктор
	|ИЗ
	|	Справочник.ИзделияКомплект КАК ИзделияКомплект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
	|		ПО (ДатыКомплекта.Комплект = ИзделияКомплект.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплекта
	|		ПО (ДанныеКомплекта.Комплект = ИзделияКомплект.Ссылка)
	|ГДЕ
	|	ИзделияКомплект.Родитель.Композиция = &Композиция
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИзделияКомплект.Наименование";
	
	Запрос.УстановитьПараметр("Композиция", Композиция);
	
	тзДанные = Запрос.Выполнить().Выгрузить();
	
	Если ВозвратВТаблице Тогда
		
		Возврат тзДанные;	
		
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(тзДанные);
	
КонецФункции // ЗаполнитьКомплекты()

&НаСервереБезКонтекста
Функция ПолучитьКонструктораОбъекта(ОбъектТЗ)
	
	стДанные = Новый Структура("ВыгруженВPDM, Конструктор", Ложь);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДатыКомплекта.Код_в_PDM = 0
	|				ИЛИ ДатыКомплекта.Код_в_PDM ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВыгруженВPDM,
	|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор
	|ИЗ
	|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &ОбъектТЗ) КАК ДанныеКомплектаСрезПоследних,
	|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
	|ГДЕ
	|	ДатыКомплекта.Комплект = &ОбъектТЗ";
	
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стДанные, Выборка); 
	КонецЦикла;
	
	Возврат стДанные;
	
КонецФункции // ПолучитьКонструктораОбъекта()

&НаСервереБезКонтекста
Процедура НазначитьОсновногоКонструктораНаСервере(КонструкторКомпозиции, мКомплекты)

	Автор = ПараметрыСеанса.ТекущийПользователь;
	ТД = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоМонтажа КАК ВнешняяДатаНачалоМонтажа,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоПроектирования КАК ВнешняяДатаНачалоПроектирования,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоПроизводства КАК ВнешняяДатаНачалоПроизводства,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоСогласования КАК ВнешняяДатаНачалоСогласования,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеМонтажа КАК ВнешняяДатаОкончаниеМонтажа,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеПроектирования КАК ВнешняяДатаОкончаниеПроектирования,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеПроизводства КАК ВнешняяДатаОкончаниеПроизводства,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеСогласования КАК ВнешняяДатаОкончаниеСогласования,
		|	ДанныеКомплектаСрезПоследних.Приоритет КАК Приоритет
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект В (&мКомплекты)) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("мКомплекты", мКомплекты);
	
	тзКонструкторКомплект = Запрос.Выполнить().Выгрузить();
	
	Для каждого Комплект Из мКомплекты Цикл
		
		НайденаяСтрока = тзКонструкторКомплект.Найти(Комплект, "Комплект");
		
		МенеджерЗаписей = РегистрыСведений.ДанныеКомплекта.СоздатьМенеджерЗаписи();
		
		Если НайденаяСтрока = Неопределено Тогда
			
			ТекущаяСтадия = Неопределено;
			
		ИначеЕсли НайденаяСтрока.Конструктор = КонструкторКомпозиции Тогда
			
			Продолжить;
			
		Иначе	
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаписей, НайденаяСтрока);
			
		КонецЕсли;
		
		МенеджерЗаписей.Период 			= ТД;
		МенеджерЗаписей.Комплект 		= Комплект;
		МенеджерЗаписей.Конструктор 	= КонструкторКомпозиции;
		МенеджерЗаписей.ТекущаяСтадия 	= ТекущаяСтадия;
		МенеджерЗаписей.Автор 			= Автор;
		
		МенеджерЗаписей.Записать();
		
		СтруктуруДляИзмененияИсполнителя = омЗадачаОбщаяНаСервере.ПолучитьСтруктуруДляИзмененияИсполнителя(КонструкторКомпозиции, , Истина);
		омЗадачаОбщаяНаСервере.ИзменитьИсполнителяЗадачиОбщей(СтруктуруДляИзмененияИсполнителя, Комплект); 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	стДанные = ПолучитьКонструктораОбъекта(Объект.ОбъектТЗ);
	КонструкторКомпозиции 	= стДанные.Конструктор;
	ВыгруженВPDM			= стДанные.ВыгруженВPDM;
	
	Элементы.ДекорацияОк.Видимость 		= ВыгруженВPDM;
	Элементы.ДекорацияСтоп.Видимость 	= НЕ ВыгруженВPDM;
	
	мКомплекты = ЗаполнитьКомплекты(Объект.ОбъектТЗ, Ложь);
	
	Комплекты.Очистить();
	
	Для каждого х Из мКомплекты Цикл
	
		ЗаполнитьЗначенияСвойств(Комплекты.Добавить(), х);	
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкторКомпозицииПриИзменении(Элемент)
	
	мОбъектов = Новый Массив;
	
	Для каждого х Из Комплекты Цикл
		
		Если НЕ ЗначениеЗаполнено(х.Конструктор) Тогда
		
			мОбъектов.Добавить(х.Комплект);	
		
		КонецЕсли;
		
	КонецЦикла;
	
	Если мОбъектов.Количество() = 0 Тогда
		
		омКонструктор.ИзменитьКонструктораНаСервере(Объект.ОбъектТЗ, КонструкторКомпозиции);
		
	Иначе
		
		мОбъектов.Добавить(Объект.ОбъектТЗ);
		омКонструктор.ИзменитьКонструктораНаСервере(мОбъектов, КонструкторКомпозиции);
		
	КонецЕсли;
	
	Обновить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПустаяСтрока(ПутьКФайлуТЗ) Тогда
		Элементы.ФормаОткрытьТЗ.Видимость = Ложь;
	Иначе
		
		Файл = Новый Файл(ПутьКФайлуТЗ);
		
		Если Файл.Существует() Тогда
			Элементы.ФормаОткрытьТЗ.Видимость = Истина;
		Иначе
			Элементы.ФормаОткрытьТЗ.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Заголовок = Объект.Наименование;
	
КонецПроцедуры


 
