//	    стПараметры  Структура("Ссылка,EnabledPDM,UserID,Username")
&НаСервере
Процедура ЗаписатьСотрудникPDM(стПараметры) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеСотрудникаВPDM.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДанныеСотрудникаВPDM КАК ДанныеСотрудникаВPDM
		|ГДЕ
		|	ДанныеСотрудникаВPDM.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", стПараметры.Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		обДанные = Справочники.ДанныеСотрудникаВPDM.СоздатьЭлемент();
	Иначе
		Пока Выборка.Следующий() Цикл
			обДанные = Выборка.Ссылка.ПолучитьОбъект(); 
		КонецЦикла;
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(обДанные,стПараметры);
	
	обДанные.Записать();
	
КонецПроцедуры // ЗаписатьПСотрудникPDM()

&НаСервере
Функция ПолучитьДанныеСотрудникаДляPDM(мСотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеСотрудникаВPDM.UserID КАК UserID,
		|	ДанныеСотрудникаВPDM.Username КАК Username,
		|	ДанныеСотрудникаВPDM.Enabled КАК Enabled,
		|	ДанныеСотрудникаВPDM.Сотрудник КАК Сотрудник,
		|	ДанныеСотрудникаВPDM.Ссылка КАК ДанныеСотрудникаВPDM
		|ИЗ
		|	Справочник.ДанныеСотрудникаВPDM КАК ДанныеСотрудникаВPDM
		|ГДЕ
		|	ДанныеСотрудникаВPDM.Сотрудник В(&мСотрудник)";
	
	Запрос.УстановитьПараметр("мСотрудник", мСотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Тип("Массив") = ТипЗнч(мСотрудник) Тогда
		Возврат РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	стВозврата = Новый Структура("UserID, Username, Enabled, ДанныеСотрудникаВPDM", 0, "", Ложь, Неопределено);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата,Выборка);
	КонецЦикла; 
	
	
    Возврат стВозврата;
КонецФункции // ПолучитьДанныеСотрудникаДляPDM()
