
&НаСервере
Функция СобратьАртикулИзДанных(СделкаПрефикс,НомерПомещения,НомерПоПорядку) Экспорт

	Возврат СделкаПрефикс + "." + НомерПомещения + "." + Формат(НомерПоПорядку,"ЧЦ=2; ЧВН=");	

КонецФункции // СобратьАртикулИзДанных()

&НаСервере
Функция ПолучитьМаксимальныйНомерИзделия(Сделка) Экспорт
	
	НомерПоПорядку = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ИзделияЭлемент.НомерПоПорядку) КАК НомерПоПорядку
		|ИЗ
		|	Справочник.ИзделияЭлемент КАК ИзделияЭлемент
		|ГДЕ
		|	ИзделияЭлемент.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НомерПоПорядку = Выборка.НомерПоПорядку; 
	КонецЦикла;
	
    Возврат НомерПоПорядку;
КонецФункции // ПолучитьМаксимальныйНомерИзделия()

&НаСервере
Функция ПолучитьПомещениеИзделия(ОсновноеИзделие) Экспорт

	Возврат ОсновноеИзделие.Помещения;	

КонецФункции // ПолучитьПомещениеИзделия()

