
Процедура ОбработкаПроведения(Отказ, Режим)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГлабольныеСостояниеКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ГлабольныеСостояниеКомплектаСрезПоследних.ПредыдущаяСтадия КАК ПредыдущаяСтадия,
		|	ГлабольныеСостояниеКомплектаСрезПоследних.ПредыдущийСтатус КАК ПредыдущийСтатус,
		|	ГлабольныеСостояниеКомплектаСрезПоследних.ПредыдущийТипЗадачи КАК ПредыдущийТипЗадачи
		|ИЗ
		|	РегистрСведений.ГлабольныеСостояниеКомплекта.СрезПоследних(, Комплект В (&Комплект)) КАК ГлабольныеСостояниеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", ИзделияКомплект.ВыгрузитьКолонку("ИзделиеКомплект"));
	
	ПредыдущиеСостояния = Запрос.Выполнить().Выгрузить();
	
	
	// регистр ГлабольныеСостояниеКомплекта
	Движения.ГлабольныеСостояниеКомплекта.Записывать = Истина;
	Для Каждого ТекСтрокаИзделияКомплект Из ИзделияКомплект Цикл
		Движение = Движения.ГлабольныеСостояниеКомплекта.Добавить();
		Движение.Период = Дата;
		Движение.Комплект = ТекСтрокаИзделияКомплект.ИзделиеКомплект;
		Движение.ИзделиеЗаказчика = Справочники.ИзделияЗаказчика.ПустаяСсылка();
		Движение.ГлобальныйСтатус = Перечисления.СтатусыЗадач.ПустаяСсылка();
		Движение.ЗадачаДляБлокировки = 2;
		Движение.ПредыдущаяСтадия = 3;
		Движение.ПредыдущийСостояние = 4;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
