
Процедура ОбработкаПроведения(Отказ, Режим)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГлабольныеСостояниеКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ГлабольныеСостояниеКомплектаСрезПоследних.ПредыдущаяСтадия КАК ПредыдущаяСтадия,
		|	ЕСТЬNULL(КанбанКолонки.УИД, """") КАК УИДКолонкиПроизводства,
		|	ЕСТЬNULL(КанбанКолонки1.УИД, """") КАК УИДТЗ
		|ИЗ
		|	РегистрСведений.ГлабольныеСостояниеКомплекта.СрезПоследних(, Комплект В (&Комплект)) КАК ГлабольныеСостояниеКомплектаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|			ПО (КанбанКолонки.Статус = СтадииКомплектаРеквизитыСтадии.Статус)
		|		ПО ГлабольныеСостояниеКомплектаСрезПоследних.СтадияПроизводства = СтадииКомплектаРеквизитыСтадии.Ссылка
		|			И (СтадииКомплектаРеквизитыСтадии.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии1
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКолонки КАК КанбанКолонки1
		|			ПО СтадииКомплектаРеквизитыСтадии1.Статус = КанбанКолонки1.Статус
		|		ПО ГлабольныеСостояниеКомплектаСрезПоследних.СтадияТЗ = СтадииКомплектаРеквизитыСтадии1.Ссылка
		|			И (СтадииКомплектаРеквизитыСтадии1.НомерСтроки = 1)";
	
	Запрос.УстановитьПараметр("Комплект", ИзделияКомплект.ВыгрузитьКолонку("ИзделиеКомплект"));
	
	ПредыдущиеСостояния = Запрос.Выполнить().Выгрузить();
	
	
	// регистр ГлабольныеСостояниеКомплекта
	Движения.ГлабольныеСостояниеКомплекта.Записывать = Истина;
	Для Каждого ТекСтрокаИзделияКомплект Из ИзделияКомплект Цикл
		Движение = Движения.ГлабольныеСостояниеКомплекта.Добавить();
		Движение.Период 				= Дата;
		Движение.Комплект 				= ТекСтрокаИзделияКомплект.ИзделиеКомплект;
		Движение.ИзделиеЗаказчика 		= Справочники.ИзделияЗаказчика.ПустаяСсылка();
		Движение.ГлобальныйСтатус 		= Перечисления.СтатусыЗадач.ПустаяСсылка();
		
		НайденаяСтрока =  ПредыдущиеСостояния.Найти(Движение.Комплект, "Комплект");
		
		Если НЕ НайденаяСтрока = Неопределено Тогда
		
			Если НЕ ПустаяСтрока(НайденаяСтрока.УИДКолонкиПроизводства) Тогда
			
				омКанбанПроизводство.ПереместитьРеквизитВПереопределенное(Движение.Комплект
							, омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство")
							, НайденаяСтрока.УИДКолонкиПроизводства);
			
			ИначеЕсли НЕ ПустаяСтрока(НайденаяСтрока.УИДТЗ) Тогда
			
				омКанбанПроизводство.ПереместитьРеквизитВПереопределенное(Движение.Комплект
				, омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиДляТЗ")
				, НайденаяСтрока.УИДКолонкиПроизводства);
				
			ИначеЕсли ЗначениеЗаполнено(НайденаяСтрока.ПредыдущаяСтадия) Тогда 
				стПараметры = Новый Структура("Комплект, ТекущаяСтадия", Движение.Комплект, НайденаяСтрока.ПредыдущаяСтадия);
				РегистрыСведений.ДанныеКомплекта.ИзменитьДанныеКомплекта(стПараметры);
			КонецЕсли;	
			
		КонецЕсли;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
