Функция ПолучитьТаймингиЗадачКонструктор(Период, Исполнитель) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадач.Задача КАК Задача
		|ПОМЕСТИТЬ втЗадачи
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|ГДЕ
		|	ТаймингЗадач.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТаймингЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором)
		|	И НЕ ЕСТЬNULL(ТаймингЗадач.Задача.ОбобщеннаяЗадача, ЛОЖЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаймингЗадач.Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаймингЗадач.Период КАК ДатаНачала,
		|	ТаймингЗадач.Задача КАК Задача,
		|	втЗадачи.Задача.Наименование КАК ЗадачаНаименование,
		|	ТаймингЗадач.Автор КАК Автор,
		|	ТаймингЗадач.Исполнитель КАК Исполнитель,
		|	ТаймингЗадач.Состояние КАК Состояние,
		|	ТаймингЗадач.Статус КАК Статус,
		|	ТаймингЗадач.ТипЗадачи КАК ТипЗадачи,
		|	ТаймингЗадач.НормаВремени КАК НормаВремени,
		|	ТаймингЗадач.Задача.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование,
		|	ТаймингЗадач.Задача.ОбъектТЗ КАК ОбъектТЗ,
		|	ТаймингЗадач.Задача.ОбъектТЗ.Проект КАК Проект,
		|	ТаймингЗадач.Исполнитель.Сотрудник КАК Сотрудник,
		|	ТаймингЗадач.Исполнитель.Сотрудник.НачалаРабочегоДня КАК НачалаРабочегоДня,
		|	ТаймингЗадач.Исполнитель.Сотрудник.ОкончаниеРабочегоДня КАК ОкончаниеРабочегоДня,
		|	ЗНАЧЕНИЕ(Справочник.СтадииКомплекта.ПустаяСсылка) КАК Стадия,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(14)) КАК ДатаСтрокойН,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(14)) КАК ДатаСтрокойК,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК СтадияНаименование,
		|	ЛОЖЬ КАК Ожидание,
		|	ЛОЖЬ КАК Доработка,
		|	0 КАК ПлановоеЗначение
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ТаймингЗадач.Задача = втЗадачи.Задача
		|ГДЕ
		|	(ТаймингЗадач.Исполнитель В (&Исполнитель)
		|			ИЛИ ТаймингЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором))
		|	И НЕ ТаймингЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПриостановкаКонструктором)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектТЗНаименование,
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("Исполнитель", 	Исполнитель);
	Запрос.УстановитьПараметр("ДатаНачала", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	Период.ДатаОкончания);
	
	СтруктураВозврата = Новый Структура("ТайминЗадач, ПлановоеЗначение", Новый ТаблицаЗначений);
	ТайминЗадач = Запрос.Выполнить().Выгрузить();
	
	ТайминЗадач.Колонки.Добавить("ДатаОкончания", 	Новый ОписаниеТипов("Дата"));
	ТайминЗадач.Колонки.Добавить("ПКД", 			Новый ОписаниеТипов("Булево"));

	ЗадачиКонструктора = Новый Массив;

	ИсполнительЭтоМассив = ТипЗнч(Исполнитель) = Тип("Массив");
	
	Для каждого х Из ТайминЗадач Цикл
		
		Если ИсполнительЭтоМассив Тогда
		
			ВСписке = НЕ Исполнитель.Найти(х.Исполнитель) = Неопределено;
		
		Иначе
		
			ВСписке = х.Исполнитель = Исполнитель;
		
		КонецЕсли;
	
		Если ВСписке Тогда
		
			Если ЗадачиКонструктора.Найти(х.Задача)  = Неопределено Тогда
			
				ЗадачиКонструктора.Добавить(х.Задача);	
			
			КонецЕсли;	
		
		КонецЕсли;	
	
	КонецЦикла;
	
	МассивДляУдаления 	= Новый Массив;
	МассивПКД 			= Новый Массив;
	
	ТипЗадачиПКД = Тип("ЗадачаСсылка.Задачи_ПКД");
	
	
	Для каждого х Из ТайминЗадач Цикл
		
		Если ЗадачиКонструктора.Найти(х.Задача) = Неопределено Тогда
			
			МассивДляУдаления.Добавить(х);
			
		Иначе
			
			х.ПКД = ТипЗнч(х.Задача) = ТипЗадачиПКД;
			
		КонецЕсли;	
	
	КонецЦикла;
	
	
	Для каждого х Из МассивДляУдаления Цикл
	
		ТайминЗадач.Удалить(х);	
	
	КонецЦикла;
	
	СтруктураВозврата.ТайминЗадач = ТайминЗадач.СкопироватьКолонки();
	
	МаксимальныйИндекс = ТайминЗадач.Количество() - 1;
	
	СтрокаНачалоработы = 0;
	Работа = Ложь;
	ПКД = Ложь;
	
	Для х = 0 По МаксимальныйИндекс Цикл
		
		СтрокаТайминга = ТайминЗадач[х];
		

		Если НЕ Работа И СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ВРаботеКонструктора Тогда
			
			Работа = Истина;
			СтрокаНачалоработы = х;
			ПКД = СтрокаТайминга.ПКД;
			
		ИначеЕсли Работа И СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ВРаботеКонструктора 
			И ПКД = СтрокаТайминга.ПКД Тогда
			Продолжить;	
		ИначеЕсли Работа И СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором 
			И ПКД = СтрокаТайминга.ПКД Тогда
			
			НС = СтруктураВозврата.ТайминЗадач.Добавить();	
			ЗаполнитьЗначенияСвойств(НС,  ТайминЗадач[СтрокаНачалоработы]);
			НС.ДатаОкончания	 = СтрокаТайминга.ДатаНачала;
			Работа = Ложь;
		Иначе
			Работа = Ложь;
		КонецЕсли;	
		
	КонецЦикла;
	
	
	ЗаполнитьСтадииЗадачи(СтруктураВозврата.ТайминЗадач);
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьТаймингиЗадач()


Процедура ЗаполнитьСтадииЗадачи(ТайминЗадач)

	КэшСтадий = Новый ТаблицаЗначений;
	КэшСтадий.Колонки.Добавить("Стадия", 			Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	КэшСтадий.Колонки.Добавить("ТекущиеСостояние",	Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЗадач"));
	КэшСтадий.Колонки.Добавить("ТекущийСтатус", 	Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	КэшСтадий.Колонки.Добавить("ТекущийТипЗадачи", 	Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадачКонструирования")); 
	
	Отбор = Новый Структура("ТекущиеСостояние, ТекущийСтатус, ТекущийТипЗадачи", );
	
	МассивСтадий = Новый Массив;
	
	Для каждого СтрокаТайминга Из ТайминЗадач Цикл
		
		Отбор.ТекущиеСостояние 	= СтрокаТайминга.Состояние;
		Отбор.ТекущийТипЗадачи 	= СтрокаТайминга.ТипЗадачи;
		Отбор.ТекущийСтатус 	= СтрокаТайминга.Статус;
		
		НайденыеСтроки = КэшСтадий.НайтиСтроки(Отбор);
		Если НайденыеСтроки.Количество() = 0 Тогда
		
			СтрокаТайминга.Стадия = омЗадачиПКДСервер.ПолучитьСтадиюКомплеткаНаОснованииПараметров(Отбор);		
			
			НС = КэшСтадий.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Отбор);
			НС.Стадия = СтрокаТайминга.Стадия; 
			
			МассивСтадий.Добавить(НС.Стадия);
		
		Иначе
		
			СтрокаТайминга.Стадия = НайденыеСтроки[0].Стадия;		
		
		КонецЕсли;
		
		СтрокаТайминга.ДатаСтрокойН = Формат(СтрокаТайминга.ДатаНачала, "ДФ=dd.MM.yy") 
										+ " " + Формат(СтрокаТайминга.ДатаНачала, "ДФ=HH:mm");
		СтрокаТайминга.ДатаСтрокойК = Формат(СтрокаТайминга.ДатаОкончания, "ДФ=dd.MM.yy") 
										+ " " + Формат(СтрокаТайминга.ДатаОкончания, "ДФ=HH:mm");
		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплекта.Ссылка КАК Стадия,
		|	СтадииКомплекта.Ожидание КАК Ожидание,
		|	СтадииКомплекта.Доработка КАК Доработка,
		|	СтадииКомплекта.ПолноеНаименование КАК СтадияНаименование
		|ИЗ
		|	Справочник.СтадииКомплекта КАК СтадииКомплекта
		|ГДЕ
		|	СтадииКомплекта.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивСтадий);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Отбор = Новый Структура("Стадия", );
	
	Пока Выборка.Следующий() Цикл
		Отбор.Стадия = Выборка.Стадия;
		
		Для каждого х Из ТайминЗадач.НайтиСтроки(Отбор) Цикл
		
			ЗаполнитьЗначенияСвойств(х, Выборка);	
		
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

