&НаСервере
Функция ПолучитьДанныеШаблона(Шаблон) Экспорт
	стДанные = Новый Структура("Детали,ЗаказныеИзделия,Фурнитура,ДопОснастка,ОборудованиеИТехника",);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныИзделияДетали.Деталь КАК Деталь,
		|	ШаблоныИзделияДетали.Длина КАК Длина,
		|	ШаблоныИзделияДетали.Количество КАК Количество,
		|	ШаблоныИзделияДетали.КромкаММ КАК КромкаММ,
		|	ШаблоныИзделияДетали.Материал КАК Материал,
		|	ШаблоныИзделияДетали.МатериалПокрытия КАК МатериалПокрытия,
		|	ШаблоныИзделияДетали.МатериалПокрытия1 КАК МатериалПокрытия1,
		|	ШаблоныИзделияДетали.НомерДетали КАК НомерДетали,
		|	ШаблоныИзделияДетали.Обработка КАК Обработка,
		|	ШаблоныИзделияДетали.Площадь КАК Площадь,
		|	ШаблоныИзделияДетали.Ширина КАК Ширина
		|ИЗ
		|	Справочник.ШаблоныИзделия.Детали КАК ШаблоныИзделияДетали
		|ГДЕ
		|	ШаблоныИзделияДетали.Ссылка = &Шаблон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШаблоныИзделияЗаказныеИзделия.Изделия КАК Изделия,
		|	ШаблоныИзделияЗаказныеИзделия.НаличиеНаСкладе КАК НаличиеНаСкладе,
		|	ШаблоныИзделияЗаказныеИзделия.Количество КАК Количество,
		|	ШаблоныИзделияЗаказныеИзделия.Цена КАК Цена,
		|	ШаблоныИзделияЗаказныеИзделия.Стоимость КАК Стоимость
		|ИЗ
		|	Справочник.ШаблоныИзделия.ЗаказныеИзделия КАК ШаблоныИзделияЗаказныеИзделия
		|ГДЕ
		|	ШаблоныИзделияЗаказныеИзделия.Ссылка = &Шаблон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШаблоныИзделияФурнитура.Фурнитура КАК Фурнитура,
		|	ШаблоныИзделияФурнитура.Количество КАК Количество
		|ИЗ
		|	Справочник.ШаблоныИзделия.Фурнитура КАК ШаблоныИзделияФурнитура
		|ГДЕ
		|	ШаблоныИзделияФурнитура.Ссылка = &Шаблон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШаблоныИзделияДопОснастка.ДопОснастка КАК ДопОснастка,
		|	ШаблоныИзделияДопОснастка.НаличиеНаСкладе КАК НаличиеНаСкладе,
		|	ШаблоныИзделияДопОснастка.Количество КАК Количество,
		|	ШаблоныИзделияДопОснастка.Цена КАК Цена,
		|	ШаблоныИзделияДопОснастка.Стоимость КАК Стоимость
		|ИЗ
		|	Справочник.ШаблоныИзделия.ДопОснастка КАК ШаблоныИзделияДопОснастка
		|ГДЕ
		|	ШаблоныИзделияДопОснастка.Ссылка = &Шаблон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШаблоныИзделияОборудованиеИТехника.Оборудование КАК Оборудование,
		|	ШаблоныИзделияОборудованиеИТехника.НаличиеНаСкладе КАК НаличиеНаСкладе,
		|	ШаблоныИзделияОборудованиеИТехника.Количество КАК Количество,
		|	ШаблоныИзделияОборудованиеИТехника.Цена КАК Цена,
		|	ШаблоныИзделияОборудованиеИТехника.Стоимость КАК Стоимость
		|ИЗ
		|	Справочник.ШаблоныИзделия.ОборудованиеИТехника КАК ШаблоныИзделияОборудованиеИТехника
		|ГДЕ
		|	ШаблоныИзделияОборудованиеИТехника.Ссылка = &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	
	ПакетЗапроса = Запрос.ВыполнитьПакет();
	
	стДанные.Детали 				= ОбщегоНазначения.ТаблицаЗначенийВМассив(ПакетЗапроса[0].Выгрузить());
	стДанные.ЗаказныеИзделия 		= ОбщегоНазначения.ТаблицаЗначенийВМассив(ПакетЗапроса[1].Выгрузить());
	стДанные.Фурнитура 				= ОбщегоНазначения.ТаблицаЗначенийВМассив(ПакетЗапроса[2].Выгрузить());
	стДанные.ДопОснастка 			= ОбщегоНазначения.ТаблицаЗначенийВМассив(ПакетЗапроса[3].Выгрузить());
	стДанные.ОборудованиеИТехника 	= ОбщегоНазначения.ТаблицаЗначенийВМассив(ПакетЗапроса[4].Выгрузить());
	
    Возврат стДанные
КонецФункции // ПолучитьДанныеШаблона()
