
&НаКлиенте
Процедура Отказ(Команда)
	
	Объект.Выполнена 	= Истина;
	Объект.Отказ		= Истина;
	Записать();
	Закрыть();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПереводВПроектный(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОИзмененииСтатуса", ЭтаФорма);
	
	ПоказатьВопрос(ОписаниеОповещения, "Вы хотите изменить статус " + Объект.ГабаритныйЧертеж + " на проектный?", РежимДиалогаВопрос.ДаНет); 	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;

	стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Объект.ГабаритныйЧертеж, "СтатусГЧ");
	
	Если НЕ ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
		Сообщить(стВозврата.ОписаниеОшибки);
	КонецЕсли;
	
	Оповестить("ИзменениеЗамеров");
	
	Закрыть();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Выполнена Тогда
	
		Элементы.ФормаОтказ.Доступность 			= Ложь;	
		Элементы.ФормаПереводВПроектный.Доступность = Ложь;
		
	Иначе
		
		Элементы.ДекорацияВыполнена.Видимость 		= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры


