
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	омКартинкиНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКартинки); 
КонецПроцедуры 


&НаКлиенте
Процедура ВидемостьРецепта()

	Элементы.Рецепт.Видимость 			= НЕ ТочныйРецепт;	
	Элементы.РецептПокрытия.Видимость 	= ТочныйРецепт;	

КонецПроцедуры // ВидемостьРецепта()


#Область Картинки

&НаКлиенте
Процедура ОбщаяКомандаКартинку(Команда)
	//омКомментарииНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры


#КонецОбласти 

&НаКлиенте
Процедура ТочныйРецептПриИзменении(Элемент)
	ВидемостьРецепта();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТочныйРецепт = ЗначениеЗаполнено(Объект.РецептПокрытия);
	ВидемостьРецепта();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ТочныйРецепт И НЕ ЗначениеЗаполнено(Объект.РецептПокрытия) Тогда
	
		Отказ = Истина;
		ПоказатьПредупреждение(, "Не заполнена рецептура");
	
	КонецЕсли;
	
КонецПроцедуры

