
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	омКартинкиНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКартинки); 
КонецПроцедуры 


&НаКлиенте
Процедура ВидемостьРецепта()

	Элементы.Рецепт.Видимость 			= НЕ ТочныйРецепт;	

КонецПроцедуры // ВидемостьРецепта()


#Область Картинки

&НаКлиенте
Процедура ОбщаяКомандаКартинку(Команда)
	//омКомментарииНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры


#КонецОбласти 

&НаКлиенте
Процедура ТочныйРецептПриИзменении(Элемент)
	ВидемостьРецепта();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидемостьРецепта();
	ДоступностьПроекта();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ТочныйРецепт Тогда
	
		Отказ = Истина;
		ПоказатьПредупреждение(, "Не заполнена рецептура");
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроектИзИзделияЗаказчика(ИзделиеЗаказчика)

	Возврат ИзделиеЗаказчика.Проект;	

КонецФункции // ПолучитьПроектИзИзделияЗаказчика()


&НаКлиенте
Процедура ИзделиеЗаказчикаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ИзделиеЗаказчика) Тогда
	
		Объект.Проект = ПолучитьПроектИзИзделияЗаказчика(Объект.ИзделиеЗаказчика);	
	
	Иначе
	
		Объект.Проект = Неопределено;	
	
	КонецЕсли;
	
	 ДоступностьПроекта();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьПроекта()

	Элементы.Проект.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ИзделиеЗаказчика);	

КонецПроцедуры // ДоступностьПроекта()


