
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОформлениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОформлениеФормы()

	Если НЕ Объект.Выполнена 
		И Объект.КрайняяДатаИсполнения > Дата(1, 1, 1) 
		И Объект.КрайняяДатаИсполнения < НачалоДня(ТекущаяДата()) Тогда
	
		Элементы.КрайняяДатаИсполнения.ЦветТекста 			= Новый Цвет(255, 10, 10);
		Элементы.КрайняяДатаИсполнения.ЦветТекстаЗаголовка 	= Элементы.КрайняяДатаИсполнения.ЦветТекста; 
		
	Иначе
		
		Элементы.КрайняяДатаИсполнения.ЦветТекста 			= Новый Цвет(0, 0, 0);
		Элементы.КрайняяДатаИсполнения.ЦветТекстаЗаголовка 	= Элементы.КрайняяДатаИсполнения.ЦветТекста; 
	
	КонецЕсли;

КонецПроцедуры // ОформлениеФормы()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеЗамеров");
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадачу(Команда)
	Объект.Выполнена = Истина;
	Записать();
	Закрыть();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("ПолныеПрава") Тогда
		
		Элементы.ГабаритныйЧертеж.ТолькоПросмотр = Ложь;
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ГабаритныйЧертежПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ГабаритныйЧертеж) Тогда
	
		ДанныеГЧ = ПолучитьПроектГЧ(Объект.ГабаритныйЧертеж);
		
		Объект.Проект 		= ДанныеГЧ.Проект;	
		Объект.Наименование = ДанныеГЧ.Наименование;	
	
	Иначе
	
		Объект.Проект 		= ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");	
	   	Объект.Наименование	= "";
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьПроектГЧ(ГабаритныйЧертеж)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежи.Проект КАК Проект,
		|	ГабаритныеЧертежи.Наименование + "".Создание"" КАК Наименование
		|ИЗ
		|	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
		|ГДЕ
		|	ГабаритныеЧертежи.Ссылка = &ГабаритныйЧертеж";
	
	Запрос.УстановитьПараметр("ГабаритныйЧертеж", ГабаритныйЧертеж);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеГЧ = Новый Структура("Проект, Наименование", Справочники.Проекты.ПустаяСсылка(), "");
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеГЧ, Выборка);
	КонецЦикла;
	
    Возврат ДанныеГЧ;
	
КонецФункции // ПолучитьПроектГЧ()
 

