
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОформлениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОформлениеФормы()

	Если НЕ Объект.Выполнена 
		И Объект.КрайняяДатаИсполнения > Дата(1, 1, 1) 
		И Объект.КрайняяДатаИсполнения < НачалоДня(ТекущаяДата()) Тогда
	
		Элементы.КрайняяДатаИсполнения.ЦветТекста 			= Новый Цвет(255, 10, 10);
		Элементы.КрайняяДатаИсполнения.ЦветТекстаЗаголовка 	= Элементы.КрайняяДатаИсполнения.ЦветТекста; 
		
	Иначе
		
		Элементы.КрайняяДатаИсполнения.ЦветТекста 			= Новый Цвет(0, 0, 0);
		Элементы.КрайняяДатаИсполнения.ЦветТекстаЗаголовка 	= Элементы.КрайняяДатаИсполнения.ЦветТекста; 
	
	КонецЕсли; 
	                                                       
	Если Объект.Выполнена Тогда
		Элементы.ГруппаКнопки.Видимость 	= Ложь;
		Элементы.ФормаЗаписать.Доступность 	= Ложь;
		ТолькоПросмотр						= Истина;
	Иначе
		
		Если Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыЗадачКонструирования.ЗамерИзменение") Тогда
			
			Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость = Ложь;
			
		Иначе
			
			Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость = Ложь;
			Элементы.КнопкаСбросКонструктором.Видимость 			= Ложь; 
			Элементы.КнопкаНачатьВыполнениеКонструктор.Доступность	= ЗначениеЗаполнено(Объект.Исполнитель); 
			
		КонецЕсли;
		
		ИсполнительПриИзменении(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры // ОформлениеФормы()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеЗамеров");
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадачу(Команда)
	Объект.Выполнена = Истина;
	Записать();
	Закрыть();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.ГабаритныйЧертеж.ТолькоПросмотр 	= Ложь;
	Иначе
		Элементы.Исполнитель.ТолькоПросмотр 		= ЗначениеЗаполнено(Объект.Исполнитель);
	КонецЕсли;
	
	МаксимальноеКоличествоЗадачСоздание = омЗадачиПКДПовтор.ПолучитьКоличествоЗадачСозданиеЗамеров();  
	
	Если ЗначениеЗаполнено(Объект.Исполнитель) Тогда
		КоличествоЗапущеныхЗадач 		= Задачи.СоздатьМодельГабаритногоЧертежа.КоличествоЗапущеныхЗадач(Объект.Исполнитель);  
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ГабаритныйЧертежПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ГабаритныйЧертеж) Тогда
	
		ДанныеГЧ = ПолучитьПроектГЧ(Объект.ГабаритныйЧертеж);
		
		Объект.Проект 		= ДанныеГЧ.Проект;	
		Объект.Наименование = ДанныеГЧ.Наименование;	
	
	Иначе
	
		Объект.Проект 		= ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");	
	   	Объект.Наименование	= "";
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьПроектГЧ(ГабаритныйЧертеж)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежи.Проект КАК Проект,
		|	ГабаритныеЧертежи.Наименование + "".Создание"" КАК Наименование
		|ИЗ
		|	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
		|ГДЕ
		|	ГабаритныеЧертежи.Ссылка = &ГабаритныйЧертеж";
	
	Запрос.УстановитьПараметр("ГабаритныйЧертеж", ГабаритныйЧертеж);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеГЧ = Новый Структура("Проект, Наименование", Справочники.Проекты.ПустаяСсылка(), "");
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеГЧ, Выборка);
	КонецЦикла;
	
    Возврат ДанныеГЧ;
	
КонецФункции // ПолучитьПроектГЧ()

&НаКлиенте
Процедура НачатьВыполнение(Команда)
	
	Если ЗначениеЗаполнено(Объект.Исполнитель) Тогда
		
		Если Модифицированность Тогда
			Записать();
		КонецЕсли;
		
		ЗапуститьДействие("НачатьВыполнение");
		
	Иначе
		
		СтруктурайПользователь = омСотрудники.ПолучитьТекущегоПользователя(,Истина);
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗаполненияИсполнителя", ЭтаФорма
								, Новый Структура("ТекущийПользователь", СтруктурайПользователь.ТекущийПользователь));
								
		ПоказатьВопрос(Оповещение, "Назначить исполнителем " + СтруктурайПользователь.Наименование, Режим, 0);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗаполненияИсполнителя(Результат, Параметр) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Объект.Исполнитель = Параметр.ТекущийПользователь;
		Записать();
		ЗапуститьДействие("НачатьВыполнение");
	Иначе
		ПоказатьПредупреждение(,"Не заполнен Исполнитель");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗапуститьДействие(Действие)
	
	СтруктураОтвета = ДействияНаСервере(Действие, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель);
	
	Если ТипЗнч(СтруктураОтвета) = Тип("Структура") Тогда
	
		ErrorDescription = "";
		Если СтруктураОтвета.Свойство("ErrorDescription", ErrorDescription) Тогда
		
			Если ПустаяСтрока(ErrorDescription) Тогда
			
				Если Действие = "ЗавершитьВыполнение" Тогда
					
					ЭтаФорма.Прочитать();
					Объект.Выполнена = Истина;
					Записать();
				
				КонецЕсли;
				Закрыть();
				
			Иначе
				
				ПоказатьПредупреждение(, ErrorDescription, , "Ошибка изменения статуса"); 
			
			КонецЕсли;	
			
		КонецЕсли;	
	
	КонецЕсли;
	
КонецФункции // СтруктураОтвета()


&НаКлиенте
Процедура ЗавершитьВыполнение(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ЗапуститьДействие("ЗавершитьВыполнение");
	
КонецПроцедуры

&НаКлиенте
Процедура Сброс(Команда)
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ЗапуститьДействие("Сброс");
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция  ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель)

	Возврат Задачи.СоздатьМодельГабаритногоЧертежа.ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель);	

КонецФункции //  ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель = Неопределено)()


&НаСервереБезКонтекста
Функция ИсполнительПриИзмененииНаСервере(Исполнитель)
	Возврат Задачи.СоздатьМодельГабаритногоЧертежа.КоличествоЗапущеныхЗадач(Исполнитель);  
КонецФункции


&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Исполнитель) Тогда
		
		Элементы.ГруппаКнопки.Видимость = Истина;
		
		КоличествоЗапущеныхЗадач = ИсполнительПриИзмененииНаСервере(Объект.Исполнитель);
		
		Если КоличествоЗапущеныхЗадач < МаксимальноеКоличествоЗадачСоздание Тогда
			
			Элементы.ДекорацияЗапущеныеЗадания.Видимость 			= Ложь;
			Элементы.КнопкаНачатьВыполнениеКонструктор.Доступность 	= Истина;
			
		ИначеЕсли Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыЗадачКонструирования.ЗамерИзменение") Тогда
			
			Элементы.ДекорацияЗапущеныеЗадания.Видимость 			= Ложь;
			
		Иначе
			
			Элементы.ДекорацияЗапущеныеЗадания.Видимость 			= Истина;
			Элементы.ДекорацияЗапущеныеЗадания.Заголовок 			= "Уже в работе " + КоличествоЗапущеныхЗадач + " из " + МаксимальноеКоличествоЗадачСоздание + " возможнвх.";
			Элементы.КнопкаНачатьВыполнениеКонструктор.Доступность 	= Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Элементы.ГруппаКнопки.Видимость = Ложь;	
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Я_исполнитель(Команда)
	
	ИсполнительЯ = омСотрудники.ПолучитьТекущегоПользователя();
	
	Если НЕ Объект.Исполнитель = ИсполнительЯ Тогда
		
		Объект.Исполнитель = ИсполнительЯ;
		ИсполнительПриИзменении(Неопределено);
		
	КонецЕсли;
КонецПроцедуры

