
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОформлениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОформлениеФормы()

	Если НЕ Объект.Выполнена 
		И Объект.КрайняяДатаИсполнения > Дата(1, 1, 1) 
		И Объект.КрайняяДатаИсполнения < НачалоДня(ТекущаяДата()) Тогда
	
		Элементы.КрайняяДатаИсполнения.ЦветТекста 			= Новый Цвет(255, 10, 10);
		Элементы.КрайняяДатаИсполнения.ЦветТекстаЗаголовка 	= Элементы.КрайняяДатаИсполнения.ЦветТекста; 
		
	Иначе
		
		Элементы.КрайняяДатаИсполнения.ЦветТекста 			= Новый Цвет(0, 0, 0);
		Элементы.КрайняяДатаИсполнения.ЦветТекстаЗаголовка 	= Элементы.КрайняяДатаИсполнения.ЦветТекста; 
	
	КонецЕсли;

КонецПроцедуры // ОформлениеФормы()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеЗамеров");
КонецПроцедуры
