
Функция ОповеститьОбНедоступностиФункционалаБазовогоМодуляПоТарифномуПлану() Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Функционал доступен только на платных тарифах");
	
КонецФункции

Функция ОповеститьОбНедоступностиФункционалаЭкспортаПечатныхФорм() Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Функционал доступен только на платных тарифах");
	
КонецФункции

Функция ОповеститьОбНедоступностиФункционалаРаботыИзОдногоОкнаПоТарифномуПлану() Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Функционал доступен на тарифах 'Базовый', 'Стандартный' и 'Профессиональный'" + Символы.ПС + "И на архивных 'Компания', 'Команда' и 'CRM+'");
	
КонецФункции

Функция ОповеститьОбНедоступностиФункционалаБитриксПоискПоТарифномуПлану() Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Функционал доступен на тарифах 'Стандартный' и 'Профессиональный'" + Символы.ПС + "И на архивных 'Компания', 'Команда' и 'CRM+'");
	
КонецФункции

Функция ОповеститьОбНедоступностиФункционалаРеестраПечатныхФормПоТарифномуПлану() Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Функционал доступен на тарифах 'Базовый', 'Стандартный' и 'Профессиональный'" + Символы.ПС + "И на архивных 'Компания', 'Команда' и 'CRM+'");
	
КонецФункции

Функция ОповеститьОбНедоступностиФункционалаСПАРКПоТарифномуПлану() Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Функционал доступен на тарифе 'Профессиональный'" + Символы.ПС + "И на архивных 'Компания', 'Команда' и 'CRM+'");
	
КонецФункции

Функция ОповеститьОбНедоступностиФункционалаТелефонияПоТарифномуПлану() Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Функционал доступен на тарифах 'Стандартный' и 'Профессиональный'" + Символы.ПС + "И на архивных 'Компания', 'Команда' и 'CRM+'");
	
КонецФункции

Функция ОповеститьОбНедоступностиФункционалаАвтоматизацииПоТарифномуПлану() Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Функционал доступен на тарифах 'Стандартный' и 'Профессиональный'" + Символы.ПС + "И на архивных 'Компания', 'Команда' и 'CRM+'");
	
КонецФункции

Функция ОповеститьОбНедоступностиФункционалаСинхронизацииПоТарифномуПлану() Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Функционал доступен на тарифе 'Профессиональный'" + Символы.ПС + "И на архивном 'Компания'");
	
КонецФункции

Функция ОповеститьОбНедоступностиФункционалаБизнесПроцессовПоТарифномуПлану() Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Функционал доступен на тарифе 'Профессиональный'" + Символы.ПС + "И на архивном 'Компания'");
	
КонецФункции   

Функция ОповеститьОбНедоступностиФункционалаСкладскойУчетПоТарифномуПлану() Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Функционал доступен на тарифе 'Профессиональный'" + Символы.ПС + "И на архивном 'Компания'");
	
КонецФункции