Процедура ИзменениеначалаПлановыхЗадач() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПлановоеЗначениеПроектированияСрезПоследних.Задача КАК Задача,
	|	ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях КАК ПланРазработкиВДнях
	|ИЗ
	|	РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних КАК ПлановоеЗначениеПроектированияСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
	|		ПО ПлановоеЗначениеПроектированияСрезПоследних.Задача = ТаймингЗадачСрезПоследних.Задача
	|ГДЕ
	|	ТаймингЗадачСрезПоследних.Состояние = &Состояние
	|	И ТаймингЗадачСрезПоследних.ТипЗадачи В(&ТипЗадачи)
	|	И ПлановоеЗначениеПроектированияСрезПоследних.ДатаНачала < &ДатаНачала";
	
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
	Запрос.УстановитьПараметр("ТипЗадачи", омЗадачиПКДПовтор.ТипыЗадачКонструктора());
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Автор 		= ПараметрыСеанса.ТекущийПользователь;
	ТД 			= ТекущаяДата();
	ТДНД		= НачалоДня(ТекущаяДата());
	Комментарий = "Регламентное задание";
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПлановоеЗначениеПроектирования.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период				= ТД;
		МенеджерЗаписи.Автор 				= Автор;
		МенеджерЗаписи.ДатаНачала 			= ТДНД;
		МенеджерЗаписи.Задача 				= Выборка.Задача;
		МенеджерЗаписи.ПланРазработкиВДнях  = Выборка.ПланРазработкиВДнях;
		МенеджерЗаписи.Комментарий			= Комментарий;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗапускОчередиPDM() Экспорт 
	омPDMНаСервере.ПроверитьОчередьИЗапуститьСкрипт();
КонецПроцедуры

Процедура РасчетТабеля() Экспорт
	омТабельНаСервере.РасчетТабеляЗаПериод();	
КонецПроцедуры

Процедура ЗапускОчередиPDM_API() Экспорт
	
	омФайлыPDM.КонтрольДлительныхДействий();	
	
КонецПроцедуры

Процедура ОповещениеПоEMail() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОповещениеПоE_mailРасписание.Ссылка КАК Оповещение,
		|	ОповещениеПоE_mailРасписание.Ссылка.ИспользоватьОтчет КАК ИспользоватьОтчет,
		|	ОповещениеПоE_mailРасписание.Ссылка.СобытиеОповещения КАК СобытиеОповещения,
		|	ОповещениеПоE_mailРасписание.Ссылка.УчетнаяЗапись КАК УчетнаяЗапись,
		|	ОповещениеПоE_mailРасписание.Ссылка.Шаблон КАК Шаблон,
		|	ОповещениеПоE_mailРасписание.Ссылка.Тема КАК Тема,
		|	ОповещениеПоE_mailАдреса.E_mail КАК E_mail,
		|	ОповещениеПоE_mailАдреса.Представление КАК ПредставлениеE_mail
		|ИЗ
		|	Справочник.ОповещениеПоE_mail.Расписание КАК ОповещениеПоE_mailРасписание
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОповещениеПоE_mail.Адреса КАК ОповещениеПоE_mailАдреса
		|		ПО ОповещениеПоE_mailРасписание.Ссылка = ОповещениеПоE_mailАдреса.Ссылка
		|ГДЕ
		|	ОповещениеПоE_mailРасписание.Ссылка.ТекущаяДатаИсполнения <= &ВремяК
		|	И НЕ ОповещениеПоE_mailРасписание.Ссылка.ПометкаУдаления
		|	И НЕ ОповещениеПоE_mailРасписание.Ссылка.Активный
		|
		|УПОРЯДОЧИТЬ ПО
		|	Оповещение";
	
	Запрос.УстановитьПараметр("ВремяК", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекущиеОповещение 	= Неопределено;
	СтруктураПараметров = омВзаимодействиеСервер.ПолучитьСтруктуруДляОтправкиПисьма();
	МассивЕмайлов 		= Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		Если НЕ ТекущиеОповещение = Выборка.Оповещение Тогда
			
			Если НЕ ТекущиеОповещение = Неопределено Тогда
				омВзаимодействиеСервер.ОтправитьСообщение(СтруктураПараметров, МассивЕмайлов);	
			КонецЕсли;
			
			ТекущиеОповещение = Выборка.Оповещение;
			ЗаполнитьЗначенияСвойств(СтруктураПараметров, Выборка);
			МассивЕмайлов = Новый Массив;
			
		КонецЕсли;	
		
		МассивЕмайлов.Добавить(Новый Структура("E_mail, ПредставлениеE_mail", Выборка.E_mail, Выборка.ПредставлениеE_mail));
		
		
	КонецЦикла;
	
	Если НЕ ТекущиеОповещение = Неопределено Тогда
		УстановитьТекущуюДатуИсполнения(ТекущиеОповещение);
		омВзаимодействиеСервер.ОтправитьСообщение(СтруктураПараметров, МассивЕмайлов);	
	КонецЕсли;
		
КонецПроцедуры 

Процедура УстановитьТекущуюДатуИсполнения(ТекущиеОповещение)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОповещениеПоE_mailРасписание.ДеньНедели КАК ДеньНедели,
		|	ОповещениеПоE_mailРасписание.Время КАК Время
		|ИЗ
		|	Справочник.ОповещениеПоE_mail.Расписание КАК ОповещениеПоE_mailРасписание
		|ГДЕ
		|	ОповещениеПоE_mailРасписание.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Время";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущиеОповещение);
	
	ТаблицаЗапусков = Запрос.Выполнить().Выгрузить();
	
	ДатаИсполнения = Дата(1, 1, 1);
	
	ТД = ТекущаяДата();
	ТВ = ДатаИсполнения + Час(ТД) * 3600 + Минута(ТД) * 60;
	
	ТекущийНомерНедели 	= ДеньНедели(ТД);
	СледующийНомерДня	= ТекущийНомерНедели;
	СледующаяДата 		= НачалоДня(ТД);
	
	ОтборДняНедели = Новый Структура("ДеньНедели",омВзаимодействиеСервер.ПолучитьПеречислениеДеньНедели(ТекущийНомерНедели)); 
	
	Для МаксимальноеКоличествоИтерраций = 1 По 9 Цикл
	
		НайденыеСтроки = ТаблицаЗапусков.НайтиСтроки(ОтборДняНедели);
		
		Для каждого ТекущаяЗапись Из НайденыеСтроки Цикл
		
			Если СледующийНомерДня = ТекущийНомерНедели Тогда
				Если НайденыеСтроки.Время <= ТВ Тогда
				
					ДатаИсполнения = СледующаяДата + Час(ТекущаяЗапись.Время) * 3600 + Минута(ТекущаяЗапись.Время) * 60;
					Прервать;
				
				КонецЕсли;
			Иначе		
				ДатаИсполнения = СледующаяДата + Час(ТекущаяЗапись.Время) * 3600 + Минута(ТекущаяЗапись.Время) * 60;
				Прервать;
			КонецЕсли;	
			
		КонецЦикла;
		
		СледующийНомерДня 			= ?(СледующийНомерДня = 7, 1, СледующийНомерДня + 1);
		СледующаяДата 				= СледующаяДата + 3600 * 24;
		ОтборДняНедели.ДеньНедели 	= омВзаимодействиеСервер.ПолучитьПеречислениеДеньНедели(СледующийНомерДня);
		
		Если ЗначениеЗаполнено(ДатаИсполнения) Тогда
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	ОбТекущиеОповещение = ТекущиеОповещение.ПолучитьОбъект();
	
	Если ЗначениеЗаполнено(ДатаИсполнения) Тогда
		ОбТекущиеОповещение.ТекущаяДатаИсполнения = ДатаИсполнения;
	Иначе
	    ОбТекущиеОповещение.Активный = Ложь;
	КонецЕсли;
	
	ОбТекущиеОповещение.Записать();
	
КонецПроцедуры

