Процедура ИзменениеначалаПлановыхЗадач() Экспорт
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановоеЗначениеПроектированияСрезПоследних.Задача КАК Задача,
		|	ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях КАК ПланРазработкиВДнях
		|ИЗ
		|	РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних КАК ПлановоеЗначениеПроектированияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО ПлановоеЗначениеПроектированияСрезПоследних.Задача = ТаймингЗадачСрезПоследних.Задача
		|ГДЕ
		|	ТаймингЗадачСрезПоследних.Состояние = &Состояние
		|	И ТаймингЗадачСрезПоследних.ТипЗадачи В(&ТипЗадачи)
		|	И ПлановоеЗначениеПроектированияСрезПоследних.ДатаНачала < &ДатаНачала";
	
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
	Запрос.УстановитьПараметр("ТипЗадачи", омЗадачиПКДПовтор.ТипыЗадачКонструктора());
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Автор 		= ПараметрыСеанса.ТекущийПользователь;
	ТД 			= ТекущаяДата();
	ТДНД		= НачалоДня(ТекущаяДата());
	Комментарий = "Регламентное задание";
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПлановоеЗначениеПроектирования.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период				= ТД;
		МенеджерЗаписи.Автор 				= Автор;
		МенеджерЗаписи.ДатаНачала 			= ТДНД;
		МенеджерЗаписи.Задача 				= Выборка.Задача;
		МенеджерЗаписи.ПланРазработкиВДнях  = Выборка.ПланРазработкиВДнях;
		МенеджерЗаписи.Комментарий			= Комментарий;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
 