Процедура ИзменениеначалаПлановыхЗадач() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПлановоеЗначениеПроектированияСрезПоследних.Задача КАК Задача,
	|	ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях КАК ПланРазработкиВДнях
	|ИЗ
	|	РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних КАК ПлановоеЗначениеПроектированияСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
	|		ПО ПлановоеЗначениеПроектированияСрезПоследних.Задача = ТаймингЗадачСрезПоследних.Задача
	|ГДЕ
	|	ТаймингЗадачСрезПоследних.Состояние = &Состояние
	|	И ТаймингЗадачСрезПоследних.ТипЗадачи В(&ТипЗадачи)
	|	И ПлановоеЗначениеПроектированияСрезПоследних.ДатаНачала < &ДатаНачала";
	
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
	Запрос.УстановитьПараметр("ТипЗадачи", омЗадачиПКДПовтор.ТипыЗадачКонструктора());
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Автор 		= ПараметрыСеанса.ТекущийПользователь;
	ТД 			= ТекущаяДата();
	ТДНД		= НачалоДня(ТекущаяДата());
	Комментарий = "Регламентное задание";
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПлановоеЗначениеПроектирования.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период				= ТД;
		МенеджерЗаписи.Автор 				= Автор;
		МенеджерЗаписи.ДатаНачала 			= ТДНД;
		МенеджерЗаписи.Задача 				= Выборка.Задача;
		МенеджерЗаписи.ПланРазработкиВДнях  = Выборка.ПланРазработкиВДнях;
		МенеджерЗаписи.Комментарий			= Комментарий;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗапускОчередиPDM() Экспорт 
	омPDMНаСервере.ПроверитьОчередьИЗапуститьСкрипт();
КонецПроцедуры

Процедура РасчетТабеля() Экспорт
	омТабельНаСервере.РасчетТабеляЗаПериод();	
КонецПроцедуры

Процедура ЗапускОчередиPDM_API() Экспорт
	
	омФайлыPDM.КонтрольДлительныхДействий();	
	
КонецПроцедуры

Процедура ОповещениеПоEMail() Экспорт

	ТД = ТекущаяДата();
	
	ВремяК = Дата(1, 1, 1, Час(ТД), Минута(ТД), 1); 
	ВремяН = ВремяК - 90; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОповещениеПоE_mailРасписание.Ссылка КАК Оповещение,
		|	ОповещениеПоE_mailРасписание.Ссылка.ИспользоватьОтчет КАК ИспользоватьОтчет,
		|	ОповещениеПоE_mailРасписание.Ссылка.СобытиеОповещения КАК СобытиеОповещения,
		|	ОповещениеПоE_mailРасписание.Ссылка.УчетнаяЗапись КАК УчетнаяЗапись,
		|	ОповещениеПоE_mailРасписание.Ссылка.Шаблон КАК Шаблон,
		|	ОповещениеПоE_mailРасписание.Ссылка.Тема КАК Тема,
		|	ОповещениеПоE_mailАдреса.E_mail КАК E_mail,
		|	ОповещениеПоE_mailАдреса.Представление КАК ПредставлениеE_mail
		|ИЗ
		|	Справочник.ОповещениеПоE_mail.Расписание КАК ОповещениеПоE_mailРасписание
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОповещениеПоE_mail.Адреса КАК ОповещениеПоE_mailАдреса
		|		ПО ОповещениеПоE_mailРасписание.Ссылка = ОповещениеПоE_mailАдреса.Ссылка
		|ГДЕ
		|	ОповещениеПоE_mailРасписание.ДеньНедели = &ДеньНедели
		|	И ОповещениеПоE_mailРасписание.Время МЕЖДУ &ВремяН И &ВремяК
		|	И НЕ ОповещениеПоE_mailРасписание.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Оповещение";
	
	Запрос.УстановитьПараметр("ВремяК", 	ВремяК);
	Запрос.УстановитьПараметр("ВремяН", 	ВремяН);
	Запрос.УстановитьПараметр("ДеньНедели", ПолучитьПеречислениеДеньНедели());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекущиеОповещение 	= Неопределено;
	СтруктураПараметров = Новый Структура("ИспользоватьОтчет, СобытиеОповещения, УчетнаяЗапись, Шаблон, Тема", );
	МассивЕмайлов 		= Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		Если НЕ ТекущиеОповещение = Выборка.Оповещение Тогда
			
			Если НЕ ТекущиеОповещение = Неопределено Тогда
				ОтправитьСообщение(СтруктураПараметров, МассивЕмайлов);	
			КонецЕсли;
			
			ТекущиеОповещение = Выборка.Оповещение;
			ЗаполнитьЗначенияСвойств(СтруктураПараметров, Выборка);
			МассивЕмайлов = Новый Массив;
			
		КонецЕсли;	
		
		МассивЕмайлов.Добавить(Новый Структура("E_mail, ПредставлениеE_mail", Выборка.E_mail, Выборка.ПредставлениеE_mail));
		
	КонецЦикла;
	
	Если НЕ ТекущиеОповещение = Неопределено Тогда
		ОтправитьСообщение(СтруктураПараметров, МассивЕмайлов);	
	КонецЕсли;
		
КонецПроцедуры 

Функция ОтправитьСообщение(СтруктураПараметров, МассивЕмайлов)

	Письмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
	
	Письмо.Автор                    = Пользователи.ТекущийПользователь();
	Письмо.Ответственный            = Пользователи.ТекущийПользователь();
	Письмо.Тема                     = СтруктураПараметров.Тема;
	Письмо.Дата                     = ТекущаяДатаСеанса();
	
	Для каждого х Из МассивЕмайлов Цикл
	
		НС 					= Письмо.ПолучателиПисьма.Добавить();
		НС.Адрес 			= х.E_mail;
		НС.Представление 	= х.ПредставлениеE_mail;
	
	КонецЦикла;
	
	КлючОтчета = "";
	
	Если СтруктураПараметров.ИспользоватьОтчет = Перечисления.ОтчетыБазы.СостояниеПроекта Тогда
	
		АдресОтчета = Отчеты.СостояниеПроекта.ПолучитьФайлНаСервере(, КлючОтчета);
	
	Иначе
	
		АдресОтчета = Неопределено;
	
	КонецЕсли;
	
	ПараметрыПисьма = Новый Структура;

	Взаимодействия.ДобавитьВПараметрАдресатов(Письмо, ПараметрыПисьма,"Кому",         "ПолучателиПисьма");
	Взаимодействия.ДобавитьВПараметрАдресатов(Письмо, ПараметрыПисьма,"Копии",        "ПолучателиКопий");
	Взаимодействия.ДобавитьВПараметрАдресатов(Письмо, ПараметрыПисьма,"СкрытыеКопии", "ПолучателиСкрытыхКопий");
	Взаимодействия.ДобавитьВПараметрАдресатов(Письмо, ПараметрыПисьма,"АдресОтвета",  "ПолучателиОтвета");
	
	ПараметрыПисьма.Вставить("Тема", Письмо.Тема);
	ПараметрыПисьма.Вставить("Тело", ?(Письмо.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст,
	                                   Письмо.Текст, Письмо.ТекстHTML));
	ПараметрыПисьма.Вставить("Кодировка", Письмо.Кодировка);
	ПараметрыПисьма.Вставить("Важность",  УправлениеЭлектроннойПочтой.ПолучитьВажность(Письмо.Важность));
	ПараметрыПисьма.Вставить("ТипТекста", Письмо.ТипТекста);
	
	Если Не ПустаяСтрока(Письмо.ИдентификаторыОснований) Тогда
		ПараметрыПисьма.Вставить("ИдентификаторыОснований", Письмо.ИдентификаторыОснований);
	КонецЕсли;
	
	МассивВложений = Новый Массив;
	
	ДанныеПрисоединенныхФайловПисьма = Взаимодействия.ДанныеПрисоединенныхФайловПисьмаОбъект(Письмо);
	ИмяПисьмоаМетаданных = ДанныеПрисоединенныхФайловПисьма.ИмяСправочникаПрисоединенныхФайлов;
	ВладелецФайлов       = ДанныеПрисоединенныхФайловПисьма.ВладелецФайлов;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Файлы.Наименование               КАК ПолноеНаименование,
	|	Файлы.Расширение                 КАК Расширение,
	|	Файлы.Ссылка                     КАК Ссылка,
	|	Файлы.ИДФайлаЭлектронногоПисьма  КАК ИДФайлаЭлектронногоПисьма
	|ИЗ
	|	&ИмяТаблицыСправочника КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &ВладелецФайла
	|;
	|
	|//////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭлектронноеПисьмоИсходящееПисьмаВложения.Письмо                     КАК Письмо,
	|	ЭлектронноеПисьмоИсходящееПисьмаВложения.ПорядковыйНомерВоВложениях КАК ПорядковыйНомерВоВложениях
	|ИЗ
	|	Документ.ЭлектронноеПисьмоИсходящее.ПисьмаВложения КАК ЭлектронноеПисьмоИсходящееПисьмаВложения
	|ГДЕ
	|	ЭлектронноеПисьмоИсходящееПисьмаВложения.Ссылка = &ВладелецФайла
	|
	|УПОРЯДОЧИТЬ ПО ПорядковыйНомерВоВложениях ВОЗР";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицыСправочника", "Справочник." + ИмяПисьмоаМетаданных);
	
	Запрос.УстановитьПараметр("ВладелецФайла", ВладелецФайлов);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаВложения = РезультатЗапроса[0].Выбрать();
	ТаблицаПисьмаВложения = РезультатЗапроса[1].Выгрузить();
	
	КоличествоВложений = ТаблицаПисьмаВложения.Количество() + ВыборкаВложения.Количество();
	
	НомерОтображаемогоВложения = 1;
	Пока ВыборкаВложения.Следующий() Цикл
		
		Взаимодействия.ДобавитьВложениеПисьмоЕслиНеобходимо(ТаблицаПисьмаВложения, МассивВложений, НомерОтображаемогоВложения);
		ИмяФайла = ВыборкаВложения.ПолноеНаименование + ?(ВыборкаВложения.Расширение = "", "", "." + ВыборкаВложения.Расширение);
		
		Если ПустаяСтрока(ВыборкаВложения.ИДФайлаЭлектронногоПисьма) Тогда
			Взаимодействия.ДобавитьВложение(МассивВложений, ИмяФайла, РаботаСФайлами.ДвоичныеДанныеФайла(ВыборкаВложения.Ссылка));
			НомерОтображаемогоВложения = НомерОтображаемогоВложения + 1;
		Иначе
			Взаимодействия.ДобавитьВложение(МассивВложений,
			                 ИмяФайла, 
			                 РаботаСФайлами.ДвоичныеДанныеФайла(ВыборкаВложения.Ссылка), 
			                 ВыборкаВложения.ИДФайлаЭлектронногоПисьма);
		КонецЕсли;
		
	КонецЦикла;
	
	Пока НомерОтображаемогоВложения <= КоличествоВложений Цикл
		
		Взаимодействия.ДобавитьВложениеПисьмоЕслиНеобходимо(ТаблицаПисьмаВложения, МассивВложений, НомерОтображаемогоВложения);
		НомерОтображаемогоВложения = НомерОтображаемогоВложения + 1;
		
	КонецЦикла;
	
	ПараметрыПисьма.Вставить("Вложения", МассивВложений);
	ПараметрыПисьма.Вставить("ОбрабатыватьТексты", Ложь);
	
	ПараметрыПисьма.Вставить("УведомитьОДоставке", Письмо.УведомитьОДоставке); 
	ПараметрыПисьма.Вставить("УведомитьОПрочтении", Письмо.УведомитьОПрочтении);
	
	ПараметрыПисьма.Вставить("АдресОтвета", "");
	ПараметрыПисьма.Вставить("Картинки", Новый Массив);
	ПараметрыПисьма.Вставить("Вложения", Новый Массив);
	
	ПараметрыДоставки = РассылкаОтчетов.ПараметрыДоставки();
	ПараметрыДоставки.Получатели = Новый Соответствие;
	
	Для каждого х Из МассивЕмайлов Цикл    
	
		ПараметрыДоставки.Получатели.Вставить(х.ПредставлениеE_mail, х.E_mail);
	
	КонецЦикла;
	
	Сообщение1 = РассылкаОтчетов.ПараметрыСообщенияДляПодсистемыВзаимодействия(ПараметрыДоставки, ПараметрыПисьма);
	
	Если ЗначениеЗаполнено(АдресОтчета) Тогда
		
		СтрокаВложение = Сообщение1.Вложения.Добавить();
		СтрокаВложение.АдресВоВременномХранилище = АдресОтчета;
		СтрокаВложение.Представление = КлючОтчета;
	
	КонецЕсли;
	
	РезультатОтправки = Взаимодействия.СоздатьПисьмо(Сообщение1, СтруктураПараметров.УчетнаяЗапись, Истина);
	

КонецФункции // ОтправитьСообщение()

Функция ПолучитьПеречислениеДеньНедели(ТД = Неопределено) Экспорт

    Если ТД = Неопределено Тогда
		НомерНедели = ДеньНедели(ТекущаяДата());	
	Иначе
		НомерНедели = ДеньНедели(ТД);	
	КонецЕсли;
	
	Если НомерНедели = 1 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Понедельник;
	ИначеЕсли НомерНедели = 2 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Вторник;
	ИначеЕсли НомерНедели = 3 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Среда;
	ИначеЕсли НомерНедели = 4 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Четверг;
	ИначеЕсли НомерНедели = 5 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Пятница;
	ИначеЕсли НомерНедели = 6 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Суббота;
	ИначеЕсли НомерНедели = 7 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Воскресение;
	КонецЕсли;
	
	Возврат ЗначениеДнянедели;

КонецФункции // ПолучитьПеречислениеДеньНедели()

