Процедура ИзменениеначалаПлановыхЗадач() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПлановоеЗначениеПроектированияСрезПоследних.Задача КАК Задача,
	|	ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях КАК ПланРазработкиВДнях
	|ИЗ
	|	РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних КАК ПлановоеЗначениеПроектированияСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
	|		ПО ПлановоеЗначениеПроектированияСрезПоследних.Задача = ТаймингЗадачСрезПоследних.Задача
	|ГДЕ
	|	ТаймингЗадачСрезПоследних.Состояние = &Состояние
	|	И ТаймингЗадачСрезПоследних.ТипЗадачи В(&ТипЗадачи)
	|	И ПлановоеЗначениеПроектированияСрезПоследних.ДатаНачала < &ДатаНачала";
	
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
	Запрос.УстановитьПараметр("ТипЗадачи", омЗадачиПКДПовтор.ТипыЗадачКонструктора());
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Автор 		= ПараметрыСеанса.ТекущийПользователь;
	ТД 			= ТекущаяДата();
	ТДНД		= НачалоДня(ТекущаяДата());
	Комментарий = "Регламентное задание";
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПлановоеЗначениеПроектирования.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период				= ТД;
		МенеджерЗаписи.Автор 				= Автор;
		МенеджерЗаписи.ДатаНачала 			= ТДНД;
		МенеджерЗаписи.Задача 				= Выборка.Задача;
		МенеджерЗаписи.ПланРазработкиВДнях  = Выборка.ПланРазработкиВДнях;
		МенеджерЗаписи.Комментарий			= Комментарий;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗапускОчередиPDM() Экспорт 
	омPDMНаСервере.ПроверитьОчередьИЗапуститьСкрипт();
КонецПроцедуры

Процедура РасчетТабеля() Экспорт
	омТабельНаСервере.РасчетТабеляЗаПериод();	
КонецПроцедуры

Процедура ЗапускОчередиPDM_API() Экспорт
	
	омФайлыPDM.КонтрольДлительныхДействий();	
	
КонецПроцедуры

Процедура ОповещениеПоEMail() Экспорт

	
	ТД = ТекущаяДата();
	
	ВремяК = Дата(Год(ТД), Месяц(ТД), День(ТД), Час(ТД), Минута(ТД), 1); 
	ВремяН = ВремяК - 60; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОповещениеПоE_mailРасписание.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.ОповещениеПоE_mail.Расписание КАК ОповещениеПоE_mailРасписание
		|ГДЕ
		|	ОповещениеПоE_mailРасписание.ДеньНедели = &ДеньНедели
		|	И ОповещениеПоE_mailРасписание.Время МЕЖДУ &ВремяН И &ВремяК
		|	И НЕ ОповещениеПоE_mailРасписание.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОповещениеПоE_mail.СобытиеОповещения КАК СобытиеОповещения,
		|	ОповещениеПоE_mail.УчетнаяЗапись КАК УчетнаяЗапись,
		|	ОповещениеПоE_mail.ИспользоватьОтчет КАК ИспользоватьОтчет
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОповещениеПоE_mail КАК ОповещениеПоE_mail
		|		ПО вт.Ссылка = ОповещениеПоE_mail.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОповещениеПоE_mailАдреса.E_mail КАК E_mail
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОповещениеПоE_mail.Адреса КАК ОповещениеПоE_mailАдреса
		|		ПО вт.Ссылка = ОповещениеПоE_mailАдреса.Ссылка";
	
	Запрос.УстановитьПараметр("ВремяК", 	ВремяК);
	Запрос.УстановитьПараметр("ВремяН", 	ВремяН);
	Запрос.УстановитьПараметр("ДеньНедели", ПолучитьПеречислениеДеньНедели());
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[1].Выбрать();	
	
	Пока Выборка.Следующий() Цикл
		Если 1=1 Тогда
		
			
		
		Иначе
		
			
		
		КонецЕсли;	
	КонецЦикла;
	
	
КонецПроцедуры 

Функция ПолучитьПеречислениеДеньНедели(ТД = Неопределено) Экспорт

    Если ТД = Неопределено Тогда
		НомерНедели = ДеньНедели(ТекущаяДата());	
	Иначе
		НомерНедели = ДеньНедели(ТД);	
	КонецЕсли;
	
	Если НомерНедели = 1 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Понедельник;
	ИначеЕсли НомерНедели = 2 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Вторник;
	ИначеЕсли НомерНедели = 3 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Среда;
	ИначеЕсли НомерНедели = 4 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Четверг;
	ИначеЕсли НомерНедели = 5 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Пятница;
	ИначеЕсли НомерНедели = 6 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Суббота;
	ИначеЕсли НомерНедели = 7 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Воскресение;
	КонецЕсли;
	
	Возврат ЗначениеДнянедели;

КонецФункции // ПолучитьПеречислениеДеньНедели()

