
&НаКлиенте
Процедура ТаблицаЦенПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.ТекущийЭлемент.Имя = "ТаблицаЦенДокумент" Тогда
		Отказ = Истина;
		ТД = Элементы.ТаблицаЦен.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТД.Документ) Тогда
			ПоказатьЗначение(,ТД.Документ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Этаформа.Параметры.Номенклатура) Тогда
		Отказ = Истина;
		Возврат
	КонецЕсли;
	ЭтаФорма.Номенклатура = Этаформа.Параметры.Номенклатура;
	
	СформироватьТаблицу();
КонецПроцедуры

&НаСервере
Процедура СформироватьТаблицу()
	ЭтаФорма.ТаблицаЦен.Загрузить(РегистрыСведений.ЦеныНоменклатурыДокументов.ПолучитьИсториюЦен(ЭтаФорма.Номенклатура));
КонецПроцедуры // СформироватьТаблицу()

&НаКлиенте
Процедура Обновить(Команда)
	СформироватьТаблицу();
КонецПроцедуры
