Процедура НазначитьСтатусЗадачи(Задача) Экспорт
	
	Если Задача.Выполнена Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СтатусыЗадач.Задача КАК Задача
			|ИЗ
			|	РегистрСведений.СтатусыЗадач КАК СтатусыЗадач
			|ГДЕ
			|	СтатусыЗадач.Задача = &Задача";
		
		Запрос.УстановитьПараметр("Задача", Задача);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.СтатусыЗадач.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Задача.Установить(Задача);
			
			НаборЗаписей.Записать();
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли; 
	
	Если ТипЗнч(Задача) = Тип("ЗадачаСсылка.ИзменениеСтатусаГЧ") Тогда
	
		СоздатьСтатусИзменениеСтатусаГЧ(Задача);		
	
	КонецЕсли;
	

КонецПроцедуры

Процедура СоздатьСтатусИзменениеСтатусаГЧ(Задача)

	СтатусДляЗадачи = 3;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыЗадач.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыЗадач КАК СтатусыЗадач
		|ГДЕ
		|	СтатусыЗадач.Задача = &Задача
		|	И СтатусыЗадач.Интерфейс = ЗНАЧЕНИЕ(Справочник.Интерфейсы.Замер1)
		|	И СтатусыЗадач.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.УстановитьПараметр("Статус", СтатусДляЗадачи);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат;
	КонецЦикла;
	
	ИнтерфейсыЗамер1 = Справочники.Интерфейсы.Замер1;
	
	МенеджерЗаписей = РегистрыСведений.СтатусыЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписей.Задача 		= Задача;
	МенеджерЗаписей.Интерфейс 	= ИнтерфейсыЗамер1;
	
	МенеджерЗаписей.Прочитать();
	
	МенеджерЗаписей.Задача 		= Задача;
	МенеджерЗаписей.Интерфейс 	= ИнтерфейсыЗамер1;
	МенеджерЗаписей.Статус	= 	СтатусДляЗадачи;
	
	МенеджерЗаписей.Записать();

КонецПроцедуры
