
&НаСервере
Функция ПолучитьПараметрыНоменклатуры(Номенклатура) Экспорт
	
	стВозврата = Новый Структура("СтатьяЗатрат,Основной",Справочники.СтатьиЗатрат.ПустаяСсылка(),Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат,
		|	Номенклатура.Основной КАК Основной
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата,Выборка);
	КонецЦикла;
	
    Возврат стВозврата;
	
КонецФункции // ПолучитьПараметрыНоменклатуры()
