
Процедура ПриЗаписи(Отказ)
	Если НЕ ЭтоГруппа Тогда
		Если ЗначениеЗаполнено(Родитель) И НЕ ЭтоГруппа Тогда
			об = Родитель.ПолучитьОбъект();
			об.КоличествоКомплектов = ПолучитьКоличествоКомплектов(Родитель);
			об.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если НЕ ЭтоГруппа Тогда
		Родитель = омКонтрольПапки.КонтрольПапкиЭлементаСправочника(Проект, Ссылка.Метаданные().Имя);
	КонецЕсли;
КонецПроцедуры



&НаСервере
Функция ПолучитьКоличествоКомплектов(Родитель)

		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПроизводственныеКомплекты.Ссылка) КАК КоличествоСсылок
		|ИЗ
		|	Справочник.ПроизводственныеКомплекты КАК ПроизводственныеКомплекты
		|ГДЕ
		|	ПроизводственныеКомплекты.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КоличествоСсылок;
	КонецЦикла;
	
	Возврат 0;


КонецФункции // ПолучитьКоличествоКомплектов(Родитель)
