Процедура ЗаполнитьПланНаОснованииЗапускаВРаботу(Задача, Комментарий = "") Экспорт

	Если НЕ ТребуестсяЗаписьПлан(Задача) Тогда
		Возврат;	
	КонецЕсли;
	
	СтруктураПараметрыЗадачи = ПолучитьПараметрыЗадачи(Задача);
	
	Если СтруктураПараметрыЗадачи.ТипЗадачи = "Композиция" Тогда
		НормаВремени = ПолучитьВремяРазработкиКомпозиции(СтруктураПараметрыЗадачи);
	Иначе
		НормаВремени = ПолучитьВремяРазработкиКомплекта(СтруктураПараметрыЗадачи);
	КонецЕсли;
	
	Если НормаВремени = 0 Тогда
	 	Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних(, Задача = &Задача) КАК ПлановоеЗначениеПроектированияСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МенеджерЗаписи = РегистрыСведений.ПлановоеЗначениеПроектирования.СоздатьМенеджерЗаписи();

	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
	КонецЦикла;
	
	МенеджерЗаписи.Период 				= ТекущаяДата();
	МенеджерЗаписи.Задача 				= Задача;
    МенеджерЗаписи.ПланРазработкиВДнях 	= НормаВремени;
    МенеджерЗаписи.Автор 				= ПараметрыСеанса.ТекущийПользователь;
    МенеджерЗаписи.Комментарий			= Комментарий;
	
	Если МенеджерЗаписи.ДатаНачала = Дата(1, 1, 1) Тогда
		МенеджерЗаписи.ДатаНачала = ТекущаяДата();	
	КонецЕсли;
	
	МенеджерЗаписи.Записать();

КонецПроцедуры

Функция ПолучитьПараметрыЗадачи(Задача)

	СтруктураПараметрыЗадачи = Новый Структура("ОбъектТЗ, Композиция, ТипЗадачи"
								, Задача.ОбъектТЗ, Ложь);
	
	Если ТипЗнч(Задача) = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
		
		СтруктураПараметрыЗадачи.ТипЗадачи = "ПКД";
		СтруктураПараметрыЗадачи.Композиция = ТипЗнч(СтруктураПараметрыЗадачи.ОбъектТЗ) = Тип("СправочникСсылка.Композиции");
		
		Если СтруктураПараметрыЗадачи.Композиция Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИзделияКомплект.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ИзделияКомплект КАК ИзделияКомплект
			|ГДЕ
			|	ИзделияКомплект.Родитель.Композиция = &Композиция";
			
			Запрос.УстановитьПараметр("Композиция", СтруктураПараметрыЗадачи.ОбъектТЗ);
			
			СтруктураПараметрыЗадачи.Вставить("МассивПодчиненных", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
			
		КонецЕсли;
		
	Иначе
		СтруктураПараметрыЗадачи.ТипЗадачи = "РКД";
	КонецЕсли;
	
	Возврат СтруктураПараметрыЗадачи;
	
КонецФункции // ПолучитьПараметрыЗадачи()

Функция ПолучитьВремяРазработкиКомпозиции(СтруктураПараметрыЗадачи)

		

КонецФункции // ПолучитьВремяРазработкиРКД(СтруктураПараметрыЗадачи)

Функция ПолучитьВремяРазработкиКомплекта(СтруктураПараметрыЗадачи)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.НормаВремени_ПКД КАК НормаВремени_ПКД,
		|	ДатыКомплекта.НормаВремени_РКД КАК НормаВремени_РКД
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", СтруктураПараметрыЗадачи.ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если СтруктураПараметрыЗадачи.ТипЗадачи = "ПКД" Тогда
		
			Возврат ?(Выборка.НормаВремени_ПКД = 0, 1, Выборка.НормаВремени_ПКД); 
		
		Иначе
		
			Возврат ?(Выборка.НормаВремени_РКД = 0, 1, Выборка.НормаВремени_РКД); 
		
		КонецЕсли;
		
		
	КонецЦикла;
	
	Возврат 1;
	
КонецФункции // ПолучитьВремяРазработкиРКД(СтруктураПараметрыЗадачи)()

Функция ТребуестсяЗаписьПлан(Задача)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановоеЗначениеПроектирования.Задача КАК Задача
		|ИЗ
		|	РегистрСведений.ПлановоеЗначениеПроектирования КАК ПлановоеЗначениеПроектирования
		|ГДЕ
		|	ПлановоеЗначениеПроектирования.Задача.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
	
		Возврат Истина;	
	
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции // ТребуестсяЗаписьПлан()
