Функция ПолучитьЗадачуПоОбъекту(ОбъектЗадачи) Экспорт
	
	мТипыЗадачКонструктора = омЗадачиПКДПовтор.ТипыЗадачКонструктора();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Задачи_ПКД.Ссылка, ЗНАЧЕНИЕ(Задача.Задачи_ПКД.ПустаяСсылка)) КАК Задачи,
		|	ВЫБОР
		|		КОГДА Задачи_ПКД.ТипЗадачи В (&ТипыЗадачКонструктора)
		|				И НЕ(ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеКонструктором)
		|						ИЛИ ТаймингЗадачСрезПоследних.Состояние ЕСТЬ NULL
		|						ИЛИ ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПустаяСсылка))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Задача_у_Конструктора
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО Задачи_ПКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|ГДЕ
		|	Задачи_ПКД.ОбъектТЗ = &ОбъектТЗ
		|	И НЕ Задачи_ПКД.Выполнена
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Задачи_РКД.Ссылка, ЗНАЧЕНИЕ(Задача.Задачи_РКД.ПустаяСсылка)),
		|	ВЫБОР
		|		КОГДА Задачи_РКД.ТипЗадачи В (&ТипыЗадачКонструктора)
		|				И НЕ(ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеКонструктором)
		|						ИЛИ ТаймингЗадачСрезПоследних.Состояние ЕСТЬ NULL
		|						ИЛИ ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПустаяСсылка))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО Задачи_РКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ = &ОбъектТЗ
		|	И НЕ Задачи_РКД.Выполнена";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектЗадачи);
	Запрос.УстановитьПараметр("ТипыЗадачКонструктора", омЗадачиПКДПовтор.ТипыЗадачКонструктора());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Задачи) Тогда
		
			Возврат Новый Структура("Задача, РаботаКонструктора", Выборка.Задачи, Выборка.Задача_у_Конструктора);	
		
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат Неопределено
	
КонецФункции // ПолучитьЗадачуПоОбъекту()

Процедура ЗаполнитьНачальныеДанныеЗадачиБагТрек(ДанныеФормы) Экспорт

	ДанныеФормы.ТипЗадачи 		= Перечисления.ТипыОбщихЗадач.Информация;
	
	Если ЗначениеЗаполнено(ДанныеФормы.ОбъектАдресации) Тогда
	
		ДанныеФормы.Проект = ДанныеФормы.ОбъектАдресации.Проект;	
	
	КонецЕсли;

КонецПроцедуры

Функция ВыполнитьДействиеДляКомплекта(УИДДействия, ДействиПриЗавершении) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДлительныеДействия.ОбъектДействия КАК ОбъектДействия
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.ДлительныеДействия КАК ДлительныеДействия
		|ГДЕ
		|	ДлительныеДействия.УИДДействия = &УИДДействия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК ЗадачаРКД
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Задачи_РКД КАК Задачи_РКД
		|		ПО вт.ОбъектДействия = Задачи_РКД.ОбъектТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.ОбъектДействия КАК ОбъектДействия
		|ИЗ
		|	вт КАК вт";
	
	Запрос.УстановитьПараметр("УИДДействия", УИДДействия);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбъектДействия = Неопределено;
	Выборка = Результат[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектДействия = Выборка.ОбъектДействия;
	КонецЦикла; 
	
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗадачаРКД = Выборка.ЗадачаРКД;
	КонецЦикла; 
	
	Если НЕ ЗначениеЗаполнено(ОбъектДействия) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтатусыДействия = омЗадачиПКДСервер.ПолучитьСтатусЗадачиПоДействию(ДействиПриЗавершении);
	Если ДействиПриЗавершении = "ПереносВ_ПКД_ДизайнеромКорректировкаДизайнера" ИЛИ ДействиПриЗавершении = "ПереносВ_ПКД_ДизайнеромИзменениеЗаказчиком" Тогда
		
		Попытка
		
		Задачи.ПересогласованиеКомпозиции.СоздатьЗадачуПересоглосования(ОбъектДействия, ДействиПриЗавершении); 
		
		Исключение
			в = ОписаниеОшибки();	
 		КонецПопытки;
		
	ИначеЕсли ДействиПриЗавершении = "СбросДизайнеромКорректировкаДизайнера" ИЛИ ДействиПриЗавершении = "СбросДизайнеромИзменениеЗаказчиком" Тогда
		
		Конструктор = омСотрудники.ПолучитьКонструктораРазработкиПользовательПоОбъекту(ОбъектДействия);
		Задачи.Задачи_ПКД.СоздатьЗадачуРКД(ОбъектДействия, Конструктор, СтатусыДействия.Статус, СтатусыДействия.Тип, Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
		
		Если омКанбанПроизводство.РесурсВПроизводстве(ОбъектДействия) Тогда
			
			УИДКарточка = "";
			
			омКанбанПроизводство.ПеревестиКарточкуВПриостановку(ОбъектДействия, , УИДКарточка);
			омКанбанДоскиНаСервере.ЗаписатьТег(Справочники.Теги.Пересогласование, УИДКарточка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции // Перемемистить_задачу_с_РКД_в_ПКД(ЗадачаКомплект)   

Функция ПолучитьрежимРаботыИсполнителяЗадачи(Задача) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.ОбъектТЗ КАК ОбъектТЗ
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.Ссылка = &Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеСотрудниковСрезПоследних.РежимРаботы КАК РежимРаботы
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСотрудников.СрезПоследних КАК ДанныеСотрудниковСрезПоследних
		|			ПО ДанныеКомплектаСрезПоследних.Конструктор = ДанныеСотрудниковСрезПоследних.Сотрудник
		|		ПО вт.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект";
	
	
	Если ТипЗнч(Задача) = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Задачи_РКД", "Задачи_ПКД");	
	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.РежимРаботы;
	КонецЦикла;
	
	Возврат Перечисления.РежимыРаботы.ПустаяСсылка();

КонецФункции // получитьрежимРаботыИсполнителяЗадачи()

Функция ПолучитьНаименованиеЗадачи(Задача, СтатусЗадачи = Неопределено, Комплект = Неопределено) Экспорт

	Если ТипЗнч(Задача) = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
		ЗадачаПКД = Истина;  
		ТипЗадачиСтрокой = "ПКД";  
	Иначе	
		ЗадачаПКД = Ложь;  
		ТипЗадачиСтрокой = "Р";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Задача) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Задачи_ПКД.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование,
			|	Задачи_ПКД.СтатусЗадачи КАК СтатусЗадачи,
			|	ЕСТЬNULL(ТаймингЗадачСрезПоследних.НомерПКД, 0) + 1 КАК НомерПКД,
			|	ЕСТЬNULL(ТаймингЗадачСрезПоследних.НомерРКД, 0) + 1 КАК НомерРКД
			|ИЗ
			|	Задача.Задачи_ПКД КАК Задачи_ПКД,
			|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних
			|ГДЕ
			|	Задачи_ПКД.Ссылка = &Задача";
		
		Если НЕ ЗадачаПКД Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Задачи_ПКД", "Задачи_РКД");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Задача", Задача);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НаименованиеКомплекта 	= Выборка.ОбъектТЗНаименование;
			СтатусЗадачи			= ?(СтатусЗадачи = Неопределено, Выборка.СтатусЗадачи, СтатусЗадачи);
			НомерПКД				= Выборка.НомерПКД;
			НомерРКД				= Выборка.НомерРКД;
		КонецЦикла;
		
	Иначе
		
		НаименованиеКомплекта 	= Комплект.Наименование;
		СтатусЗадачи			= ?(СтатусЗадачи = Неопределено, Перечисления.СтатусыЗадач.Разработка, СтатусЗадачи);
		НомерПКД				= 1;
		НомерРКД				= 1;
		
	КонецЕсли;
	
	ЗначениеСтатуса = "";
	
	Если СтатусЗадачи = Перечисления.СтатусыЗадач.Изменение Тогда
		ЗначениеСтатуса = "Изменение";	
	ИначеЕсли СтатусЗадачи = Перечисления.СтатусыЗадач.Корректировка Тогда
		ЗначениеСтатуса = "Корректировка";
	ИначеЕсли СтатусЗадачи = Перечисления.СтатусыЗадач.Разработка Тогда
		ЗначениеСтатуса = "Разработка";
	ИначеЕсли СтатусЗадачи = Перечисления.СтатусыЗадач.Редакция Тогда
		ЗначениеСтатуса = "Редакция";
	ИначеЕсли СтатусЗадачи = Перечисления.СтатусыЗадач.Рекламация Тогда
		ЗначениеСтатуса = "Рекламация";
	ИначеЕсли СтатусЗадачи = Перечисления.СтатусыЗадач.ОжиданиеГЧ Тогда
		ЗначениеСтатуса = "ОжиданиеГЧ";
	КонецЕсли;
	
	Если ЗадачаПКД Тогда
		НомерЗадачи = Формат(НомерПКД, "ЧГ=0");  
	Иначе	
		НомерЗадачи = Формат(НомерПКД, "ЧГ=0") + "." + Формат(НомерРКД, "ЧГ=0");  
	КонецЕсли;
	
	Возврат СтрШаблон("%1.%2.%3.%4", НаименованиеКомплекта, ТипЗадачиСтрокой, НомерЗадачи, ЗначениеСтатуса);

КонецФункции // получитьСуфиксНаименованиеЗадачи()

#Область СчетчикиСобытий

Функция ПолучитьНаименованиеПКД() Экспорт  //Не менять порядок в массиве!!!

	НаименованиеКнопокПКД = Новый Массив(20);
	
	НаименованиеКнопокПКД[0]  = "СчетчикиКнопки_ПКД_ДоработкаДизайнера";
	НаименованиеКнопокПКД[1]  = "СчетчикиКнопки_ПКД_КорректировкаДизайнер";
	НаименованиеКнопокПКД[2]  = "СчетчикиКнопки_ПКД_ВнешнееСоглосование";
	НаименованиеКнопокПКД[3]  = "СчетчикиКнопки_ПКД_Запрос";
	НаименованиеКнопокПКД[4]  = "СчетчикиКнопки_ПКД_Согласовано";
	НаименованиеКнопокПКД[5]  = "СчетчикиКнопки_ПКД_РекламацияДизайнер";
	НаименованиеКнопокПКД[6]  = "СчетчикиКнопки_ПКД_РедакцияДизайнер";
	НаименованиеКнопокПКД[7]  = "СчетчикиКнопки_ПКД_КонтрольКП";
	НаименованиеКнопокПКД[8]  = "СчетчикиКнопки_ПКД_ВозвратССогласования";
	НаименованиеКнопокПКД[9]  = "СчетчикиКнопки_ПКД_ВозвратСЗапроса";
	НаименованиеКнопокПКД[10] = "СчетчикиКнопки_ПКД_СогласованоМенеджер";
	НаименованиеКнопокПКД[11] = "СчетчикиКнопки_ПКД_НачатьВыполнениеКонструктор";
	НаименованиеКнопокПКД[12] = "СчетчикиКнопки_ПКД_ЗавершитьВыполнениеКонструктор";
	НаименованиеКнопокПКД[13] = "СчетчикиКнопки_ПКД_ПриостановитьКонструктор";
	НаименованиеКнопокПКД[14] = "СчетчикиКнопки_ПКД_СбросКонструктором";
	НаименованиеКнопокПКД[15] = "СчетчикиКнопки_ПКД_ДоработкаВедущийКонструктор";
	НаименованиеКнопокПКД[16] = "СчетчикиКнопки_ПКД_КонтрольВедущийКонструктор";
	НаименованиеКнопокПКД[17] = "СчетчикиКнопки_ПКД_СогласованоСИзменением";
	НаименованиеКнопокПКД[18] = "СчетчикиКнопки_ПКД_СогласованоБезИзменений";
	НаименованиеКнопокПКД[19] = "СчетчикиКнопки_ПКД_ОтменаИзделия";
	
	Возврат НаименованиеКнопокПКД;

КонецФункции // ПолучитьНаименованиеПКД()

Функция ПолучитьНаименованиеРКД() Экспорт  //Не менять порядок в массиве!!!

	НаименованиеКнопокПКД = Новый Массив(9);
	
	НаименованиеКнопокПКД[0] = "СчетчикиКнопки_РКД_НачатьВыполнениеКонструктор";
	НаименованиеКнопокПКД[1] = "СчетчикиКнопки_РКД_ЗавершитьВыполнениеКонструктор";
	НаименованиеКнопокПКД[2] = "СчетчикиКнопки_РКД_ПриостановитьКонструктор";
	НаименованиеКнопокПКД[3] = "СчетчикиКнопки_РКД_СбросКонструктором";
	НаименованиеКнопокПКД[4] = "СчетчикиКнопки_РКД_ДоработкаВедущийКонструктор";
	НаименованиеКнопокПКД[5] = "СчетчикиКнопки_РКД_УтвердитьВедущийКонструктор";
	НаименованиеКнопокПКД[6] = "СчетчикиКнопки_РКД_СбросДизайнеромКорректировкаДизайнера";
	НаименованиеКнопокПКД[7] = "СчетчикиКнопки_РКД_СбросДизайнеромИзменениеЗаказчиком";
	НаименованиеКнопокПКД[8] = "СчетчикиКнопки_РКД_ОжиданиеГЧ";
	
	Возврат НаименованиеКнопокПКД;

КонецФункции // ПолучитьНаименованиеПКД()   ОжиданиеГЧ

Функция ПолучитьНаименованиеСостояний() Экспорт  //Не менять порядок в массиве!!!

	НаименованиеКнопокПКД = Новый Массив(4);
	
	НаименованиеКнопокПКД[0] = "СчетчикиКнопки_Сост_СтопНачало";
	НаименованиеКнопокПКД[1] = "СчетчикиКнопки_Сост_СтопОстановка";
	НаименованиеКнопокПКД[2] = "СчетчикиКнопки_Сост_РекламацияНачало";
	НаименованиеКнопокПКД[3] = "СчетчикиКнопки_Сост_РекламацияОстановка";
	
	Возврат НаименованиеКнопокПКД;

КонецФункции // ПолучитьНаименованиеПКД()

Функция КолонкиТаблицаКнопокСостояние() Экспорт

	ИменаКолонок = Новый Массив(9);
	
	ИменаКолонок[0] = "Номер ПКД согласованное";
	ИменаКолонок[1] = "Номер ПКД не согласованное";
	ИменаКолонок[2] = "Номер РКД согласованное";
	ИменаКолонок[3] = "Номер РКД не согласованное";
	ИменаКолонок[4] = "Доработка";
	ИменаКолонок[5] = "Изменение";
	ИменаКолонок[6] = "Редакция";
	ИменаКолонок[7] = "Рекламация";
	ИменаКолонок[8] = "Согласование";
	
	Возврат ИменаКолонок;
	
КонецФункции // КолонкиТаблицаКнопокПКД()

Функция КолонкиТаблицаКнопокПКД() Экспорт

	ИменаКолонок = Новый Массив(7);
	ИменаКолонок[0] = "Номер ПКД согласованное";
	ИменаКолонок[1] = "Номер ПКД не согласованное";
	ИменаКолонок[2] = "Доработка";
	ИменаКолонок[3] = "Изменение";
	ИменаКолонок[4] = "Редакция";
	ИменаКолонок[5] = "Рекламация";
	ИменаКолонок[6] = "Согласование";
	
	Возврат ИменаКолонок;
	
КонецФункции // КолонкиТаблицаКнопокПКД()

Функция КолонкиТаблицаКнопокРКД() Экспорт

	ИменаКолонок = Новый Массив(6);
	ИменаКолонок[0] = "Номер РКД согласованное";
	ИменаКолонок[1] = "Номер РКД не согласованное";
	ИменаКолонок[2] = "Доработка";
	ИменаКолонок[3] = "Изменение";
	ИменаКолонок[4] = "Редакция";
	ИменаКолонок[5] = "Рекламация";
	
	Возврат ИменаКолонок;
	
КонецФункции // КолонкиТаблицаКнопокПКД()

	
#КонецОбласти

