Функция ПолучитьЗадачуПоОбъекту(ОбъектЗадачи) Экспорт
	
	мТипыЗадачКонструктора = омЗадачиПКДПовтор.ТипыЗадачКонструктора();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Задачи_ПКД.Ссылка, ЗНАЧЕНИЕ(Задача.Задачи_ПКД.ПустаяСсылка)) КАК Задачи,
		|	ВЫБОР
		|		КОГДА Задачи_ПКД.ТипЗадачи В (&ТипыЗадачКонструктора)
		|				И НЕ(ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеКонструктором)
		|						ИЛИ ТаймингЗадачСрезПоследних.Состояние ЕСТЬ NULL
		|						ИЛИ ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПустаяСсылка))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Задача_у_Конструктора
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО Задачи_ПКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|ГДЕ
		|	Задачи_ПКД.ОбъектТЗ = &ОбъектТЗ
		|	И НЕ Задачи_ПКД.Выполнена
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Задачи_РКД.Ссылка, ЗНАЧЕНИЕ(Задача.Задачи_РКД.ПустаяСсылка)),
		|	ВЫБОР
		|		КОГДА Задачи_РКД.ТипЗадачи В (&ТипыЗадачКонструктора)
		|				И НЕ(ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеКонструктором)
		|						ИЛИ ТаймингЗадачСрезПоследних.Состояние ЕСТЬ NULL
		|						ИЛИ ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПустаяСсылка))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО Задачи_РКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ = &ОбъектТЗ
		|	И НЕ Задачи_РКД.Выполнена";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектЗадачи);
	Запрос.УстановитьПараметр("ТипыЗадачКонструктора", омЗадачиПКДПовтор.ТипыЗадачКонструктора());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Задачи) Тогда
		
			Возврат Новый Структура("Задача, РаботаКонструктора", Выборка.Задачи, Выборка.Задача_у_Конструктора);	
		
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат Неопределено
	
КонецФункции // ПолучитьЗадачуПоОбъекту()

Процедура ЗаполнитьНачальныеДанныеЗадачиБагТрек(ДанныеФормы) Экспорт

	ДанныеФормы.ТипЗадачи 		= Перечисления.ТипыОбщихЗадач.Информация;
	
	Если ЗначениеЗаполнено(ДанныеФормы.ОбъектАдресации) Тогда
	
		ДанныеФормы.Проект = ДанныеФормы.ОбъектАдресации.Проект;	
	
	КонецЕсли;

КонецПроцедуры

Функция ВыполнитьДействиеДляКомплекта(УИДДействия, ДействиПриЗавершении) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДлительныеДействия.ОбъектДействия КАК ОбъектДействия
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.ДлительныеДействия КАК ДлительныеДействия
		|ГДЕ
		|	ДлительныеДействия.УИДДействия = &УИДДействия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК ЗадачаРКД
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Задачи_РКД КАК Задачи_РКД
		|		ПО вт.ОбъектДействия = Задачи_РКД.ОбъектТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.ОбъектДействия КАК ОбъектДействия
		|ИЗ
		|	вт КАК вт";
	
	Запрос.УстановитьПараметр("УИДДействия", УИДДействия);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбъектДействия = Неопределено;
	Выборка = Результат[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектДействия = Выборка.ОбъектДействия;
	КонецЦикла; 
	
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗадачаРКД = Выборка.ЗадачаРКД;
	КонецЦикла; 
	
	Если НЕ ЗначениеЗаполнено(ОбъектДействия) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтатусыДействия = омЗадачиПКДСервер.ПолучитьСтатусЗадачиПоДействию(ДействиПриЗавершении);
	Если ДействиПриЗавершении = "ПереносВ_ПКД_ДизайнеромКорректировкаДизайнера" ИЛИ ДействиПриЗавершении = "ПереносВ_ПКД_ДизайнеромИзменениеЗаказчиком" Тогда
		
		Попытка
		
		Задачи.ПересогласованиеКомпозиции.СоздатьЗадачуПересоглосования(ОбъектДействия, ДействиПриЗавершении); 
		
		Исключение
			в = ОписаниеОшибки();	
 		КонецПопытки;
		
	ИначеЕсли ДействиПриЗавершении = "СбросДизайнеромКорректировкаДизайнера" ИЛИ ДействиПриЗавершении = "СбросДизайнеромИзменениеЗаказчиком" Тогда
		
		Конструктор = омСотрудники.ПолучитьКонструктораРазработкиПользовательПоОбъекту(ОбъектДействия);
		Задачи.Задачи_ПКД.СоздатьЗадачуРКД(ОбъектДействия, Конструктор, СтатусыДействия.Статус, СтатусыДействия.Тип, Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
		
		Если омКанбанПроизводство.РесурсВПроизводстве(ОбъектДействия) Тогда
			
			УИДКарточка = "";
			
			омКанбанПроизводство.ПеревестиКарточкуВПриостановку(ОбъектДействия, , УИДКарточка);
			омКанбанДоскиНаСервере.ЗаписатьТег(Справочники.Теги.Пересогласование, УИДКарточка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции // Перемемистить_задачу_с_РКД_в_ПКД(ЗадачаКомплект)   

Функция ПолучитьрежимРаботыИсполнителяЗадачи(Задача) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.ОбъектТЗ КАК ОбъектТЗ
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.Ссылка = &Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеСотрудниковСрезПоследних.РежимРаботы КАК РежимРаботы
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСотрудников.СрезПоследних КАК ДанныеСотрудниковСрезПоследних
		|			ПО ДанныеКомплектаСрезПоследних.Конструктор = ДанныеСотрудниковСрезПоследних.Сотрудник
		|		ПО вт.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект";
	
	
	Если ТипЗнч(Задача) = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Задачи_РКД", "Задачи_ПКД");	
	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.РежимРаботы;
	КонецЦикла;
	
	Возврат Перечисления.РежимыРаботы.ПустаяСсылка();

КонецФункции // получитьрежимРаботыИсполнителяЗадачи()

Функция ПолучитьНаименованиеЗадачи(Задача, СтатусЗадачи = Неопределено, Комплект) Экспорт

	Если ТипЗнч(Задача) = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
		ЗадачаПКД = Истина;  
	Иначе	
		ЗадачаПКД = Ложь;  
	КонецЕсли;

	Если ЗначениеЗаполнено(Задача) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Задачи_ПКД.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование,
			|	Задачи_ПКД.СтатусЗадачи КАК СтатусЗадачи,
			|	ЕСТЬNULL(ТаймингЗадачСрезПоследних.НомерПКД, 0) + 1 КАК НомерПКД,
			|	ЕСТЬNULL(ТаймингЗадачСрезПоследних.НомерРКД, 0) + 1 КАК НомерРКД
			|ИЗ
			|	Задача.Задачи_ПКД КАК Задачи_ПКД,
			|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних
			|ГДЕ
			|	Задачи_ПКД.Ссылка = &Ссылка";
		
		Если ЗадачаПКД Тогда
			ТипЗадачиСтрокой = ".ПКД";  
		Иначе	
			ТипЗадачиСтрокой = ".Р";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Задачи_ПКД", "Задачи_РКД");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Ссылка", Задача);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НаименованиеКомплекта 	= Выборка.ОбъектТЗНаименование;
			КоличествоСогласований 	= Выборка.КоличествоСогласований;
			СтатусЗадачи			= ?(СтатусЗадачи = Неопределено, Выборка.СтатусЗадачи, СтатусЗадачи);
			НомерПКД				= Выборка.НомерПКД;
			НомерРКД				= Выборка.НомерРКД;
		КонецЦикла;
		
	Иначе
		
		НаименованиеКомплекта 	= Комплект.Наименование;
		СтатусЗадачи			= ?(СтатусЗадачи = Неопределено, Перечисления.СтатусыЗадач.Разработка, СтатусЗадачи);
		НомерПКД				= 1;
		НомерРКД				= 1;
		
	КонецЕсли;
	
	ЗначениеСтатуса = "";
	
	Если СтатусЗадачи = Перечисления.СтатусыЗадач.Изменение Тогда
		ЗначениеСтатуса = "Изменение";	
	ИначеЕсли СтатусЗадачи = Перечисления.СтатусыЗадач.Корректировка Тогда
		ЗначениеСтатуса = "Корректировка";
	ИначеЕсли СтатусЗадачи = Перечисления.СтатусыЗадач.Разработка Тогда
		ЗначениеСтатуса = "Разработка";
	ИначеЕсли СтатусЗадачи = Перечисления.СтатусыЗадач.Редакция Тогда
		ЗначениеСтатуса = "Редакция";
	ИначеЕсли СтатусЗадачи = Перечисления.СтатусыЗадач.Рекламация Тогда
		ЗначениеСтатуса = "Рекламация";
	ИначеЕсли СтатусЗадачи = Перечисления.СтатусыЗадач.ОжиданиеГЧ Тогда
		ЗначениеСтатуса = "ОжиданиеГЧ";
	КонецЕсли;
	
	Если ЗадачаПКД Тогда
		НомерЗадачи = Формат(НомерПКД, "ЧГ=0");  
	Иначе	
		НомерЗадачи = Формат(НомерПКД, "ЧГ=0") + "." + Формат(НомерРКД, "ЧГ=0");  
	КонецЕсли;
	
	Возврат СтрШаблон("%1.%2.%3.%4", НаименованиеКомплекта, ЗначениеСтатуса, ТипЗадачиСтрокой, НомерЗадачи);

КонецФункции // получитьСуфиксНаименованиеЗадачи()
