
&НаКлиенте
Процедура Обновить(Команда)
	СформироватьОтчет();
КонецПроцедуры


Процедура СформироватьОтчет()

	ПолеВывода.Очистить();
	
	МенеджерОтчета = Отчеты.РаботаКонструктра;
	
	Макет = МенеджерОтчета.ПолучитьМакет("Макет");
	
	ТекущаяОбласть = Макет.ПолучитьОбласть("Шапка");
	ТекущаяОбласть.Параметры.Заполнить(ЭтаФорма);
	ПолеВывода.Вывести(ТекущаяОбласть);

	
	ТекущаяОбласть = Макет.ПолучитьОбласть("Строка");
	      
	МассивЗадач = МенеджерОтчета.ПолучитьМассивЗадачЗакрытыеВПериод(Период.ДатаНачала, Период.ДатаОкончания);
	
	ТаблицаТайминга = РегистрыСведений.ТаймингЗадач.ПолучитьТаймингиЗадач(МассивЗадач, Конструктор).ТайминЗадач;
	
	ТаблицаТайминга.Сортировать("ОбъектТЗНаименование, ДатаНачала");
	
	МассиаОбъектов = ПолучитьМассивОбъектов(ТаблицаТайминга); 
	
	Отбор = Новый Структура("ОбъектТЗ", );
	
	Для каждого ТекущийОбъект Из МассиаОбъектов Цикл
	
		ТекущаяОбласть.Параметры.Заполнить(ТекущийОбъект);
		
		Норма 	= 0;
		Факт 	= 0;
		План 	= 0; 
		
		ИтогоДоработка 	= 0;
		ИтогоФакт		= 0;
		
		Отбор.ОбъектТЗ = ТекущийОбъект.ОбъектТЗ;
		
		Для каждого х Из ТаблицаТайминга.НайтиСтроки(Отбор) Цикл
		
			Если НЕ х.Ожидание Тогда
			
				Если х.Доработка Тогда
					ИтогоДоработка = ИтогоДоработка + х.ПродолжительностьВЧасах;
				КонецЕсли;
				
				ИтогоФакт = ИтогоФакт + х.ПродолжительностьВЧасах;
				
				Норма 	= Норма + х.НормаВремени;
				Факт 	= Факт 	+ х.ПродолжительностьВЧасах;
				План 	= План 	+ х.ПлановоеЗначение;
			КонецЕсли;	
		
		КонецЦикла;
		
		ТекущаяОбласть.Параметры.Норма 	= Норма;
		ТекущаяОбласть.Параметры.Факт 	= Факт / 24;
		ТекущаяОбласть.Параметры.План 	= План;

		ПолеВывода.Вывести(ТекущаяОбласть);

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьМассивОбъектов(ТаблицаТайминга)
	
	МассивВременный = Новый Массив;
	МассиаОбъектов	= Новый Массив;
	
    Для каждого х Из ТаблицаТайминга Цикл
	
		Если МассивВременный.Найти(х.ОбъектТЗ) = Неопределено Тогда
		
			МассивВременный.Добавить(х.ОбъектТЗ);	
			МассиаОбъектов.Добавить(Новый Структура("ОбъектТЗ, ОбъектТЗНаименование",х.ОбъектТЗ, х.ОбъектТЗНаименование));
			
		КонецЕсли;	
	
	КонецЦикла;
	
	Возврат МассиаОбъектов;
	
КонецФункции // ПолучитьМассивОбъектов(ТаблицаТайминга)
