
&НаКлиенте
Процедура Обновить(Команда)
	СформироватьОтчет();
КонецПроцедуры

Процедура СформироватьОтчет()

	ПолеВывода.Очистить();
	
	СекундВСутках = 3600 * 24;
	
	МенеджерОтчета = Отчеты.РаботаКонструктра;
	
	Макет = МенеджерОтчета.ПолучитьМакет("Макет");
	
	ТекущаяОбласть = Макет.ПолучитьОбласть("Шапка");
	ТекущаяОбласть.Параметры.Заполнить(ЭтаФорма);
	ПолеВывода.Вывести(ТекущаяОбласть);
	ПолеВывода.ФиксацияСверху = ПолеВывода.ВысотаТаблицы;
	
	ТекущаяОбласть 	= Макет.ПолучитьОбласть("Строка");
	ОбъектТЗОбласть = Макет.ПолучитьОбласть("ОбъектТЗ");
	ВРаботеОбласть 	= Макет.ПолучитьОбласть("ВРаботе");
	ТаблицаТайминга = РегистрыСведений.ТаймингЗадач.ПолучитьТаймингиЗадачКонструктор(Период,Конструктор).ТайминЗадач;
	
	ОбъектыТЗКонструктора = омТЧ_НаКлиентеСервере.КолонкуВМассив(ТаблицаТайминга, "ОбъектТЗ");
	
	ТаблицаТайминга.Сортировать("ОбъектТЗНаименование, ДатаНачала");
	Отбор = Новый Структура("ОбъектТЗ", );
	
	ТекущийОбъектТЗ = Неопределено; 
	
	ТаблицаВыводаОбъектаТЗ = СоздатьТаблицуВывода();
	
	Для каждого СтрокаЗадач Из ТаблицаТайминга Цикл
		
		Если НЕ ТекущийОбъектТЗ = СтрокаЗадач.ОбъектТЗ Тогда
		
			Отбор.ОбъектТЗ = СтрокаЗадач.ОбъектТЗ;
			ЗаполнитьТаблицуВывода(ТаблицаВыводаОбъектаТЗ, ТаблицаТайминга, Отбор, СекундВСутках);
			
			ТекущийОбъектТЗ = СтрокаЗадач.ОбъектТЗ;	
		    ОбъектТЗОбласть.Параметры.Заполнить(СтрокаЗадач);
			ПолеВывода.Вывести(ОбъектТЗОбласть); 
			
			Для каждого х Из ТаблицаВыводаОбъектаТЗ Цикл
				
				Если х.Вработе Тогда
					ВРаботеОбласть.Параметры.Заполнить(х);
					ПолеВывода.Вывести(ВРаботеОбласть);
				Иначе
					ТекущаяОбласть.Параметры.Заполнить(х);
					ПолеВывода.Вывести(ТекущаяОбласть);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		
		//ТекущаяОбласть.Параметры.Заполнить(СтрокаЗадач);
		//
		//Норма 	= 0;
		//Факт 	= 0;
		//План 	= 0; 
		//
		//ИтогоДоработка 	= 0;
		//ИтогоФакт		= 0;
		//
		//Отбор.ОбъектТЗ = СтрокаЗадач.ОбъектТЗ;
		//
		//Для каждого х Из ТаблицаТайминга.НайтиСтроки(Отбор) Цикл
		//
		//	Если НЕ х.Ожидание И Конструктор = х.Исполнитель Тогда
		//	
		//		Если х.Доработка Тогда
		//			ИтогоДоработка = ИтогоДоработка + х.ПродолжительностьВЧасах;
		//		КонецЕсли;
		//		
		//		//ИтогоФакт = ИтогоФакт + х.ПродолжительностьВЧасах;
		//		
		//		Норма 	= Норма + х.НормаВремени;
		//		//Факт 	= Факт 	+ х.ПродолжительностьВЧасах;
		//		План 	= План 	+ х.ПлановоеЗначение;
		//	КонецЕсли;	
		//
		//КонецЦикла;
		//
		//ТекущаяОбласть.Параметры.Норма 	= Норма;
		////ТекущаяОбласть.Параметры.Факт 	= Факт / 24;
		//ТекущаяОбласть.Параметры.План 	= План;

		//ПолеВывода.Вывести(ТекущаяОбласть);

	КонецЦикла;

КонецПроцедуры 

Функция ЗаполнитьТаблицуВывода(ТаблицаВыводаОбъектаТЗ, ТаблицаТайминга, Отбор, СекундВСутках)
	
	ДанныеВозврата = Новый Структура("Норма, Факт, План, ОписаниеОбъектаТЗ", 0, 0, 0, "");
	
	ТаблицаВыводаОбъектаТЗ.Очистить(); 
	
	НайденыеСтроки = ТаблицаТайминга.НайтиСтроки(Отбор);
	
	МаксимальныйИндекс = НайденыеСтроки.Количество() - 1;
	
	ОжиданиеРаботы = Истина;
	
	Для х = 0 По МаксимальныйИндекс Цикл
		
		СтрокаТайминга = ТаблицаТайминга[х];
		
		НС = ТаблицаВыводаОбъектаТЗ.Добавить();
		НС.ДатаНачала 			= СтрокаТайминга.ДатаНачала;
		НС.Норма 				= СтрокаТайминга.НормаВремени;
		НС.Стадия 				= СтрокаТайминга.Стадия;
		НС.СтадияНаименование	= СтрокаТайминга.СтадияНаименование;
		НС.ВРаботе 				= СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ВРаботеКонструктора;
		
		Если х < МаксимальныйИндекс Тогда
			
			СтрокаТаймингаСледующая 	= ТаблицаТайминга[х + 1];
			НС.Факт 					= Окр((СтрокаТаймингаСледующая.ДатаНачала - СтрокаТайминга.ДатаНачала) / СекундВСутках, 2);
			
		КонецЕсли;  		
		
	КонецЦикла;
	
	Если МаксимальныйИндекс >= 0 Тогда
		
		НС.Факт = Окр((ТекущаяДата() - СтрокаТайминга.ДатаНачала) / СекундВСутках, 2);
		
	КонецЕсли;
	
КонецФункции


Функция СоздатьТаблицуВывода()

	ОписаниеЧисла5_2 = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 2, ДопустимыйЗнак.Неотрицательный));
	
	ТаблицаВыводаОбъектаТЗ = Новый ТаблицаЗначений;
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Стадия", 				Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("СтадияНаименование", 	Новый ОписаниеТипов("Строка"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДатаНачала", 			Новый ОписаниеТипов("Дата"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Факт", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("План", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Норма", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("СтруктураНорма",		Новый ОписаниеТипов("СписокЗначений"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ВРаботе", 				Новый ОписаниеТипов("Булево"));

	Возврат ТаблицаВыводаОбъектаТЗ;
	
КонецФункции // СоздатьТаблицуВывода()


