&НаСервере
Функция ПолучитьПредставление(СтруктураПараметров) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерТипа = Справочники.ТипыРасчетныхЗначений;
	
	Если СтруктураПараметров.ТипРасчетногоЗначения = МенеджерТипа.НомерПомещения Тогда
		Возврат ПолучитьНомерПомещения(СтруктураПараметров.Помещение);	
	ИначеЕсли СтруктураПараметров.ТипРасчетногоЗначения = МенеджерТипа.ДатаСогласованияЧертежей Тогда
		Возврат ПолучитьДатыСогласованияЧертежей(СтруктураПараметров.Комплект);	
	ИначеЕсли СтруктураПараметров.ТипРасчетногоЗначения = МенеджерТипа.ДоговорныеСроки Тогда
		Возврат ПолучитьСрокиПроизводства(СтруктураПараметров.Комплект);	
	ИначеЕсли СтруктураПараметров.ТипРасчетногоЗначения = МенеджерТипа.ПлановыеДаты Тогда
		Возврат ПолучитьПлановыеДаты(СтруктураПараметров.Комплект);	
	
	
		
	
	КонецЕсли;
	
	
КонецФункции // ПолучитьПредставление(СтруктураПараметров) 

&НаСервере
Функция ПолучитьПлановыеДаты(Комплект)

			

КонецФункции // ПолучитьПлановыеДаты()


&НаСервере
Функция ПолучитьСтруктуруПараметровДляТипаРасчетногоЗначения(ТипРасчетногоЗначения, ЕдинственноеЗначение = Истина) Экспорт

	МенеджерТипа = Справочники.ТипыРасчетныхЗначений;
	
	СтруктураПараметров = Новый Структура("ТипРасчетногоЗначения", ТипРасчетногоЗначения);
	
	Если ТипРасчетногоЗначения = МенеджерТипа.НомерПомещения Тогда
		СтруктураПараметров.Вставить("Помещение", ?(ЕдинственноеЗначение, Справочники.Помещения.ПустаяСсылка(), Новый Массив));		
	ИначеЕсли ТипРасчетногоЗначения = МенеджерТипа.ДатаСогласованияЧертежей ИЛИ МенеджерТипа.СрокПроизводства
		ИЛИ ТипРасчетногоЗначения = МенеджерТипа.ПлановыеДаты Тогда
		СтруктураПараметров.Вставить("Комплект", ?(ЕдинственноеЗначение, Неопределено, Новый Массив));		
	
	
		
	
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции // ПолучиьтьСтруктуруПараметровДляТипаРасчетногоЗначения() 

&НаСервере
Функция ПолучитьСрокиПроизводства(Комплект)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Комплект,
		|	ИзделияКомплект.Родитель.Композиция КАК Композиция
		|ПОМЕСТИТЬ втКомплекты
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Родитель.Композиция В(&Комплект)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Ссылка В(&Комплект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка КАК ИзделиеЗаказчика,
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК Комплект,
		|	втКомплекты.Композиция КАК Композиция
		|ПОМЕСТИТЬ втИзделия
		|ИЗ
		|	втКомплекты КАК втКомплекты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|			ПО ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент = ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент
		|		ПО втКомплекты.Комплект = ИзделияКомплектИзделияЭлемент.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИзделия.Композиция КАК Композиция,
		|	втИзделия.Комплект КАК Комплект,
		|	МИНИМУМ(ЕСТЬNULL(СрокиПоДоговору.СрокПроектированияВНеделях, 0)) КАК СрокПроектированияВНеделях,
		|	МИНИМУМ(ЕСТЬNULL(СрокиПоДоговору.СрокПроизводстваВНеделях, 0)) КАК СрокПроизводстваВНеделях,
		|	МИНИМУМ(ЕСТЬNULL(СрокиПоДоговору.СрокМонтажаВНеделях, 0)) КАК СрокМонтажаВНеделях
		|ИЗ
		|	втИзделия КАК втИзделия
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиПоДоговору КАК СрокиПоДоговору
		|		ПО (СрокиПоДоговору.ИзделиеЗаказчика = втИзделия.ИзделиеЗаказчика)
		|
		|СГРУППИРОВАТЬ ПО
		|	втИзделия.Композиция,
		|	втИзделия.Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ТипЗнч(Комплект) = Тип("Массив") Тогда
	
		Возврат РезультатЗапроса.Выгрузить();	
	
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ИзделиеЗаказчика", 				);
	СтруктураВозврата.Вставить("Композиция", 					);
	СтруктураВозврата.Вставить("Комплект", 						Комплект);
	СтруктураВозврата.Вставить("СрокПроектированияВНеделях", 	0);
	СтруктураВозврата.Вставить("СрокПроизводстваВНеделях", 		0);
	СтруктураВозврата.Вставить("СрокМонтажаВНеделях", 			0);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	
	ПерваяВыборка = Истина;
	
	Пока Выборка.Следующий() Цикл
		Если ПерваяВыборка Тогда
			ПерваяВыборка = Ложь;
			ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
		Иначе
		
			СтруктураВозврата.СрокПроектированияВНеделях 	= Мин(СтруктураВозврата.СрокПроектированияВНеделях, Выборка.СрокПроектированияВНеделях); 
			СтруктураВозврата.СрокПроизводстваВНеделях 		= Мин(СтруктураВозврата.СрокПроизводстваВНеделях, 	Выборка.СрокПроизводстваВНеделях); 
			СтруктураВозврата.СрокМонтажаВНеделях 			= Мин(СтруктураВозврата.СрокМонтажаВНеделях, 		Выборка.СрокМонтажаВНеделях); 
		
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьСрокиПроизводства()

&НаСервере
Функция ПолучитьДатыСогласованияЧертежей(Комплект)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешниеСогласованияСрезПоследних.Комплект КАК Комплект,
		|	ВнешниеСогласованияСрезПоследних.ВСоставеКомпозиции КАК ВСоставеКомпозиции,
		|	ВнешниеСогласованияСрезПоследних.ДатаОтказа КАК ДатаОтказа,
		|	ВнешниеСогласованияСрезПоследних.ДатаОтправки КАК ДатаОтправки,
		|	ВнешниеСогласованияСрезПоследних.ДатаСогласования КАК ДатаСогласования
		|ИЗ
		|	РегистрСведений.ВнешниеСогласованияЧертежей.СрезПоследних(, Комплект В (&Комплект)) КАК ВнешниеСогласованияСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если ТипЗнч(Комплект) = Тип("Массив") Тогда
	
		Возврат РезультатЗапроса.Выгрузить();	
	
	КонецЕсли;
	
	ПустаяДата = Дата(1, 1, 1);
	
	СтруктураВозврата = Новый Структура("ВСоставеКомпозиции, ДатаОтказа, ДатаОтправки, ДатаСогласования", Ложь, ПустаяДата, ПустаяДата, ПустаяДата);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьНомерПомещения()

&НаСервере
Функция ПолучитьНомерПомещения(Помещение)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Помещения.Ссылка КАК Помещение,
		|	Помещения.НомерПомещения КАК НомерПомещения
		|ИЗ
		|	Справочник.Помещения КАК Помещения
		|ГДЕ
		|	Помещения.Ссылка В(&Помещение)";
	
	Запрос.УстановитьПараметр("Помещение", Помещение);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если ТипЗнч(Помещение) = Тип("Массив") Тогда
	
		Возврат РезультатЗапроса.Выгрузить();	
	
	КонецЕсли;
	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.НомерПомещения;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции // ПолучитьНомерПомещения()


