&НаСервере
Функция ПолучитьПредставление(СтруктураПараметров) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерТипа = Справочники.ТипыРасчетныхЗначений;
	
	Если СтруктураПараметров.ТипРасчетногоЗначения = МенеджерТипа.НомерПомещения Тогда
		Возврат ПолучитьНомерПомещения(СтруктураПараметров.Помещение);	
	ИначеЕсли СтруктураПараметров.ТипРасчетногоЗначения = МенеджерТипа.ДатаСогласованияЧертежей Тогда
		Возврат ПолучитьДатыСогласованияЧертежей(СтруктураПараметров.Комплект);	
	
	
		
	
	КонецЕсли;
	
	
КонецФункции // ПолучитьПредставление(СтруктураПараметров)


&НаСервере
Функция ПолучиьтьСтруктуруПараметровДляТипаРасчетногоЗначения(ТипРасчетногоЗначения, ЕдинственноеЗначение = Истина) Экспорт

	МенеджерТипа = Справочники.ТипыРасчетныхЗначений;
	
	СтруктураПараметров = Новый Структура("ТипРасчетногоЗначения", ТипРасчетногоЗначения);
	
	Если ТипРасчетногоЗначения = МенеджерТипа.НомерПомещения Тогда
		СтруктураПараметров.Вставить("Помещение", ?(ЕдинственноеЗначение, Справочники.Помещения.ПустаяСсылка(), Новый Массив));		
	ИначеЕсли ТипРасчетногоЗначения = МенеджерТипа.ДатаСогласованияЧертежей Тогда
		СтруктураПараметров.Вставить("Комплект", ?(ЕдинственноеЗначение, Неопределено, Новый Массив));		
	//ИначеЕсли ТипРасчетногоЗначения = МенеджерТипа.ДатаСогласованияЧертежей Тогда
	//	СтруктураПараметров.Вставить("Комплект", ?(ЕдинственноеЗначение, Неопределено, Новый Массив));		
	
	
		
	
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции // ПолучиьтьСтруктуруПараметровДляТипаРасчетногоЗначения() 

Функция ПолучитьДатыСогласованияЧертежей(Комплект)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешниеСогласованияСрезПоследних.Комплект КАК Комплект,
		|	ВнешниеСогласованияСрезПоследних.ВСоставеКомпозиции КАК ВСоставеКомпозиции,
		|	ВнешниеСогласованияСрезПоследних.ДатаОтказа КАК ДатаОтказа,
		|	ВнешниеСогласованияСрезПоследних.ДатаОтправки КАК ДатаОтправки,
		|	ВнешниеСогласованияСрезПоследних.ДатаСогласования КАК ДатаСогласования
		|ИЗ
		|	РегистрСведений.ВнешниеСогласования.СрезПоследних(, Комплект В (&Комплект)) КАК ВнешниеСогласованияСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если ТипЗнч(Комплект) = Тип("Массив") Тогда
	
		Возврат РезультатЗапроса.Выгрузить()	
	
	КонецЕсли;
	
	ПустаяДата = Дата(1, 1, 1);
	
	СтруктураВозврата = Новый Структура("ВСоставеКомпозиции, ДатаОтказа, ДатаОтправки, ДатаСогласования", Ложь, ПустаяДата, ПустаяДата, ПустаяДата);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьНомерПомещения()

Функция ПолучитьНомерПомещения(Помещение)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Помещения.Ссылка КАК Помещение,
		|	Помещения.НомерПомещения КАК НомерПомещения
		|ИЗ
		|	Справочник.Помещения КАК Помещения
		|ГДЕ
		|	Помещения.Ссылка В(&Помещение)";
	
	Запрос.УстановитьПараметр("Помещение", Помещение);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если ТипЗнч(Помещение) = Тип("Массив") Тогда
	
		Возврат РезультатЗапроса.Выгрузить()	
	
	КонецЕсли;
	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.НомерПомещения;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции // ПолучитьНомерПомещения()


