Функция ПолучитьНастройкиТЗКанбан(Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 
	
	стПараметры = ПолучитьСтруктуруТЗКанбан();
	
	мПараметры = Новый Массив;
	Для каждого х Из стПараметры Цикл
		мПараметры.Добавить(х.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.Пользователь = &Пользователь
		|	И НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", мПараметры);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стПараметры[Выборка.ИмяНастройки] = Выборка.Значение;
	КонецЦикла;

	Возврат стПараметры;

КонецФункции // ПолучитьНастройкиТЗКанбан()

Функция ПолучитьСтруктуруТЗКанбан() Экспорт

	стПараметры = Новый Структура();
	
	стПараметры.Вставить("ШиринаКолонкиТЗКанбан", 	240);
	стПараметры.Вставить("РазмерШрифтаТЗКанбан", 	16);
	стПараметры.Вставить("СортировкаТЗКанбан", 		0);
	
	Возврат стПараметры;

КонецФункции // ПолучитьСтруктуруТЗКанбан()

Процедура ЗаписатьНастройкиКанбанТЗ(стПараметры, Пользователь = Неопределено) Экспорт

	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 

	мПараметры = Новый Массив;
	Для каждого х Из стПараметры Цикл
		
		МенеджерЗаписи = РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.ИмяНастройки 	= х.Ключ;
		МенеджерЗаписи.НомерНастройки 	= 0;
		МенеджерЗаписи.Пользователь 	= Пользователь;
		МенеджерЗаписи.Значение			= х.Значение;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	

КонецПроцедуры

