
&НаСервере
Функция ПолучитьПомещенияИзделияЗаказчика(ИзделиеЗаказчика, МассивПомещений = Неопределено) Экспорт
	МассивПомещений = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка КАК ИзделиеЗаказчика,
		|	ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент.Помещения КАК Помещения
		|ИЗ
		|	Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|ГДЕ
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка В(&Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент.Помещения,
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент.Помещения.Наименование";
	
	Запрос.УстановитьПараметр("Ссылка", ИзделиеЗаказчика);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если ТипЗнч(ИзделиеЗаказчика) = Тип("Массив") Тогда
		тзВозврата = Новый ТаблицаЗначений;
		тзВозврата.Колонки.Добавить("ИзделиеЗаказчика", Новый ОписаниеТипов("СправочникСсылка.ИзделияЗаказчика"));
		тзВозврата.Колонки.Добавить("Помещения", Новый ОписаниеТипов("Строка"));
		

		тзВыгрузка =  РезультатЗапроса.Выгрузить();
		
		мИзделияЗаказчика = Новый Массив;
		Для каждого х Из тзВыгрузка Цикл
			Если мИзделияЗаказчика.Найти(х.ИзделиеЗаказчика) = Неопределено Тогда
				
				мИзделияЗаказчика.Добавить(х.ИзделиеЗаказчика);	
				
			КонецЕсли;	
		КонецЦикла; 
		
		стОтбор = Новый Структура("ИзделиеЗаказчика", ); 
		
		Для каждого ИзделиеЗаказчика Из мИзделияЗаказчика Цикл
			стОтбор.ИзделиеЗаказчика = ИзделиеЗаказчика;
			НайденыеСтроки = тзВыгрузка.НайтиСтроки(стОтбор);
			стрПомещение = "";
			
			Для каждого х Из НайденыеСтроки Цикл
				стрПомещение = омРаботаССтроками.ДобавитьРазделительНеПустойСтроке(стрПомещение) + х.Помещения;
			КонецЦикла;
			
		    НС = тзВозврата.Добавить();
			НС.ИзделиеЗаказчика = ИзделиеЗаказчика;
			НС.Помещения 		= стрПомещение;
		КонецЦикла;
				
		Возврат тзВозврата;
		
		//Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(тзВозврата);	
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	стрВозврата = "";
	
	Пока Выборка.Следующий() Цикл
		стрВозврата = омРаботаССтроками.ДобавитьРазделительНеПустойСтроке(стрВозврата) + Выборка.Помещения;
		ДобавитьПомещениеВМассив(МассивПомещений,Выборка.Помещения);
	КонецЦикла;
	

	Возврат стрВозврата;

КонецФункции // ПолучитьПомещенияИзделияЗаказчика() 

&НаСервере
Процедура ДобавитьПомещениеВМассив(МассивПомещений, Помещение)

	Если МассивПомещений.Найти(Помещение) = Неопределено Тогда
	
		МассивПомещений.Добавить(Помещение);	
	
	КонецЕсли;	
	
КонецПроцедуры // ДобавитьПомещениеВМассив()


Функция ПолучитьПодчиненыеКомплектыИзделийЗаказчика(МассивКомплектов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка КАК ИзделиеЗаказчика,
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК Комплект
		|ИЗ
		|	Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|		ПО ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент = ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент
		|ГДЕ
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка В(&Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка,
		|	ИзделияКомплектИзделияЭлемент.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МассивКомплектов);
	
	ТаблицаВозврата = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка КАК ИзделиеЗаказчика,
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК Комплект
		|ИЗ
		|	Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|		ПО ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент = ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент
		|ГДЕ
		|	ИзделияКомплектИзделияЭлемент.Ссылка В(&Комплект)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка,
		|	ИзделияКомплектИзделияЭлемент.Ссылка";
	
	Запрос.УстановитьПараметр("Комплект", ТаблицаВозврата.ВыгрузитьКолонку("Комплект"));
	
	СтруктураОтбор = Новый Структура("ИзделиеЗаказчика, Комплект", );
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ЗаполнитьЗначенияСвойств(СтруктураОтбор, Выборка);
		
		НайденыеСтроки = ТаблицаВозврата.НайтиСтроки(СтруктураОтбор);
		
		Если НайденыеСтроки.Количество() = 0 Тогда
		
			ЗаполнитьЗначенияСвойств(ТаблицаВозврата.Добавить(), Выборка);
		
		КонецЕсли;
	
	КонецЦикла; 
	
	Возврат ТаблицаВозврата;
	
КонецФункции // ПолучитьПодчиненыеКомплектыИзделийЗаказчика()
