Функция СформироватьЗаголовокСсылкиОткрытияОтчета(ВедущийКонструктор, Проект) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК Задача
		|ИЗ
		|	Документ.Рекламации КАК Рекламации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Задачи_РКД КАК Задачи_РКД
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|			ПО Задачи_РКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|		ПО (Задачи_РКД.Основание = Рекламации.Ссылка)
		|ГДЕ
		|	НЕ Рекламации.ПометкаУдаления
		|	И НЕ Рекламации.РКДВыполнено
		|	И ВЫБОР
		|			КОГДА &ВедущийКонструктор = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Рекламации.ВедущийКонструктор = &ВедущийКонструктор
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Рекламации.Проект = &Проект
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ВедущийКонструктор", ВедущийКонструктор);
	Запрос.УстановитьПараметр("Проект", 			Проект);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	КоличествоРекламаций 	= Выборка.Количество();
	НеОбработанно			= 0;
	
	Пока Выборка.Следующий() Цикл
	
		Если Выборка.Задача = null Тогда
		
			НеОбработанно = НеОбработанно + 1;	
		
		КонецЕсли;	
	
	КонецЦикла;
	
	Возврат Новый Структура("Текст, КоличествоРекламаций, НеОбработанно", 
							СтрШаблон("Всего рекламаций %1. Из них не обработанно %2", КоличествоРекламаций, НеОбработанно),
							КоличествоРекламаций, НеОбработанно);

КонецФункции // СформироватьЗаголовокСсылкиОткрытияОтчета()
