Функция ПолучитьРазрешенноеИмяРеквизитаПоСтроке(ВходящаяСтрока) Экспорт
    
    // Определяем разрешённые символы
    БуквыСтрочные                = "абвгдеёжзийклмнопрстуфхцчшщъыьэюяabcdefghijklmnopqrstuvwxyz";
    БуквыЗаглавные                = ВРег(БуквыСтрочные);
    Цифры                        = "0123456789";
    РазрешенныеСимволы            = " _"; // Пробел будет позже заменён на "_"
    СтрокаРазрешенныхСимволов    = БуквыСтрочные + БуквыЗаглавные + Цифры + РазрешенныеСимволы;
    
    // Находим запрещённые символы в строке
    ЗапрещенныеСимволы = Новый Массив;
    Для НомерСимвола = 1 По СтрДлина(ВходящаяСтрока) Цикл
        ПроверяемыйСимвол = Сред(ВходящаяСтрока, НомерСимвола, 1);
        Если СтрНайти(СтрокаРазрешенныхСимволов, ПроверяемыйСимвол) = 0 Тогда
            ЗапрещенныеСимволы.Добавить(ПроверяемыйСимвол);
        КонецЕсли;
    КонецЦикла;    
    СтрокаЗапрещенныхСимволов = СтрСоединить(ЗапрещенныеСимволы);
    
    // Если строка начинается с цифры, то в начале добавим разрешённый символ
	//ПервыйСимвол = Сред(ВходящаяСтрока, 1, 1);
	//Если СтрНайти(Цифры, ПервыйСимвол) = 0 Тогда
	//    ДобавляемыйПервыйСимвол = "";
	//Иначе
	//    ДобавляемыйПервыйСимвол = "_";
	//КонецЕсли;
	//
    // Формируем строку без запрещённых символов и заменяем пробелы
    НормализованнаяСтрока = СтрСоединить(СтрРазделить(ВходящаяСтрока, СтрокаЗапрещенныхСимволов));
	//НормализованнаяСтрока = СтрЗаменить(НормализованнаяСтрока, " ", "_");
	//НормализованнаяСтрока = ДобавляемыйПервыйСимвол + НормализованнаяСтрока;
    
    Возврат СокрЛП(НормализованнаяСтрока);
    
КонецФункции