Функция ПолучитьКоличествоРазрешенныхЗадачПКДВРаботе() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК КоличествоЗадачПКДВРаботе
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = ""КоличествоЗадачПКДВРаботе""
		|	И НастройкиПроекта.НомерНастройки = 0
		|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КоличествоЗадачПКДВРаботе;
	КонецЦикла;
	
	Возврат 2;
	
КонецФункции // ПолучитьКоличествоЗадачПКДВРаботе()   

Функция ТипыЗадачКонструктора(ФиксированныйМассив = Истина) Экспорт
	
	КоличествоЭлементов = 1;
	
	Если ФиксированныйМассив Тогда
		ТипыЗадачКонструктора = Новый Массив(КоличествоЭлементов);
	Иначе
	    ТипыЗадачКонструктора = Новый Массив;
		
		Для х = 1 По КоличествоЭлементов Цикл
			ТипыЗадачКонструктора.Добавить(Неопределено);
		КонецЦикла;
	
	КонецЕсли;
	
	ТипыЗадачКонструктора[0] = Перечисления.ТипыЗадачКонструирования.Конструктор;
	//ТипыЗадачКонструктора[0] = Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором;
	//ТипыЗадачКонструктора[1] = Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором;
	//ТипыЗадачКонструктора[2] = Перечисления.ТипыЗадачКонструирования.Разработка;
	//ТипыЗадачКонструктора[3] = Перечисления.ТипыЗадачКонструирования.Конструктор;

	Возврат ТипыЗадачКонструктора;

КонецФункции // ТипыЗадачКонструктора()

Функция СтадииКонструктора(ФиксированныйМассив = Истина, ИспользоватьПаузу = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплектаРеквизитыСтадии.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|ГДЕ
		|	СтадииКомплектаРеквизитыСтадии.ТипЗадачи В(&ТипЗадачи)";
	
	Если НЕ ИспользоватьПаузу Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И НЕ СтадииКомплектаРеквизитыСтадии.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПриостановкаКонструктором))";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипЗадачи", ТипыЗадачКонструктора());
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции // ТипыЗадачьКонструктора()

Функция ПолучитьСтадииКомплектов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплектаРеквизитыСтадии.Статус КАК Статус,
		|	СтадииКомплектаРеквизитыСтадии.ТипЗадачи КАК ТипЗадачи,
		|	СтадииКомплектаРеквизитыСтадии.Состояние КАК Состояние,
		|	СтадииКомплектаРеквизитыСтадии.Ссылка КАК Стадия
		|ИЗ
		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|ГДЕ
		|	НЕ СтадииКомплектаРеквизитыСтадии.Ссылка.ПометкаУдаления";
	
	Возврат Запрос.Выполнить().Выгрузить();
	

КонецФункции // ПолучитьСтадииКомплектов()

Функция ПолучитьКоличествоРазрешенныхЗадачНаПаузе() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК КоличествоРазрешенныхЗадачНаПаузе
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = ""КоличествоЗадачНаПаузе""
		|	И НастройкиПроекта.НомерНастройки = 0
		|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КоличествоРазрешенныхЗадачНаПаузе;
	КонецЦикла;
	
	Возврат 2;
	
КонецФункции // ПолучитьКоличествоЗадачПКДВРаботе()

Функция ПолучитьКоличествоЗадачСозданиеЗамеров() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК КоличествоЗадачСозданиеЗамеров
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = ""КоличествоЗадачСозданиеЗамеров""
		|	И НастройкиПроекта.НомерНастройки = 0
		|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КоличествоЗадачСозданиеЗамеров;
	КонецЦикла;
	
	Возврат 2;
	
КонецФункции // ПолучитьКоличествоЗадачСозданиеЗамеров()   

Функция ТипыЗадачКонструктораВедущий() Экспорт

	ТипыЗадачКонструктора = Новый Массив(1);
	ТипыЗадачКонструктора[0] = Перечисления.ТипыЗадачКонструирования.ВедущийКонструктор;
	
	Возврат ТипыЗадачКонструктора;

КонецФункции // ДобавитьТипыЗадачВедущий()

