Функция ПолучитьКоличествоРазрешенныхЗадачПКДВРаботе() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК КоличествоЗадачПКДВРаботе
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = ""КоличествоЗадачПКДВРаботе""
		|	И НастройкиПроекта.НомерНастройки = 0
		|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КоличествоЗадачПКДВРаботе;
	КонецЦикла;
	
	Возврат 2;
	
КонецФункции // ПолучитьКоличествоЗадачПКДВРаботе()   

Функция ТипыЗадачКонструктора(ФиксированныйМассив = Истина) Экспорт
	
	КоличествоЭлементов = 1;
	
	Если ФиксированныйМассив Тогда
		ТипыЗадачКонструктора = Новый Массив(КоличествоЭлементов);
	Иначе
	    ТипыЗадачКонструктора = Новый Массив;
		
		Для х = 1 По КоличествоЭлементов Цикл
			ТипыЗадачКонструктора.Добавить(Неопределено);
		КонецЦикла;
	
	КонецЕсли;
	
	ТипыЗадачКонструктора[0] = Перечисления.ТипыЗадачКонструирования.Конструктор;

	Возврат ТипыЗадачКонструктора;

КонецФункции // ТипыЗадачКонструктора()

Функция СтадииКонструктора(ИспользоватьПаузу = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплектаРеквизитыСтадии.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|ГДЕ
		|	СтадииКомплектаРеквизитыСтадии.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.Конструктор)";
	
	Если НЕ ИспользоватьПаузу Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И НЕ СтадииКомплектаРеквизитыСтадии.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПриостановкаКонструктором))";
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции // ТипыЗадачьКонструктора()

Функция ПолучитьСтадииКомплектов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплектаРеквизитыСтадии.Статус КАК Статус,
		|	СтадииКомплектаРеквизитыСтадии.ТипЗадачи КАК ТипЗадачи,
		|	СтадииКомплектаРеквизитыСтадии.Состояние КАК Состояние,
		|	СтадииКомплектаРеквизитыСтадии.Ссылка КАК Стадия,
		|	СтадииКомплектаРеквизитыСтадии.Ссылка.Наименование КАК Наименование
		|ИЗ
		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|ГДЕ
		|	НЕ СтадииКомплектаРеквизитыСтадии.Ссылка.ПометкаУдаления";
	
	Возврат Запрос.Выполнить().Выгрузить();
	

КонецФункции // ПолучитьСтадииКомплектов()

Функция ПолучитьКоличествоРазрешенныхЗадачНаПаузе() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК КоличествоРазрешенныхЗадачНаПаузе
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = ""КоличествоЗадачНаПаузе""
		|	И НастройкиПроекта.НомерНастройки = 0
		|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КоличествоРазрешенныхЗадачНаПаузе;
	КонецЦикла;
	
	Возврат 2;
	
КонецФункции // ПолучитьКоличествоЗадачПКДВРаботе()

Функция ПолучитьКоличествоЗадачСозданиеЗамеров() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК КоличествоЗадачСозданиеЗамеров
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = ""КоличествоЗадачСозданиеЗамеров""
		|	И НастройкиПроекта.НомерНастройки = 0
		|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КоличествоЗадачСозданиеЗамеров;
	КонецЦикла;
	
	Возврат 2;
	
КонецФункции // ПолучитьКоличествоЗадачСозданиеЗамеров()   

Функция ТипыЗадачКонструктораВедущий() Экспорт

	ТипыЗадачКонструктора = Новый Массив(1);
	ТипыЗадачКонструктора[0] = Перечисления.ТипыЗадачКонструирования.ВедущийКонструктор;
	
	Возврат ТипыЗадачКонструктора;

КонецФункции // ДобавитьТипыЗадачВедущий()

Функция ПолучитьСписокСокращений() Экспорт

	мСписокИмен = Новый Массив;
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	ОбъектОтчета.ДобавитьСписокИменНаименованияКомплекта(мСписокИмен);
	
	СтруктураСокращений = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&мСписокИмен)
		|	И НастройкиПроекта.НомерНастройки = 0
		|	И НЕ НастройкиПроекта.Значение = """"
		|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("мСписокИмен", мСписокИмен);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураСокращений.Вставить(Выборка.ИмяНастройки, Выборка.Значение); 
	КонецЦикла;
	
	Возврат СтруктураСокращений;
	
КонецФункции // ПолучитьСписокСокращений()

Функция ПолучитьУровниНаименованияСтадии(СтадияКомплекта) Экспорт
	
	ДанныеУровней = Новый Структура("_1, _2, _3, _4", Истина, Истина, Истина, Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплекта.ВыводитьПервыйУровеньВНаименовании КАК _1,
		|	СтадииКомплекта.ВыводитьВторойУровеньВНаименовании КАК _2,
		|	СтадииКомплекта.ВыводитьТретийУровеньВНаименовании КАК _3,
		|	СтадииКомплекта.ВыводитьЧетвертыйУровеньВНаименовании КАК _4
		|ИЗ
		|	Справочник.СтадииКомплекта КАК СтадииКомплекта
		|ГДЕ
		|	СтадииКомплекта.Ссылка = &СтадияКомплекта
		|	И (СтадииКомплекта.ВыводитьПервыйУровеньВНаименовании
		|			ИЛИ СтадииКомплекта.ВыводитьВторойУровеньВНаименовании
		|			ИЛИ СтадииКомплекта.ВыводитьТретийУровеньВНаименовании
		|			ИЛИ СтадииКомплекта.ВыводитьЧетвертыйУровеньВНаименовании)";
	
	Запрос.УстановитьПараметр("СтадияКомплекта", СтадияКомплекта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеУровней, Выборка);
	КонецЦикла;
	
	Возврат ДанныеУровней;
	
КонецФункции // ПолучитьУровниНаименованияСтадии()
