Функция ПолучитьКоличествоЗадачПКДВРаботе() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК КоличествоЗадачПКДВРаботе
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = ""КоличествоЗадачПКДВРаботе""
		|	И НастройкиПроекта.НомерНастройки = 0
		|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КоличествоЗадачПКДВРаботе;
	КонецЦикла;
	
	Возврат 2;
	
КонецФункции // ПолучитьКоличествоЗадачПКДВРаботе()

Функция ТипыЗадачКонструктора() Экспорт

	ТипыЗадачКонструктора = Новый Массив(3);
	ТипыЗадачКонструктора[0] = Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором;
	ТипыЗадачКонструктора[1] = Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором;
	ТипыЗадачКонструктора[2] = Перечисления.ТипыЗадачКонструирования.Разработка;
	
	Возврат ТипыЗадачКонструктора;

КонецФункции // ТипыЗадачьКонструктора()

Функция ПолучитьСтадииКомплектов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплектаРеквизитыСтадии.Статус КАК Статус,
		|	СтадииКомплектаРеквизитыСтадии.ТипЗадачи КАК ТипЗадачи,
		|	СтадииКомплектаРеквизитыСтадии.Состояние КАК Состояние,
		|	СтадииКомплектаРеквизитыСтадии.Ссылка КАК Стадия
		|ИЗ
		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|ГДЕ
		|	НЕ СтадииКомплектаРеквизитыСтадии.Ссылка.ПометкаУдаления";
	
	Возврат Запрос.Выполнить().Выгрузить();
	

КонецФункции // ПолучитьСтадииКомплектов()

