
&НаСервере
Процедура ПередатьВПодрядНаСервере()
	
	СтруктураПараметров = омПодряд.СтруктураПараметровДляЗаписиЧастичногоПодряда();
	СтруктураПараметров.ИзделиеКомплект = ИзделиеКомплект;
	СтруктураПараметров.ДатаВозврата 	= ДатаВозврата;
	СтруктураПараметров.Комментарий 	= Комментарий;
	СтруктураПараметров.Подрядчик 		= Подрядчик;
	СтруктураПараметров.Завершен 		= Ложь;
	СтруктураПараметров.Проект 			= Проект;
	
	омПодряд.СоздатьЗаписьЧастичногоПодряда(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВПодряд(Команда)
	
	Если ДатаВозврата = Дата(1, 1, 1) Тогда
		
		ПоказатьПредупреждение(, "Не заполнена дата возврата");
		
	Иначе
		
		ПередатьВПодрядНаСервере();
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Параметры.Свойство("ИзделиеКомплект", ИзделиеКомплект); 
	
	Если ЗначениеЗаполнено(ИзделиеКомплект) Тогда
	
		Проект = ИзделиеКомплект.Проект;	
	
	Иначе
	
		Отказ = Истина;	
	
	КонецЕсли;
	
	
КонецПроцедуры


