
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		Элементы.Проект.СписокВыбора.Добавить(Объект.Проект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Комплект) Тогда
		Элементы.Комплект.СписокВыбора.Добавить(Объект.Комплект);
	КонецЕсли;

	ТолькоПросмотр = Объект.РКДВыполнено;
	
	Если ПустаяСтрока(Объект.ПредыдущаяСтатдияПроизводства) Тогда
		Элементы.ПредыдущаяСтадия.Видимость = Ложь;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтадииКомплектаРеквизитыСтадии.Ссылка.ПолноеНаименование КАК ПолноеНаименование
			|ИЗ
			|	РегистрСведений.КанбанКолонки КАК КанбанКолонки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
			|		ПО КанбанКолонки.Статус = СтадииКомплектаРеквизитыСтадии.Статус
			|ГДЕ
			|	КанбанКолонки.УИД = &УИД";
		
		Запрос.УстановитьПараметр("УИД", Объект.ПредыдущаяСтатдияПроизводства);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ПредыдущаяСтадия = Выборка.ПолноеНаименование;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Элементы.Проект.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Объект.ТипРекламации) Тогда
		
		Для каждого ЗначениеПроекта Из ПолучитьСписокПроектовВПроизводстве(Объект.ТипРекламации) Цикл
			Элементы.Проект.СписокВыбора.Добавить(ЗначениеПроекта.Значение, ЗначениеПроекта.Представление);
		КонецЦикла;
		
		
	Иначе
		
		//	
		//	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		//		Элементы.Проект.СписокВыбора.Добавить(Объект.Проект);
		//	КонецЕсли;
		//	
		//	СтандартнаяОбработка = Ложь;
		//	
		//	Сообщение = Новый СообщениеПользователю;
		//	Сообщение.Текст = "Не заполнен тип рекламации";
		//	Сообщение.Поле = "Объект.ТипРекламации";
		//	Сообщение.Сообщить();
		//	
		
		Для каждого ЗначениеПроекта Из ПолучитьСписокПроектовВПроизводстве(ПредопределенноеЗначение("Перечисление.ТипыРекламации.ИзОжиданияГЧ")) Цикл
			Элементы.Проект.СписокВыбора.Добавить(ЗначениеПроекта.Значение, ЗначениеПроекта.Представление);
		КонецЦикла;
		
		Для каждого ЗначениеПроекта Из ПолучитьСписокПроектовВПроизводстве(ПредопределенноеЗначение("Перечисление.ТипыРекламации.ИзПроизводства")) Цикл
			Если Элементы.Проект.СписокВыбора.НайтиПоЗначению(ЗначениеПроекта.Значение) = Неопределено Тогда
				Элементы.Проект.СписокВыбора.Добавить(ЗначениеПроекта.Значение, ЗначениеПроекта.Представление);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли; 
	
    Элементы.Проект.СписокВыбора.СортироватьПоПредставлению();
	
	Если Элементы.Проект.СписокВыбора.НайтиПоЗначению(Объект.Проект) = Неопределено Тогда
		Объект.Проект = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПроектовВПроизводстве(ТипРекламации)
	
	СписокВозврата = Новый СписокЗначений;
	Запрос = Новый Запрос;
	
	Если ТипРекламации = Перечисления.ТипыРекламации.ИзПроизводства Тогда
		
		Запрос.Текст = 
		
			"ВЫБРАТЬ
				|	ВЫРАЗИТЬ(КанбанКарточки.Ресурс КАК Справочник.ИзделияКомплект) КАК Комплект
				|ПОМЕСТИТЬ втКомплекты
				|ИЗ
				|	РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
				|		ПО КанбанПереходКарточкиСрезПоследних.УИДКарточка = КанбанКарточки.УИД
				|ГДЕ
				|	КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка В(&УИДКудаКолонка)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	втКомплекты.Комплект.Проект КАК Проект,
				|	втКомплекты.Комплект.Проект.Наименование КАК ПроектНаименование,
				|	втКомплекты.Комплект.Проект.Префикс КАК ПроектПрефикс,
				|	втКомплекты.Комплект.Проект.Номер КАК ПроектНомер
				|ИЗ
				|	втКомплекты КАК втКомплекты
				|
				|УПОРЯДОЧИТЬ ПО
				|	ПроектНомер";
				
		Запрос.УстановитьПараметр("УИДКудаКолонка", омКанбанПроизводство.ПолучитьУИДКолонокПороизводства());
		
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СписокВозврата.Добавить(Выборка.Проект, Формат(Выборка.ПроектНомер, "ЧГ=0") + "-" + Выборка.ПроектНаименование + " (" + Выборка.ПроектПрефикс + ")");
		КонецЦикла;
		
	Иначе 	
		
		Для каждого х Из  Обработки.ОжиданиеГЧ.ЗадачиВОжиданииГЧ() Цикл
			
			Если СписокВозврата.НайтиПоЗначению(х.Проект) = Неопределено Тогда
				СписокВозврата.Добавить(х.Проект, Формат(х.ПроектНомер, "ЧГ=0") + "-" + х.ПроектНаименование + " (" + х.ПроектПрефикс + ")");
			КонецЕсли;
		КонецЦикла;
		
		СписокВозврата.СортироватьПоПредставлению();
		
	КонецЕсли;
	
	Возврат СписокВозврата;
	
КонецФункции // ПолучитьСписокПроектовВПроизводстве()

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	Объект.Комплект = ПредопределенноеЗначение("Справочник.ИзделияКомплект.ПустаяСсылка");
	Элементы.ПоказыватьЗавершенноеПроизводство.Доступность = ЗначениеЗаполнено(Объект.Проект);
	ПоказыватьЗавершенноеПроизводство = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КомплектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Элементы.Комплект.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Объект.ТипРекламации) Тогда
		
		Для каждого ЗначениеКомплекта Из ПолучитьСписокКомплектовВПроизводстве(Объект.Проект, Объект.ТипРекламации, ПоказыватьЗавершенноеПроизводство) Цикл
			Элементы.Комплект.СписокВыбора.Добавить(ЗначениеКомплекта.Значение, ЗначениеКомплекта.Представление);
		КонецЦикла;
		
		Если Элементы.Комплект.СписокВыбора.НайтиПоЗначению(Объект.Комплект) = Неопределено Тогда
			Объект.Комплект = ПредопределенноеЗначение("Справочник.ИзделияКомплект.ПустаяСсылка");	
		КонецЕсли;
		
	Иначе
		
		Для каждого ЗначениеКомплекта Из ПолучитьСписокКомплектовВПроизводстве(Объект.Проект, ПредопределенноеЗначение("Перечисление.ТипыРекламации.ИзОжиданияГЧ"), ПоказыватьЗавершенноеПроизводство) Цикл
			Элементы.Проект.СписокВыбора.Добавить(ЗначениеКомплекта.Значение, ЗначениеКомплекта.Представление);
		КонецЦикла;
		
		Для каждого ЗначениеКомплекта Из ПолучитьСписокКомплектовВПроизводстве(Объект.Проект, ПредопределенноеЗначение("Перечисление.ТипыРекламации.ИзПроизводства"), ПоказыватьЗавершенноеПроизводство) Цикл
			Если Элементы.Комплект.СписокВыбора.НайтиПоЗначению(ЗначениеКомплекта.Значение) = Неопределено Тогда
				Элементы.Комплект.СписокВыбора.Добавить(ЗначениеКомплекта.Значение, ЗначениеКомплекта.Представление);
			КонецЕсли;
		КонецЦикла;
		
		//Если ЗначениеЗаполнено(Объект.Комплект) Тогда
		//	Элементы.Комплект.СписокВыбора.Добавить(Объект.Комплект);
		//КонецЕсли;
		//
		//СтандартнаяОбработка = Ложь;
		//
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = "Не заполнен тип рекламации";
		//Сообщение.Поле = "Объект.ТипРекламации";
		//Сообщение.Сообщить();
		//
	КонецЕсли;
	
	Элементы.Комплект.СписокВыбора.СортироватьПоПредставлению();
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокКомплектовВПроизводстве(Проект, ТипРекламации, ДобавитьСлужебныеКолонки = Ложь)
	
	Возврат Документы.Рекламации.ПолучитьСписокКомплектовВПроизводстве(Проект, ТипРекламации, ДобавитьСлужебныеКолонки);
	
КонецФункции // ПолучитьСписокПроектовВПроизводстве()    

&НаКлиенте
Процедура КомплектПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Комплект) Тогда
		
		ЗаполнитьДанныеНаОснованииКомплекта();	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура  ЗаполнитьДанныеНаОснованииКомплекта()

	Документы.Рекламации.ЗаполнитьДанныеНаОснованииКомплекта(Объект, Элементы, ПоказыватьЗавершенноеПроизводство);	

КонецПроцедуры //  ЗаполнитьДанныеНаОснованииКомплекта(Объект)


Функция ПолучитьПроект(Комплект)

	Возврат Комплект.Проект;	

КонецФункции // ПлдучтьПроект(Комплект)

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УИДДоскиПроизводство = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
	
	ДанныеКарточки = омКанбанДоскиНаСервере.ПолучитьКарточкиКанбанаСКолонкамиИТегами(УИДДоскиПроизводство, ТекущийОбъект.Комплект);
	
	Если ДанныеКарточки.Количество() = 0 Тогда
		УИДКудаКолонка 	= "";
		УИДКарточка 	= "";
	Иначе
		УИДКудаКолонка 	= ДанныеКарточки[0].УИДКудаКолонка;
		УИДКарточка		= ДанныеКарточки[0].УИДКарточка;	
	КонецЕсли;
	
	Если Не ПустаяСтрока(УИДКарточка) Тогда
		
		УИДКолонкиПриостановки = омКанбанДоскиНаСервереПовтор.ПолучитьУИДКолонки(УИДДоскиПроизводство, "_Приостановка_Производства");
		
		Если УИДКолонкиПриостановки = УИДКудаКолонка Тогда
			
			Если (НЕ ТекущийОбъект.ОстановитьПроизводство ИЛИ ТекущийОбъект.РКДВыполнено) И НЕ ПустаяСтрока(ТекущийОбъект.ПредыдущаяСтатдияПроизводства) Тогда
				
				ТекущийОбъект.ПредыдущаяСтатдияПроизводства	= "";	
				
			КонецЕсли; 
			
		Иначе
			
			Если ТекущийОбъект.ОстановитьПроизводство И НЕ ТекущийОбъект.РКДВыполнено Тогда
				
				ТекущийОбъект.ПредыдущаяСтатдияПроизводства	= УИДКудаКолонка;	
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипРекламацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПоляДляОчистки 		= "";
	НаименованиеПоле 	= "очищено поле";
	
	Если ЗначениеЗаполнено(Объект.Комплект) Тогда
		ПоляДляОчистки = "комплект";	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		
		Если ПустаяСтрока(ПоляДляОчистки) Тогда
			ПоляДляОчистки = "проект";	
		Иначе
			ПоляДляОчистки 		= "проект и " + ПоляДляОчистки;
			НаименованиеПоле 	= "очищены поля"
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Комплект) Тогда
		
		СтандартнаяОбработка = Ложь;
		ТестВопроса = СтрШаблон("При смене типа рекламации будет %1 %2. Продолжить?", НаименованиеПоле, ПоляДляОчистки);
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОСменеТипаРекламации", ЭтаФорма);
		ПоказатьВопрос(Оповещение, ТестВопроса, РежимДиалогаВопрос.ДаНет, , , "Очистка поля");	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОСменеТипаРекламации(Результат, ДополнительныеСвойства) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Комплект = ПредопределенноеЗначение("Справочник.ИзделияКомплект.ПустаяСсылка");	
		Объект.Проект 	= ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");	
	КонецЕсли;	
	
КонецПроцедуры // СтандартнаяОбработка()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.Проект) И Элементы.Проект.СписокВыбора.НайтиПоЗначению(Объект.Проект) = Неопределено Тогда
		Элементы.Проект.СписокВыбора.Добавить(Объект.Проект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Комплект) И Элементы.Комплект.СписокВыбора.НайтиПоЗначению(Объект.Комплект) = Неопределено Тогда
		Элементы.Комплект.СписокВыбора.Добавить(Объект.Комплект);
	КонецЕсли;
КонецПроцедуры

