
&НаКлиенте
Процедура Заполнить(Команда)
	Если ЭтаФорма.Дата = Дата(1,1,1) Тогда
		ПоказатьПредупреждение(,"Не заполнена дата.");
	Иначе	
		ЭтаФорма.Закрыть(Новый Структура("Дата,Направление",ЭтаФорма.Дата,ЭтаФорма.Направление));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ПервыйЭтап  	= Параметры.ПервыйЭтап;
	ЭтаФорма.ПоследнийЭтап  = Параметры.ПоследнийЭтап;
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЭтаФорма.Направление = ?(ЭтаФорма.Направление = 0,1,0);
КонецПроцедуры
