&НаКлиенте
Перем Автор;



&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	Объект.Комплекты.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда) 
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		
		мВДокументе = Новый Массив;
		
		Для каждого х Из Объект.Комплекты Цикл
			мВДокументе.Добавить(х.Комплект);	
		КонецЦикла;
		
		
		СтруктураПараметров = Новый Структура("Проект, мВДокументе", Объект.Проект, мВДокументе);
		Оповещение = Новый ОписаниеОповещения("ПослеПолученияСпискаКомплектов", ЭтаФорма);
		ОткрытьФорму("Документ.АктыСогласованияКомплектовЗаказчиком.Форма.ФормаВыборКомплектов", СтруктураПараметров, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
	
		ПоказатьПредупреждение(, "Не заполнен проект");
	
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеПолученияСпискаКомплектов(Значение, ДополнительныеПараметры) Экспорт

	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ТекущийКомплект Из Значение Цикл
	
		НС = Объект.Комплекты.Добавить();
		НС.Комплект = ТЕкущийКомплект;
	
	КонецЦикла;

КонецПроцедуры // ПослеПолученияСпискаКомплектов()

&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура КомплектыПередНачаломИзменения(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
КонецПроцедуры


&НаКлиенте
Процедура КомплектыДатаСогласованияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТД = Элементы.Комплекты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = НЕ ЗначениеЗаполнено(ТД.ДатаОтказа);
	
КонецПроцедуры


&НаКлиенте
Процедура КомплектыОтказНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТД = Элементы.Комплекты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = НЕ ЗначениеЗаполнено(ТД.ДатаСогласования);

КонецПроцедуры


&НаКлиенте
Процедура КомплектыДатаСогласованияПриИзменении(Элемент)
	
	ТД = Элементы.Комплекты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТД.Автор = Автор;	
	
КонецПроцедуры


&НаКлиенте
Процедура КомплектыОтказПриИзменении(Элемент)
	
	ТД = Элементы.Комплекты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТД.Автор = Автор;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Автор = омСотрудники.ПолучитьТекущегоПользователя();
КонецПроцедуры
 
