Процедура СоздатьЭлементыИРеквизитыНаФорме(ТекущаяФорма, ТипНастройки) Экспорт
	
	
	ГруппаНастройки = СоздатьГруппуНастройки(ТекущаяФорма, ТипНастройки);
	
	Если ТипНастройки = "НастройкиКартинки" Тогда
		
		СоздадьКомандуКартинкуИКнопку(ТекущаяФорма, ГруппаНастройки, "Настройка картинки", "ОбщаяКомандаНастройкаКартинки", БиблиотекаКартинок.Настройка);
		
	КонецЕсли;
	
КонецПроцедуры



Процедура СоздадьКомандуКартинкуИКнопку(ТекущаяФорма, ЭлементГруппа, Заголовок, ИмяКоманды, КартинкаНаКнопке = Неопределено)
	
	КомандаНастройка 			= ТекущаяФорма.Команды.Добавить(ИмяКоманды);
	КомандаНастройка.Заголовок 	= Заголовок;
	КомандаНастройка.Действие 	= ИмяКоманды;
	
	КнопкаДобавитьНастройка 			= ТекущаяФорма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ЭлементГруппа);
	КнопкаДобавитьНастройка.Заголовок 	= Заголовок;
	КнопкаДобавитьНастройка.ИмяКоманды 	= ИмяКоманды;
	КнопкаДобавитьНастройка.Отображение	= ОтображениеКнопки.КартинкаИТекст;
	КнопкаДобавитьНастройка.Картинка	= КартинкаНаКнопке;
	
КонецПроцедуры


Функция СоздатьГруппуНастройки(ТекущаяФорма, ТипНастройки)
	
	ИмяГруппыПанели 	= "Группа_настройки_командной_панели_авто";
	
	НайденаГруппаНастройки = Ложь;
	
	Для каждого ТекущийЭлемент Из ТекущаяФорма.КоманднаяПанель.ПодчиненныеЭлементы Цикл
	
		Если ТекущийЭлемент.Имя = ИмяГруппыПанели Тогда
		
			НайденаГруппаНастройки = Истина;
			ГруппаНастройкиПанели  = ТекущийЭлемент;
			Прервать;
		
		КонецЕсли;	
	
	КонецЦикла; 
	
	Если НайденаГруппаНастройки Тогда
		
		НайденаГруппа = Ложь;
		
		Для каждого ТекущийЭлемент Из ГруппаНастройкиПанели.ПодчиненныеЭлементы Цикл
			
			Если ТекущийЭлемент.Имя = ТипНастройки Тогда
				
				НайденаГруппа = Истина;
				ГруппаНастройки = ТекущийЭлемент;
				Прервать;
				
			КонецЕсли;	
			
		КонецЦикла;
		
		Если НЕ НайденаГруппа Тогда
			ГруппаНастройки 		= Группа_настройки(ТекущаяФорма, ГруппаНастройкиПанели, ТипНастройки);
		КонецЕсли;
		
	Иначе
		
		ГруппаНастройкиПанели 	= Группа_настройки_командной_панели(ТекущаяФорма, ИмяГруппыПанели);
		ГруппаНастройки 		= Группа_настройки(ТекущаяФорма, ГруппаНастройкиПанели, ТипНастройки);
		
		
	КонецЕсли; 
	
	Возврат ГруппаНастройки;

КонецФункции

Функция Группа_настройки_командной_панели(ТекущаяФорма, ИмяГруппы)

	Группа_настройки = ТекущаяФорма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ТекущаяФорма.КоманднаяПанель);
	Группа_настройки.Вид							= ВидГруппыФормы.ГруппаКнопок;
	Группа_настройки.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	Группа_настройки.РастягиватьПоГоризонтали 		= Истина;
	
    Возврат Группа_настройки;
	
КонецФункции // Группа_настройки_командной_панели()

Функция Группа_настройки(ТекущаяФорма, ГруппаНастройкиПанели, ТипНастройки)

	Группа_настройки			= ТекущаяФорма.Элементы.Добавить(ТипНастройки, Тип("ГруппаФормы"), ГруппаНастройкиПанели);
	Группа_настройки.Заголовок	= "Настройки";
	Группа_настройки.Вид		= ВидГруппыФормы.Подменю;
	
    Возврат Группа_настройки;
	
КонецФункции // Группа_настройки_командной_панели()

                          
