
&НаКлиенте
Процедура ЗаполнитьЕдиницуПриИзмененииМатериала(ТекущиеДанныеСтрокаТЧ) Экспорт
	Если ТекущиеДанныеСтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанныеСтрокаТЧ.Номенклатура) Тогда
		мЕдиницы = омЕдиницыИзмерения.ЕдиницыИзмеренийНоменклатурыДляВыбора(ТекущиеДанныеСтрокаТЧ.Номенклатура);
		
		Если мЕдиницы.Количество() = 1 Тогда
			ТекущиеДанныеСтрокаТЧ.ЕдиницыИзмерения = мЕдиницы[0];
			ТекущиеДанныеСтрокаТЧ.Коэффициент = 1;
		КонецЕсли;
		
	Иначе
		ТекущиеДанныеСтрокаТЧ.ЕдиницыИзмерения = Неопределено;
		ТекущиеДанныеСтрокаТЧ.Сумма = 0;
		ТекущиеДанныеСтрокаТЧ.Количество = 0;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьЕдиницуПриИзмененииМатериала()


&НаКлиенте
Процедура ЗаполнитьКоэффициентПриИзмененииЕдиницы(ТекущиеДанныеСтрокаТЧ) Экспорт
	Если ТекущиеДанныеСтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанныеСтрокаТЧ, "Цена") Тогда
		ЕстьФинансовыеКолонки = Истина;	
	Иначе
		ЕстьФинансовыеКолонки = Ложь;	
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ТекущиеДанныеСтрокаТЧ.ЕдиницыИзмерения) Тогда
		ТекущиеДанныеСтрокаТЧ.Коэффициент 	= омЕдиницыИзмерения.ПолучитьКоэффициентНаСервере(ТекущиеДанныеСтрокаТЧ.Номенклатура,ТекущиеДанныеСтрокаТЧ.ЕдиницыИзмерения);
		Если ЕстьФинансовыеКолонки Тогда
			ТекущиеДанныеСтрокаТЧ.Сумма 	= ТекущиеДанныеСтрокаТЧ.Цена * ТекущиеДанныеСтрокаТЧ.Количество;
		КонецЕсли;
	Иначе	
		ТекущиеДанныеСтрокаТЧ.Коэффициент 	= 0;
		Если ЕстьФинансовыеКолонки Тогда
			ТекущиеДанныеСтрокаТЧ.Сумма 	= 0;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьКоэффициентПриИзмененииЕдиницы()
