
&НаСервере
Процедура НазначитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(&Дата, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", 		Объект.Дата);
	Запрос.УстановитьПараметр("Комплект", 	Объект.Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.ДанныеКомплекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Комплект.Установить(Объект.Комплект);
	НоваяЗапись = НаборЗаписей.Добавить();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
	КонецЦикла;
	
	НоваяЗапись.Период 		= Объект.Дата;
	НоваяЗапись.Автор 		= Объект.Автор;
	НоваяЗапись.Комплект 	= Объект.Комплект;
	НоваяЗапись.Конструктор = Объект.НовыйКонструктор;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Назначить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.НовыйКонструктор) Тогда
	
		ПоказатьПредупреждение(, "Не заполнен конструктор");
		Возврат;
	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Комплект) Тогда
	
		ПоказатьПредупреждение(, "Не заполнен комплект");
		Возврат;
	
	КонецЕсли;
	
	Записать();
	
	НазначитьНаСервере();
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура КомплектПриИзмененииНаСервере()
	
	ТекущаяСтадия 			= Справочники.СтадииКомплекта.ПустаяСсылка();
	ТекущийКонструктор 		= Справочники.Сотрудники.ПустаяСсылка();
	ТекущиеСостояниеЗадачи 	= Перечисления.СостоянияЗадач.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Объект.Комплект) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
			|	ДанныеКомплектаСрезПоследних.Конструктор КАК ТекущийКонструктор
			|ИЗ
			|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние
			|ИЗ
			|	РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
			|ГДЕ
			|	ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ = &Комплект
			|	И НЕ ТаймингЗадачСрезПоследних.Задача.Выполнена";
		
		Запрос.УстановитьПараметр("Комплект", Объект.Комплект);
		
		Результат = Запрос.ВыполнитьПакет();
		Выборка = Результат[0].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
		КонецЦикла; 
		
		Выборка = Результат[1].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТекущиеСостояниеЗадачи = Выборка.Состояние;
		КонецЦикла; 
		
	КонецЕсли;
	
	Если Не РольДоступна("ПолныеПрава") И НЕ ТекущаяСтадия = Перечисления.СостоянияЗадач.ОжиданиеКонструктором Тогда
	
		Элементы.ФормаНазначить.Доступность = Ложь;
		
	Иначе
		
		Элементы.ФормаНазначить.Доступность = Истина;
	
	КонецЕсли;
	
		
КонецПроцедуры

&НаКлиенте
Процедура КомплектПриИзменении(Элемент)
	КомплектПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	КомплектПриИзмененииНаСервере();
	
КонецПроцедуры

