
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
	Для каждого ТекущийПроект Из омПроекты.ПолучитАктивныеПроекты() Цикл
		Элементы.Проект.СписокВыбора.Добавить(ТекущийПроект.Значение, ТекущийПроект.Представление);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТекущиеКомплекты()

	МассивТекущиеКомплекты = Новый Массив;
	
	Для каждого х Из Объект.Комплекты Цикл
		МассивТекущиеКомплекты.Добавить(х.Комплект);
	КонецЦикла;
	
	Возврат МассивТекущиеКомплекты;

КонецФункции // ПолучитьТекущиеКомплекты()
 

&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
	
		СтруктураПараметры = Новый Структура("МножественныйВыбор, НеПоказывать, Проект", Истина, ПолучитьТекущиеКомплекты(), Объект.Проект);
		ОписаниеПослеВыбораКомплекта = Новый ОписаниеОповещения("ПослеВыбораКомплекта", ЭтаФорма);	
		ОткрытьФорму("Документ.НазначениеВнешнегоПроизводства.Форма.ФормаПодбор", СтруктураПараметры, ЭтаФорма, , , , ОписаниеПослеВыбораКомплекта);
		
	Иначе
	
		ПоказатьПредупреждение(, "Не заполнен проект.");	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКомплекта(Значение, ДополнительныеПараметры) Экспорт

	Если Значение = Неопределено Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если ДополнительныеПараметры = Неопределено Тогда
		
		Для каждого х Из Значение Цикл
			
			НС = Объект.Комплекты.Добавить();
			НС.Комплект = х;
			
		КонецЦикла;
		
	Иначе
	
		Для каждого СтрокаКомплекта Из Объект.Комплекты Цикл
		
			Если СтрокаКомплекта.Комплект = ДополнительныеПараметры Тогда
			
				СтрокаКомплекта.Комплект = Значение[0];
				Прервать;
			
			КонецЕсли; 	
		
		КонецЦикла;	
	
	КонецЕсли;
	

КонецПроцедуры // ПослеВыбораКомплекта()


&НаКлиенте
Процедура ПослеВопросаОчисткиТЧ(Значение, ДополнительныеПараметры) Экспорт

	Если Значение = КодВозвратаДиалога.Да Тогда
	
		Объект.Комплекты.Очистить();
	
	КонецЕсли;	

КонецПроцедуры // ПослеВопросаОчисткиТЧ()


&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если Объект.Комплекты.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		Описание = Новый ОписаниеОповещения("ПослеВопросаОчисткиТЧ", ЭтаФорма);
		ПоказатьВопрос(Описание, "Если изменить проект, то очиститься табличная часть. Продолжить?", РежимДиалогаВопрос.ДаНет, , , "Выбор проекта");
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура КомплектыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметры = Новый Структура("МножественныйВыбор, НеПоказывать, Проект", Ложь, ПолучитьТекущиеКомплекты(), Объект.Проект);
	ОписаниеПослеВыбораКомплекта = Новый ОписаниеОповещения("ПослеВыбораКомплекта", ЭтаФорма, Элементы.Комплекты.ТекущиеДанные.Комплект);	
	ОткрытьФорму("Документ.НазначениеВнешнегоПроизводства.Форма.ФормаПодбор", СтруктураПараметры, ЭтаФорма, , , , ОписаниеПослеВыбораКомплекта);
КонецПроцедуры

