Функция ПолучитьСписокИменРеквизитов(ТолькоНормы = Ложь) Экспорт

	мСписокИмен = Новый Массив;
	
	Если НЕ ТолькоНормы Тогда
		
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаЕдиницы(Перечисления.ТипыНоменклатуры.Листовая));
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаЕдиницы(Перечисления.ТипыНоменклатуры.Штучная));
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаЕдиницы(Перечисления.ТипыНоменклатуры.Поганажная));
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаЕдиницы(Перечисления.ТипыНоменклатуры.Массив));
		
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Листовая));
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Штучная));
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Поганажная));
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Прочее));
		мСписокИмен.Добавить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Массив));
		
		мСписокИмен.Добавить(ПолучитьИмяНастройкиСтараяЦена());
		мСписокИмен.Добавить(ПолучитьИмяНастройкиВыключитьСинхронизациюСБитрикс());
		
		мСписокИмен.Добавить(ПолучитьИмяНастройкиСекретныйКлючAPI());
		мСписокИмен.Добавить(ПолучитьИмяВремяЖизниКлючаAPI());
		мСписокИмен.Добавить(ПолучитьИмяКодПриложенияAPI());
		мСписокИмен.Добавить(ПолучитьИмяКлючПриложенияAPI());
		
		мСписокИмен.Добавить(ПолучитьИмяПутьККорневойПапкеPDM());

		мСписокИмен.Добавить(ПолучитьНазваниеОрганизации());

		мСписокИмен.Добавить(ПолучитьИмяПутьКАдрес_API_Telegramm());
		
		мСписокИмен.Добавить(НаименованиеДоскиДляТЗ());
		мСписокИмен.Добавить(НаименованиеДоскиДляПроизводства());
		мСписокИмен.Добавить(НаименованиеКолонкиДляВозвратаТЗ());
		мСписокИмен.Добавить(НаименованиеКолонкиДляОжиданияТЗ());
		мСписокИмен.Добавить(НаименованиеКолонкиДляСтадияСогласование());
		мСписокИмен.Добавить(НаименованиеКолонкиДляСтадияТЗ());
		мСписокИмен.Добавить(НаименованиеКолонкиДляСтадияПодтвержденияТЗ());
		мСписокИмен.Добавить(НаименованиеКолонкиДляТегаКомментарий());

		мСписокИмен.Добавить(ПолучитьИмяИнтервалОпросаСообщений());    

		омMsSQL.ПолучитСписокРеквизитовДляПодключенияКPDM(мСписокИмен);
		
		ПолучитСписокРеквизитовДляНормВремени(мСписокИмен);
		
		
		Возврат мСписокИмен;                       
	Иначе
		стСписокИмен = Новый Структура();
		стСписокИмен.Вставить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Листовая),Перечисления.ТипыНоменклатуры.Листовая);
		стСписокИмен.Вставить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Поганажная),Перечисления.ТипыНоменклатуры.Поганажная);
		стСписокИмен.Вставить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Штучная),Перечисления.ТипыНоменклатуры.Штучная);
		стСписокИмен.Вставить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Массив),Перечисления.ТипыНоменклатуры.Массив);
		стСписокИмен.Вставить(ПолучитьНаименованиеРеквизитаНормыРасхода(Перечисления.ТипыНоменклатуры.Прочее),Перечисления.ТипыНоменклатуры.Прочее);
		
		Возврат стСписокИмен;
	КонецЕсли;
	
КонецФункции // ПолучитьСписокИменРеквизитов()

Процедура ПолучитСписокРеквизитовДляНормВремени(мСписокИмен) Экспорт

	мСписокИмен.Добавить("ПлюсДнейРКД");
	мСписокИмен.Добавить("ПлюсДнейПКД");
	мСписокИмен.Добавить("КоличествоЗадачПКДВРаботе");
	
КонецПроцедуры

Функция ПолучитьНаименованиеРеквизитаЕдиницы(ТипНоменклатурв) Экспорт
	
	Если ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Листовая Тогда
		Возврат "ЕдиницаПлощади"	
	ИначеЕсли ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Поганажная Тогда	
		Возврат "ЕдиницаДлины"	
	ИначеЕсли ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Штучная Тогда	
		Возврат "ЕдиницаШтуки"	
	ИначеЕсли ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Массив Тогда	
		Возврат "ЕдиницаМассива"	
	КонецЕсли;	
	
	Возврат "";
КонецФункции // ПолучитьНаименованиеРеквизитаНормыРасхода()

Функция ПолучитьНаименованиеРеквизитаНормыРасхода(ТипНоменклатурв) Экспорт
	
	Если ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Листовая Тогда
		Возврат "НормаРасходаЛистовых"	
	ИначеЕсли ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Поганажная Тогда	
		Возврат "НормаРасходаПоганажных"	
	ИначеЕсли ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Массив Тогда	
		Возврат "НормаРасходаМассива"	
	ИначеЕсли ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Штучная Тогда	
		Возврат "НормаРасходаШтучных"	
	ИначеЕсли ТипНоменклатурв = Перечисления.ТипыНоменклатуры.Прочее Тогда	
		Возврат "НормаРасходаПрочих"	
	КонецЕсли;	
	
КонецФункции // ПолучитьНаименованиеРеквизитаНормыРасхода()

Функция ПолучитьИмяНастройкиСтараяЦена()

	Возврат "ПериодВДняхСтараяЦена";	

КонецФункции // ПолучитьИмяНастройкиСтараяЦена() 

Функция ПолучитьИмяИнтервалОпросаСообщений()

	Возврат "ИнтервалОпросаСообщений";	

КонецФункции // ПолучитьИмяИнтервалОпросаСообщений()

Функция ПолучитьИмяНастройкиВыключитьСинхронизациюСБитрикс() Экспорт

	Возврат "ВыключитьСинхронизациюСБитрикс";	

КонецФункции // ПолучитьИмяНастройкиСтараяЦена()

Функция ПолучитьИмяНастройкиСекретныйКлючAPI() Экспорт

	Возврат "СекретныйКлючAPI";	

КонецФункции // ПолучитьИмяНастройкиСтараяЦена()

Функция ПолучитьИмяНастройкиТокенAPIБитрикс() Экспорт

	Возврат "ТокенAPIБитрикс";	

КонецФункции // ПолучитьИмяНастройкиСтараяЦена()

Функция ПолучитьИмяНастройкиДатаСозданияКлючаAPI() Экспорт

	Возврат "ДатаСозданияКлючаAPI";	

КонецФункции // ПолучитьИмяНастройкиСтараяЦена()

Функция ПолучитьИмяВремяЖизниКлючаAPI() Экспорт

	Возврат "ВремяЖизниКлючаAPI";	

КонецФункции // ПолучитьИмяНастройкиСтараяЦена()

Функция ПолучитьИмяКодПриложенияAPI() Экспорт

	Возврат "КодПриложенияAPI";	

КонецФункции // ПолучитьИмяНастройкиСтараяЦена()

Функция ПолучитьИмяКлючПриложенияAPI() Экспорт

	Возврат "КлючПриложенияAPI";	

КонецФункции // ПолучитьИмяНастройкиСтараяЦена()

Функция ПолучитьИмяПутьККорневойПапкеPDM() Экспорт

	Возврат "КореньПапкиPDM";	

КонецФункции // ПолучитьИмяПутьКПапкеPDM()

Функция ПолучитьИмяПутьКАдрес_API_Telegramm() Экспорт

	Возврат "Адрес_API_Telegramm";	

КонецФункции // ПолучитьИмяПутьКПапкеPDM()

Функция НаименованиеДоскиДляТЗ() Экспорт

	Возврат "ТЗ_Дизайнер";	

КонецФункции // НаименованиеДоскиДляТЗ()

Функция НаименованиеДоскиДляПроизводства() Экспорт

	Возврат "ПроизводствоНаименованиеДоски";	

КонецФункции // НаименованиеДоскиДляТЗ()

Функция НаименованиеКолонкиДляВозвратаТЗ() Экспорт

	Возврат "ТЗ_ДизайнерВозврат";	

КонецФункции // НаименованиеКолонкиДляВозвратаТЗ()

Функция НаименованиеКолонкиДляСтадияСогласование() Экспорт

	Возврат "СтадияСогласование";	

КонецФункции // НаименованиеКолонкиДляСтадияСогласование()

Функция НаименованиеКолонкиДляСтадияПодтвержденияТЗ() Экспорт

	Возврат "СтадияПодтвержденияТЗ";	

КонецФункции // НаименованиеКолонкиДляСтадияПодтвержденияТЗ()

Функция НаименованиеКолонкиДляСтадияТЗ() Экспорт

	Возврат "СтадияТЗ";	

КонецФункции // СтадияТЗ()    

Функция НаименованиеКолонкиДляОжиданияТЗ() Экспорт

	Возврат "ТЗ_ДизайнерОжидание";	

КонецФункции // НаименованиеКолонкиДляОжиданияТЗ()

Функция НаименованиеКолонкиДляТегаКомментарий() Экспорт

	Возврат "ТегКомментарий";	

КонецФункции // НаименованиеКолонкиДляОжиданияТЗ()


Функция ПолучитьНазваниеОрганизации() Экспорт

	Возврат "НазваниеОрганизации";	

КонецФункции // ПолучитьИмяПутьКПапкеPDM()
