
Функция ПолучитьСтруктуруДляИзмененияИсполнителя(Конструктор = Неопределено, КонструкторНеНужен = Истина, ТолькоКонструктор = Ложь) Экспорт

	СтруктуруДляИзменения = Новый Структура();
	
	Если ТолькоКонструктор Тогда
	   	СтруктуруДляИзменения.Вставить("Конструктор", Конструктор);
	Иначе
		
		СтруктуруДляИзменения.Вставить("ВедущийКонструктор");
		СтруктуруДляИзменения.Вставить("Дизайнер");
		СтруктуруДляИзменения.Вставить("Менеджер");
		Если НЕ КонструкторНеНужен Тогда
			СтруктуруДляИзменения.Вставить("Конструктор", Конструктор);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктуруДляИзменения;

КонецФункции // ПолучитьСтруктуруДляИзмененияКонструктора()

Процедура ИзменитьИсполнителяЗадачиОбщей(СтруктуруДляИзменения, ОбъектАдресации) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиОбщие.Ссылка КАК Задача,
		|	ЗадачиОбщие.ДолжностьИсполнителя КАК ДолжностьИсполнителя
		|ИЗ
		|	Задача.ЗадачиОбщие КАК ЗадачиОбщие
		|ГДЕ
		|	ЗадачиОбщие.ОбъектАдресации = &ОбъектАдресации
		|	И НЕ ЗадачиОбщие.ДолжностьИсполнителя = """"";
	
	Запрос.УстановитьПараметр("ОбъектАдресации", ОбъектАдресации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	

	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ДанныеЗадачи.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Задача = Выборка.Задача;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.Задача = Выборка.Задача;
		
		Исполнитель = МенеджерЗаписи.Исполнитель;
		Если Выборка.ДолжностьИсполнителя = "Ведущий конструктор" И СтруктуруДляИзменения.Свойство("ВедущийКонструктор") Тогда
			Исполнитель 	= СтруктуруДляИзменения.ВедущийКонструктор;
		ИначеЕсли Выборка.ДолжностьИсполнителя = "Дизайнер" И СтруктуруДляИзменения.Свойство("Дизайнер") Тогда
			Исполнитель 	= СтруктуруДляИзменения.Дизайнер;
		ИначеЕсли Выборка.ДолжностьИсполнителя = "Менеджер" И СтруктуруДляИзменения.Свойство("Менеджер") Тогда
			Исполнитель 	= СтруктуруДляИзменения.Менеджер;
		ИначеЕсли Выборка.ДолжностьИсполнителя = "Конструктор" И СтруктуруДляИзменения.Свойство("Конструктор") Тогда
			Исполнитель 	= СтруктуруДляИзменения.Конструктор;
		Иначе
		    Продолжить;
		КонецЕсли; 
		
		Если НЕ МенеджерЗаписи.Исполнитель = Исполнитель Тогда
			МенеджерЗаписи.Исполнитель = Исполнитель;
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьТаблицуОбщихЗадач(СтруктураПараметров) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиОбщие.Ссылка КАК Задача,
		|	ЗадачиОбщие.Дата КАК Дата,
		|	ЗадачиОбщие.Наименование КАК Наименование,
		|	ЗадачиОбщие.Направление КАК Направление,
		|	ЗадачиОбщие.Автор КАК Автор,
		|	ЗадачиОбщие.АвторИсполнения КАК АвторИсполнения,
		|	ЗадачиОбщие.ОбъектАдресации КАК ОбъектАдресации,
		|	ЗадачиОбщие.Проект КАК Проект,
		|	ЗадачиОбщие.СвязаннаяЗадача КАК СвязаннаяЗадача,
		|	ЗадачиОбщие.ТипЗадачи КАК ТипЗадачи,
		|	ЗадачиОбщие.Выполнена КАК Выполнена,
		|	ЗадачиОбщие.Сообщение КАК Сообщение,
		|	ДанныеЗадачи.Исполнитель КАК Исполнитель,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗадачиОбщиеПрисоединенныеФайлы.Ссылка) КАК КоличествоФайлов
		|ИЗ
		|	Задача.ЗадачиОбщие КАК ЗадачиОбщие
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗадачиОбщиеПрисоединенныеФайлы КАК ЗадачиОбщиеПрисоединенныеФайлы
		|		ПО ЗадачиОбщиеПрисоединенныеФайлы.ВладелецФайла = ЗадачиОбщие.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеЗадачи КАК ДанныеЗадачи
		|		ПО ДанныеЗадачи.Задача = ЗадачиОбщие.Ссылка";		
	
	ГДЕ_добавлен = Ложь;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Исполнитель) И ЗначениеЗаполнено(СтруктураПараметров.Автор) Тогда
		
		Если СтруктураПараметров.МоиЗадачи И СтруктураПараметров.ДляМеня Тогда
			
			ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
			Запрос.Текст = Запрос.Текст + "(ДанныеЗадачи.Исполнитель = &Исполнитель ИЛИ
			|ЗадачиОбщие.Автор = &Автор)";
			Запрос.УстановитьПараметр("Исполнитель", 	СтруктураПараметров.Исполнитель);
			Запрос.УстановитьПараметр("Автор", 			СтруктураПараметров.Автор);
			
		ИначеЕсли СтруктураПараметров.МоиЗадачи Тогда
			ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
			Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.Автор = &Автор";
			Запрос.УстановитьПараметр("Автор", СтруктураПараметров.Автор);
		ИначеЕсли СтруктураПараметров.ДляМеня Тогда
			ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
			Запрос.Текст = Запрос.Текст + "ДанныеЗадачи.Исполнитель = &Исполнитель";
			Запрос.УстановитьПараметр("Исполнитель", СтруктураПараметров.Исполнитель);
		Иначе
			Возврат Новый ТаблицаЗначений;
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(СтруктураПараметров.Исполнитель) Тогда
			
			ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
			Запрос.Текст = Запрос.Текст + "ДанныеЗадачи.Исполнитель = &Исполнитель";
			Запрос.УстановитьПараметр("Исполнитель", СтруктураПараметров.Исполнитель);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураПараметров.Автор) Тогда
			
			ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
			Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.Автор = &Автор";
			Запрос.УстановитьПараметр("Автор", СтруктураПараметров.Автор);
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(СтруктураПараметров.АвторИсполнения) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.АвторИсполнения = &АвторИсполнения";
		Запрос.УстановитьПараметр("АвторИсполнения", СтруктураПараметров.АвторИсполнения);
	
	КонецЕсли;
	
	Если СтруктураПараметров.НеВыполненые Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "НЕ ЗадачиОбщие.Выполнена";
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ДатаОкончания) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.Дата <= &ДатаОкончания";
		Запрос.УстановитьПараметр("ДатаОкончания", СтруктураПараметров.ДатаОкончания);
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ДатаНачала) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.Дата >= &ДатаНачала";
		Запрос.УстановитьПараметр("ДатаНачала", СтруктураПараметров.ДатаНачала);
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Направление) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.Направление = &Направление";
		Запрос.УстановитьПараметр("Направление", СтруктураПараметров.Направление);
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ТипЗадачи) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.ТипЗадачи = &ТипЗадачи";
		Запрос.УстановитьПараметр("ТипЗадачи", СтруктураПараметров.ТипЗадачи);
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ОбъектАдресации) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.ОбъектАдресации = &ОбъектАдресации";
		Запрос.УстановитьПараметр("ОбъектАдресации", СтруктураПараметров.ОбъектАдресации);
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Проект) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.Проект = &Проект";
		Запрос.УстановитьПараметр("Проект", СтруктураПараметров.Проект);
	
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтруктураПараметров.СообщениеСодержит) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.Сообщение Подобно &СообщениеСодержит";
		Запрос.УстановитьПараметр("СообщениеСодержит", СтруктураПараметров.СообщениеСодержит);
	
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтруктураПараметров.ИсполнениеСодержит) Тогда
	
		ДобавитьГДЕ(Запрос.Текст, ГДЕ_добавлен);
		Запрос.Текст = Запрос.Текст + "ЗадачиОбщие.Исполнение Подобно &ИсполнениеСодержит";
		Запрос.УстановитьПараметр("ИсполнениеСодержит", СтруктураПараметров.ИсполнениеСодержит);
	
	КонецЕсли;
	
	
	Запрос.Текст = Запрос.Текст + "
	|СГРУППИРОВАТЬ ПО
	|	ЗадачиОбщие.Ссылка,
	|	ЗадачиОбщие.Дата,
	|	ЗадачиОбщие.Наименование,
	|	ЗадачиОбщие.Направление,
	|	ЗадачиОбщие.Автор,
	|	ЗадачиОбщие.АвторИсполнения,
	|	ЗадачиОбщие.ОбъектАдресации,
	|	ЗадачиОбщие.Проект,
	|	ЗадачиОбщие.СвязаннаяЗадача,
	|	ЗадачиОбщие.ТипЗадачи,
	|	ЗадачиОбщие.Выполнена,
	|	ЗадачиОбщие.Сообщение,
	|	ДанныеЗадачи.Исполнитель,
	|	ЗадачиОбщие.Исполнение"; 
	
	Если НЕ ПустаяСтрока(СтруктураПараметров.СтрокаСортировки) Тогда
		Запрос.Текст = Запрос.Текст + "	УПОРЯДОЧИТЬ ПО " + СтруктураПараметров.СтрокаСортировки;
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // СформироватьТаблицуОбщихЗадач()

Процедура ДобавитьГДЕ(ЗапросТекст, ГДЕ_добавлен)
	
	Если НЕ ГДЕ_добавлен Тогда
		ГДЕ_добавлен = Истина;
		ЗапросТекст = ЗапросТекст+ "		
		|ГДЕ
		|"
	Иначе
		ЗапросТекст = ЗапросТекст+ "		
		|И ";
	КонецЕсли;
	
КонецПроцедуры


Функция ПолучитьСтруктуруПараметровДляТаблицыОбщихЗадач() Экспорт

	
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("АвторИсполнения", 	Справочники.Пользователи.ПустаяСсылка());
	СтруктураПараметров.Вставить("Автор", 				Справочники.Пользователи.ПустаяСсылка());
	СтруктураПараметров.Вставить("Исполнитель", 		ПараметрыСеанса.ТекущийПользователь);
	СтруктураПараметров.Вставить("ОбъектАдресации", 	);
	СтруктураПараметров.Вставить("Направление", 		Справочники.НаправленияОбщихЗадач.ПустаяСсылка());
	СтруктураПараметров.Вставить("Проект", 				Справочники.Проекты.ПустаяСсылка());
	СтруктураПараметров.Вставить("ТипЗадачи", 			Перечисления.ТипыОбщихЗадач.ПустаяСсылка());
	СтруктураПараметров.Вставить("ДатаОкончания", 		Дата(1, 1, 1));
	СтруктураПараметров.Вставить("ДатаНачала", 			СтруктураПараметров.ДатаОкончания);
	СтруктураПараметров.Вставить("НеВыполненые", 		Истина);
	СтруктураПараметров.Вставить("ДляМеня", 			Ложь);
	СтруктураПараметров.Вставить("МоиЗадачи", 			Истина);
	СтруктураПараметров.Вставить("ИсполнениеСодержит", 	"");
	СтруктураПараметров.Вставить("СообщениеСодержит", 	"");
	СтруктураПараметров.Вставить("СтрокаСортировки", 	"Дата, Наименование");
	
	Возврат СтруктураПараметров;

КонецФункции // ПолучитьСтруктуруПараметровДляТаблицыОбщихЗадач()   

