Функция ПолучитьДнанныеВТаблице(СтруктураФильтров, СортировкаСтрокой) Экспорт

	ТипПользователь = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
	ТипБулево 		= Новый ОписаниеТипов("Булево");
	
	КвалификаторыДаты 	= Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
	ТипПолнаяДата 		= Новый ОписаниеТипов("Дата", , , , , КвалификаторыДаты);
	
	КвалификаторыСтроки = Новый КвалификаторыСтроки(30);
	ТипСтррка30 		= Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Задача", 			Новый ОписаниеТипов("ЗадачаСсылка.ЗадачиОбщие"));
	ТаблицаДанных.Колонки.Добавить("Выполнена", 		ТипБулево);
	ТаблицаДанных.Колонки.Добавить("ОтчетОВыполнении", 	ТипБулево);
	ТаблицаДанных.Колонки.Добавить("Исполнитель", 		ТипПользователь);
	ТаблицаДанных.Колонки.Добавить("Автор", 			ТипПользователь);
	ТаблицаДанных.Колонки.Добавить("Проект", 			Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	ТаблицаДанных.Колонки.Добавить("Сообщение", 		КвалификаторыСтроки);
	ТаблицаДанных.Колонки.Добавить("Исполнение", 		КвалификаторыСтроки);
	ТаблицаДанных.Колонки.Добавить("Направление", 		Новый ОписаниеТипов("СправочникСсылка.НаправлениеОбщихЗадач"));
	ТаблицаДанных.Колонки.Добавить("ТипЗадачи", 		Новый ОписаниеТипов("ПеречислениеСсылка.ТипыОбщихЗадач"));
	ТаблицаДанных.Колонки.Добавить("ОбъектАдресации", 	);
	ТаблицаДанных.Колонки.Добавить("Дата", 				ТипПолнаяДата);
	ТаблицаДанных.Колонки.Добавить("ДатаВыполнения", 	ТипПолнаяДата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиОбщие.Ссылка КАК Ссылка,
		|	ЗадачиОбщие.Дата КАК Дата,
		|	ЗадачиОбщие.Наименование КАК Наименование,
		|	ЗадачиОбщие.Выполнена КАК Выполнена,
		|	ЗадачиОбщие.Автор КАК Автор,
		|	ЗадачиОбщие.ДолжностьИсполнителя КАК ДолжностьИсполнителя,
		|	ЗадачиОбщие.Исполнение КАК Исполнение,
		|	ЗадачиОбщие.Направление КАК Направление,
		|	ЗадачиОбщие.Проект КАК Проект,
		|	ЗадачиОбщие.Сообщение КАК Сообщение,
		|	ЗадачиОбщие.ТипЗадачи КАК ТипЗадачи,
		|	ЗадачиОбщие.ОбъектАдресации КАК ОбъектАдресации,
		|	ЗадачиОбщие.ДатаВыполнения КАК ДатаВыполнения,
		|	ДанныеЗадачи.Исполнитель КАК Исполнитель
		|ИЗ
		|	Задача.ЗадачиОбщие КАК ЗадачиОбщие
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеЗадачи КАК ДанныеЗадачи
		|		ПО (ДанныеЗадачи.Задача = ЗадачиОбщие.Ссылка)
		|ГДЕ
		|	ЗадачиОбщие.ОтчетОВыполнении = &ОтчетОВыполнении
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВыполнения";
	
	//Запрос.УстановитьПараметр("ОтчетОВыполнении", ОтчетОВыполнении);
	
	МассивПодобно = Новый Массив(2);
	МассивПодобно[0] = "Исполнение";
	МассивПодобно[1] = "Сообщение";
	
	МассивЗадачиОбщие 		= Новый Массив(13);
	МассивЗадачиОбщие[0] 	= "Ссылка";
	МассивЗадачиОбщие[1] 	= "ДатаНачало";
	МассивЗадачиОбщие[2] 	= "ДатаОкончания";
	МассивЗадачиОбщие[3] 	= "Наименование";
	МассивЗадачиОбщие[4] 	= "Выполнена";
	МассивЗадачиОбщие[5] 	= "Автор";
	МассивЗадачиОбщие[6] 	= "ДолжностьИсполнителя";
	МассивЗадачиОбщие[7] 	= "Направление";
	МассивЗадачиОбщие[8] 	= "Проект";
	МассивЗадачиОбщие[9] 	= "ТипЗадачи";
	МассивЗадачиОбщие[10] 	= "ОбъектАдресации";
	МассивЗадачиОбщие[11] 	= "ДатаВыполненияНачала";
	МассивЗадачиОбщие[12] 	= "ДатаВыполненияОкончания";

	МассивДанныеЗадачи = Новый Массив(1);
	МассивДанныеЗадачи[0] = "Исполнитель";
	
	СтрокаФильтров = "";
	
	Для каждого ТекущийФильт Из СтруктураФильтров Цикл
		
		
	
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(), Выборка);
	КонецЦикла;
	
	Возврат ТаблицаДанных;

КонецФункции // ПолучитьДнанныеВТаблице()

Функция ПолучитьМассивФильтры() Экспорт
	
	МассивФильтров = Новый Массив(7);
	
	МассивФильтров[0] = "Период";
	МассивФильтров[1] = "Проект";
	МассивФильтров[2] = "Автор";
	МассивФильтров[3] = "Исполнитель";
	МассивФильтров[4] = "Направление";
	МассивФильтров[5] = "Объект адресации";
	МассивФильтров[6] = "Часть сообщения";
	
	Возврат МассивФильтров;

КонецФункции // ПолучитьСтруктуруФильтры()

Функция ПолучитьМассивСортировка() Экспорт

	МассивСортировка = Новый Массив(6);
	
	МассивСортировка[0] = "Дата";
	МассивСортировка[1] = "Проект";
	МассивСортировка[2] = "Автор";
	МассивСортировка[3] = "Исполнитель";
	МассивСортировка[4] = "Направление";
	МассивСортировка[5] = "Объект адресации";
	
	Возврат МассивСортировка;

КонецФункции // ПолучитьМассивСортировка()

Функция ПолучитьСтруктуруДляИзмененияИсполнителя(Конструктор = Неопределено, КонструкторНеНужен = Истина, ТолькоКонструктор = Ложь) Экспорт

	СтруктуруДляИзменения = Новый Структура();
	
	Если ТолькоКонструктор Тогда
	   	СтруктуруДляИзменения.Вставить("Конструктор", Конструктор);
	Иначе
		
		СтруктуруДляИзменения.Вставить("ВедущийКонструктор");
		СтруктуруДляИзменения.Вставить("Дизайнер");
		СтруктуруДляИзменения.Вставить("Менеджер");
		Если НЕ КонструкторНеНужен Тогда
			СтруктуруДляИзменения.Вставить("Конструктор", Конструктор);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктуруДляИзменения;

КонецФункции // ПолучитьСтруктуруДляИзмененияКонструктора()

Процедура ИзменитьИсполнителяЗадачиОбщей(СтруктуруДляИзменения, ОбъектАдресации) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиОбщие.Ссылка КАК Задача,
		|	ЗадачиОбщие.ДолжностьИсполнителя КАК ДолжностьИсполнителя
		|ИЗ
		|	Задача.ЗадачиОбщие КАК ЗадачиОбщие
		|ГДЕ
		|	ЗадачиОбщие.ОбъектАдресации = &ОбъектАдресации
		|	И НЕ ЗадачиОбщие.ДолжностьИсполнителя = """"";
	
	Запрос.УстановитьПараметр("ОбъектАдресации", ОбъектАдресации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	

	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ДанныеЗадачи.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Задача = Выборка.Задача;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.Задача = Выборка.Задача;
		
		Исполнитель = МенеджерЗаписи.Исполнитель;
		Если Выборка.ДолжностьИсполнителя = "Ведущий конструктор" И СтруктуруДляИзменения.Свойство("ВедущийКонструктор") Тогда
			Исполнитель 	= СтруктуруДляИзменения.ВедущийКонструктор;
		ИначеЕсли Выборка.ДолжностьИсполнителя = "Дизайнер" И СтруктуруДляИзменения.Свойство("Дизайнер") Тогда
			Исполнитель 	= СтруктуруДляИзменения.Дизайнер;
		ИначеЕсли Выборка.ДолжностьИсполнителя = "Менеджер" И СтруктуруДляИзменения.Свойство("Менеджер") Тогда
			Исполнитель 	= СтруктуруДляИзменения.Менеджер;
		ИначеЕсли Выборка.ДолжностьИсполнителя = "Конструктор" И СтруктуруДляИзменения.Свойство("Конструктор") Тогда
			Исполнитель 	= СтруктуруДляИзменения.Конструктор;
		Иначе
		    Продолжить;
		КонецЕсли; 
		
		Если НЕ МенеджерЗаписи.Исполнитель = Исполнитель Тогда
			МенеджерЗаписи.Исполнитель = Исполнитель;
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

