
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	МножественныйВыбор 	= Параметры.МножественныйВыбор;
	Проект 				= Параметры.Проект;
	ЗаполнитьСписокВыбора(Параметры.НеПоказывать);
	Элементы.СписокВыбораПометка.Видимость = МножественныйВыбор;

КонецПроцедуры  

Процедура ЗаполнитьСписокВыбора(НеПоказывать)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Ссылка,
		|	ИзделияКомплект.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Проект = &Проект
		|	И НЕ ИзделияКомплект.Ссылка В (&Ссылка)
		|	И НЕ ИзделияКомплект.ЭтоГруппа
		|	И ИзделияКомплект.Родитель.Композиция = ЗНАЧЕНИЕ(Справочник.Композиции.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Композиции.Ссылка,
		|	Композиции.Наименование
		|ИЗ
		|	Справочник.Композиции КАК Композиции
		|ГДЕ
		|	НЕ Композиции.Ссылка В (&Ссылка)
		|	И Композиции.Проект = &Проект
		|	И НЕ Композиции.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Ссылка", НеПоказывать);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	МассивЗначение = Новый Массив(); 
	
	Для каждого х Из СписокВыбора Цикл
	
		Если х.Пометка Тогда
			МассивЗначение.Добавить(х.Значение);
		КонецЕсли;	
	
	КонецЦикла;
	
	Закрыть(МассивЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораПередНачаломИзменения(Элемент, Отказ)
	
	Если МножественныйВыбор Тогда 
		
		Если Элемент.ТекущийЭлемент.Имя = "СписокВыбораЗначение" Тогда
			
			Отказ = Истина;
			ПоказатьЗначение(, Элементы.СписокВыбора.ТекущиеДанные.Значение);
			
		КонецЕсли;
		
	Иначе
		
		Отказ = Истина;
		
		МассивЗначение = Новый Массив(1); 
		МассивЗначение[0] = Элементы.СписокВыбора.ТекущиеДанные.Значение;
		ЭтаФорма.Закрыть(МассивЗначение);	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

