
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ВыборКомпозиции		= Параметры.ВыборКомпозиции;
	МножественныйВыбор 	= Параметры.МножественныйВыбор;
	Проект 				= Параметры.Проект;
	ЗаполнитьСписокВыбора(Параметры.НеПоказывать);
	Элементы.СписокВыбораПометка.Видимость = МножественныйВыбор;

КонецПроцедуры  

Процедура ЗаполнитьСписокВыбора(НеПоказыватьКомпозиции)
	
	Запрос = Новый Запрос;
	
	
	Если ВыборКомпозиции Тогда
		
		РанееВыбранныеКомпозиции 			= ПолучитьРанееВыбранныеКомпозиции(НеПоказыватьКомпозиции);
		КомпозицииСЧастичнымиКомплектами 	= ПолучитьКомпозицииСЧастичнымиКомплектами(РанееВыбранныеКомпозиции, НеПоказыватьКомпозиции);
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Композиции.Ссылка,
			|	Композиции.Наименование
			|ИЗ
			|	Справочник.Композиции КАК Композиции
			|ГДЕ
			|	НЕ Композиции.Ссылка В (&Ссылка)
			|	И Композиции.Проект = &Проект
			|	И НЕ Композиции.ЭтоГруппа
			|
			|УПОРЯДОЧИТЬ ПО
			|	Наименование";
			
	Иначе
	
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИзделияКомплект.Ссылка КАК Ссылка,
			|	ИзделияКомплект.Наименование КАК Наименование
			|ИЗ
			|	Справочник.ИзделияКомплект КАК ИзделияКомплект
			|ГДЕ
			|	ИзделияКомплект.Проект = &Проект
			|	И НЕ ИзделияКомплект.Ссылка В (&Ссылка)
			|	И НЕ ИзделияКомплект.ЭтоГруппа
			|
			|УПОРЯДОЧИТЬ ПО
			|	Наименование";
			
	
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Ссылка", НеПоказыватьКомпозиции);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьРанееВыбранныеКомпозиции(НеПоказыватьКомпозиции)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешнееПроизводствоСрезПоследних.Комплект КАК Комплект
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.ВнешнееПроизводство.СрезПоследних КАК ВнешнееПроизводствоСрезПоследних
		|ГДЕ
		|	НЕ ВнешнееПроизводствоСрезПоследних.Отмена
		|	И ВнешнееПроизводствоСрезПоследних.Комплект ССЫЛКА Справочник.ИзделияКомплект
		|	И ВнешнееПроизводствоСрезПоследних.Комплект.Проект = &Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзделияКомплект.Родитель.Композиция КАК Композиция,
		|	ИзделияКомплект.Ссылка КАК Комплект
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ПО вт.Комплект = ИзделияКомплект.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияКомплект.Родитель.Композиция,
		|	ИзделияКомплект.Ссылка";
	
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Возврат Запрос.Выполнить().Выгрузить(); 
	
КонецФункции // ПорлучитьРанееВыбранныеКомпозиции()


Функция ПолучитьКомпозицииСЧастичнымиКомплектами(РанееВыбранныеКомпозиции, НеПоказыватьКомпозиции)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешнееПроизводствоСрезПоследних.Комплект КАК Комплект
		|ИЗ
		|	РегистрСведений.ВнешнееПроизводство.СрезПоследних КАК ВнешнееПроизводствоСрезПоследних
		|ГДЕ
		|	НЕ ВнешнееПроизводствоСрезПоследних.Отмена
		|	И ВнешнееПроизводствоСрезПоследних.Комплект ССЫЛКА Справочник.Композиции
		|	И ВнешнееПроизводствоСрезПоследних.Комплект.Проект = &Проект";
	
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Комплект"); 
	
КонецФункции // ПорлучитьРанееВыбранныеКомпозиции()


&НаКлиенте
Процедура Выбрать(Команда)
	
	МассивЗначение = Новый Массив(); 
	
	Для каждого х Из СписокВыбора Цикл
	
		Если х.Пометка Тогда
			МассивЗначение.Добавить(х.Значение);
		КонецЕсли;	
	
	КонецЦикла;
	
	Закрыть(МассивЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораПередНачаломИзменения(Элемент, Отказ)
	
	Если МножественныйВыбор Тогда 
		
		Если Элемент.ТекущийЭлемент.Имя = "СписокВыбораЗначение" Тогда
			
			Отказ = Истина;
			ПоказатьЗначение(, Элементы.СписокВыбора.ТекущиеДанные.Значение);
			
		КонецЕсли;
		
	Иначе
		
		Отказ = Истина;
		
		МассивЗначение = Новый Массив(1); 
		МассивЗначение[0] = Элементы.СписокВыбора.ТекущиеДанные.Значение;
		ЭтаФорма.Закрыть(МассивЗначение);	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

