
Функция ПолучитьРодительКомпозиции(Сделка) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Композиции.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Композиции КАК Композиции
		|ГДЕ
		|	Композиции.Проект = &Проект
		|	И Композиции.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
    Возврат Справочники.Композиции.ПустаяСсылка();
	
КонецФункции // ПолучитьРодительКопозиции()

Функция ПолучитьКомплектыКомпозиции(Композиция, СписокЗначенийДляЗаполнения = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК ИзделиеКомплект,
		|	ИзделияКомплект.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Родитель.Композиция = &Композиция
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзделияКомплект.Наименование";
	
	Запрос.УстановитьПараметр("Композиция", Композиция);
	
	Если СписокЗначенийДляЗаполнения = Неопределено Тогда
		
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИзделиеКомплект");
		
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокЗначенийДляЗаполнения.Добавить(Выборка.ИзделиеКомплект, Выборка.Наименование);
	КонецЦикла;
	
КонецФункции // ПолучитьКомплектыКомпозиции()

Функция ПолучитьПомещенияКомпозиции(Композиция, СписокЗначенийДляЗаполнения = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент.Помещения КАК Помещения,
		|	ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент.Помещения.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|		ПО ИзделияКомплект.Ссылка = ИзделияКомплектИзделияЭлемент.Ссылка
		|ГДЕ
		|	ИзделияКомплект.Родитель.Композиция = &Композиция
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент.Помещения,
		|	ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент.Помещения.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент.Помещения.Наименование";
	
	Запрос.УстановитьПараметр("Композиция", Композиция);
	
	Если СписокЗначенийДляЗаполнения = Неопределено Тогда
		
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Помещения");
		
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокЗначенийДляЗаполнения.Добавить(Выборка.Помещения, Выборка.Наименование);
	КонецЦикла;
	
КонецФункции // ПолучитьКомплектыКомпозиции()

Процедура УстановитьКодПДМДляКомпозиции(ПараметрКомпозиция, КодВПДМ) Экспорт

	
	Если ТипЗнч(ПараметрКомпозиция) = Тип("Строка") Тогда
		Композиция = Справочники.Композиции.НайтиПоКоду(ПараметрКомпозиция);
	Иначе
		Композиция = ПараметрКомпозиция;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Композиция) Тогда
	
		МенеджерЗаписей 			= РегистрыСведений.ДатыКомплекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.Комплект 	= Композиция;
		
		МенеджерЗаписей.Прочитать();
		
		Если ЗначениеЗаполнено(МенеджерЗаписей.Комплект) Тогда
			
			Если НЕ МенеджерЗаписей.Код_в_PDM = КодВПДМ Тогда
				
				МенеджерЗаписей.Код_в_PDM = КодВПДМ;
				МенеджерЗаписей.Записать();
				
			КонецЕсли;
			
		Иначе
			
			МенеджерЗаписей.Проект 		= Композиция.Проект;
			МенеджерЗаписей.Комплект 	= Композиция;
			МенеджерЗаписей.Код_в_PDM 	= КодВПДМ;
			
			МенеджерЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // УстановитьКодПДМДляСделки()

Функция ПолучитьДанныеКомпозиции(Композиция, Дата = Неопределено, Параметр = "Конструктор") Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	ДанныеКомплектаСрезПоследних.Автор КАК Автор,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(&Дата, (ВЫРАЗИТЬ(Комплект КАК Справочник.Композиции)) = &Композиция) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Композиция", Композиция);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Параметр) Тогда
			Возврат Выборка[Параметр];	
		КонецЕсли; 
		
		Возврат Новый Структура("Конструктор, Автор, ТекущаяСтадия",
								Выборка.Конструктор,
								Выборка.Автор,
								Выборка.ТекущаяСтадия);
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьКонструктораКомпозиции()
