&НаКлиенте
Процедура ОбщееДействие(ТекущаяФорма, НажатаяКнопка, НомерКартинки, ДополнительныеТипыФайлов = Ложь, МассивИменВременныхФайлов) Экспорт
	
	ИмяСозданогоВременногоФайла = "";
	
	ОбъектТЗ = ТекущаяФорма.Объект.Ссылка;
	
	Если НЕ ЗначениеЗаполнено(ОбъектТЗ) Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	ШифрКоманды = ПолучитьШифрКоманды(НажатаяКнопка.Имя);
	
	Если ШифрКоманды = "ДобавитьКартинку" Тогда
	
		Параметр = Новый Структура("ОбъектТЗ, ДополнительныеТипыФайлов", ОбъектТЗ, ДополнительныеТипыФайлов);
		ОткрытьФорму("РегистрСведений.КартинкиОбъектов.Форма.ФормаДобавитьКартинку", Параметр);	
	
	ИначеЕсли ШифрКоманды = "КартинкуВправо" Тогда
	
		ТекущаяФорма.НомерКартинки = ТекущаяФорма.НомерКартинки + 1;	
	    ИмяСозданогоВременногоФайла = ВывестиКартинку(ОбъектТЗ, ТекущаяФорма.НомерКартинки, ТекущаяФорма, ТекущаяФорма.ВсегоКартинок, Истина);

	ИначеЕсли ШифрКоманды = "КартинкуВлево" Тогда
	
		ТекущаяФорма.НомерКартинки = ТекущаяФорма.НомерКартинки - 1;	
	    ИмяСозданогоВременногоФайла = ВывестиКартинку(ОбъектТЗ, ТекущаяФорма.НомерКартинки, ТекущаяФорма, ТекущаяФорма.ВсегоКартинок, Ложь);

	ИначеЕсли ШифрКоманды = "СохранитьКартинку" Тогда
	
		Параметр = Новый Структура("ОбъектТЗ, НомерКартинки", ОбъектТЗ, ТекущаяФорма.НомерКартинки);
		ОткрытьФорму("РегистрСведений.КартинкиОбъектов.Форма.ФормаСохранитьКартинку", Параметр);	

	ИначеЕсли ШифрКоманды = "УдалитьКартинку" Тогда
	
		Параметр = Новый Структура("ОбъектТЗ, НомерКартинки", ОбъектТЗ, ТекущаяФорма.НомерКартинки);
		ОткрытьФорму("РегистрСведений.КартинкиОбъектов.Форма.ФормаУдалитьКартинку", Параметр);	

	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ИмяСозданогоВременногоФайла) Тогда
		Если МассивИменВременныхФайлов.Найти(ИмяСозданогоВременногоФайла) = Неопределено Тогда
			МассивИменВременныхФайлов.Добавить(ИмяСозданогоВременногоФайла);
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьШифрКоманды(ИмяКнопки) 
	Возврат СтрЗаменить(ИмяКнопки,"Кнопка","");
КонецФункции 

&НаКлиенте
Функция ВывестиКартинку(ОбъектТЗ, НомерКартинки, ТекущаяФорма, ВсегоКартинок, Вправо = Истина) Экспорт
	
	ИмяВременногоФайла = "";
	
	ДанныеОФайле = омКартинкиНаСервере.ПолучитьИнформациюОКартинке(ОбъектТЗ, НомерКартинки, Вправо);
	
	Если ДанныеОФайле = Неопределено Тогда
		Возврат ИмяВременногоФайла;
	КонецЕсли;
	
	
	ТипФайла = омКартинкиНаСервереКлиенте.ПолучитьТипФайлаПоРасширению(ДанныеОФайле.Расширение);
	
	Если ТипФайла = "picture" Тогда
		
		ТекущаяФорма.Элементы.Картинка_авто.Видимость 	= Истина;
		
		ТекущаяФорма.Картинка_авто 						= ДанныеОФайле.Картинка;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяФорма, "Картинка_pdf_авто") Тогда
			ТекущаяФорма.Элементы.Картинка_pdf_авто.Видимость 	= Ложь;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяФорма, "Картинка_ТД_авто") Тогда
			ТекущаяФорма.Элементы.Картинка_ТД_авто.Видимость 	= Ложь;
		КонецЕсли;
		
	ИначеЕсли ТипФайла = "pdf" Тогда
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяФорма, "Картинка_pdf_авто") Тогда
			ТекущаяФорма.Элементы.Картинка_pdf_авто.Видимость 	= Истина;
		Иначе
			Возврат ИмяВременногоФайла;
		КонецЕсли;
		
		ТекущаяФорма.Элементы.Картинка_авто.Видимость 			= Ложь;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяФорма, "Картинка_ТД_авто") Тогда
			ТекущаяФорма.Элементы.Картинка_ТД_авто.Видимость 	= Ложь;
		КонецЕсли;
		
		ИмяВременногоФайла = омPDF_Клиент.ПоказатьФайлПоАдресуХранилища(ДанныеОФайле.Картинка, ТекущаяФорма.Картинка_pdf_авто);	
		
	ИначеЕсли ТипФайла = "xls" Тогда
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяФорма, "Картинка_ТД_авто") Тогда
			ТекущаяФорма.Элементы.Картинка_ТД_авто.Видимость 	= Истина;
		Иначе
			Возврат ИмяВременногоФайла;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяФорма, "Картинка_pdf_авто") Тогда
			ТекущаяФорма.Элементы.Картинка_pdf_авто.Видимость 	= Истина;
		КонецЕсли;

	Иначе	
		Возврат ИмяВременногоФайла;
	КонецЕсли;
	
	ТекущаяФорма.ИмяКартинки_авто 								= ДанныеОФайле.Описание + " (" + (НомерКартинки + 1) + "/" + ВсегоКартинок + ")";
	ТекущаяФорма.Элементы.КартинкуВлево.Доступность 			= НЕ НомерКартинки = 0;	
	ТекущаяФорма.Элементы.КартинкуВправо.Доступность 			= НЕ НомерКартинки = ВсегоКартинок - 1;
	ТекущаяФорма.Элементы.КнопкаСохранитьКартинку.Доступность 	= ВсегоКартинок > 0;
	
	Возврат ИмяВременногоФайла;
	
КонецФункции // ВывестиКартинку()

&НаКлиенте
Асинх Процедура ВыбратьКартинку(ОбъектТЗ, Описание, УникальныйИдентификатор, ДополнительныеТипыФайлов) Экспорт
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите картинку";
	ПараметрыДиалога.Фильтр = омКартинкиНаСервереКлиенте.ПолучитьСтрокуДляВыбораКартинок();
	Если ДополнительныеТипыФайлов Тогда
	
		//ПараметрыДиалога.Фильтр = ПараметрыДиалога.Фильтр  + "|Файлы excel (*.xls, *.xlsx)|*.xls; *.xlsx";
		//ПараметрыДиалога.Фильтр = ПараметрыДиалога.Фильтр  + "|Файлы word (*.doc, *.docx)|*.doc, *.docx";
		ПараметрыДиалога.Фильтр = ПараметрыДиалога.Фильтр  + "|Файлы pdf (*.pdf)|*.pdf";
	
	КонецЕсли;
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога, УникальныйИдентификатор);
	Если ОписаниеФайла <> Неопределено Тогда
		
		Расширение = ОписаниеФайла.СсылкаНаФайл.Расширение;
		
		Если Лев(Расширение, 1) = "." Тогда
			Расширение = Сред(Расширение, 2);	
		КонецЕсли;
		
		АдресКартинки = ОписаниеФайла.Адрес;
		
		ИнформацияОФайле = Новый Структура;
		ИнформацияОФайле.Вставить("Адрес", 		АдресКартинки);
		ИнформацияОФайле.Вставить("Описание",	Описание);
		ИнформацияОФайле.Вставить("ИмяФайла",	ОписаниеФайла.СсылкаНаФайл.Имя);
		ИнформацияОФайле.Вставить("Расширение", Расширение);
		ИнформацияОФайле.Вставить("Размер", 	ОписаниеФайла.СсылкаНаФайл.Размер());
		
		омКартинкиНаСервере.СоздатьПрисоединенныйФайл(ОбъектТЗ, ИнформацияОФайле);
		
		Оповестить("ИзменилииКартинкиОбъектТЗ", Новый Структура("ОбъектТЗ", ОбъектТЗ));
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Функция УдалитьВременныеФайлы(МассивИменВременныхФайлов) Экспорт
	
	Для каждого ПутьВременныйФайл Из МассивИменВременныхФайлов Цикл
		
		Попытка
			
			МойФайл = Новый Файл(ПутьВременныйФайл);
			Если МойФайл.Существует() Тогда
				УдалитьФайлы(ПутьВременныйФайл);
			КонецЕсли;
			
		Исключение
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецФункции // УдалитьВременныеФайлы()

