&НаКлиенте
Процедура ОбщееДействие(ТекущаяФорма, НажатаяКнопка, НомерКартинки, ДополнительныеТипыФайлов = Ложь) Экспорт
	
	ОбъектТЗ = ТекущаяФорма.Объект.Ссылка;
	
	Если НЕ ЗначениеЗаполнено(ОбъектТЗ) Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	ШифрКоманды = ПолучитьШифрКоманды(НажатаяКнопка.Имя);
	
	Если ШифрКоманды = "ДобавитьКартинку" Тогда
	
		Параметр = Новый Структура("ОбъектТЗ, ДополнительныеТипыФайлов", ОбъектТЗ, ДополнительныеТипыФайлов);
		ОткрытьФорму("РегистрСведений.КартинкиОбъектов.Форма.ФормаДобавитьКартинку", Параметр);	
	
	ИначеЕсли ШифрКоманды = "КартинкуВправо" Тогда
	
		ТекущаяФорма.НомерКартинки = ТекущаяФорма.НомерКартинки + 1;	
	    ВывестиКартинку(ОбъектТЗ, ТекущаяФорма.НомерКартинки, ТекущаяФорма, ТекущаяФорма.ВсегоКартинок, Истина);

	ИначеЕсли ШифрКоманды = "КартинкуВлево" Тогда
	
		ТекущаяФорма.НомерКартинки = ТекущаяФорма.НомерКартинки - 1;	
	    ВывестиКартинку(ОбъектТЗ, ТекущаяФорма.НомерКартинки, ТекущаяФорма, ТекущаяФорма.ВсегоКартинок, Ложь);

	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьШифрКоманды(ИмяКнопки) 
	Возврат СтрЗаменить(ИмяКнопки,"Кнопка","");
КонецФункции 

	&НаКлиенте
Процедура ВывестиКартинку(ОбъектТЗ, НомерКартинки, ТекущаяФорма, ВсегоКартинок, Вправо = Истина) Экспорт

	ДанныеОФайле = омКартинкиНаСервере.ПолучитьИнформациюОКартинке(ОбъектТЗ, НомерКартинки, Вправо);
	
	Если ДанныеОФайле = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	ТекущаяФорма.Картинка_авто 		= ДанныеОФайле.Картинка;
	ТекущаяФорма.ИмяКартинки_авто 	= ДанныеОФайле.Описание + " (" + (НомерКартинки + 1) + "/" + ВсегоКартинок + ")";
	
	ТекущаяФорма.Элементы.КартинкуВлево.Доступность 	= НЕ НомерКартинки = 0;	
	ТекущаяФорма.Элементы.КартинкуВправо.Доступность 	= НЕ НомерКартинки = ВсегоКартинок - 1;	
	

КонецПроцедуры // ВывестиКартинку()

&НаКлиенте
Асинх Процедура ВыбратьКартинку(ОбъектТЗ, Описание, УникальныйИдентификатор, ДополнительныеТипыФайлов) Экспорт
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите картинку";
	ПараметрыДиалога.Фильтр = омКартинкиНаСервереКлиенте.ПолучитьСтрокуДляВыбораКартинок();
	Если ДополнительныеТипыФайлов Тогда
	
		ПараметрыДиалога.Фильтр = ПараметрыДиалога.Фильтр  + "|Файлы excel (*.xls, *.xlsx)|*.xls; *.xlsx";
		//ПараметрыДиалога.Фильтр = ПараметрыДиалога.Фильтр  + "|Файлы word (*.doc, *.docx)|*.doc, *.docx";
		ПараметрыДиалога.Фильтр = ПараметрыДиалога.Фильтр  + "|Файлы pdf (*.pdf)|*.pdf";
	
	КонецЕсли;
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога, УникальныйИдентификатор);
	Если ОписаниеФайла <> Неопределено Тогда
		
		АдресКартинки = ОписаниеФайла.Адрес;
		
		ИнформацияОФайле = Новый Структура;
		ИнформацияОФайле.Вставить("Адрес", 		АдресКартинки);
		ИнформацияОФайле.Вставить("Описание",	Описание);
		ИнформацияОФайле.Вставить("ИмяФайла",	ОписаниеФайла.СсылкаНаФайл.Имя);
		ИнформацияОФайле.Вставить("Расширение", ОписаниеФайла.СсылкаНаФайл.Расширение);
		ИнформацияОФайле.Вставить("Размер", 	ОписаниеФайла.СсылкаНаФайл.Размер());
		
		омКартинкиНаСервере.СоздатьПрисоединенныйФайл(ОбъектТЗ, ИнформацияОФайле);
		
		Оповестить("ИзменилииКартинкиОбъектТЗ", Новый Структура("ОбъектТЗ", ОбъектТЗ));
		
	КонецЕсли;
	
КонецПроцедуры 


	