&НаКлиенте
Процедура ОбщееДействие(ТекущаяФорма, НажатаяКнопка, НомерКартинки) Экспорт
	
	ОбъектТЗ = ТекущаяФорма.Объект.Ссылка;
	
	Если НЕ ЗначениеЗаполнено(ОбъектТЗ) Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	ШифрКоманды = ПолучитьШифрКоманды(НажатаяКнопка.Имя);
	
	Если ШифрКоманды = "ДобавитьКартинку" Тогда
	
		Параметр = Новый Структура("ОбъектТЗ", ОбъектТЗ);
		ОткрытьФорму("РегистрСведений.КартинкиОбъектов.Форма.ФормаДобавитьКартинку", Параметр);	
	
	ИначеЕсли ШифрКоманды = "КартинкуВправо" Тогда
	
		ТекущаяФорма.НомерКартинки = ТекущаяФорма.НомерКартинки + 1;	
	    ВывестиКартинку(ОбъектТЗ, ТекущаяФорма.НомерКартинки, ТекущаяФорма, ТекущаяФорма.ВсегоКартинок)
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьШифрКоманды(ИмяКнопки) 
	Возврат СтрЗаменить(ИмяКнопки,"Кнопка","");
КонецФункции 

	&НаКлиенте
Асинх Процедура ВывестиКартинку(ОбъектТЗ, НомерКартинки, ТекущаяФорма, ВсегоКартинок) Экспорт

	ДанныеОФайле = омКартинкиНаСервере.ПолучитьИнформациюОКартинке(ОбъектТЗ, НомерКартинки);
	ТекущаяФорма.Картинка_авто 		= ДанныеОФайле.Картинка;
	ТекущаяФорма.ИмяКартинки_авто 	= ДанныеОФайле.Описание + " (" + (НомерКартинки + 1) + "/" + ВсегоКартинок + ")";
	
	ТекущаяФорма.Элементы.КартинкуВлево.Доступность 	= НЕ НомерКартинки = 0;	
	ТекущаяФорма.Элементы.КартинкуВправо.Доступность 	= НЕ НомерКартинки = ВсегоКартинок - 1;	
	

КонецПроцедуры // ВывестиКартинку()

&НаКлиенте
Асинх Процедура ВыбратьКартинку(Ссылка, Описание, УникальныйИдентификатор) Экспорт
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите картинку";
	ПараметрыДиалога.Фильтр = "Все файлы изображений | *.jpg; *.png; *.bmp";
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога, УникальныйИдентификатор);
	Если ОписаниеФайла <> Неопределено Тогда
		
		АдресКартинки = ОписаниеФайла.Адрес;
		
		ИнформацияОФайле = Новый Структура;
		ИнформацияОФайле.Вставить("Адрес", 		АдресКартинки);
		ИнформацияОФайле.Вставить("Описание",	Описание);
		ИнформацияОФайле.Вставить("ИмяФайла",	ОписаниеФайла.СсылкаНаФайл.Имя);
		ИнформацияОФайле.Вставить("Расширение", ОписаниеФайла.СсылкаНаФайл.Расширение);
		ИнформацияОФайле.Вставить("Размер", 	ОписаниеФайла.СсылкаНаФайл.Размер());
		
		омКартинкиНаСервере.СоздатьПрисоединенныйФайл(Ссылка, ИнформацияОФайле);
		
	КонецЕсли;
	
КонецПроцедуры
	