&НаКлиенте
Процедура ОбщееДействие(ТекущаяФорма, НажатаяКнопка) экспорт
	
	ШифрКоманды = СтрЗаменить(НажатаяКнопка.Имя,"Кнопка", "");
	
	Если ШифрКоманды = "ПоказатьДлительныеДействия" Тогда
		ТекущаяФорма.Элементы.ДлительныеДействия_авто.Видимость = НЕ ТекущаяФорма.Элементы.ДлительныеДействия_авто.Видимость;
		ТекущаяФорма.Элементы.КнопкаПоказатьДлительныеДействия.Заголовок = ?(ТекущаяФорма.Элементы.КнопкаПоказатьДлительныеДействия.Заголовок = "Показать действия",
			"Скрыть действия", "Показать действия");
	КонецЕсли;
	
КонецПроцедуры 


