Функция ДействияНаСервере(Действие, Знач Задача, ТипЗадачи, Исполнитель = Неопределено, Параметр = Неопределено) Экспорт

	МенеджерРегистра = РегистрыСведений.ВнешнееПроизводство;
	
	ОбъектЗадача 		= Задача.ПолучитьОбъект();
	ОбъектЗадача.Дата 	= ТекущаяДата();
	
	Если Действие = "Контроль" Тогда
	
		ОбъектЗадача.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееСогласование;	
	
	ИначеЕсли Действие = "ДоработкаДиз" Тогда
	
		ОбъектЗадача.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееПКД;	
	
	ИначеЕсли Действие = "Согласовано" Тогда
	
		ОбъектЗадача.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееПроизводство;	
	
	КонецЕсли;
	
	ОбъектЗадача.Наименование = ПолучитьЗаголовокЗадачи(Задача.ОбъектТЗ, Задача.ТипЗадачи); 
	
	ОбъектЗадача.Записать();

КонецФункции // ДействияНаСервере()

Функция ПолучитьЗаголовокЗадачи(ОбъектТЗ, ТипЗадачи) Экспорт

	Возврат Строка(ОбъектТЗ) + "." + ПредставлениеТипаЗадачи(ТипЗадачи);

КонецФункции // ПолучитьЗаголовокЗадачи()

Функция ПредставлениеТипаЗадачи(ТипЗадачи)

    Если ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееПКД Тогда
		Возврат "ПКД";
    ИначеЕсли ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееПроизводство Тогда
		Возврат "Производство";
    ИначеЕсли ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееСогласование Тогда
		Возврат "Согласование";
	Иначе
	    Возврат "";
	КонецЕсли;
	

КонецФункции // ПредставлениеТипаЗадачи(ТипЗадачи)
