
Процедура ПриВыполнении(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешнееПроизводствоСрезПоследних.ДатаРеальнойГотовности КАК ДатаРеальнойГотовности,
		|	ВнешнееПроизводствоСрезПоследних.Отмена КАК Отмена,
		|	ВнешнееПроизводствоСрезПоследних.ТипВнешнегоПроизводства КАК ТипВнешнегоПроизводства
		|ИЗ
		|	РегистрСведений.ВнешнееПроизводство.СрезПоследних КАК ВнешнееПроизводствоСрезПоследних
		|ГДЕ
		|	ВнешнееПроизводствоСрезПоследних.Комплект = &Комплект
		|
		|СГРУППИРОВАТЬ ПО
		|	ВнешнееПроизводствоСрезПоследних.Отмена,
		|	ВнешнееПроизводствоСрезПоследних.ТипВнешнегоПроизводства,
		|	ВнешнееПроизводствоСрезПоследних.ДатаРеальнойГотовности";
	
	Запрос.УстановитьПараметр("Комплект", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МенеджерЗаписи = РегистрыСведений.ВнешнееПроизводство.СоздатьМенеджерЗаписи();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
	КонецЦикла;
	
	МенеджерЗаписи.Период								= ТекущаяДата();
	МенеджерЗаписи.ДатаРеальнойГотовности 				= МенеджерЗаписи.Период;
	МенеджерЗаписи.ДоставкаНаСклад						= ДоставкаНаСклад;
	МенеджерЗаписи.ДатаОжидаемогоОкончанияПодрядчиком	= ДатаОжидаемогоОкончанияПодрядчиком;
	МенеджерЗаписи.Подрядчик							= Исполнитель;
	МенеджерЗаписи.Комплект								= ОбъектТЗ;
	МенеджерЗаписи.ДатаОкончанияПКД						= ДатаОкончанияПКД;
	МенеджерЗаписи.РегистраторДвижения					= Ссылка;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешнееПроизводствоСрезПоследних.ТипВнешнегоПроизводства КАК ТипВнешнегоПроизводства
		|ИЗ
		|	РегистрСведений.ВнешнееПроизводство.СрезПоследних(
		|			,
		|			Комплект = &Комплект
		|				И РегистраторДвижения = &Ссылка) КАК ВнешнееПроизводствоСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", 	ОбъектТЗ);
	Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();

	ТипВнешнегоПроизводства = Перечисления.ТипыВнешнегоПроизводства.ПустаяСсылка();
	
	Пока Выборка.Следующий() Цикл
		ТипВнешнегоПроизводства = Выборка.ТипВнешнегоПроизводства;
	КонецЦикла;
	
	ТД = ТекущаяДата();
	
	НаборЗаписей = РегистрыСведений.ВнешнееПроизводство.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РегистраторДвижения.Установить(Ссылка);
	НаборЗаписей.Отбор.Комплект.Установить(ОбъектТЗ);
	НаборЗаписей.Отбор.Период.Установить(ТД);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.Период								= ТД;
	НоваяЗапись.Комплект 							= ОбъектТЗ;
	НоваяЗапись.РегистраторДвижения 				= Ссылка;
	НоваяЗапись.ТипЗадачи 							= ТипЗадачи;
	НоваяЗапись.ДатаОкончанияПКД					= ДатаОкончанияПКД;
	НоваяЗапись.ТипВнешнегоПроизводства				= ТипВнешнегоПроизводства;
	НоваяЗапись.ДатаОжидаемогоОкончанияПодрядчиком	= ДатаОжидаемогоОкончанияПодрядчиком;
	НоваяЗапись.ДоставкаНаСклад 					= ДоставкаНаСклад;
	НоваяЗапись.Подрядчик 							= Исполнитель;
	
	НаборЗаписей.Записать();

КонецПроцедуры

