
#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НастройкаПодключения") Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Портал");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.НастройкаПодключения, "Портал");
	КонецЕсли;

КонецПроцедуры	

&НаСервере
Функция ПолучитьСсылкуНаОбъектНаСервере(ТипСущности1С, Сущность1С, ИдентификаторОбъекта)
	
	Результат 	= Неопределено;
	ТипОбъекта 	= Неопределено;
	
	Если ТипСущности1С = "Справочник" Тогда
		ТипОбъекта = Тип("СправочникСсылка."+Сущность1С);
	ИначеЕсли ТипСущности1С = "Документ" Тогда
		ТипОбъекта = Тип("ДокументСсылка."+Сущность1С);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипОбъекта) Тогда
		Результат = XMLЗначение(ТипОбъекта, ИдентификаторОбъекта);	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.свойство("ИдентификаторОбъекта") Тогда
		СсылкаНаОбъект = ПолучитьСсылкуНаОбъектНаСервере(ТекущиеДанные.ТипСущности1С, ТекущиеДанные.Сущность1С, ТекущиеДанные.ИдентификаторОбъекта);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ПоказатьЗначение(,СсылкаНаОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

