&НаКлиенте
Перем ДанныеОбразца, СтруктрураОбъеденненыхЯчеек;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Образец", Образец);
	
	Если НЕ ЗначениеЗаполнено(Образец) Тогда
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	НачальныеНастройки();
	ДанныеОбразца = ПолучитьДанныеОбразца(Образец);
	ТекстНаименование = ДанныеОбразца.Наименование;
	
	Если ПустаяСтрока(ДанныеОбразца.Обработка) Тогда
	
		Элементы.ГруппаОбработка.ТолькоПросмотр = Истина;
		Элементы.Обработка.Видимость = Ложь;
	
	КонецЕсли;
	
	Если ДанныеОбразца.Материалы.Количество() = 0 Тогда
	
		Элементы.ГруппаМатериалы.ТолькоПросмотр = Истина;
		Элементы.Метериалы.Видимость = Ложь;
	
	КонецЕсли;
	
	ПриИзмененииНастроек();
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьДанныеОбразца(Образец)
	
	ДанныеОбразца = Новый Структура("Материалы, Наименование, Обработка, Код, ШК", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Образец.Наименование КАК Наименование,
		|	Образец.Обработка КАК Обработка,
		|	Образец.Код КАК Код
		|ИЗ
		|	Справочник.Образец КАК Образец
		|ГДЕ
		|	Образец.Ссылка = &Образец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбразецМатериалы.Количество КАК Количество,
		|	ОбразецМатериалы.Примечание КАК Примечание,
		|	ОбразецМатериалы.Номенклатура.Представление КАК Номенклатура,
		|	ОбразецМатериалы.Единица.Представление КАК Единица
		|ИЗ
		|	Справочник.Образец.Материалы КАК ОбразецМатериалы
		|ГДЕ
		|	ОбразецМатериалы.Ссылка = &Образец";
	
	Запрос.УстановитьПараметр("Образец", Образец);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеОбразца, Выборка);
		ДанныеОбразца.ШК = омШрихкодыНаСереверКлиенте.ПолучитьПрефиксШтрихкодаПоТипу(Образец) + Формат(Выборка.Код, "ЧЦ=9; ЧВН=; ЧГ=0");
		
		ДанныеОбразца.Наименование = СтрЗаменить(ДанныеОбразца.Наименование, Символы.ВК, "");
		ДанныеОбразца.Наименование = СтрЗаменить(ДанныеОбразца.Наименование, Символы.ПС, "");
		ДанныеОбразца.Наименование = "Образец № " + Формат(ДанныеОбразца.Код ,"ЧГ=0") + " " + ДанныеОбразца.Наименование;
		
		ДанныеОбразца.Обработка = СтрЗаменить(ДанныеОбразца.Обработка, Символы.ВК, ""); 
		ДанныеОбразца.Обработка = СтрЗаменить(ДанныеОбразца.Обработка, Символы.ПС, "");
		
	КонецЦикла;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДаныеМатериала = Новый Структура("Номенклатура, Единица, Примечание, Количество", );
		ЗаполнитьЗначенияСвойств(СтруктураДаныеМатериала, Выборка);
		ДанныеОбразца.Материалы.Добавить(СтруктураДаныеМатериала);
		
	КонецЦикла;
	
    Возврат ДанныеОбразца;
КонецФункции // ПолучитьДанныеОбразца()

&НаКлиенте
Процедура НачальныеНастройки()

	РазмерШрифтаНаименования 	= ?(РазмерШрифтаНаименования = 0, 	9, РазмерШрифтаНаименования);
	РазмерШрифтаОбработка 		= ?(РазмерШрифтаОбработка = 0, 		8, РазмерШрифтаОбработка);
	РазмерШрифтаМатериалы 		= ?(РазмерШрифтаМатериалы = 0, 		8, РазмерШрифтаМатериалы);

КонецПроцедуры // НачальныеНастройки() 

Функция СформироватьТаблицуНаСервере(ДанныеОбразца)
	
	Пример.Очистить();
 	СтруктрураОбъеденненыхЯчеек = Новый Структура("Наименование, Обработка, Материалы, МаксимальнаяШирина", 2, 2, 2, 5);

	мШиринаКолонок = Новый Массив(2);
	мШиринаКолонок[0] = 1;
	мШиринаКолонок[1] = 20;

	стПараметровОбласти = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров(Истина);
	стПараметровОбласти.НомерСтроки 			= 2;
	стПараметровОбласти.НомерКолонки 			= 2;
	стПараметровОбласти.ДлинаОбласти 			= СтруктрураОбъеденненыхЯчеек.Наименование;
	стПараметровОбласти.ВысотаОбласти 			= 1;
	стПараметровОбласти.РазмерШрифта 			= РазмерШрифтаНаименования; 
	стПараметровОбласти.Полужирный     			= ПолужирныйНаименование; 
	стПараметровОбласти.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	стПараметровОбласти.РазмещениеТекста 		= ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	Если Наименование Тогда
		Пример.Вывести(ПолучитьТаблицуНаименовнаия(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок));
	КонецЕсли;
	
	Если ВыводитьШК Тогда
		Пример.Вывести(ПолучитьШК(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти));
	КонецЕсли;
	
	Если Обработка Тогда
		стПараметровОбласти.РазмерШрифта 		= РазмерШрифтаОбработка; 
		стПараметровОбласти.Полужирный     		= ПолужирныйОбработка; 
		Пример.Вывести(ПолучитьТаблицуОбработка(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок));
	КонецЕсли;
	
	Если Метериалы Тогда
		стПараметровОбласти.РазмерШрифта 		= РазмерШрифтаМатериалы; 
		стПараметровОбласти.Полужирный     		= ПолужирныйМатериалы;
		стПараметровОбласти.РазмещениеТекста	= ТипРазмещенияТекстаТабличногоДокумента.Обрезать;
		Пример.Вывести(ПолучитьТаблицуМатериалы(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок));
	КонецЕсли;
	
Конецфункции

Функция ПолучитьТаблицуМатериалы(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок)

	ТабДок = Новый ТабличныйДокумент;
	Если ДанныеОбразца.Материалы.Количество() = 0 Тогда
	    Возврат ТабДок;
	КонецЕсли;
	
	ЛинияГраницы = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1); 
	стПараметровОбласти.ГраницаСлева			= ЛинияГраницы;
	стПараметровОбласти.ГраницаСправа			= ЛинияГраницы;
	стПараметровОбласти.ГраницаСверху			= ЛинияГраницы;
	стПараметровОбласти.ГраницаСнизу			= ЛинияГраницы;
	стПараметровОбласти.ЦветРамки				= "000000000";
	стПараметровОбласти.ДлинаОбласти 			= 1;		
	
	мШиринаКолонок = Новый Массив(5);
	мШиринаКолонок[0] = 1;
	мШиринаКолонок[1] = 20;
	мШиринаКолонок[2] = 7;
	мШиринаКолонок[3] = 8;
	мШиринаКолонок[4] = 30;

	омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(ТабДок, мШиринаКолонок);
	
	Для х = 0 По ДанныеОбразца.Материалы.Количество() - 1 Цикл
		
		ДанныеСтроки = ДанныеОбразца.Материалы[х];
		
		стПараметровОбласти.НомерКолонки = 2;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Номенклатура;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		стПараметровОбласти.НомерКолонки = 3;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Количество;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		стПараметровОбласти.НомерКолонки = 4;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Единица;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		стПараметровОбласти.НомерКолонки = 5;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Примечание;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		
		стПараметровОбласти.НомерСтроки = стПараметровОбласти.НомерСтроки + 1;
		
	КонецЦикла;
	
	Возврат ТабДок;

КонецФункции // ПолучитьТаблицуНаименовнаия()

Функция ПолучитьТаблицуОбработка(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок)

	ПоискРазмера = Истина;
	РазмерНайден = Ложь;
	ПоследнийРаз = Ложь;
	
	Пока ПоискРазмера Цикл
		
		Если ПоследнийРаз Тогда
			ПоискРазмера = Ложь;
		КонецЕсли;
		
		ТабДок = Новый ТабличныйДокумент;
		омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(ТабДок, мШиринаКолонок);
		Область = омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		ВысотаПустойОбласти = ВысотаОбластиВмм(Область, ТабДок);
		Область.Текст 		= ДанныеОбразца.Обработка;
		
		Если ПоискРазмера Тогда
			
			ВысотаСТекстом = ВысотаОбластиВмм(Область, ТабДок);
			
			Если ВысотаПустойОбласти < ВысотаСТекстом Тогда
				СтруктрураОбъеденненыхЯчеек.Обработка = СтруктрураОбъеденненыхЯчеек.Обработка + 1;
				Если СтруктрураОбъеденненыхЯчеек.Обработка > СтруктрураОбъеденненыхЯчеек.МаксимальнаяШирина Тогда
					Прервать;	
				КонецЕсли;

				Если РазмерНайден Тогда
					ПоследнийРаз = Истина;
				КонецЕсли;
				
			Иначе
				Если СтруктрураОбъеденненыхЯчеек.Обработка = 1 Тогда
					Прервать;	
				КонецЕсли;
				РазмерНайден = Истина;
				СтруктрураОбъеденненыхЯчеек.Обработка = СтруктрураОбъеденненыхЯчеек.Обработка - 1;
			КонецЕсли;
			
			стПараметровОбласти.ДлинаОбласти = СтруктрураОбъеденненыхЯчеек.Обработка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции // ПолучитьТаблицуНаименовнаия()

Функция ПолучитьШК(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти)
	
	КоличествоМиллиметровВПикселе = омТабличныйДокументСерверПовтор.ПолучитьКоличествоМиллиметровВПикселе();
	ТабДок = Новый ТабличныйДокумент;
	
	ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	РисунокШтрихкода = ТабДок.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка); 
	РисунокШтрихкода.ВыводитьНаПечать = Истина;
	РисунокШтрихкода.Высота				= 8 / КоличествоМиллиметровВПикселе;
	РисунокШтрихкода.Ширина				= 20 / КоличествоМиллиметровВПикселе; 
	//ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Ширина =                    Окр(РисунокШтрихкода.Ширина * 5);
	ПараметрыШтрихкода.Высота =                    Окр(РисунокШтрихкода.Высота * 5);
    ПараметрыШтрихкода.Вставить("Штрихкод",                  ДанныеОбразца.ШК);
	ПараметрыШтрихкода.ТипКода =                   4;
	ПараметрыШтрихкода.РазмерШрифта =                   14;
	ПараметрыШтрихкода.СохранятьПропорции =                   Истина;
	//ПараметрыШтрихкода.Вставить("МонохромныйШрифт",          Истина);
	ПараметрыШтрихкода.ОтображатьТекст =          ТекстНаШтрихКоде;
	//ПараметрыШтрихкода.Вставить("РазмерШрифта",              10);
	//ПараметрыШтрихкода.Вставить("Масштабировать",            Ложь);    
    
    РисунокШтрихкода.Картинка = 	ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода).Картинка;
    РисунокШтрихкода.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
	РисунокШтрихкода.ГраницаСверху  = Ложь;
	РисунокШтрихкода.ГраницаСлева  = Ложь;
	РисунокШтрихкода.ГраницаСнизу  = Ложь;
	РисунокШтрихкода.ГраницаСправа  = Ложь;
	
	Возврат ТабДок;

КонецФункции // ПолучитьШК()

Функция ПолучитьТаблицуНаименовнаия(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок)
	
	ПоискРазмера = Истина;
	РазмерНайден = Ложь;
	ПоследнийРаз = Ложь;
	
	Пока ПоискРазмера Цикл
		
		Если ПоследнийРаз Тогда
			ПоискРазмера = Ложь;
		КонецЕсли;
		
		ТабДок = Новый ТабличныйДокумент;
		омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(ТабДок, мШиринаКолонок);
		Область = омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		ВысотаПустойОбласти = ВысотаОбластиВмм(Область, ТабДок);
		Область.Текст 		= ТекстНаименование;
		
		Если НЕ ПоследнийРаз Тогда
			
			ВысотаСТекстом = ВысотаОбластиВмм(Область, ТабДок);
			
			Если ВысотаПустойОбласти < ВысотаСТекстом Тогда
				СтруктрураОбъеденненыхЯчеек.Наименование = СтруктрураОбъеденненыхЯчеек.Наименование + 1;
				Если СтруктрураОбъеденненыхЯчеек.Наименование > СтруктрураОбъеденненыхЯчеек.МаксимальнаяШирина Тогда
					Прервать;	
				КонецЕсли;
				Если РазмерНайден Тогда
					ПоследнийРаз = Истина;
				КонецЕсли;
			Иначе
				Если СтруктрураОбъеденненыхЯчеек.Наименование = 1 Тогда
					Прервать;	
				КонецЕсли;
				РазмерНайден = Истина;
				СтруктрураОбъеденненыхЯчеек.Наименование = СтруктрураОбъеденненыхЯчеек.Наименование - 1;
			КонецЕсли;
			
			стПараметровОбласти.ДлинаОбласти = СтруктрураОбъеденненыхЯчеек.Наименование;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДок;

КонецФункции // ПолучитьТаблицуНаименовнаия()

Функция ВысотаОбластиВмм(пОбласть, пТабДок)
    
    Надпись = пТабДок.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);    
    Надпись.Расположить(пОбласть);    
    Высота = Надпись.Высота;    
    пТабДок.Рисунки.Удалить(Надпись);
    
    Возврат(Высота);
    
КонецФункции

&НаКлиенте
Процедура ПриИзмененииНастроек()
	
	СформироватьТаблицуНаСервере(ДанныеОбразца);

КонецПроцедуры // ПриИзмененииНастроек()


&НаКлиенте
Процедура РазмерШрифтаНаименованияПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ТекстНаименованиеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ТекстНаШтрихКодеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШрифтаОбработкаПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура МетериалыПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШрифтаМатериалыПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПолужирныйНаименованиеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПолужирныйОбработкаПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПолужирныйМатериалыПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьШКПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры



&НаКлиенте
Процедура Печать(Команда)
	
	ИдентификаторПечатнойФормы = "ШилдикОбразца";
	НазваниеПечатнойФормы = НСтр("ru = 'Шильдик образца'");
	
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	
	ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент = Пример;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	
	ОбластиОбъектов = Новый СписокЗначений;
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
	
КонецПроцедуры


