Функция КомплектыИзИзделияЗаказчика(ИзделиеЗаказчика) Экспорт
	
	стКомплекты = Новый Структура("мИзделияКомплект"
			, Новый Массив);
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ     
		|	ИзделияКомплектИзделияЗаказчика.Ссылка КАК ИзделияКомплект,
		|	ИзделияКомплектИзделияЗаказчика.Ссылка.Представление КАК Представление
		|ИЗ
		|	Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЭлементИзделияЗаказчика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЗаказчика
		|		ПО ИзделияЭлементИзделияЗаказчика.ИзделиеЭлемент = ИзделияКомплектИзделияЗаказчика.ИзделиеЭлемент
		|ГДЕ
		|	ИзделияЭлементИзделияЗаказчика.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияКомплектИзделияЗаказчика.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзделияКомплектИзделияЗаказчика.Ссылка.Наименование";

	Запрос.УстановитьПараметр("Ссылка", ИзделиеЗаказчика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стКомплекты.мИзделияКомплект.Добавить(Новый Структура("ИзделияКомплект, Представление",Выборка.ИзделияКомплект, Выборка.Представление));
	КонецЦикла;
	
	
	Возврат стКомплекты;
	
КонецФункции // КомплектыИзИзделияЗаказчика()

Функция КомплектыИзИзделияЭлементы(ИзделиеЭлемент) Экспорт
	
	стКомплекты = Новый Структура("мИзделияКомплект", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплектИзделияЗаказчика.Ссылка КАК ИзделияКомплект
		|ИЗ
		|	Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЗаказчика
		|ГДЕ
		|	ИзделияКомплектИзделияЗаказчика.ИзделиеЭлемент = &ИзделиеЭлемент
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияКомплектИзделияЗаказчика.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзделияКомплектИзделияЗаказчика.Ссылка.Наименование";
	
	Запрос.УстановитьПараметр("ИзделиеЭлемент", ИзделиеЭлемент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стКомплекты.мИзделияКомплект.Добавить(Выборка.ИзделияКомплект);
	КонецЦикла;
	
	 Возврат стКомплекты;

КонецФункции // КомплектыИзИзделияЗаказчика()

Функция ДанныеКомплекта(мКомплект, Дата = Неопределено) Экспорт
	
	стВозврата = Новый Структура("Конструктор, ТекущаяСтадия", );
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	ДанныеКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(&Дата, Комплект В (&мКомплект)) КАК ДанныеКомплектаСрезПоследних";
	
	Если Дата = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Дата", "");	
	Иначе
		Запрос.УстановитьПараметр("Дата", Дата);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("мКомплект", мКомплект);
	
	 Результат =  Запрос.Выполнить();
	
	Если ТипЗнч(мКомплект) = Тип("Массив") Тогда
	
		Возврат Результат.Выгрузить();	
	
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата, Выборка); 
	КонецЦикла;
	
	Возврат стВозврата;
	

КонецФункции // ДанныеКомплекта()

Процедура УстановитьКодPDMКомплекта(КодЭлемента, КодPDM) Экспорт

	

КонецПроцедуры

