
Функция ЗаполнитьКоличествоДнейКомпозиции(мКомпозиции) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Ссылка,
		|	ИзделияКомплект.Родитель.Композиция КАК Композиция,
		|	ИзделияКомплект.Проект КАК Проект,
		|	ЕСТЬNULL(ДатыКомплекта.ДнейПКД, 0) КАК ДнейПКД,
		|	ЕСТЬNULL(ДатыКомплекта.НормаВремени_ПКД, 0) КАК НормаВремени_ПКД,
		|	ЕСТЬNULL(ДатыКомплекта.НормаДоработки_ПКД, 0) КАК НормаДоработки_ПКД,
		|	ЕСТЬNULL(ДанныеКомплектаСрезПоследних.Конструктор, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Конструктор,
		|	ЕСТЬNULL(ДатыКомплекта.НачалоПКД, ДАТАВРЕМЯ(1, 1, 1)) КАК НачалоПКД,
		|	ЕСТЬNULL(ДатыКомплекта.ОкончаниеПКД, ДАТАВРЕМЯ(1, 1, 1)) КАК ОкончаниеПКД,
		|	ЕСТЬNULL(ДатыКомплекта.ГантКонструктораНачалоПКД, ДАТАВРЕМЯ(1, 1, 1)) КАК ГантКонструктораНачалоПКД,
		|	ЕСТЬNULL(ДатыКомплекта.ГантКонструктораОкончаниеПКД, ДАТАВРЕМЯ(1, 1, 1)) КАК ГантКонструктораОкончаниеПКД
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ПО ((ВЫРАЗИТЬ(ДатыКомплекта.Комплект КАК Справочник.ИзделияКомплект)) = ИзделияКомплект.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО ((ВЫРАЗИТЬ(ДанныеКомплектаСрезПоследних.Комплект КАК Справочник.ИзделияКомплект)) = ИзделияКомплект.Ссылка)
		|ГДЕ
		|	ИзделияКомплект.Родитель.Композиция В(&Композиция)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДатыКомплекта.ДнейПКД КАК ДнейПКД,
		|	ДатыКомплекта.НачалоПКД КАК НачалоПКД,
		|	ДатыКомплекта.НормаВремени_ПКД КАК НормаВремени_ПКД,
		|	ДатыКомплекта.НормаДоработки_ПКД КАК НормаДоработки_ПКД,
		|	ДатыКомплекта.Комплект КАК Композиция,
		|	ДатыКомплекта.ГантКонструктораНачалоПКД КАК ГантКонструктораНачалоПКД
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ВЫРАЗИТЬ(ДатыКомплекта.Комплект КАК Справочник.Композиции) В (&Композиция)";
	
	Запрос.УстановитьПараметр("Композиция", мКомпозиции);
	
	РезультатЗапроса 			= Запрос.ВыполнитьПакет();
	тзДанные 					= РезультатЗапроса[0].Выгрузить();
	тзТекущиеДанныеКомпозиции 	= РезультатЗапроса[1].Выгрузить();
	

	мКомпозиции = омТЧ_НаКлиентеСервере.КолонкуВМассив(тзДанные, "Композиция"); 
	
	стОтбор = Новый Структура("Композиция", );
	ПустаяДата = Дата(1, 1, 1);
	
	
	Для каждого ТекущаяКомпозиция Из мКомпозиции Цикл
	
		ГантКонструктораНачалоПКД	= ПустаяДата;
		ДнейПКД 					= 0;
		НормаДоработки_ПКД 			= 0;
		НормаВремени_ПКД 			= 0;
		стОтбор.Композиция 			= ТекущаяКомпозиция;
		НачалоПКД 					= ПустаяДата;
		Проект						= Справочники.Проекты.ПустаяСсылка();
		
		Для каждого текДанные Из тзДанные.НайтиСтроки(стОтбор) Цикл
		
			ДнейПКД					= ДнейПКД	+ текДанные.ДнейПКД;				
			ДнейПКД 				= ДнейПКД 					+ текДанные.ДнейПКД;				
			НормаДоработки_ПКД 		= НормаДоработки_ПКД 		+ текДанные.НормаДоработки_ПКД;				
			НормаВремени_ПКД 		= НормаВремени_ПКД 			+ текДанные.НормаВремени_ПКД;
			Проект					= текДанные.Проект;
			
			Если НЕ текДанные.НачалоПКД = ПустаяДата Тогда
			
				Если НачалоПКД = ПустаяДата Тогда
				
					НачалоПКД = текДанные.НачалоПКД;	
				
				ИначеЕсли НачалоПКД > текДанные.НачалоПКД Тогда
				
					НачалоПКД = текДанные.НачалоПКД;	
				
				КонецЕсли;	
			
				Если ГантКонструктораНачалоПКД = ПустаяДата Тогда
				
					ГантКонструктораНачалоПКД = текДанные.ГантКонструктораНачалоПКД;	
				
				ИначеЕсли ГантКонструктораНачалоПКД > текДанные.ГантКонструктораНачалоПКД Тогда
				
					ГантКонструктораНачалоПКД = текДанные.ГантКонструктораНачалоПКД;	
				
				КонецЕсли;	
			
			КонецЕсли;
		
		КонецЦикла;
		
		НайденаяСтрока = тзТекущиеДанныеКомпозиции.Найти(текДанные.Композиция, "Композиция");
		
		ТребуетсяИзменения 		= Истина;
		ТребуетсяИзмененияГант 	= Истина;
		
		Если НЕ НайденаяСтрока = Неопределено Тогда
		
			Если ДнейПКД = НайденаяСтрока.ДнейПКД 
				И НормаДоработки_ПКД = НайденаяСтрока.НормаДоработки_ПКД 
				И НормаВремени_ПКД = НайденаяСтрока.НормаВремени_ПКД 
				И НачалоПКД = НайденаяСтрока.НачалоПКД Тогда
			
				ТребуетсяИзменения = Ложь;
			
			КонецЕсли;	
		
			Если ГантКонструктораНачалоПКД = НайденаяСтрока.ГантКонструктораНачалоПКД
				И ДнейПКД = НайденаяСтрока.ДнейПКД Тогда
			
				ТребуетсяИзмененияГант = Ложь;
			
			КонецЕсли;
			
		КонецЕсли; 
		
		Если ТребуетсяИзменения ИЛИ ТребуетсяИзмененияГант Тогда 
			
			стДанные = Новый Структура("Проект, Комплект, ДнейПКД, НормаДоработки_ПКД, НормаВремени_ПКД, НачалоПКД"
				, Проект, текДанные.Композиция, ДнейПКД, НормаДоработки_ПКД, НормаВремени_ПКД, НачалоПКД);
			
			ЗаписатьВДатыКомплектаБезПерерасчета(стДанные);
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецФункции // ПолучитКоличествоДнейКомпозиции() 

Процедура ЗаписатьВДатыКомплектаБезПерерасчета(стДанные) Экспорт

	ПустаяДата = Дата(1, 1, 1);
	
	НаборЗаписей = РегистрыСведений.ДатыКомплекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Комплект.Установить(стДанные.Комплект);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатыКомплекта.БезГабаритногоЧертежа КАК БезГабаритногоЧертежа,
	|	ДатыКомплекта.БезЗамера КАК БезЗамера,
	|	ДатыКомплекта.ГантКонструктораНачалоПКД КАК ГантКонструктораНачалоПКД,
	|	ДатыКомплекта.ГантКонструктораНачалоРКД КАК ГантКонструктораНачалоРКД,
	|	ДатыКомплекта.ГантКонструктораОкончаниеПКД КАК ГантКонструктораОкончаниеПКД,
	|	ДатыКомплекта.ГантКонструктораОкончаниеРКД КАК ГантКонструктораОкончаниеРКД,
	|	ДатыКомплекта.ДнейПКД КАК ДнейПКД,
	|	ДатыКомплекта.ДнейРКД КАК ДнейРКД,
	|	ДатыКомплекта.ДнейТЗ КАК ДнейТЗ,
	|	ДатыКомплекта.Код_в_PDM КАК Код_в_PDM,
	|	ДатыКомплекта.КрайПКД КАК КрайПКД,
	|	ДатыКомплекта.КрайРКД КАК КрайРКД,
	|	ДатыКомплекта.КрайТЗ КАК КрайТЗ,
	|	ДатыКомплекта.НачалоПКД КАК НачалоПКД,
	|	ДатыКомплекта.НачалоРКД КАК НачалоРКД,
	|	ДатыКомплекта.НачалоТЗ КАК НачалоТЗ,
	|	ДатыКомплекта.НормаВремени_ПКД КАК НормаВремени_ПКД,
	|	ДатыКомплекта.НормаВремени_РКД КАК НормаВремени_РКД,
	|	ДатыКомплекта.НормаВремени_ТЗ КАК НормаВремени_ТЗ,
	|	ДатыКомплекта.НормаДоработки_ПКД КАК НормаДоработки_ПКД,
	|	ДатыКомплекта.НормаДоработки_РКД КАК НормаДоработки_РКД,
	|	ДатыКомплекта.ОкончаниеПКД КАК ОкончаниеПКД,
	|	ДатыКомплекта.ОкончаниеРКД КАК ОкончаниеРКД,
	|	ДатыКомплекта.ОкончаниеТЗ КАК ОкончаниеТЗ,
	|	ДатыКомплекта.СрокМонтажа КАК СрокМонтажа,
	|	ДатыКомплекта.СрокПроектирования КАК СрокПроектирования,
	|	ДатыКомплекта.СрокПроизводства КАК СрокПроизводства,
	|	ДатыКомплекта.Проект КАК Проект
	|ИЗ
	|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
	|ГДЕ
	|	ДатыКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", стДанные.Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	НуженРачетОкончанияПКД = Ложь;
	НуженРачетОкончанияРКД = Ложь;
	НуженРачетОкончанияКонструкторскогоПКД = Ложь;
	НуженРачетОкончанияКонструкторскогоРКД = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если стДанные.Свойство("ДнейПКД") И НЕ стДанные.ДнейПКД = Выборка.ДнейПКД Тогда
			НуженРачетОкончанияПКД 					= Истина;
			НуженРачетОкончанияКонструкторскогоПКД 	= Истина;
		Иначе
			Если стДанные.Свойство("НачалоПКД") И НЕ стДанные.НачалоПКД = Выборка.НачалоПКД Тогда
				НуженРачетОкончанияПКД 					= Истина;
			КонецЕсли;
			Если стДанные.Свойство("ГантКонструктораНачалоПКД") И НЕ стДанные.ГантКонструктораНачалоПКД = Выборка.ГантКонструктораНачалоПКД Тогда
				НуженРачетОкончанияКонструкторскогоПКД	= Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если стДанные.Свойство("ДнейРКД") И НЕ стДанные.ДнейРКД = Выборка.ДнейРКД Тогда
			НуженРачетОкончанияРКД 					= Истина;
			НуженРачетОкончанияКонструкторскогоРКД 	= Истина;
		Иначе
			Если стДанные.Свойство("НачалоРКД") И НЕ стДанные.НачалоРКД = Выборка.НачалоРКД Тогда
				НуженРачетОкончанияРКД 					= Истина;
			КонецЕсли;
			Если стДанные.Свойство("ГантКонструктораНачалоРКД") И НЕ стДанные.ГантКонструктораНачалоРКД = Выборка.ГантКонструктораНачалоРКД Тогда
				НуженРачетОкончанияКонструкторскогоРКД	= Истина;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		
	КонецЦикла;
	
	НоваяЗапись.Проект 				= Выборка.Проект;
	НоваяЗапись.Комплект 			= стДанные.Комплект;
	
	Если стДанные.Свойство("ДнейПКД") Тогда
		НоваяЗапись.ДнейПКД 			= ?(стДанные.ДнейПКД 			= 0, 1, стДанные.ДнейПКД);
	КонецЕсли;
	
	Если стДанные.Свойство("ДнейРКД") Тогда
		НоваяЗапись.ДнейРКД 			= ?(стДанные.ДнейРКД 			= 0, 1, стДанные.ДнейРКД);
	КонецЕсли;
	
	Если стДанные.Свойство("НормаДоработки_ПКД") Тогда
		НоваяЗапись.НормаДоработки_ПКД 	= ?(стДанные.НормаДоработки_ПКД = 0, 1, стДанные.НормаДоработки_ПКД);
	КонецЕсли;
	
	Если стДанные.Свойство("НормаВремени_ПКД") Тогда
		НоваяЗапись.НормаВремени_ПКД 	= ?(стДанные.НормаВремени_ПКД 	= 0, 1, стДанные.НормаВремени_ПКД);
	КонецЕсли;
	
	Если стДанные.Свойство("НачалоПКД") Тогда
		НоваяЗапись.НачалоПКД 			= стДанные.НачалоПКД;
	КонецЕсли;
	
	Если НЕ НоваяЗапись.НачалоПКД = ПустаяДата И НуженРачетОкончанияПКД Тогда
		НоваяЗапись.ОкончаниеПКД = омДаты.ДобавитьДниСУчетомВыходных(НоваяЗапись.НачалоПКД, НоваяЗапись.ДнейПКД);
	КонецЕсли;
	
	Если стДанные.Свойство("НачалоРКД") Тогда
		НоваяЗапись.НачалоРКД 			= стДанные.НачалоРКД;
	КонецЕсли;
	
	Если НЕ НоваяЗапись.НачалоРКД = ПустаяДата И НуженРачетОкончанияРКД Тогда
		НоваяЗапись.ОкончаниеРКД = омДаты.ДобавитьДниСУчетомВыходных(НоваяЗапись.НачалоРКД, НоваяЗапись.ДнейРКД);
	КонецЕсли;
	
	Если стДанные.Свойство("ГантКонструктораНачалоПКД") Тогда
		НоваяЗапись.ГантКонструктораНачалоПКД 	= стДанные.ГантКонструктораНачалоПКД;
	КонецЕсли; 
	
	Если НЕ НоваяЗапись.ГантКонструктораНачалоПКД = ПустаяДата И НуженРачетОкончанияКонструкторскогоПКД Тогда
		НоваяЗапись.ГантКонструктораОкончаниеПКД = омДаты.ДобавитьДниСУчетомВыходных(НоваяЗапись.ГантКонструктораНачалоПКД, НоваяЗапись.ДнейПКД);
	КонецЕсли;
	
	Если стДанные.Свойство("ГантКонструктораНачалоРКД") Тогда
		НоваяЗапись.ГантКонструктораНачалоРКД 	= стДанные.ГантКонструктораНачалоРКД;
	КонецЕсли; 
	
	Если НЕ НоваяЗапись.ГантКонструктораНачалоРКД = ПустаяДата И НуженРачетОкончанияКонструкторскогоРКД Тогда
		НоваяЗапись.ГантКонструктораОкончаниеРКД = омДаты.ДобавитьДниСУчетомВыходных(НоваяЗапись.ГантКонструктораНачалоРКД, НоваяЗапись.ДнейРКД);
	КонецЕсли;
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("УжеРасчитаннаяКомпозиция", стДанные.Комплект);
	
	НаборЗаписей.Записать();
	
	
КонецПроцедуры

