Функция ПолучитьДополнительныеЗадачиПКД(Задача_ПКД, ВозвратМассив = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеЗадачиПКД.НомерЗадачи КАК НомерЗадачи,
		|	ДополнительныеЗадачиПКД.НачалоЗадачи КАК НачалоЗадачи,
		|	ДополнительныеЗадачиПКД.АвторЗадачи КАК АвторЗадачи,
		|	ДополнительныеЗадачиПКД.ФайлВPDM КАК ФайлВPDM,
		|	ДополнительныеЗадачиПКД.ЗавершениеЗадачи КАК ЗавершениеЗадачи,
		|	ДополнительныеЗадачиПКД.АвторЗавершения КАК АвторЗавершения,
		|	ДополнительныеЗадачиПКД.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.ДополнительныеЗадачиПКД КАК ДополнительныеЗадачиПКД
		|ГДЕ
		|	ДополнительныеЗадачиПКД.Задача_ПКД = &Задача_ПКД
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерЗадачи";
	
	Запрос.УстановитьПараметр("Задача_ПКД", Задача_ПКД);
	
	Если ВозвратМассив Тогда
		Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	

КонецФункции // ПолучитьДополнительныеЗадачи()

Процедура СоздатьДополнительнуюЗадачу(Задача_ПКД, ФайлВPDM = "", Комментарий = "") Экспорт

    АвторЗадачи 	= ПараметрыСеанса.ТекущийПользователь;
	НачалоЗадачи 	= ТекущаяДата();
	
    Попытка
		
        НачатьТранзакцию();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДополнительныеЗадачиПКД");
		ЭлементБлокировки.УстановитьЗначение("Задача_ПКД", Задача_ПКД);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСТЬNULL(МАКСИМУМ(ДополнительныеЗадачиПКД.НомерЗадачи), 0) + 1 КАК НомерЗадачи
			|ИЗ
			|	РегистрСведений.ДополнительныеЗадачиПКД КАК ДополнительныеЗадачиПКД
			|ГДЕ
			|	ДополнительныеЗадачиПКД.Задача_ПКД = &Задача_ПКД
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Задачи_ПКД.ОбъектТЗ КАК ОбъектТЗ,
			|	Задачи_ПКД.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование,
			|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор
			|ИЗ
			|	Задача.Задачи_ПКД КАК Задачи_ПКД
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
			|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект";
		
		Запрос.УстановитьПараметр("Задача_ПКД", Задача_ПКД);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		НомерЗадачи = 1;
		
		Пока Выборка.Следующий() Цикл
			НомерЗадачи = Выборка.НомерЗадачи;
		КонецЦикла; 
		
		МенеджерЗаписи = РегистрыСведений.ДополнительныеЗадачиПКД.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.АвторЗадачи 	= АвторЗадачи; 
		МенеджерЗаписи.НачалоЗадачи = НачалоЗадачи;
		
		МенеджерЗаписи.НачалоЗадачи = НачалоЗадачи;
		МенеджерЗаписи.ФайлВPDM 	= ФайлВPDM;
		МенеджерЗаписи.Комментарий 	= Комментарий;
		
		МенеджерЗаписи.Записать();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Возврат;
		
	КонецПопытки;
	
	ЗафиксироватьТранзакцию(); 
	
	
	
	ТекстОповещения = "Создана дополнительная задпча ПКД для 
	
	омЗадачаОбщаяНаСервере.СоздатьЗадачуИнформация("

	
КонецПроцедуры // СоздатьДополнительнуюЗадачу()
