
&НаКлиенте
Процедура ОбщееДействие(ТекущаяФорма, НажатаяКнопка, ИзменятьКомментарий = Ложь) экспорт
	
	ШифрКоманды = ПолучитьШифрКоманды(НажатаяКнопка.Имя);
	
	Если ШифрКоманды = "ДобавитьКомментарий" Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВводаКомментария", омКомментарииНаКлиенте, Новый Структура("ТекущаяФорма, ИзменятьКомментарий", ТекущаяФорма, ИзменятьКомментарий));
		ПоказатьВводСтроки(Оповещение, "", "Ввод комментария", 250, Истина);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВсеКомментарий(ТекущаяФорма, НажатаяКнопка) экспорт
	
	ШифрКоманды = ПолучитьШифрКоманды(НажатаяКнопка.Имя);
	
	Если ШифрКоманды = "ВсеКомментарии" Тогда
		
		Объект = ТекущаяФорма.Объект;

		Если НажатаяКнопка.Заголовок = "Все комментарии" Тогда
		    НажатаяКнопка.Заголовок 							= "Комментарии";
			ТекущаяФорма.Элементы.Комментарий_авто.Заголовок 	= "Все комментарии";
			ВсеКомментарии 										= Истина;
		Иначе
			НажатаяКнопка.Заголовок 							= "Все комментарии";
			ТекущаяФорма.Элементы.Комментарий_авто.Заголовок 	= "Комментарии";
			ВсеКомментарии 										= Ложь;
		КонецЕсли;

		ОбъектВывода = ПолучитьОбъектВывода(Объект, ВсеКомментарии);

		ДополнительныеПараметрыКомментария = Неопределено;
		ТекущаяФорма.Комментарий_авто = омКомментарииНаСервере.Получить_HTML_комментарий(ОбъектВывода, , , ДополнительныеПараметрыКомментария, ВсеКомментарии);
		ТекущаяФорма.Элементы.ГруппаКомментарий.Заголовок = омКомментарийКлиентСервер.ПолучитьЗаголовокСтраницы(ДополнительныеПараметрыКомментария);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаКомментария(Значение, ДополнительныеПараметры)  Экспорт

	Если ЗначениеЗаполнено(Значение) Тогда
		
		
		ТекущаяФорма 	= ДополнительныеПараметры.ТекущаяФорма;
		Объект 			= ТекущаяФорма.Объект;
		
		НС 					= Объект.Комментарии.Вставить(0);
		НС.Автор			= омСотрудники.ПолучитьТекущегоПользователя();
		НС.Дата 			= ТекущаяДата();
		НС.Текст 			= Значение;
		
		Если ДополнительныеПараметры.ИзменятьКомментарий Тогда
			Объект.Комментарий = Значение;
		КонецЕсли;
		
		ВсеКомментарии = ТекущаяФорма.Элементы.Комментарий_авто.Заголовок = "Все комментарии";
		
		ОбъектВывода = ПолучитьОбъектВывода(Объект, ВсеКомментарии);

		ДополнительныеПараметрыКомментария = Неопределено;
		ТекущаяФорма.Комментарий_авто	= омКомментарииНаСервере.Получить_HTML_комментарий(ОбъектВывода, , , ДополнительныеПараметрыКомментария, ВсеКомментарии);
		ТекущаяФорма.Элементы.ГруппаКомментарий.Заголовок = омКомментарийКлиентСервер.ПолучитьЗаголовокСтраницы(ДополнительныеПараметрыКомментария);
		ТекущаяФорма.Модифицированность = Истина;
		
	КонецЕсли;	

КонецПроцедуры // ПослеВводаКомментария()

&НаКлиенте
Функция ПолучитьОбъектВывода(Объект, ВсеКомментарии)

	Если ВсеКомментарии Тогда
		
		ОбъектВывода = Объект.Ссылка;
		
	Иначе
		
		мКомментарии = Новый Массив;
		
		Для каждого х Из Объект.Комментарии Цикл
			
			СтруктураДанные = Новый Структура("Автор, Дата, Текст, ТипКомментария", );
			ЗаполнитьЗначенияСвойств(СтруктураДанные, х);
			мКомментарии.Добавить(СтруктураДанные);
			
		КонецЦикла; 
		
		ОбъектВывода = мКомментарии;
		
	КонецЕсли;
	
	Возврат ОбъектВывода;
	
КонецФункции // ПолучитьОбъектВывода()

&НаКлиенте
Функция ПолучитьШифрКоманды(ИмяКнопки)
	Возврат СтрЗаменить(ИмяКнопки,"Кнопка","");
КонецФункции