
&НаКлиенте
Процедура ОбщееДействие(ТекущаяФорма, НажатаяКнопка) экспорт
	
	ШифрКоманды = ПолучитьШифрКоманды(НажатаяКнопка.Имя);
	
	Если ШифрКоманды = "ДобавитьКомментарий" Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВводаКомментария", омКомментарииНаКлиенте, Новый Структура("ТекущаяФорма", ТекущаяФорма));
		ПоказатьВводСтроки(Оповещение, "", "Ввод комментария", 250, Истина);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВсеКомментарий(ТекущаяФорма, НажатаяКнопка) экспорт
	
	ШифрКоманды = ПолучитьШифрКоманды(НажатаяКнопка.Имя);
	
	Если ШифрКоманды = "ВсеКомментарии" Тогда
		
		Если НажатаяКнопка.Заголовок = "Все комментарии" Тогда
		    НажатаяКнопка.Заголовок = "Комментарии";
			ТекущаяФорма.Элементы.Комментарий_авто.Заголовок = "Все комментарии";
		Иначе
			НажатаяКнопка.Заголовок = "Все комментарии";
			ТекущаяФорма.Элементы.Комментарий_авто.Заголовок = "Комментарии";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаКомментария(Значение, ДополнительныеПараметры)  Экспорт

	Если ЗначениеЗаполнено(Значение) Тогда
		
		
		ТекущаяФорма 	= ДополнительныеПараметры.ТекущаяФорма;
		Объект 			= ТекущаяФорма.Объект;
		
		НС 					= Объект.Комментарии.Вставить(0);
		НС.Автор			= омСотрудники.ПолучитьТекущегоПользователя();
		НС.Дата 			= ТекущаяДата();
		НС.Текст 			= Значение;  
		
		мКомментарии = Новый Массив;
		
		Для каждого х Из Объект.Комментарии Цикл
		
			СтруктураДанные = Новый Структура("Автор, Дата, Текст, ТипКомментария", );
			ЗаполнитьЗначенияСвойств(СтруктураДанные, х);
			мКомментарии.Добавить(СтруктураДанные);
		
		КонецЦикла;
		
		ДополнительныеПараметрыКомментария = Неопределено;
		ТекущаяФорма.Комментарий_авто	= омКомментарииНаСервере.Получить_HTML_комментарий(мКомментарии, , , ДополнительныеПараметрыКомментария);
		ТекущаяФорма.Элементы.ГруппаКомментарий.Заголовок = омКомментарийКлиентСервер.ПолучитьЗаголовокСтраницы(ДополнительныеПараметрыКомментария);
		ТекущаяФорма.Модифицированность = Истина;
		
	КонецЕсли;	

КонецПроцедуры // ПослеВводаКомментария()

&НаКлиенте
Функция ПолучитьШифрКоманды(ИмяКнопки)
	Возврат СтрЗаменить(ИмяКнопки,"Кнопка","");
КонецФункции