
&НаКлиенте
Процедура КаталогДляСохраненияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия 						= Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог 				= "";
	ДиалогОткрытия.МножественныйВыбор 	= Ложь;
	ДиалогОткрытия.Заголовок 			= "Выберите каталог";
	Оповещение = Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтотОбъект);
	ДиалогОткрытия.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталога_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Массив") Тогда
		Сообщить("Каталог не выбран");
		Возврат;
	КонецЕсли; 
	
	КаталогДляСохранения = Результат[0];	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектТЗ", 			ОбъектТЗ);
	Параметры.Свойство("НомерПоПорядку", 	НомерПоПорядку);
	
	Если ЗначениеЗаполнено(ОбъектТЗ) Тогда
		
		Элементы.ОбъектТЗ.Заголовок = ОбъектТЗ.Метаданные().Представление(); 
		
		КаталогДляСохранения = омНастройкиПолучитьЗаписать.ПолучитьНастройкуПользователя("ПутьККаталогуСохраненияФайлов");
		Если ЗначениеЗаполнено(КаталогДляСохранения) Тогда
			
			Каталог = Новый Файл(КаталогДляСохранения);
			
			Если НЕ Каталог.Существует() Тогда
				КаталогДляСохранения = "";
			КонецЕсли; 
			
		КонецЕсли;
		
	Иначе
		Отказ = Истина
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	омНастройкиПолучитьЗаписать.ЗаписатьНастройкуПользователя("ПутьККаталогуСохраненияФайлов", КаталогДляСохранения);
КонецПроцедуры 

&НаСервереБезКонтекста
Функция СохранитьНаСервере(ОбъектТЗ, НомерПоПорядку)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартинкиОбъектов.Картинка КАК Картинка,
		|	КартинкиОбъектов.ИмяФайла КАК ИмяФайла
		|ИЗ
		|	РегистрСведений.КартинкиОбъектов КАК КартинкиОбъектов
		|ГДЕ
		|	КартинкиОбъектов.ОбъектТЗ = &ОбъектТЗ
		|	И КартинкиОбъектов.НомерПоПорядку = &НомерПоПорядку";
	
	Запрос.УстановитьПараметр("НомерПоПорядку", НомерПоПорядку);
	Запрос.УстановитьПараметр("ОбъектТЗ", 		ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ИмяФайла", 	Выборка.ИмяФайла);
		//СтруктураДанных.Вставить("Адрес", 		ПоместитьВоВременноеХранилище(Выборка.Картинка.Получить()));
		
		Возврат СтруктураДанных; 
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура Сохранить(Команда)
	
	СтруктураДанных = СохранитьНаСервере(ОбъектТЗ, НомерПоПорядку);
	
	Если СтруктураДанных = Неопределено Тогда
	
		ПоказатьПредупреждение(, "Не удалось сохранить файл");
		
	Иначе
		
		КаталогДляСохранения = СокрЛП(КаталогДляСохранения);
		
		Если НЕ Прав(КаталогДляСохранения, 1) = "\" Тогда
		
			КаталогДляСохранения = КаталогДляСохранения + "\";	
		
		КонецЕсли;
		
		омФайлыНаКлиенте.ПолучитьИмяФайлаСУчетомСущемтвующих(КаталогДляСохранения + СтруктураДанных.ИмяФайла);
	
КонецЕсли;
	
КонецПроцедуры






