
&НаКлиенте
Процедура КаталогДляСохраненияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия 						= Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог 				= "";
	ДиалогОткрытия.МножественныйВыбор 	= Ложь;
	ДиалогОткрытия.Заголовок 			= "Выберите каталог";
	Оповещение = Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтотОбъект);
	ДиалогОткрытия.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталога_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Массив") Тогда
		Сообщить("Каталог не выбран");
		Возврат;
	КонецЕсли; 
	
	КаталогДляСохранения = Результат[0];	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектТЗ", 	ОбъектТЗ);
	
	Если ЗначениеЗаполнено(ОбъектТЗ) Тогда
		
		Элементы.ОбъектТЗ.Заголовок = ОбъектТЗ.Метаданные().Представление(); 
		
		КаталогДляСохранения = омНастройкиПолучитьЗаписать.ПолучитьНастройкуПользователя("ПутьККаталогуСохраненияФайлов");
		Если ЗначениеЗаполнено(КаталогДляСохранения) Тогда
			
			Каталог = Новый Файл(КаталогДляСохранения);
			
			Если НЕ Каталог.Существует() Тогда
				КаталогДляСохранения = "";
			КонецЕсли; 
			
		КонецЕсли;
		
	Иначе
		Отказ = Истина
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	омНастройкиПолучитьЗаписать.ЗаписатьНастройкуПользователя("ПутьККаталогуСохраненияФайлов", КаталогДляСохранения);
КонецПроцедуры 






