&НаСервере
Функция СоздатьПодключениеКБД(Параметры = Неопределено) Экспорт
	стВозрата = Новый Структура("Соединение,Ошибка",Неопределено,"");
	Если Параметры = Неопределено Тогда
		стПараметрв = ПолучитьПараметрыПодключенияMsSQL();
		Если НЕ стПараметрв.ПодключениеВозможно Тогда
			стВозрата.Ошибка = стПараметрв.Причина;
			Возврат стВозрата;
		КонецЕсли;
	Иначе
		Если ТипЗнч(Параметры) = Тип("Структура") Тогда
			ПроверитьЗаполнениеПараметров(Параметры,ПолучитСписокРеквизитовДляПодключенияКPDM());
			Если НЕ Параметры.ПодключениеВозможно Тогда
				стВозрата.Ошибка = Параметры.Причина;
				Возврат стВозрата;
			КонецЕсли;
			стПараметрв = Параметры;
		Иначе
			стВозрата.Ошибка = "Праметры не структура!";
			Возврат стВозрата;
		КонецЕсли;
	КонецЕсли;
	
	данныеВозврата = ПодключитьсяКБД(стПараметрв);
	Если Тип("Строка") = ТипЗнч(данныеВозврата) Тогда
		стВозрата.Ошибка = данныеВозврата;
		омЖурналСобытий.ЗаписатьВЖурналСобытий(,"омMsSQL.СоздатьПодключениеКБД"
		,,данныеВозврата,Перечисления.СтатусСобытий.Ошибка,Перечисления.ТипыСобытий.ПодключениеКВнешнейБазе);
	Иначе
		стВозрата.Соединение = данныеВозврата;
	КонецЕсли;
	
	Возврат стВозрата;
КонецФункции // СоздатьПодключениеКБД(Параметры)

&НаСервере
Функция ПодключитьсяКБД(стПараметрв)
	Соединение = Новый COMОбъект("ADODB.Connection");
	СтрокаПодключения = "driver={" + стПараметрв.ВерсияДрайвераPDM + "};
	|server=" + стПараметрв.АдресPDM + ";
	|uid=" + стПараметрв.ПользовательPDM + ";
	|pwd=" + стПараметрв.ПарольPDM + ";
	|database=" + стПараметрв.БазаPDM + ";
	//|MULTI_STATEMENTS=1;
	//|MULTI_RESULTS=1;
	|STMT=SET CHARACTER SET utf8";
	Попытка
		Соединение.open(СтрокаПодключения);
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки; 
	
	
	Возврат Соединение;
КонецФункции // ПодключитьсяКБД(стПараметрв)


&НаСервере
Функция ПолучитьСтруктуруПодключения() Экспорт
	стПараметры = Новый Структура();
	Для каждого х Из ПолучитСписокРеквизитовДляПодключенияКPDM() Цикл
		стПараметры.Вставить(х,Неопределено);
	КонецЦикла;
	стПараметры.Вставить("ПодключениеВозможно",Истина);
	стПараметры.Вставить("Причина","");
	
    Возврат стПараметры;
КонецФункции // ПолучитьСтруктуруПодключения()

 &НаСервере
Функция ПолучитСписокРеквизитовДляПодключенияКPDM(мСписокИмен = Неопределено) Экспорт
	
	Если мСписокИмен = Неопределено Тогда
		
		текМассив = Новый Массив;	
		
	Иначе
		
		текМассив = мСписокИмен;	
		
	КонецЕсли;
	
	текМассив.Добавить("ВерсияДрайвераPDM");
	текМассив.Добавить("АдресPDM");
	текМассив.Добавить("БазаPDM");
	текМассив.Добавить("ПользовательPDM");
	текМассив.Добавить("ПарольPDM");
	текМассив.Добавить("ИмяХранилищаPDM");
	
	Возврат текМассив;            
	
КонецФункции // ПолучитСписокРеквизитовДляПодключенияКPDM()

&НаСервере
Функция ПолучитьПараметрыПодключенияMsSQL() Экспорт
	мПараметры = ПолучитСписокРеквизитовДляПодключенияКPDM();
	стПараметры = Новый Структура("ПодключениеВозможно",Истина);
	стПараметры = Новый Структура("Причина","");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Настройки.ИмяНастройки КАК НаименованиеНастройки,
		|	Настройки.Значение КАК ЗначениеНастройки
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК Настройки
		|ГДЕ
		|	Настройки.ИмяНастройки В(&мПараметры)";
	
	Запрос.УстановитьПараметр("мПараметры", мПараметры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стПараметры.Вставить(Выборка.НаименованиеНастройки,Выборка.ЗначениеНастройки);
	КонецЦикла;
	
	ПроверитьЗаполнениеПараметров(стПараметры,мПараметры);
	
	Возврат стПараметры;
КонецФункции // ПолучитьПараметрыПодключенияMySQL()


&НаСервере
Функция ПроверитьЗаполнениеПараметров(стПараметрв,мПараметры)
	Если НЕ стПараметрв.Свойство("ПодключениеВозможно") Тогда
		стПараметрв.Вставить("ПодключениеВозможно",Истина);
	КонецЕсли;
	Если НЕ стПараметрв.Свойство("Причина") Тогда
		стПараметрв.Вставить("Причина","");
	КонецЕсли;
	Для каждого имяПараметра Из мПараметры Цикл
		Если НЕ стПараметрв.Свойство(имяПараметра) Тогда
			стПараметрв.Вставить(имяПараметра,Неопределено);
			стПараметрв.ПодключениеВозможно = Ложь;
			стПараметрв.Причина = "Не заполнены параметры подключения";
			омЖурналСобытий.ЗаписатьВЖурналСобытий(1,"омMsSQL.ПроверитьЗаполнениеПараметров"
			,омЖурналСобытий.ЗаполнитьПараметрыЖурналаСобытий(имяПараметра));
		КонецЕсли;
	КонецЦикла;
КонецФункции // ПроверитьЗаполнениеПараметров()


&НаСервере
Функция ВыполнитьЗапросНаВыборкуВPDM(Соединение, ТекстЗапроса) Экспорт

	Команда = Новый COMОбъект("ADODB.Command");
	Выборка = Новый COMОбъект("ADODB.RecordSet");
	
	Команда.ActiveConnection = Соединение;  
	
	Попытка
		Команда.CommandText = ТекстЗапроса;
		Выборка = Команда.Execute();
	Исключение
	    Возврат Неопределено;
	КонецПопытки;
	
	Возврат Выборка;
КонецФункции // ВыполнитьЗапросНаВыборкуВPDM()



&НаСервере
Функция ВыполнитьЗапросНаВставкуPDM(Соединение, ТекстЗапроса) Экспорт

	Команда = Новый COMОбъект("ADODB.Command");
	Выборка = Новый COMОбъект("ADODB.RecordSet");
	
	Команда.ActiveConnection = Соединение;  
	
	
	Попытка
		Команда.CommandText = ТекстЗапроса;
		Команда.Execute();
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;
	
	Возврат "";

КонецФункции // ВыполнитьзапросНаВставкуPDM()
