
#Область СобытияФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Период.ДатаНачала 		= НачалоМесяца(ТекущаяДата());
	ЭтаФорма.Период.ДатаОкончания 	= НачалоМесяца(ЭтаФорма.Период.ДатаНачала);
	
	ЗаполнитьПолеВывода();
КонецПроцедуры

#КонецОбласти

#Область СобытиеЭлементовФормы
	
&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьПолеВывода();
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалПриИзменении(Элемент)
	ЗаполнитьПолеВывода();
КонецПроцедуры

#КонецОбласти

#Область ПодготовкаДанных


#КонецОбласти 

#Область ВыводДанных 

&НаСервере
Процедура ЗаполнитьПолеВывода()

	

КонецПроцедуры // ЗаполнитьПолеВывода()
 
	
#КонецОбласти