
&НаКлиенте
Процедура ОткрытьПодборИзделийЭлемент(Объект,ЭтаФорма,СтандартнаяОбработка = Неопределено,ДополнительныеПараметры = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;
	
	СделкаРодитель = Объект.Проект;
	
	Если Не ЗначениеЗаполнено(СделкаРодитель) Тогда
		ПоказатьПредупреждение(,"Не заполнена Проект.");	
		Возврат;	
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзделияЭлемент",ЭтаФорма,ДополнительныеПараметры);
	
	стПараметры = Новый Структура("Проект,ТолькоНеИспользованые,ТекущиеИзделияЗаказчика,СсылкаРодитель"
					,СделкаРодитель
					,Истина
					,омТЧ_НаКлиентеСервере.КолонкуВМассив(Объект.ИзделияЭлемент,"ИзделиеЭлемент")
					,Объект.Ссылка);
	
	ОткрытьФорму("Справочник.ИзделияЭлемент.ФормаВыбора",стПараметры,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

КонецПроцедуры // ОткрытьПодборИзделий()


