Перем СекундВНеделе, ДнейДоОкончания, ПустаяДата, ТД;

&НаСервереБезКонтекста
Функция ЗаполнитьПроектыНаСервере(мДобавленныеПроекты)
	
	Возврат Отчеты.СостояниеПроекта.ЗаполнитьПроектыНаСервере(мДобавленныеПроекты);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПроекты(Команда)
	
	Для каждого ТекущийПроект Из ЗаполнитьПроектыНаСервере(Проекты.ВыгрузитьЗначения()) Цикл
		Проекты.Добавить(ТекущийПроект.Значение, ТекущийПроект.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	СформироватьОтчетНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура Обновить(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

Процедура СформироватьОтчетНаСервере()
	
	Отчеты.СостояниеПроекта.СоздатьФайлОтчета("", ПолеВывода, Проекты);
	
КонецПроцедуры // СформироватьОтчетНаСервере()
