Перем СекундВНеделе, ДнейДоОкончания, ПустаяДата, ТД;

&НаСервереБезКонтекста
Функция ЗаполнитьПроектыНаСервере(мДобавленныеПроекты)
	
	Возврат Отчеты.СостояниеПроекта.ЗаполнитьПроектыНаСервере(мДобавленныеПроекты);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПроекты(Команда)
	
	Для каждого ТекущийПроект Из ЗаполнитьПроектыНаСервере(Проекты.ВыгрузитьЗначения()) Цикл
		Проекты.Добавить(ТекущийПроект.Значение, ТекущийПроект.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	СформироватьОтчетНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура Обновить(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

Процедура СформироватьОтчетНаСервере()
	
	Отчеты.СостояниеПроекта.СоздатьФайлОтчета("", ПолеВывода, Проекты);
	
КонецПроцедуры // СформироватьОтчетНаСервере()

&НаКлиенте
Процедура Записать_в_PDF(Команда)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия 						= Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог 				= "";
	ДиалогОткрытия.МножественныйВыбор 	= Ложь;
	ДиалогОткрытия.Заголовок 			= "Выберите каталог";
	Оповещение = Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтотОбъект);
	ДиалогОткрытия.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталога_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Массив") Тогда
		Сообщить("Каталог не выбран");
		Возврат;
	КонецЕсли; 
	
	ТД = ТекущаяДата();
	
	ИмяФайла = "Состояние_проекта_" + Формат(Год(ТД), "ЧГ=0") + "_" + Месяц(ТД) + "_" + День(ТД) + ".pdf";
	
	ПолныйПуть = Результат[0] + "\" + ИмяФайла;
	
	Адрес = ПолучитьФайлНаСервере(); 
	
	Двоичное = ПолучитьИзВременногоХранилища(Адрес); 
	Двоичное.Записать(ПолныйПуть);
	
КонецПроцедуры

Функция ПолучитьФайлНаСервере()

	ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("pdf");
	
	Отчеты.СостояниеПроекта.СоздатьФайлОтчета(ИмяПромежуточногоФайла, , Проекты);
	
	Двоичное=Новый ДвоичныеДанные(ИмяПромежуточногоФайла);  // получаем двоичные данные из файла
	
	Адрес = ПоместитьВоВременноеХранилище(Двоичное); // кидаем двоичные данные во врем. хранилище
	
	Попытка
		УдалитьФайлы(ИмяПромежуточногоФайла);
	Исключение
	КонецПопытки;
	Возврат Адрес;
	

КонецФункции // ПолучитьФайлНаСервере()

