
&НаСервереБезКонтекста
Функция ЗаполнитьПроектыНаСервере(мДобавленныеПроекты)
	
	Возврат Отчеты.СостояниеПроекта.ЗаполнитьПроектыНаСервере(мДобавленныеПроекты);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПроекты(Команда)
	
	Для каждого ТекущийПроект Из ЗаполнитьПроектыНаСервере(Проекты.ВыгрузитьЗначения()) Цикл
		Проекты.Добавить(ТекущийПроект.Значение, ТекущийПроект.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	СформироватьОтчетНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура Обновить(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

Процедура СформироватьОтчетНаСервере()
	
	Отчеты.СостояниеПроекта.СоздатьФайлОтчета("", ПолеВывода, Проекты);
	
КонецПроцедуры // СформироватьОтчетНаСервере()

#Область PDF

&НаКлиенте
Процедура Записать_в_PDF(Команда)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия 						= Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог 				= "";
	ДиалогОткрытия.МножественныйВыбор 	= Ложь;
	ДиалогОткрытия.Заголовок 			= "Выберите каталог";
	Оповещение = Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтотОбъект);
	ДиалогОткрытия.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталога_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Массив") Тогда
		Сообщить("Каталог не выбран");
		Возврат;
	КонецЕсли; 
	
	ИмяФайла = "";
	Адрес = ПолучитьФайлНаСервере(Проекты, ИмяФайла); 
	ПолныйПуть = Результат[0] + "\" + ИмяФайла;
	
	Двоичное = ПолучитьИзВременногоХранилища(Адрес); 
	Двоичное.Записать(ПолныйПуть);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФайлНаСервере(Проекты, ИмяФайла)

	Возврат Отчеты.СостояниеПроекта.ПолучитьФайлНаСервере(Проекты, ИмяФайла);	

КонецФункции // ПолучитьФайлНаСервере()


#КонецОбласти


