
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Проект") Тогда
		ИспользоватьОтбор 				= Истина;
		Проект 							= Параметры.Проект;
		НеПоказыватьВВыборе				= Параметры.НеПоказыватьВВыборе;
		Элементы.Список.Отображение 	= ОтображениеТаблицы.Список;
		Элементы.Проект1.ТолькоПросмотр = Истина;
	Иначе
		ИспользоватьОтбор 				= Ложь;
		Проект 							= Неопределено;
	КонецЕсли; 
	
	Если Параметры.Свойство("НеПоказыватьВВыборе") Тогда
		ИспользоватьНеПоказыватьВВыборе 	= Истина;
		НеПоказыватьВВыборе					= Параметры.НеПоказыватьВВыборе;
	Иначе
		ИспользоватьНеПоказыватьВВыборе 	= Ложь;
		НеПоказыватьВВыборе					= Неопределено;
	КонецЕсли;

	Список.Параметры.УстановитьЗначениеПараметра("ИспользоватьОтбор",				ИспользоватьОтбор);
	Список.Параметры.УстановитьЗначениеПараметра("Проект",							Проект);
	Список.Параметры.УстановитьЗначениеПараметра("ИспользоватьНеПоказыватьВВыборе",	ИспользоватьНеПоказыватьВВыборе);
	Список.Параметры.УстановитьЗначениеПараметра("НеПоказыватьВВыборе",				НеПоказыватьВВыборе);
	
КонецПроцедуры

&НаКлиенте
Процедура Сделка1ПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ЭтаФорма.Проект) Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список; 
	Иначе
		Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок; 
	КонецЕсли;
	УстановитьПараметры();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметры()
	Список.Параметры.УстановитьЗначениеПараметра("Проект",				Проект);
	Список.Параметры.УстановитьЗначениеПараметра("ИспользоватьОтбор",	ЗначениеЗаполнено(Проект));
	Список.Параметры.УстановитьЗначениеПараметра("НеПоказыватьВВыборе",	Ложь);
КонецПроцедуры // УстановитьПараметры()

