
&НаКлиенте
Процедура ДобавитьБольшуюКартинку(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМаленькуюКартинку(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		ЦветФона 	= Новый Цвет(255, 255, 255);
		ЦветТекста 	= Новый Цвет(0, 0, 0);
	Иначе	
		ЦветФона 	= омЦвет.ПолучитьЦветИзСтрокиСПрефиксом(Объект.ЦветФона);
		ЦветТекста 	= омЦвет.ПолучитьЦветИзСтрокиСПрефиксом(Объект.ЦветТекста);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Декорация1.ЦветТекста 	= ЦветТекста;
	Элементы.Декорация1.ЦветФона 	= ЦветФона;
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаПриИзменении(Элемент)
	Элементы.Декорация1.ЦветФона 	= ЦветФона;
	Модифицированность 				= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЦветШрифтаПриИзменении(Элемент)
	Элементы.Декорация1.ЦветТекста 	= ЦветТекста;
	Модифицированность 				= Истина;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ЦветФона = омЦвет.ПолучитьСтроковоеПредставлениеЦвета(ЦветФона);
	ТекущийОбъект.ЦветТекста = омЦвет.ПолучитьСтроковоеПредставлениеЦвета(ЦветТекста);
КонецПроцедуры






