Функция ПодключитьБиблиотекуPDM() Экспорт
	
	
	Попытка
		МойОбъект = Новый COMОбъект("PDM_1C_COM.clPDM_1C_COM");
		
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
		Возврат ПодключитьсяККомпонентеИзМакета();
	КонецПопытки;
	//МойОбъект.message("Проба. Это такое пробное сообщение");
	Сообщить(МойОбъект.Login_PDM("User1C", "OJL314Pin", "PDM"));
	
	МойОбъект.Message(МойОбъект.Root_folder());
	Возврат Истина;
КонецФункции // ПодключитьБиблиотекуPDM()

Функция ПодключитьсяККомпонентеИзМакета()

	Попытка
	СсылкаНаАрхив  = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет("PDM_1C_COM"), Новый УникальныйИдентификатор);
	ПодключитьВнешнююКомпоненту(СсылкаНаАрхив, "PDM_1C_COM", ТипВнешнейКомпоненты.COM);	
	
	Исключение
		Возврат Ложь;
	КонецПопытки;
	 Возврат Истина;

КонецФункции // ПодключитьсяККоипонентеИзМакета()

Функция ПолучитьГабаритныйЧертежПоКоду(Код) Экспорт
	
	стВозврата = Новый Структура("Ссылка ,Наименование", Неопределено, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежи.Ссылка КАК Ссылка,
		|	ГабаритныеЧертежи.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
		|ГДЕ
		|	ГабаритныеЧертежи.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата ,Выборка);
	КонецЦикла;
	
	Возврат стВозврата;
	
КонецФункции // ПолучитьГабаритныйЧертежПоКоду()

Функция ПолучитьКомпозициюПоКоду(Код) Экспорт

	стВозврата = Новый Структура("Ссылка ,Наименование", Неопределено, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Композиции.Ссылка КАК Ссылка,
		|	Композиции.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Композиции КАК Композиции
		|ГДЕ
		|	Композиции.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата ,Выборка);
	КонецЦикла;
	
	Возврат стВозврата;
	

КонецФункции // ПолучитьКомпозициюПоКоду()

Функция ПолучитьКомплектПоКоду(Код) Экспорт

	стВозврата = Новый Структура("Ссылка ,Наименование", Неопределено, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Ссылка,
		|	ИзделияКомплект.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата ,Выборка);
	КонецЦикла;
	
	Возврат стВозврата;
	

КонецФункции // ПолучитьКомпозициюПоКоду()
