Функция ПодключитьБиблиотекуPDM() Экспорт
	
	
	Попытка
		МойОбъект = Новый COMОбъект("PDM_1C_COM.clPDM_1C_COM");
		
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
		Возврат ПодключитьсяККомпонентеИзМакета();
	КонецПопытки;
	//МойОбъект.message("Проба. Это такое пробное сообщение");
	Сообщить(МойОбъект.Login_PDM("User1C", "OJL314Pin", "PDM"));
	
	МойОбъект.Message(МойОбъект.Root_folder());
	Возврат Истина;
КонецФункции // ПодключитьБиблиотекуPDM()

Функция ПодключитьсяККомпонентеИзМакета()

	Попытка
	СсылкаНаАрхив  = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет("PDM_1C_COM"), Новый УникальныйИдентификатор);
	ПодключитьВнешнююКомпоненту(СсылкаНаАрхив, "PDM_1C_COM", ТипВнешнейКомпоненты.COM);	
	
	Исключение
		Возврат Ложь;
	КонецПопытки;
	 Возврат Истина;

КонецФункции // ПодключитьсяККоипонентеИзМакета()

Функция ПолучитьГабаритныйЧертежПоКоду(Код) Экспорт
	
	стВозврата = Новый Структура("Ссылка ,Наименование", Неопределено, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежи.Ссылка КАК Ссылка,
		|	ГабаритныеЧертежи.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
		|ГДЕ
		|	ГабаритныеЧертежи.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата ,Выборка);
	КонецЦикла;
	
	Возврат стВозврата;
	
КонецФункции // ПолучитьГабаритныйЧертежПоКоду()

Функция ПолучитьКомпозициюПоКоду(Код) Экспорт

	стВозврата = Новый Структура("Ссылка ,Наименование", Неопределено, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Композиции.Ссылка КАК Ссылка,
		|	Композиции.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Композиции КАК Композиции
		|ГДЕ
		|	Композиции.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата ,Выборка);
	КонецЦикла;
	
	Возврат стВозврата;
	

КонецФункции // ПолучитьКомпозициюПоКоду()

Функция ПолучитьКомплектПоКоду(Код) Экспорт

	стВозврата = Новый Структура("Ссылка ,Наименование", Неопределено, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Ссылка,
		|	ИзделияКомплект.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата ,Выборка);
	КонецЦикла;
	
	Возврат стВозврата;
	

КонецФункции // ПолучитьКомпозициюПоКоду()

#Область PDM_очередь_на_сервере 

Процедура ПроверитьОчередьИЗапуститьСкрипт() Экспорт

//ДанныеИзОчереди структура ОбъектВыгрузки, ТипОбмена, УИД
	ДанныеИзОчереди = омОчередьПДМНаСервере.ПолучитьДанныеИзОчереди();
	
	Если ПустаяСтрока(ДанныеИзОчереди.ОписаниеОшибки) Тогда
		ПодготовитьФайлыДляСкрипта(ДанныеИзОчереди);
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьТекстовоеПредставлениеТипаОбмена(ТипОбмена)

	Если ТипОбмена = Перечисления.ТипыОбменаPDM.НазначениеПрав Тогда
		Возврат "РаздатьПрава";	
	ИначеЕсли ТипОбмена = Перечисления.ТипыОбменаPDM.ОтзывПрав Тогда
		Возврат "ЗабратьПрава";	
	КонецЕсли;	

КонецФункции // ПолучитьТекстовоеПредставлениеТипаОбмена()


Процедура ПодготовитьФайлыДляСкрипта(ДанныеИзОчереди)
	
	Для каждого ДанныеОчереди Из ДанныеИзОчереди.Результат Цикл
		
		ТипВыгрузки = ПолучитьТекстовоеПредставлениеТипаОбмена(ДанныеОчереди.ТипОбмена); 
		
		стДанныеЭлемента = омВыгрузкаCRMНаСевере.ПолучитьДанныеЭлемента(ДанныеОчереди.ОбъектВыгрузки, ТипВыгрузки);
		
		стДанныеВыгрузки = омВыгрузкаCRMНаСевере.ПолучитьДанныеВыгрузки();
		
		ТестКаталог = Новый Файл(стДанныеВыгрузки.ПутьКФайлуЗагрузки); 
		Если НЕ ТестКаталог.Существует() Тогда
			
			омОчередьПДМНаСервере.СоздатьЗаписьВЛог(ДанныеОчереди.УИД, "Каталог " + стДанныеВыгрузки.ПутьКФайлуЗагрузки + " не существует.");
			Возврат;	
			
		КонецЕсли; 
		
		
		
		//НаименованиеЭлемента, мДанныеЭлемента, Ошибка
		Если ПустаяСтрока(стДанныеЭлемента.Ошибка) Тогда
			СоздатьФайлЗапуститьСкрипт(ДанныеОчереди, стДанныеЭлемента, ТипВыгрузки, стДанныеВыгрузки); 
		Иначе
			омОчередьПДМНаСервере.СоздатьЗаписьВЛог(ДанныеОчереди.УИД, стДанныеЭлемента.Ошибка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

Процедура СоздатьФайлЗапуститьСкрипт(ДанныеОчереди, стДанныеЭлемента, ТипВыгрузки, стДанныеВыгрузки)

	НаименованиеЭлемента = стДанныеЭлемента.НаименованиеЭлемента;
	
	КоличествоЭлементов = стДанныеЭлемента.мДанныеЭлемента.Количество();
	
	Если КоличествоЭлементов = 0 Тогда
		
		омОчередьПДМНаСервере.СоздатьЗаписьВЛог(ДанныеОчереди.УИД, "Нет данных для выгрузки");
		
	ИначеЕсли КоличествоЭлементов = 1 Тогда
		
		ПутьКФайлуEXE = ом_ПДМ_клиент_сервер.ПолучитьПутьКВыгузке(ТипВыгрузки, стДанныеВыгрузки);
		
		Если ПустаяСтрока(ПутьКФайлуEXE) Тогда       
			омОчередьПДМНаСервере.СоздатьЗаписьВЛог(ДанныеОчереди.УИД, "Не заполнен путь к исполняемому файлу.");
			Возврат;
		КонецЕсли;
		
		ПутьКФайлуЗагрузки = стДанныеВыгрузки.ПутьКФайлуЗагрузки; 
		
		Если ПустаяСтрока(ПутьКФайлуЗагрузки) Тогда
			омОчередьПДМНаСервере.СоздатьЗаписьВЛог(ДанныеОчереди.УИД, "Каталог выгрузки не заполнен.");
			Возврат;
		КонецЕсли;
		
		ТестКаталог = Новый Файл(ПутьКФайлуЗагрузки); 
		
		Если НЕ ТестКаталог.Существует() Тогда
			омОчередьПДМНаСервере.СоздатьЗаписьВЛог(ДанныеОчереди.УИД, "Каталог " + ПутьКФайлуЗагрузки + " не существует.");
			Возврат;
		КонецЕсли; 

		ТекстДок = ом_ПДМ_клиент_сервер.СоздатьФайлВыгрузки(стДанныеЭлемента.мДанныеЭлемента, ТипВыгрузки); 

		стВозврата = Новый Структура("ОписаниеОшибки, ВыгруженВPDM", "", "");
		ом_ПДМ_клиент_сервер.ЗапуститьИсполнение(ТекстДок, стВозврата, ТестКаталог, ПутьКФайлуEXE, НаименованиеЭлемента, ТипВыгрузки, ДанныеОчереди.ОбъектВыгрузки);
		
		Если НЕ ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
			омОчередьПДМНаСервере.СоздатьЗаписьВЛог(ДанныеОчереди.УИД, стВозврата.ОписаниеОшибки);
			Возврат;
		КонецЕсли; 
		
		ОпросФайловОтвета();
	Иначе
		
		//стПараметры = Новый Структура("мДанныеЭлемента, ТипВыгрузки, НаименованиеЭлемента", 
		//								стДанныеЭлемента.мДанныеЭлемента, ТипВыгрузки, НаименованиеЭлемента);
		//ОткрытьФорму("ОбщаяФорма.ФормаОтправкаНесколькихЗначенийВ_ПДМ", стПараметры);
		
	КонецЕсли;
	

КонецПроцедуры


Процедура ОпросФайловОтвета() Экспорт
	
	НастройкиВыгрузки = омPDMНаСервереПовтор.ПолучитьДанныеВыгрузки();
	
	КонтрольЗависшихДействий();
	
	КонтрольФайлов(НастройкиВыгрузки);
	
	ВызватьПаузу(НастройкиВыгрузки.ВремяОпросаФайлов * 1000);
	
	Если омОчередьПДМНаСервере.НуженКонтрольНовыхФайловОтвета() Тогда
		ОпросФайловОтвета();	
	КонецЕсли;

КонецПроцедуры

Процедура КонтрольФайлов(НастройкиВыгрузки)

	НайденныеФайлы = НайтиФайлы(НастройкиВыгрузки.ПутьКФайлуЗагрузки, "*.txt");
	
	Для Каждого Файл Из НайденныеФайлы Цикл
		
		Если Файл.ЭтоФайл() Тогда
			
			РазборФайла(Файл);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РазборФайла(Файл)

	мДанныеИмяФайла = СтрРазделить(Файл.ИмяБезРасширения, "_");
	
	Если мДанныеИмяФайла.Количество() = 2 Тогда
	
		ИмяПрефикса 	= "";	
	
	Иначе
	
		ИмяПрефикса 	= мДанныеИмяФайла[0];
		
	КонецЕсли;
	
	Текст = Новый ЧтениеТекста(Файл.ПолноеИмя, КодировкаТекста.ANSI); 
	
	МассивСтрок = Новый Массив;
	
	СтрокаФайла = Текст.ПрочитатьСтроку();
	Если НЕ СтрокаФайла = Неопределено Тогда
		МассивСтрок.Добавить(СтрокаФайла);	
	КонецЕсли;
	
	Пока СтрокаФайла <> Неопределено Цикл // строки читаются до символа перевода строки
		
		СтрокаФайла = Текст.ПрочитатьСтроку();
		Если НЕ СтрокаФайла = Неопределено Тогда
			МассивСтрок.Добавить(СтрокаФайла);	
		КонецЕсли;
		
	КонецЦикла;
	
	Текст.Закрыть(); 
	Текст = Неопределено;
	
	
	Если ИмяПрефикса = "" Тогда
		ИзменилсяКомплект(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "MPC" Тогда
		ЗабратьПраваКомпозиции(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "SPC" Тогда
		РаздатьПраваКомпозиции(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "UP" Тогда
		РаздатьПраваКомплект(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "MP" Тогда
		ЗабратьПраваКомплект(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "TT" Тогда
		ИзменилсяПереносТЗ(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "GCS" Тогда
		ИзменилсяСтатусГЧ(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "C" Тогда
		ИзменилсяКомпозиция(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "K" Тогда
		ИзменилсяКонструктор(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "G" Тогда
		ИзменилсяГЧ(МассивСтрок, мДанныеИмяФайла);
	ИначеЕсли ИмяПрефикса = "P" Тогда
		ИзменилсяПроект(МассивСтрок, мДанныеИмяФайла);
	Иначе
		ЛогОшибок("Неизвестный префикс", Файл.ИмяБезРасширения);
	КонецЕсли;
	
	УдалитьФайлы(Файл.ПолноеИмя);
	
	
КонецПроцедуры              

Процедура ЗабратьПраваКомпозиции(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура РаздатьПраваКомпозиции(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура РаздатьПраваКомплект(МассивСтрок, мДанныеИмяФайла)
	
	ЗначениеСуфикса = мДанныеИмяФайла[2];
	
	Если ЗначениеСуфикса = "1" Тогда
		омОчередьПДМНаСервере.ЗавершитьДействие(Перечисления.ТипыОбменаPDM.НазначениеПрав);
	Иначе
		омОчередьПДМНаСервере.ЗавершитьДействиеСОшибкой(Перечисления.ТипыОбменаPDM.НазначениеПрав, "Не удалось назначить права.");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗабратьПраваКомплект(МассивСтрок, мДанныеИмяФайла)

	//"ЗабратьПрава"	

КонецПроцедуры

Процедура ИзменилсяПереносТЗ(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура ИзменилсяСтатусГЧ(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура ИзменилсяКомпозиция(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура ИзменилсяКонструктор(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура ИзменилсяГЧ(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура ИзменилсяКомплект(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура ИзменилсяПроект(МассивСтрок, мДанныеИмяФайла)

	

КонецПроцедуры

Процедура ЛогОшибок(ОписаниеОшибки, ИмяФайла)

	

КонецПроцедуры



Процедура КонтрольЗависшихДействий()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьВыгрузкиPDM.УИД КАК УИД,
		|	ОчередьВыгрузкиPDM.СчетчикДействий КАК СчетчикДействий
		|ИЗ
		|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
		|ГДЕ
		|	ОчередьВыгрузкиPDM.НачалоОбмена < &НачалоОбмена
		|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("НачалоОбмена", ТекущаяДата() - 300);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
КонецПроцедуры 

#Область ОбработкаКоманд


	
#КонецОбласти


#КонецОбласти