&НаСервере
Функция ПолучитьИмяПапки(Сделка) Экспорт
	Возврат Сделка.Наименование;
КонецФункции // ПолучитьИмяПапки()

&НаСервере
Функция ПроверитьКаталогИзделия(СсылкаНаИзделие,Знач ОбъектИзделия = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ИзделияЭлемент.Родитель.Проект, ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)) КАК РодительОбъект,
		|	ИзделияЭлемент.Проект КАК Проект
		|ИЗ
		|	Справочник.ИзделияЭлемент КАК ИзделияЭлемент
		|ГДЕ
		|	ИзделияЭлемент.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаИзделие);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Если Выборка.РодительОбъект = Выборка.Проект Тогда
			Возврат Истина;	
		КонецЕсли; 
		Проект = Выборка.Проект;
	КонецЦикла; 
	
	Если Проект = Неопределено Тогда
		Проект = СсылкаНаИзделие.Проект;
	КонецЕсли;
	
	ПеренестиИзделиеВГруппуОбъекта(Проект,СсылкаНаИзделие);	
	
КонецФункции // ПроверитьКаталогИзделия()

&НаСервере
Процедура ПеренестиИзделиеВГруппуОбъекта(Проект,СсылкаНаИзделие)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияЭлемент.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИзделияЭлемент КАК ИзделияЭлемент
		|ГДЕ
		|	ИзделияЭлемент.Проект = &Проект
		|	И ИзделияЭлемент.ЭтоГруппа = ИСТИНА";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ГруппаИзделияЗаказачика = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		ГруппаИзделияЗаказачика = Выборка.Ссылка;
	КонецЦикла;
	
	Если ГруппаИзделияЗаказачика = Неопределено Тогда
		ГруппаИзделияЗаказачика = СоздатьКаталогИзделия(Проект);
	КонецЕсли;
	
	обИзделия = СсылкаНаИзделие.ПолучитьОбъект();
	обИзделия.Родитель = ГруппаИзделияЗаказачика;
	обИзделия.Записать();
	
КонецПроцедуры // ПеренестиИзделиеВГруппуОбъекта() 

&НаСервере
Функция СоздатьКаталогИзделия(Проект)
	обГруппаИзделияЗаказачика = Справочники.ИзделияЭлемент.СоздатьГруппу();
	обГруппаИзделияЗаказачика.Проект = Проект;
	обГруппаИзделияЗаказачика.Наименование = Проект;
	обГруппаИзделияЗаказачика.Записать();
	
	Возврат обГруппаИзделияЗаказачика.Ссылка;

КонецФункции // СоздатьКаталог()

&НаСервере
Процедура СоздатьКаталокИзделиеЗаказчика(Проект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияЭлемент.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИзделияЭлемент КАК ИзделияЭлемент
		|ГДЕ
		|	ИзделияЭлемент.Проект = &Проект
		|	И ИзделияЭлемент.ЭтоГруппа = ИСТИНА";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
    	Возврат;
	КонецЦикла;
	

	СоздатьКаталогИзделия(Проект);
	

КонецПроцедуры // СоздатьКаталокИзделиеЗаказчика()

