
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ОбъектТЗ) Тогда
	
		Элементы.Проект.ТолькоПросмотр 				= Истина;	
		Элементы.ГабаритныйЧертеж.ТолькоПросмотр 	= Истина;	
	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НовыйСтатус) Тогда
	
		Элементы.НовыйСтатус.Видимость	= Ложь;	
	
	КонецЕсли;
	
	ОформлениеФормы(); 
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МаксимальноеКоличествоЗадачСоздание = омЗадачиПКДПовтор.ПолучитьКоличествоЗадачСозданиеЗамеров();  
	
	Элементы.ДекорацияВыполнен.Видимость 	= Объект.Выполнена;
	Элементы.ДекорацияНеВыполнен.Видимость 	= НЕ Элементы.ДекорацияВыполнен.Видимость;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ИсполнительПриИзмененииНаСервере(Исполнитель)
	Возврат Задачи.ПроверитьГабаритныеЧертежи.КоличествоЗапущеныхЗадач(Исполнитель);  
КонецФункции

&НаКлиенте
Процедура Сохранить_и_Закрыть(Команда)
	Записать();
	Оповестить("ИзменениеЗамеров");
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВыполнениеНаСервере()

	ЗадачаОбъект = Объект.Ссылка.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецПроцедуры // ЗапмсатьВыполнениеНаСервере()  

#Область Команды

&НаКлиенте
Процедура НачатьВыполнение(Команда)
	
	Если ЗначениеЗаполнено(Объект.Исполнитель) Тогда
		
		Если Модифицированность Тогда
			Записать();
		КонецЕсли;
		
		ЗапуститьДействие("НачатьВыполнение");
		
	Иначе
		
		СтруктурайПользователь = омСотрудники.ПолучитьТекущегоПользователя(,Истина);
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗаполненияИсполнителя", ЭтаФорма
								, Новый Структура("ТекущийПользователь", СтруктурайПользователь.ТекущийПользователь));
								
		ПоказатьВопрос(Оповещение, "Назначить исполнителем " + СтруктурайПользователь.Наименование, Режим, 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗаполненияИсполнителя(Результат, Параметр) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Объект.Исполнитель = Параметр.ТекущийПользователь;
		Записать();
		ЗапуститьДействие("НачатьВыполнение");
	Иначе
		ПоказатьПредупреждение(,"Не заполнен Исполнитель");
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура КорректировкаНеНужна(Команда)

	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ЗапуститьДействие("КорректировкаНеНужна"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыполнение(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ЗапуститьДействие("ЗавершитьВыполнение");
	
КонецПроцедуры

&НаКлиенте
Процедура Сброс(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ЗапуститьДействие("Сброс"); 
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция ЗапуститьДействие(Действие)
	
	Прочитать();
	Если Действие = "ЗавершитьВыполнение" Тогда
		Записать(Новый Структура("ВыполнитьЗадачу", Истина));
	Иначе
		Записать();
	КонецЕсли;
	
	ДействияНаСервере(Действие, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель);
	
	Оповестить("ИзменениеЗамеров");
	Закрыть();
	
КонецФункции // СтруктураОтвета() 

&НаСервереБезКонтекста
Процедура ВыполнитьНаСервере(СсылкаОбъекта)

	ЗадачаОбъект = СсылкаОбъекта.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель)

	Возврат Задачи.ПроверитьГабаритныеЧертежи.ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель);	

КонецФункции //  ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель = Неопределено)()

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Исполнитель) Тогда
		
		Элементы.ДекорацияЗаполнитьИсполнителя.Видимость 	= Ложь;
		Элементы.ГруппаКнопки.ТолькоПросмотр 				= Ложь;
		
		КоличествоЗапущеныхЗадач = ИсполнительПриИзмененииНаСервере(Объект.Исполнитель);
		
		Если КоличествоЗапущеныхЗадач < МаксимальноеКоличествоЗадачСоздание Тогда
			
			Элементы.ДекорацияЗапущеныеЗадания.Видимость 	= Ложь;
			Элементы.КнопкаНачатьВыполнение.Доступность 	= Истина;
			
		ИначеЕсли Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыЗадачКонструирования.ЗамерИзменение") Тогда
			
			Элементы.ДекорацияЗапущеныеЗадания.Видимость 	= Ложь;
			
		Иначе
			
			Элементы.ДекорацияЗапущеныеЗадания.Видимость 	= Истина;
			Элементы.ДекорацияЗапущеныеЗадания.Заголовок 	= "Уже в работе " + КоличествоЗапущеныхЗадач + " из " + МаксимальноеКоличествоЗадачСоздание + " возможнвх.";
			Элементы.КнопкаНачатьВыполнение.Доступность 	= Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Элементы.ГруппаКнопки.ТолькоПросмотр				= Истина;
		Элементы.ДекорацияЗаполнитьИсполнителя.Видимость 	= Истина;
		Элементы.ДекорацияЗапущеныеЗадания.Видимость 		= Ложь;
		
	КонецЕсли;
	
	Элементы.КнопкаКорректировкаНеНужна.Видимость 		= Элементы.КнопкаНачатьВыполнение.Видимость;
	Элементы.КнопкаКорректировкаНеНужна.Доступность 	= Элементы.КнопкаНачатьВыполнение.Доступность; 
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОформлениеФормы()

	Если НЕ Объект.Выполнена 
		И Объект.КрайняяДатаИсполнения > Дата(1, 1, 1) 
		И Объект.КрайняяДатаИсполнения < НачалоДня(ТекущаяДата()) Тогда
	
		Элементы.КрайняяДатаИсполнения.ЦветТекста 			= Новый Цвет(255, 10, 10);
		Элементы.КрайняяДатаИсполнения.ЦветТекстаЗаголовка 	= Элементы.КрайняяДатаИсполнения.ЦветТекста; 
		
	Иначе
		
		Элементы.КрайняяДатаИсполнения.ЦветТекста 			= Новый Цвет(0, 0, 0);
		Элементы.КрайняяДатаИсполнения.ЦветТекстаЗаголовка 	= Элементы.КрайняяДатаИсполнения.ЦветТекста; 
	
	КонецЕсли; 
	                                                       
	Если Объект.Выполнена Тогда
		Элементы.ГруппаКнопки.Видимость 	= Ложь;
		Элементы.ФормаЗаписать.Доступность 	= Ложь;
		ТолькоПросмотр						= Истина;
	Иначе
		
		Если Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыЗадачКонструирования.ЗамерИзменение") Тогда
			
			Элементы.КнопкаНачатьВыполнение.Видимость = Ложь;
			
		Иначе
			
			Элементы.КнопкаЗавершитьВыполнение.Видимость 	= Ложь;
			Элементы.КнопкаСброс.Видимость 					= Ложь; 
			Элементы.КнопкаНачатьВыполнение.Доступность		= ЗначениеЗаполнено(Объект.Исполнитель); 
			
		КонецЕсли;
		
		Элементы.КнопкаКорректировкаНеНужна.Видимость 		= Элементы.КнопкаНачатьВыполнение.Видимость;
		Элементы.КнопкаКорректировкаНеНужна.Доступность 	= Элементы.КнопкаНачатьВыполнение.Доступность;
		
		ИсполнительПриИзменении(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры // ОформлениеФормы()

&НаКлиенте
Процедура СообщитьООшибке(Команда)
	омЗадачаОбщаяНаКлиенте.ОткрытьПодготовленныюЗадачу(Объект.Ссылка);
КонецПроцедуры
 
&НаКлиенте
Процедура ТаймингЗадачи(Команда)
	ОткрытьФорму("ОбщаяФорма.ТаймигОбъекта", Новый Структура("ОбъектТайминга", Объект.Ссылка), ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

