
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ОбъектТЗ) Тогда
	
		Элементы.Проект.ТолькоПросмотр 				= Истина;	
		Элементы.ГабаритныйЧертеж.ТолькоПросмотр 	= Истина;	
	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НовыйСтатус) Тогда
	
		Элементы.НовыйСтатус.Видимость	= Ложь;	
	
	КонецЕсли;
	
	ОформлениеФормы(); 
	
	ОформлениеКорректировки();
	
КонецПроцедуры


Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.АктПриемкиГабаритныхЧертежей") Тогда
		Элементы.БылаКорректировка.СписокВыбора.Добавить(3, "Нет данных для изменения");
	КонецЕсли;
	
	МаксимальноеКоличествоЗадачСоздание = омЗадачиПКДПовтор.ПолучитьКоличествоЗадачСозданиеЗамеров();  
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ИсполнительПриИзмененииНаСервере(Исполнитель)
	Возврат Задачи.ПроверитьГабаритныеЧертежи.КоличествоЗапущеныхЗадач(Исполнитель);  
КонецФункции

&НаКлиенте
Процедура ОформлениеКорректировки()

	КотеровкаНеВыбрана = Объект.БылаКорректировка = 0;
	
	Элементы.БылаКорректировка.ЦветТекста 		= ?(КотеровкаНеВыбрана, Новый Цвет(100, 0, 0), Новый Цвет(0, 0, 0));
	Элементы.БылаКорректировка.Шрифт			= омТабличныйДокументКлиентСервер.ИзменитьПараметрШрифта(Элементы.БылаКорректировка.Шрифт,,10,КотеровкаНеВыбрана);
	

КонецПроцедуры // ОформлениеКорректировки()


&НаКлиенте
Процедура Сохранить_и_Закрыть(Команда)
	Записать();
	Оповестить("ИзменениеЗамеров");
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВыполнениеНаСервере()

	ЗадачаОбъект = Объект.Ссылка.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецПроцедуры // ЗапмсатьВыполнениеНаСервере()  

&НаКлиенте
Процедура ЗавершитьВыполнение(Команда)
	
	Если Объект.БылаКорректировка = 0 Тогда
	
		ПоказатьПредупреждение(, "Не выбрано требование к корректировке.");
		Отказ = Истина;
		Возврат;
	
	КонецЕсли;
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ЗапуститьДействие("ЗавершитьВыполнение");
	
КонецПроцедуры

&НаКлиенте
Процедура Сброс(Команда)
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ЗапуститьДействие("Сброс");
КонецПроцедуры
 
&НаКлиенте
Процедура НачатьВыполнение(Команда)
	
	Если ЗначениеЗаполнено(Объект.Исполнитель) Тогда
		
		Если Модифицированность Тогда
			Записать();
		КонецЕсли;
		
		ЗапуститьДействие("НачатьВыполнение");
		
	Иначе
		
		СтруктурайПользователь = омСотрудники.ПолучитьТекущегоПользователя(,Истина);
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗаполненияИсполнителя", ЭтаФорма
								, Новый Структура("ТекущийПользователь", СтруктурайПользователь.ТекущийПользователь));
								
		ПоказатьВопрос(Оповещение, "Назначить исполнителем " + СтруктурайПользователь.Наименование, Режим, 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗаполненияИсполнителя(Результат, Параметр) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Объект.Исполнитель = Параметр.ТекущийПользователь;
		Записать();
		ЗапуститьДействие("НачатьВыполнение");
	Иначе
		ПоказатьПредупреждение(,"Не заполнен Исполнитель");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗапуститьДействие(Действие)
	
	Прочитать();
	Записать();
	
	ДействияНаСервере(Действие, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель);
	
	Если Действие = "ЗавершитьВыполнение" Тогда
		ВыполнитьНаСервере(Объект.Ссылка);
	КонецЕсли;
	
	Оповестить("ИзменениеЗамеров");
	Закрыть();
	
КонецФункции // СтруктураОтвета() 

&НаСервереБезКонтекста
Процедура ВыполнитьНаСервере(СсылкаОбъекта)

	ЗадачаОбъект = СсылкаОбъекта.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция  ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель)

	Возврат Задачи.ПроверитьГабаритныеЧертежи.ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель);	

КонецФункции //  ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель = Неопределено)()

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Исполнитель) Тогда
		
		Элементы.ГруппаКнопки.Видимость = Истина;
		
		КоличествоЗапущеныхЗадач = ИсполнительПриИзмененииНаСервере(Объект.Исполнитель);
		
		Если КоличествоЗапущеныхЗадач < МаксимальноеКоличествоЗадачСоздание Тогда
			
			Элементы.ДекорацияЗапущеныеЗадания.Видимость 	= Ложь;
			Элементы.КнопкаНачатьВыполнение.Доступность 	= Истина;
			
		ИначеЕсли Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыЗадачКонструирования.ЗамерИзменение") Тогда
			
			Элементы.ДекорацияЗапущеныеЗадания.Видимость 	= Ложь;
			
		Иначе
			
			Элементы.ДекорацияЗапущеныеЗадания.Видимость 	= Истина;
			Элементы.ДекорацияЗапущеныеЗадания.Заголовок 	= "Уже в работе " + КоличествоЗапущеныхЗадач + " из " + МаксимальноеКоличествоЗадачСоздание + " возможнвх.";
			Элементы.КнопкаНачатьВыполнение.Доступность 	= Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Элементы.ГруппаКнопки.Видимость = Ложь;	
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОформлениеФормы()

	Если НЕ Объект.Выполнена 
		И Объект.КрайняяДатаИсполнения > Дата(1, 1, 1) 
		И Объект.КрайняяДатаИсполнения < НачалоДня(ТекущаяДата()) Тогда
	
		Элементы.КрайняяДатаИсполнения.ЦветТекста 			= Новый Цвет(255, 10, 10);
		Элементы.КрайняяДатаИсполнения.ЦветТекстаЗаголовка 	= Элементы.КрайняяДатаИсполнения.ЦветТекста; 
		
	Иначе
		
		Элементы.КрайняяДатаИсполнения.ЦветТекста 			= Новый Цвет(0, 0, 0);
		Элементы.КрайняяДатаИсполнения.ЦветТекстаЗаголовка 	= Элементы.КрайняяДатаИсполнения.ЦветТекста; 
	
	КонецЕсли; 
	                                                       
	Если Объект.Выполнена Тогда
		Элементы.ГруппаКнопки.Видимость 	= Ложь;
		Элементы.ФормаЗаписать.Доступность 	= Ложь;
		ТолькоПросмотр						= Истина;
	Иначе
		
		Если Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыЗадачКонструирования.ЗамерИзменение") Тогда
			
			Элементы.КнопкаНачатьВыполнение.Видимость = Ложь;
			
		Иначе
			
			Элементы.КнопкаЗавершитьВыполнение.Видимость = Ложь;
			Элементы.КнопкаСброс.Видимость 			= Ложь; 
			Элементы.КнопкаНачатьВыполнение.Доступность	= ЗначениеЗаполнено(Объект.Исполнитель); 
			
		КонецЕсли;
		
		ИсполнительПриИзменении(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры // ОформлениеФормы()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
КонецПроцедуры

&НаКлиенте
Процедура БылаКорректировкаПриИзменении(Элемент)
	ОформлениеКорректировки();
КонецПроцедуры


 
