
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ГабаритныйЧертеж) Тогда
	
		Элементы.Проект.ТолькоПросмотр 				= Истина;	
		Элементы.ГабаритныйЧертеж.ТолькоПросмотр 	= Истина;	
	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НовыйСтатус) Тогда
	
		Элементы.НовыйСтатус.Видимость	= Ложь;	
	
	КонецЕсли;
	
КонецПроцедуры


Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.АктПриемкиГабаритныхЧертежей") Тогда
		Элементы.БылаКорректировка.СписокВыбора.Добавить(3, "Нет данных для изменения");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить_и_Закрыть(Команда)
	Записать();
	Оповестить("ИзменениеЗамеров");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Выполнить_и_закрыть(Команда) 
	
	Если Объект.БылаКорректировка = 0 Тогда
	
		ПоказатьПредупреждение(, "Не выбрано требование к корректировке.");
		Отказ = Истина;
		Возврат;
	
	КонецЕсли;
	
	Если Модифицированность Тогда	
		Записать(); 
	КонецЕсли;
		
	ЗаписатьВыполнениеНаСервере();
	Оповестить("ИзменениеЗамеров");
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВыполнениеНаСервере()

	ЗадачаОбъект = Объект.Ссылка.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецПроцедуры // ЗапмсатьВыполнениеНаСервере()  

	
 
