
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Настройка.Видимость = РольДоступна("Программист");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = НЕ Настройка;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = НЕ Настройка;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Если Настройка Тогда
		
		Отказ = Истина;
		ОткрытьФорму("Справочник.БазаЗнанийСсылки.ФормаОбъекта", Новый Структура("Редактирование, Ключ", Истина, Элементы.Список.ТекущаяСтрока), ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры
