&НаКлиенте
Перем стРеквизитыИзменненыеДляВыгрузки, НормаВремениПКДРКД, ИзмененКонструктор, ПутьКФайлуПДМ;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ (РольДоступна("АдминистраторСистемы") И РольДоступна("ПолныеПрава")) Тогда
		
		Элементы.ВыгрузитьВPDM.Видимость 	= Ложь;
		Элементы.ГруппаТЗ.Доступность 		= Ложь;
		
	КонецЕсли;
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		
		ЗаполнитьДанныеПКД();
		омКомпозицииСервер.ПолучитьКомплектыКомпозиции(Объект.Ссылка, Комплекты);
		омКомпозицииСервер.ПолучитьПомещенияКомпозиции(Объект.Ссылка, Помещения);
		
		ПолучитьКодБитрикса();
		Если Код_в_PDM > 0 Тогда
			Элементы.ВыгрузитьВPDM.Видимость = Ложь;	
		КонецЕсли;
		
		ЗадачаВРаботе = омКонструктор.ВозможностьИзменитьКонструктора(Объект.Ссылка);
		
		Если ЗначениеЗаполнено(ЗадачаВРаботе) Тогда
			
			Элементы.Конструктор.ТолькоПросмотр				 	= Истина;	
			
		Иначе
			
			Элементы.ЗадачаВРаботе.Видимость = Ложь;	
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры      

Процедура ЗаполнитьДанныеПКД()

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.НормаВремени_ПКД КАК НормаВремени_ПКД,
		|	ДатыКомплекта.ДнейПКД КАК ДнейПКД,
		|	ДатыКомплекта.КрайПКД КАК КрайПКД,
		|	ДатыКомплекта.НачалоПКД КАК НачалоПКД,
		|	ДатыКомплекта.Код_в_PDM КАК Код_в_PDM
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Комплект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", Объект.Ссылка);
	
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
	КонецЦикла;
	
	Выборка = Результат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Значение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗарегестрироватьНаСервере(стРеквизитыИзменненыеДляВыгрузки);
	
	Если НормаВремениПКДРКД ИЛИ ИзмененКонструктор Тогда
		
		стДанные = Новый Структура();
		стДанные.Вставить("ДнейТЗ", 			ДнейТЗ);
		стДанные.Вставить("НачалоТЗ", 			НачалоТЗ);
		стДанные.Вставить("Композиция", 		Объект.Ссылка);
		стДанные.Вставить("Проект", 			Объект.Проект);
		стДанные.Вставить("ТекущаяСтадия", 		ТекущаяСтадия);
		стДанные.Вставить("Конструктор", 		Конструктор);
		стДанные.Вставить("ИзмененКонструктор", ИзмененКонструктор);
		
		ЗаписатьИзмененияТЗНаСервере(стДанные);	
		
	КонецЕсли;
	
	НормаВремениПКДРКД = Ложь;
	ИзмененКонструктор = Ложь;
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаписатьИзмененияТЗНаСервере(стДанные)

	МенеджерЗаписей = РегистрыСведений.ДатыКомплекта.СоздатьМенеджерЗаписи();
	МенеджерЗаписей.Проект 		= стДанные.Проект;
	МенеджерЗаписей.Комплект 	= стДанные.Композиция;
	
	МенеджерЗаписей.Прочитать();
	
	МенеджерЗаписей.Проект 			= стДанные.Проект;
	МенеджерЗаписей.Комплект 		= стДанные.Композиция;
	МенеджерЗаписей.ДнейТЗ 			= стДанные.ДнейТЗ;
	МенеджерЗаписей.НачалоТЗ 		= стДанные.НачалоТЗ;
	МенеджерЗаписей.КрайТЗ 			= омДаты.ДобавитьДниСУчетомВыходных(стДанные.НачалоТЗ, стДанные.ДнейТЗ);
	
	МенеджерЗаписей.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоМонтажа КАК ВнешняяДатаНачалоМонтажа,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоПроектирования КАК ВнешняяДатаНачалоПроектирования,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоПроизводства КАК ВнешняяДатаНачалоПроизводства,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоСогласования КАК ВнешняяДатаНачалоСогласования,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеМонтажа КАК ВнешняяДатаОкончаниеМонтажа,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеПроектирования КАК ВнешняяДатаОкончаниеПроектирования,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеПроизводства КАК ВнешняяДатаОкончаниеПроизводства,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеСогласования КАК ВнешняяДатаОкончаниеСогласования,
		|	ДанныеКомплектаСрезПоследних.Приоритет КАК Приоритет
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", стДанные.Композиция);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МенеджерЗаписей = РегистрыСведений.ДанныеКомплекта.СоздатьМенеджерЗаписи();

	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(МенеджерЗаписей, Выборка);
	КонецЦикла;
	
	МенеджерЗаписей.Период 			= ТекущаяДата();
	МенеджерЗаписей.Комплект 		= стДанные.Композиция;
	МенеджерЗаписей.ТекущаяСтадия 	= стДанные.ТекущаяСтадия;
	МенеджерЗаписей.Конструктор 	= стДанные.Конструктор;
	МенеджерЗаписей.Автор 			= ПараметрыСеанса.ТекущийПользователь;
	
	МенеджерЗаписей.Записать(); 
	
	Если стДанные.ИзмененКонструктор Тогда
		омКонструктор.ИзменитьИсполнителяВЗадаче(стДанные.Композиция, стДанные.Конструктор);	
	КонецЕсли;
	
КонецПроцедуры // ЗаписатьИзмененияТЗНаСервере(стДанные)

Процедура ЗарегестрироватьНаСервере(стРеквизитыИзменненыеДляВыгрузки)
	Если ЕстьИзменениеРеквизитов(стРеквизитыИзменненыеДляВыгрузки) Тогда
		текОбъект = РеквизитФормыВЗначение("Объект");
		Отказ = Ложь;
		Б24_СМ_РегистрацияИзмененийСервер.ЗарегистрироватьИзменения(текОбъект, Ложь, Отказ);
	КонецЕсли;
КонецПроцедуры

Функция ЕстьИзменениеРеквизитов(стРеквизитыИзменненыеДляВыгрузки)

 	Для каждого х Из стРеквизитыИзменненыеДляВыгрузки Цикл
		Если НЕ Объект[х.Ключ] = х.Значение  Тогда
			Возврат Истина;	
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции // ЕстьИзменениеРеквизитов()

&НаКлиенте
Процедура ОткрытьТЗ(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, "Перед открытием ТЗ необходимо сохранить комплект");
	Иначе
		ОткрытьФорму("РегистрСведений.ТЗ_Изделий.Форма.Форма", Новый Структура("ОбъектТЗ", Объект.Ссылка));
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьКодБитрикса()
	
	КодВыгрузкиВБитрикс = "";
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	КодВыгрузкиВБитрикс = омВыгрузкаCRMНаСевере.ПолучитьКодБитрикс(Объект.Ссылка);
	
КонецФункции // ПолучитьКодБитрикса()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПутьКФайлуПДМ = омФайлы.ПолучитьПутьКФайлуПДМ(Объект.Ссылка);
	Если ПустаяСтрока(ПутьКФайлуПДМ) Тогда
		Элементы.ОткрытьФайлПДМ.Видимость = Ложь;
	Иначе
		
		Файл = Новый Файл(ПутьКФайлуПДМ);
		
		Элементы.ОткрытьФайлПДМ.Видимость = Файл.Существует();
		
	КонецЕсли;
	
	
	НормаВремениПКДРКД 	= Ложь;
	
	стРеквизитыИзменненыеДляВыгрузки = Новый Структура();
	стРеквизитыИзменненыеДляВыгрузки.Вставить("Проект", 			Объект.Проект);
	стРеквизитыИзменненыеДляВыгрузки.Вставить("ГабаритныйЧертеж", 	Объект.ГабаритныйЧертеж);
	стРеквизитыИзменненыеДляВыгрузки.Вставить("Наименование", 		Объект.Наименование);
	
	ИзмененКонструктор = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВPDM(Команда)
	
	Если ЭтаФорма.Модифицированность ИЛИ Параметры.Ключ.Пустая() Тогда
		ПоказатьПредупреждение(, "Необходимо сохранить композицию");
		Возврат;
	КонецЕсли;
	
	стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Объект.Ссылка, "Композиция");
	Если НЕ ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
		ПоказатьПредупреждение(, стВозврата.ОписаниеОшибки, , "Ошибка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НазначитьКодPDM(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКодаПДМ", ЭтаФорма);
	
	Заголовок = ?(Код_в_PDM = 0, "Ввод кода PDM", "Изменение кода PDM");
	
	ПоказатьВводЧисла(Оповещение, Код_в_PDM, Заголовок, 10, 0); 

КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаКодаПДМ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
	
		Возврат;	
	
	КонецЕсли;

	омКомпозицииСервер.УстановитьКодПДМДляКомпозиции(Объект.Ссылка, Результат);
	Код_в_PDM = Результат;
	
	Оповестить("Изменился_код_PDM_Композиция");

КонецПроцедуры // ПослеВводаКодаПДМ()

&НаКлиенте
Процедура НачалоТЗПриИзменении(Элемент)
	НормаВремениПКДРКД = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДнейТЗПриИзменении(Элемент)
	НормаВремениПКДРКД = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяСтадияПриИзменении(Элемент)
	НормаВремениПКДРКД = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НазначитьКодБитрикс(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		ПоказатьПредупреждение(, "Необходимо сохранить композицию");
		Возврат;
	
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКодаБитрикс", ЭтаФорма);
	
	Если ПустаяСтрока(КодВыгрузкиВБитрикс) Тогда
		
		КодБитрикс = 0;
		
	Иначе
		
		КодБитрикс = Число(КодВыгрузкиВБитрикс);
		
	КонецЕсли;
	ПоказатьВводЧисла(Оповещение, КодБитрикс, "Введите код битрикс", 5, 0);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаКодаБитрикс(КодБитрикс, ДополнительныеПараметры) Экспорт

    Если КодБитрикс = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаписатьКодБитриксаНаСервера(Строка(Объект.Ссылка.УникальныйИдентификатор()), Строка(КодБитрикс));

	КодВыгрузкиВБитрикс = омВыгрузкаCRMНаСевере.ПолучитьКодБитрикс(Объект.Ссылка);

КонецПроцедуры // ПослеВводаКодаБитрикс() 

Процедура ЗаписатьКодБитриксаНаСервера(ИдентификаторОбъекта, КодБитрикс)

	МенеджерЗаписей = РегистрыСведений.Б24_СМ_ИдентификаторыОбъектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписей.Портал 						= "pdm.8955.ru";
	МенеджерЗаписей.ТипВладельцаСмартПроцесса 	= "154";
	МенеджерЗаписей.ИдСмартПроцесса 			= "5";
	МенеджерЗаписей.ТипСущности1С 				= "Справочник";
	МенеджерЗаписей.Сущность1С 					= "Композиции";
	МенеджерЗаписей.ИдентификаторОбъекта 		= ИдентификаторОбъекта;
	МенеджерЗаписей.Идентификатор 				= КодБитрикс;
	
	МенеджерЗаписей.Записать();
	

КонецПроцедуры

&НаКлиенте
Процедура КонструкторПриИзменении(Элемент)
	ИзмененКонструктор = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФайлПДМ(Команда)
	ФайловаяСистемаКлиент.ОткрытьПроводник(ПутьКФайлуПДМ);
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеПомещениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Проект) Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ОсновноеПомещение.СписокВыбора.ЗагрузитьЗначения(ПолучитьПомещенияОбъекта(Объект.Проект));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПомещенияОбъекта(Проект)
	Возврат Справочники.Помещения.ПолучитьПомещенияОбъекта(Проект);
КонецФункции // ПолучитьПомещенияОбъекта()


