Процедура СоздатьЭлементыИРеквизитыНаФорме(ТекущаяФорма,РодительскийЭлемент) Экспорт
	
	ЭлементГруппа = СоздатьГруппуКомментарий(ТекущаяФорма, РодительскийЭлемент);
	СоздадьКомандуДобавитьКомментарий(ТекущаяФорма);
	СоздатьКнопкуДобавитьКомментарий(ТекущаяФорма, ЭлементГруппа);
	
	ИмяРеквизита = СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма);
	СоздатьЭлементФормы(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа);	
	
КонецПроцедуры 

Процедура СоздатьЭлементФормы(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа)
	
	НовыйЭлемент 				= ТекущаяФорма.Элементы.Добавить("Комментарий_авто", Тип("ПолеФормы"), ЭлементГруппа);
	НовыйЭлемент.Заголовок		= "Комментарий";
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеHTMLДокумента;
	НовыйЭлемент.ПутьКДанным 	= ИмяРеквизита;
	
КонецПроцедуры // СоздатьЭлементФормы(ТекущаяФорма)

Функция СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма)

	имяРеквизита = "Комментарий_авто";
	
	ДобавляемыеРеквизиты = Новый Массив; 
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(имяРеквизита, Новый ОписаниеТипов("Строка"))); 
	
    ТекущаяФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Возврат имяРеквизита;
	
КонецФункции // СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма)

Функция СоздатьГруппуКомментарий(ТекущаяФорма, РодительскийЭлемент)
	
	ГруппаКомментарий 						= ТекущаяФорма.Элементы.Добавить("ГруппаКомментарий_авто", Тип("ГруппаФормы"), РодительскийЭлемент);
	ГруппаКомментарий.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКомментарий.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ГруппаКомментарий.ОтображатьЗаголовок 	= Ложь; 
	ГруппаКомментарий.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Возврат ГруппаКомментарий;
	
КонецФункции

Функция СоздадьКомандуДобавитьКомментарий(ТекущаяФорма)
	
	КомандаДобавитьКомментарий 				= ТекущаяФорма.Команды.Добавить("ОбщаяКомандаКомментарий");
	КомандаДобавитьКомментарий.Заголовок 	= "Добавить комментарий";
	КомандаДобавитьКомментарий.Действие 	= "ОбщаяКомандаКомментарий";
	
	Возврат КомандаДобавитьКомментарий;
	
КонецФункции

Процедура СоздатьКнопкуДобавитьКомментарий(ТекущаяФорма, ЭлементГруппа)
	
	КнопкаДобавитьКомментарий 				= ТекущаяФорма.Элементы.Добавить("КнопкаДобавитьКомментарий", Тип("КнопкаФормы"), ЭлементГруппа);
	КнопкаДобавитьКомментарий.Заголовок 	= "Добавить комментарий";
	КнопкаДобавитьКомментарий.ИмяКоманды 	= "ОбщаяКомандаКомментарий";
	
КонецПроцедуры


