Процедура СоздатьЭлементыИРеквизитыНаФорме(ТекущаяФорма,РодительскийЭлемент) Экспорт
	
	ЭлементГруппа 		= СоздатьГруппуКомментарий(ТекущаяФорма, РодительскийЭлемент);
	ЭлементГруппаКнопки = СоздатьГруппуКнопки(ТекущаяФорма, ЭлементГруппа);
	СоздадьКомандуДобавитьКомментарий(ТекущаяФорма);
	СоздадьКомандуВсеКомментарии(ТекущаяФорма);
	СоздатьКнопкуДобавитьКомментарий(ТекущаяФорма, ЭлементГруппаКнопки);
	СоздатьКнопкуВсеКомментарии(ТекущаяФорма, ЭлементГруппаКнопки);
	
	ИмяРеквизита = СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма);
	СоздатьЭлементФормы(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа);	
	
КонецПроцедуры 

Процедура СоздатьЭлементФормы(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа)
	
	НовыйЭлемент 				= ТекущаяФорма.Элементы.Добавить("Комментарий_авто", Тип("ПолеФормы"), ЭлементГруппа);
	НовыйЭлемент.Заголовок		= "Комментарий";
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеHTMLДокумента;
	НовыйЭлемент.ПутьКДанным 	= ИмяРеквизита;
	
КонецПроцедуры // СоздатьЭлементФормы(ТекущаяФорма)

Функция СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма)

	имяРеквизита = "Комментарий_авто";
	
	ДобавляемыеРеквизиты = Новый Массив; 
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(имяРеквизита, Новый ОписаниеТипов("Строка"))); 
	
    ТекущаяФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Возврат имяРеквизита;
	
КонецФункции // СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма)

Функция СоздатьГруппуКнопки(ТекущаяФорма, РодительскийЭлемент)
	
	ГруппаКомментарий 						= ТекущаяФорма.Элементы.Добавить("ГруппаКомментарийКнопки_авто", Тип("ГруппаФормы"), РодительскийЭлемент);
	ГруппаКомментарий.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКомментарий.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ГруппаКомментарий.ОтображатьЗаголовок 	= Ложь; 
	ГруппаКомментарий.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	Возврат ГруппаКомментарий;
	
КонецФункции

Функция СоздатьГруппуКомментарий(ТекущаяФорма, РодительскийЭлемент)
	
	ГруппаКомментарий 						= ТекущаяФорма.Элементы.Добавить("ГруппаКомментарий_авто", Тип("ГруппаФормы"), РодительскийЭлемент);
	ГруппаКомментарий.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКомментарий.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ГруппаКомментарий.ОтображатьЗаголовок 	= Ложь; 
	ГруппаКомментарий.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Возврат ГруппаКомментарий;
	
КонецФункции

Функция СоздадьКомандуВсеКомментарии(ТекущаяФорма)
	
	КомандаВсеКомментарии 				= ТекущаяФорма.Команды.Добавить("ОбщаяКомандаВсеКомментарии");
	КомандаВсеКомментарии.Заголовок 	= "Все комментарии";
	КомандаВсеКомментарии.Действие 		= "ОбщаяКомандаВсеКомментарии";
	
	Возврат КомандаВсеКомментарии;
	
КонецФункции

Функция СоздадьКомандуДобавитьКомментарий(ТекущаяФорма)
	
	КомандаДобавитьКомментарий 				= ТекущаяФорма.Команды.Добавить("ОбщаяКомандаКомментарий");
	КомандаДобавитьКомментарий.Заголовок 	= "Добавить комментарий";
	КомандаДобавитьКомментарий.Действие 	= "ОбщаяКомандаКомментарий";
	
	Возврат КомандаДобавитьКомментарий;
	
КонецФункции

Процедура СоздатьКнопкуДобавитьКомментарий(ТекущаяФорма, ЭлементГруппа)
	
	КнопкаДобавитьКомментарий 				= ТекущаяФорма.Элементы.Добавить("КнопкаДобавитьКомментарий", Тип("КнопкаФормы"), ЭлементГруппа);
	КнопкаДобавитьКомментарий.Заголовок 	= "Добавить комментарий";
	КнопкаДобавитьКомментарий.ИмяКоманды 	= "ОбщаяКомандаКомментарий";
	
КонецПроцедуры

Процедура СоздатьКнопкуВсеКомментарии(ТекущаяФорма, ЭлементГруппа)
	
	КнопкаДобавитьКомментарий 				= ТекущаяФорма.Элементы.Добавить("КнопкаВсеКомментарии", Тип("КнопкаФормы"), ЭлементГруппа);
	КнопкаДобавитьКомментарий.Заголовок 	= "Все комментарии";
	КнопкаДобавитьКомментарий.ИмяКоманды 	= "ОбщаяКомандаВсеКомментарии"; 
	КнопкаДобавитьКомментарий.Пометка		= Истина;
	
КонецПроцедуры

//Колонки ДанныеКомментария Автор, Дата, Текст, ТипКомментария
Функция Получить_HTML_комментарий(ДанныеКомментария, ОтображатьТип = Ложь, СтрокаСортировки = "", ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ПустаяСтрока(СтрокаСортировки) Тогда
		ДанныеКомментария.Сортировать(СтрокаСортировки);	
	КонецЕсли;
		
	стрВозврата = омHTML.ПолучитьЗаголовокHTML();
	стрВозврата = стрВозврата + омHTML.ПолучитьHeadHTML("", 3);
	
	стрВозврата = стрВозврата + "<table>";
	стрВозврата = стрВозврата + "<tr><th style=""min-width: 70px;"">Дата</th><th>Текст</th><th style=""min-width: 65px;"">Автор</th>";
	
	Если ОтображатьТип Тогда
		стрВозврата = стрВозврата + "<th>Тип</th></tr>";
		ШаблонСтроки = "<tr><td>%1</td><td>%2</td><td>%3</td><td>%4</td></tr>";
	Иначе
		стрВозврата = стрВозврата + "</tr>";
		ШаблонСтроки = "<tr><td>%1</td><td>%2</td><td>%3</td></tr>";
	КонецЕсли; 
	
	ДополнительныеПараметры = Новый Структура("КоличествоКомментариев, КрайняяДата", ДанныеКомментария.Количество(), Дата(1, 1, 1)); 
		
	Для каждого СтрокаТаблицы Из ДанныеКомментария Цикл
		
		ТестСообщения = СтрЗаменить(СтрокаТаблицы.Текст, "&", "&amp;");
		ТестСообщения = СтрЗаменить(ТестСообщения, ">",  "&gt;");
		ТестСообщения = СтрЗаменить(ТестСообщения, "<",  "&lt;");
		ТестСообщения = СтрЗаменить(ТестСообщения, """", "&quot;");
		ТестСообщения = СтрЗаменить(ТестСообщения, "'",  "&apos;");
		
		Если ОтображатьТип Тогда
			стрВозврата = стрВозврата + СтрШаблон(ШаблонСтроки, Формат(СтрокаТаблицы.Дата, "ДФ=dd.MM.yy"), ТестСообщения, СтрокаТаблицы.Автор, СтрокаТаблицы.ТипКомментария);	
		Иначе
			стрВозврата = стрВозврата + СтрШаблон(ШаблонСтроки, Формат(СтрокаТаблицы.Дата, "ДФ=dd.MM.yy"), ТестСообщения, СтрокаТаблицы.Автор);	
		КонецЕсли; 
		
		Если СтрокаТаблицы.Дата > ДополнительныеПараметры.КрайняяДата Тогда
			ДополнительныеПараметры.КрайняяДата = СтрокаТаблицы.Дата;
		КонецЕсли;
		
	КонецЦикла;
	
	стрВозврата = стрВозврата + "</table>";
	
	стрВозврата = стрВозврата + омHTML.ПолучитьХвостHTML();
	
	Возврат стрВозврата;
	
	
КонецФункции // Получить_HTML_комментарий()
