&НаКлиенте
Функция РасчетНачалаДатыПроизводства(стДаты) Экспорт

	ПустаяДата = Дата(1,1,1);
	
	СекундВСутках = 24 * 3600;
	
	МинДата = ПустаяДата;
	
	НормаВремени 	= 0;
	ДатаОкончания 	= ПустаяДата;
	ДатаНачала 		= ПустаяДата;         
	
	Если НЕ стДаты.КрайСтолярка = ПустаяДата Тогда
		НормаВремени 	= стДаты.НормаВремени_столярка;
		ДатаНачала 		= стДаты.КрайСтолярка - стДаты.НормаВремени_столярка * СекундВСутках;
		ДатаОкончания 	= стДаты.КрайСтолярка;
	КонецЕсли;
	
	Если НЕ стДаты.КрайПроизводства = ПустаяДата Тогда
		НормаВремени 	= стДаты.НормаВремениПроизводства;
		ДатаНачала 		= стДаты.КрайПроизводства - стДаты.НормаВремениПроизводства * СекундВСутках;
		ДатаОкончания 	= стДаты.КрайПроизводства;
	КонецЕсли;
	
	Если НЕ стДаты.КрайМалярка = ПустаяДата Тогда
		текДатаНачала = стДаты.КрайМалярка - стДаты.НормаВремени_малярка * СекундВСутках;
		
		Если ДатаНачала = ПустаяДата ИЛИ текДатаНачала < ДатаНачала Тогда
			НормаВремени 	= стДаты.НормаВремени_малярка;
			ДатаОкончания 	= стДаты.КрайМалярка;
			ДатаНачала     	= текДатаНачала
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ стДаты.КрайПодрядчик = ПустаяДата Тогда
		текДатаНачала = стДаты.КрайПодрядчик - стДаты.НормаВремени_подрядчик * СекундВСутках;
		
		Если текДатаНачала = ПустаяДата И текДатаНачала < ДатаНачала Тогда
			НормаВремени 	= стДаты.НормаВремени_подрядчик;
			ДатаОкончания 	= стДаты.КрайПодрядчик;
			ДатаНачала     	= текДатаНачала
		КонецЕсли;
	КонецЕсли;
	
    Если НЕ ДатаНачала = ПустаяДата Тогда
	
		Возврат омДаты.ДобавитьДниСУчетомВыходных(ДатаОкончания, -НормаВремени);	
	
	КонецЕсли; 
	
	Возврат ПустаяДата;
КонецФункции // РасчетНачалаДатыПроизводства()         

&НаКлиенте
Функция РасчетНачалаДаты(Край = Неопределено, Начало = Неопределено, Период) Экспорт
	Если Период = 0 Тогда
		Возврат ?(ЗначениеЗаполнено(Край), Край, Начало);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Край) Тогда
		Возврат омДаты.ДобавитьДниСУчетомВыходных(Край, -Период);
	ИначеЕсли ЗначениеЗаполнено(Начало) Тогда
		Возврат омДаты.ДобавитьДниСУчетомВыходных(Начало, Период);
	КонецЕсли;
	
	Возврат Дата(1,1,1);
	
КонецФункции // РасчетНачалаДатыПроизводства()   
