
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ИзделияУПодрядчика Расход
	Движения.ИзделияУПодрядчика.Записывать = Истина;
	Для Каждого ТекСтрокаИзделияЗаказчика Из ИзделияЭлемент Цикл
		Движение = Движения.ИзделияУПодрядчика.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Подрядчик = Подрядчик;
		Движение.ИзделиеЭлемент = ТекСтрокаИзделияЗаказчика.ИзделиеЭлемент;
		Движение.Количество = 1;
	КонецЦикла;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияУПодрядчикаОстатки.ИзделиеЭлемент КАК ИзделиеЭлемент,
		|	ИзделияУПодрядчикаОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ИзделияУПодрядчика.Остатки(&МоментВремени, ИзделиеЭлемент В (&ИзделияЭлемент)) КАК ИзделияУПодрядчикаОстатки
		|ГДЕ
		|	ИзделияУПодрядчикаОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("ИзделияЭлемент", ИзделияЭлемент.ВыгрузитьКолонку("ИзделиеЭлемент"));
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(),ВидГраницы.Включая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Отказ = Истина;
		Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
			стрОшибка = "Изделие "; 
		Иначе
			стрОшибка = "Изделия: "; 
		КонецЕсли;
		
		флПервоеИзделие = Истина;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если флПервоеИзделие Тогда
				флПервоеИзделие = НЕ флПервоеИзделие;
			Иначе
			    стрОшибка = стрОшибка + ", ";
			КонецЕсли;
			стрОшибка = стрОшибка + """" +ВыборкаДетальныеЗаписи.ИзделиеЗаказчика + """";
		КонецЦикла;
		Сообщить(стрОшибка + " не находятся у подрядчика " + Подрядчик,СтатусСообщения.Важное);
		Возврат;
	КонецЕсли; 
	
	
	// регистр ИзделияУПодрядчикаПлан 
	
	Движения.ИзделияУПодрядчикаПлан.Записывать = Истина;
	Для Каждого ТекСтрокаИзделияЗаказчика Из ИзделияЭлемент Цикл
		Движение = Движения.ИзделияУПодрядчикаПлан.Добавить();
		Движение.Подрядчик = Подрядчик;
		Движение.ИзделиеЭлемент = ТекСтрокаИзделияЗаказчика.ИзделиеЭлемент;
		Движение.ДатаВозвратаФакт = Дата;
	КонецЦикла;

КонецПроцедуры
