 
Процедура РасчитатьКрайююДатуГотовностиНаСервере(мПомещения) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(ДатыКомплекта.НачалоПКД) КАК НачалоПКД,
		|	ИзделияЭлемент.Помещения КАК Помещения
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияЭлемент КАК ИзделияЭлемент
		|			ПО ИзделияЭлемент.Ссылка = ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент
		|		ПО ДатыКомплекта.Комплект = ИзделияКомплектИзделияЭлемент.Ссылка
		|ГДЕ
		|	ИзделияЭлемент.Помещения В(&Помещения)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияЭлемент.Помещения";
	
	Запрос.УстановитьПараметр("Помещения", мПомещения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
КонецПроцедуры

