&НаСервере
Функция ПолучитьИсториюЦен(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЦеныНоменклатурыДокументов.Документ = &Номенклатура
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЦеныНоменклатурыДокументов.Документ
		|	КОНЕЦ КАК Документ,
		|	ЦеныНоменклатурыДокументов.Дата КАК Дата,
		|	ЦеныНоменклатурыДокументов.Цена КАК Цена,
		|	ЦеныНоменклатурыДокументов.Автор КАК Автор
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатурыДокументов КАК ЦеныНоменклатурыДокументов
		|ГДЕ
		|	ЦеныНоменклатурыДокументов.Номенклатура = &Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Возврат Запрос.Выполнить().Выгрузить();
	

КонецФункции // ПолучитьИсториюЦен()
