Функция ПолучитьДанныеОбразца(Образец) Экспорт
	
	ДанныеОбразца = Новый Структура("Материалы, Наименование, Обработка, Код, ШК", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Образцы.Наименование КАК Наименование,
		|	Образцы.Обработка КАК Обработка,
		|	Образцы.Код КАК Код
		|ИЗ
		|	Справочник.Образцы КАК Образцы
		|ГДЕ
		|	Образцы.Ссылка = &Образец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбразецМатериалы.Количество КАК Количество,
		|	ОбразецМатериалы.Примечание КАК Примечание,
		|	ОбразецМатериалы.Номенклатура.Представление КАК Номенклатура,
		|	ОбразецМатериалы.Единица.Представление КАК Единица
		|ИЗ
		|	Справочник.Образцы.Материалы КАК ОбразецМатериалы
		|ГДЕ
		|	ОбразецМатериалы.Ссылка = &Образец";
	
	Запрос.УстановитьПараметр("Образец", Образец);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеОбразца, Выборка);
		ДанныеОбразца.ШК = омШрихкодыНаСереверКлиенте.ПолучитьПрефиксШтрихкодаПоТипу(Образец) + Формат(Выборка.Код, "ЧЦ=9; ЧВН=; ЧГ=0");
		
		ДанныеОбразца.Наименование = СтрЗаменить(ДанныеОбразца.Наименование, Символы.ВК, "");
		ДанныеОбразца.Наименование = СтрЗаменить(ДанныеОбразца.Наименование, Символы.ПС, "");
		ДанныеОбразца.Наименование = "Образец № " + Формат(ДанныеОбразца.Код ,"ЧГ=0") + " " + ДанныеОбразца.Наименование;
		
		ДанныеОбразца.Обработка = СтрЗаменить(ДанныеОбразца.Обработка, Символы.ВК, ""); 
		ДанныеОбразца.Обработка = СтрЗаменить(ДанныеОбразца.Обработка, Символы.ПС, "");
		
	КонецЦикла;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДаныеМатериала = Новый Структура("Номенклатура, Единица, Примечание, Количество", );
		ЗаполнитьЗначенияСвойств(СтруктураДаныеМатериала, Выборка);
		ДанныеОбразца.Материалы.Добавить(СтруктураДаныеМатериала);
		
	КонецЦикла;
	
    Возврат ДанныеОбразца;
КонецФункции // ПолучитьДанныеОбразца()

Функция ПолучитьСтркутуруНастроекПечати() Экспорт

	СтруктураНастроекПечати = Новый Структура();
	
	СтруктураНастроекПечати.Вставить("ТекстНаименование", 			"");
	СтруктураНастроекПечати.Вставить("РазмерШрифтаНаименования", 	10);
	СтруктураНастроекПечати.Вставить("РазмерШКпоВысоте", 			5);
	СтруктураНастроекПечати.Вставить("РазмерШКпоШирине", 			12);
	СтруктураНастроекПечати.Вставить("РазмерШрифтаОбработка",		8);
	СтруктураНастроекПечати.Вставить("РазмерШрифтаМатериалы", 		8);
	СтруктураНастроекПечати.Вставить("ПолужирныйНаименование", 		Истина);
	СтруктураНастроекПечати.Вставить("Материалы",					Истина);
	СтруктураНастроекПечати.Вставить("Наименование", 				Истина);
	СтруктураНастроекПечати.Вставить("Обработка",					Истина);
	СтруктураНастроекПечати.Вставить("ВыводитьРамку", 				Истина);
	СтруктураНастроекПечати.Вставить("ТекстНаШтрихКоде", 			Истина);
	СтруктураНастроекПечати.Вставить("ВыводитьШК", 					Истина);
	СтруктураНастроекПечати.Вставить("ПолужирныйОбработка", 		Ложь);
	СтруктураНастроекПечати.Вставить("ПолужирныйМатериалы", 		Ложь);
	
	
	Возврат СтруктураНастроекПечати;

КонецФункции // ПолучитьСтркутураНстроекПечати()    


Функция ПолучитьВариантыНастроек() Экспорт

	СтруктураНастроекПечати = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК НаименованиеВарианта,
		|	НастройкиПроекта.НомерНастройки КАК НомерНастройки
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПроекта КАК НастройкиПроектаВарианты
		|		ПО НастройкиПроекта.НомерНастройки = НастройкиПроектаВарианты.НомерНастройки
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = ""ВариантыНастроекПечатиОбразцов""
		|	И НастройкиПроектаВарианты.ИмяНастройки В(&МассивНастроекПечатьОбразца)";
	
	Запрос.УстановитьПараметр("МассивНастроекПечатьОбразца", ПолучитьМассивНастроекПечатьОбразца());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	
	Возврат СтруктураНастроекПечати;

КонецФункции // ПолучитьСтркутураНстроекПечати() 

Функция ПолучитьМассивНастроекПечатьОбразца()

	

КонецФункции // ПолучитьМассивНастроекПечатьОбразца()

Функция СформироватьТаблицуНаСервере(Образец, СтркутураНастроекПечати, Пример, ДанныеОбразца = Неопределено) Экспорт
	
	Если ДанныеОбразца = Неопределено Тогда
		ДанныеОбразца = ПолучитьДанныеОбразца(Образец);	
	КонецЕсли;
	
	Пример.Очистить();
	СтруктрураОбъеденненыхЯчеек = Новый Структура("Наименование, Обработка, Материалы, МаксимальнаяШирина", 2, 2, 2, 5);
	
	мШиринаКолонок = Новый Массив(?(СтркутураНастроекПечати.Материалы, 5, 2));
	мШиринаКолонок[0] = 1;
	мШиринаКолонок[1] = 20;
	
	Если СтркутураНастроекПечати.Материалы Тогда
		мШиринаКолонок[2] = 6;
		мШиринаКолонок[3] = 6;
		мШиринаКолонок[4] = 30;
	КонецЕсли;
	
	стПараметровОбласти = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров(Истина);
	стПараметровОбласти.НомерСтроки 			= 2;
	стПараметровОбласти.НомерКолонки 			= 2;
	стПараметровОбласти.ДлинаОбласти 			= СтруктрураОбъеденненыхЯчеек.Наименование;
	стПараметровОбласти.ВысотаОбласти 			= 1;
	стПараметровОбласти.РазмерШрифта 			= СтркутураНастроекПечати.РазмерШрифтаНаименования; 
	стПараметровОбласти.Полужирный     			= СтркутураНастроекПечати.ПолужирныйНаименование; 
	стПараметровОбласти.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	стПараметровОбласти.РазмещениеТекста 		= ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	Если СтркутураНастроекПечати.Наименование Тогда
		Пример.Вывести(ПолучитьТаблицуНаименовнаия(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок, СтркутураНастроекПечати));
	КонецЕсли;
	
	Если СтркутураНастроекПечати.ВыводитьШК Тогда
		Пример.Вывести(ПолучитьШК(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, СтркутураНастроекПечати));
	КонецЕсли;
	
	Если СтркутураНастроекПечати.Обработка Тогда
		стПараметровОбласти.РазмерШрифта 		= СтркутураНастроекПечати.РазмерШрифтаОбработка; 
		стПараметровОбласти.Полужирный     		= СтркутураНастроекПечати.ПолужирныйОбработка; 
		Пример.Вывести(ПолучитьТаблицуОбработка(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок));
	КонецЕсли;
	
	Если СтркутураНастроекПечати.Материалы Тогда
		стПараметровОбласти.РазмерШрифта 		= СтркутураНастроекПечати.РазмерШрифтаМатериалы; 
		стПараметровОбласти.Полужирный     		= СтркутураНастроекПечати.ПолужирныйМатериалы;
		стПараметровОбласти.РазмещениеТекста	= ТипРазмещенияТекстаТабличногоДокумента.Обрезать;
		Пример.Вывести(ПолучитьТаблицуМатериалы(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок));
	КонецЕсли;
	
	Если СтркутураНастроекПечати.ВыводитьРамку Тогда
		омТабличныйДокументКлиентСервер.ОбвестиОбласть(Пример);	
	КонецЕсли;
	
Конецфункции

Функция ПолучитьТаблицуМатериалы(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок)

	ТабДок = Новый ТабличныйДокумент;
	Если ДанныеОбразца.Материалы.Количество() = 0 Тогда
	    Возврат ТабДок;
	КонецЕсли;
	
	ЛинияГраницы = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1); 
	стПараметровОбласти.ГраницаСлева			= ЛинияГраницы;
	стПараметровОбласти.ГраницаСправа			= ЛинияГраницы;
	стПараметровОбласти.ГраницаСверху			= ЛинияГраницы;
	стПараметровОбласти.ГраницаСнизу			= ЛинияГраницы;
	стПараметровОбласти.ЦветРамки				= "000000000";
	стПараметровОбласти.ДлинаОбласти 			= 1;		
	
	Для х = 0 По ДанныеОбразца.Материалы.Количество() - 1 Цикл
		
		ДанныеСтроки = ДанныеОбразца.Материалы[х];
		
		стПараметровОбласти.НомерКолонки = 2;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Номенклатура;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		стПараметровОбласти.НомерКолонки = 3;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Количество;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		стПараметровОбласти.НомерКолонки = 4;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Единица;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		стПараметровОбласти.НомерКолонки = 5;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Примечание;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		
		стПараметровОбласти.НомерСтроки = стПараметровОбласти.НомерСтроки + 1;
		
	КонецЦикла;
	
	Возврат ТабДок;

КонецФункции // ПолучитьТаблицуНаименовнаия()

Функция ПолучитьТаблицуОбработка(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок)

	ПоискРазмера = Истина;
	РазмерНайден = Ложь;
	ПоследнийРаз = Ложь;
	
	Пока ПоискРазмера Цикл
		
		Если ПоследнийРаз Тогда
			ПоискРазмера = Ложь;
		КонецЕсли;
		
		ТабДок = Новый ТабличныйДокумент;
		омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(ТабДок, мШиринаКолонок);
		Область = омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		ВысотаПустойОбласти = ВысотаОбластиВмм(Область, ТабДок);
		Область.Текст 		= ДанныеОбразца.Обработка;
		
		Если ПоискРазмера Тогда
			
			ВысотаСТекстом = ВысотаОбластиВмм(Область, ТабДок);
			
			Если ВысотаПустойОбласти < ВысотаСТекстом Тогда
				СтруктрураОбъеденненыхЯчеек.Обработка = СтруктрураОбъеденненыхЯчеек.Обработка + 1;
				Если СтруктрураОбъеденненыхЯчеек.Обработка > СтруктрураОбъеденненыхЯчеек.МаксимальнаяШирина Тогда
					Прервать;	
				КонецЕсли;

				Если РазмерНайден Тогда
					ПоследнийРаз = Истина;
				КонецЕсли;
				
			Иначе
				Если СтруктрураОбъеденненыхЯчеек.Обработка = 1 Тогда
					Прервать;	
				КонецЕсли;
				РазмерНайден = Истина;
				СтруктрураОбъеденненыхЯчеек.Обработка = СтруктрураОбъеденненыхЯчеек.Обработка - 1;
			КонецЕсли;
			
			стПараметровОбласти.ДлинаОбласти = СтруктрураОбъеденненыхЯчеек.Обработка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции // ПолучитьТаблицуНаименовнаия()

Функция ПолучитьШК(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, СтркутураНастроекПечати)
	
	КоличествоМиллиметровВПикселе = омТабличныйДокументСерверПовтор.ПолучитьКоличествоМиллиметровВПикселе();
	ТабДок = Новый ТабличныйДокумент;
	
	РисунокШтрихкода = ТабДок.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка); 
	РисунокШтрихкода.ВыводитьНаПечать 		= Истина;
	РисунокШтрихкода.Высота					= СтркутураНастроекПечати.РазмерШКпоВысоте / КоличествоМиллиметровВПикселе;
	РисунокШтрихкода.Ширина					= СтркутураНастроекПечати.РазмерШКпоШирине / КоличествоМиллиметровВПикселе; 
	
	
	ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	ПараметрыШтрихкода.Ширина 				= Окр(РисунокШтрихкода.Ширина * 3);
	ПараметрыШтрихкода.Высота 				= Окр(РисунокШтрихкода.Высота * 3);
	ПараметрыШтрихкода.Штрихкод				= ДанныеОбразца.ШК;
	ПараметрыШтрихкода.ТипКода 				= 4;
	ПараметрыШтрихкода.РазмерШрифта 		= 14;
	ПараметрыШтрихкода.СохранятьПропорции 	= Истина;
	ПараметрыШтрихкода.ОтображатьТекст 		= СтркутураНастроекПечати.ТекстНаШтрихКоде;
	
	РисунокШтрихкода.Картинка 		= ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода).Картинка;
	РисунокШтрихкода.РазмерКартинки = РазмерКартинки.Пропорционально;
	РисунокШтрихкода.ГраницаСверху  = Ложь;
	РисунокШтрихкода.ГраницаСлева  	= Ложь;
	РисунокШтрихкода.ГраницаСнизу  	= Ложь;
	РисунокШтрихкода.ГраницаСправа  = Ложь;
	
	Возврат ТабДок;

КонецФункции // ПолучитьШК()

Функция ПолучитьТаблицуНаименовнаия(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок, СтркутураНастроекПечати)
	
	ПоискРазмера = Истина;
	РазмерНайден = Ложь;
	ПоследнийРаз = Ложь;
	
	Пока ПоискРазмера Цикл
		
		Если ПоследнийРаз Тогда
			ПоискРазмера = Ложь;
		КонецЕсли;
		
		ТабДок = Новый ТабличныйДокумент;
		омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(ТабДок, мШиринаКолонок);
		Область = омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		ВысотаПустойОбласти = ВысотаОбластиВмм(Область, ТабДок);
		Область.Текст 		= СтркутураНастроекПечати.ТекстНаименование;
		
		Если НЕ ПоследнийРаз Тогда
			
			ВысотаСТекстом = ВысотаОбластиВмм(Область, ТабДок);
			
			Если ВысотаПустойОбласти < ВысотаСТекстом Тогда
				СтруктрураОбъеденненыхЯчеек.Наименование = СтруктрураОбъеденненыхЯчеек.Наименование + 1;
				Если СтруктрураОбъеденненыхЯчеек.Наименование > СтруктрураОбъеденненыхЯчеек.МаксимальнаяШирина Тогда
					Прервать;	
				КонецЕсли;
				Если РазмерНайден Тогда
					ПоследнийРаз = Истина;
				КонецЕсли;
			Иначе
				Если СтруктрураОбъеденненыхЯчеек.Наименование = 1 Тогда
					Прервать;	
				КонецЕсли;
				РазмерНайден = Истина;
				СтруктрураОбъеденненыхЯчеек.Наименование = СтруктрураОбъеденненыхЯчеек.Наименование - 1;
			КонецЕсли;
			
			стПараметровОбласти.ДлинаОбласти = СтруктрураОбъеденненыхЯчеек.Наименование;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДок;

КонецФункции // ПолучитьТаблицуНаименовнаия()


Функция ВысотаОбластиВмм(пОбласть, пТабДок)
    
    Надпись = пТабДок.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);    
    Надпись.Расположить(пОбласть);    
    Высота = Надпись.Высота;    
    пТабДок.Рисунки.Удалить(Надпись);
    
    Возврат(Высота);
    
КонецФункции
