Функция РазобратьСтрокуCSV(СтрокаФайла,Разделитель = ";", НижнийРегистр = Ложь) Экспорт
    ПредыдущийСимвол = Неопределено;
    ОткрытаСтрока = Ложь;
    мВозврата = Новый Массив;
    ДлинаСтроки = СтрДлина(СтрокаФайла);
    стрЗначение = "";
    Для х = 1 По ДлинаСтроки Цикл
        текСимвол = Сред(СтрокаФайла,х,1);
        Если текСимвол = """" Тогда
            Если ОткрытаСтрока Тогда
                Если ПредыдущийСимвол = """" Тогда
                    стрЗначение = стрЗначение + """";
                Иначе
                    ПредыдущийСимвол = """";    
                    Продолжить;
                КонецЕсли;     
            Иначе
                ОткрытаСтрока = Истина;
                Продолжить;
            КонецЕсли; 
        Иначе
            Если ПредыдущийСимвол = """" Тогда
                Если ОткрытаСтрока Тогда
                    ОткрытаСтрока = Ложь;
                КонецЕсли;     
            КонецЕсли;
            Если ОткрытаСтрока Тогда
                стрЗначение = стрЗначение + текСимвол;
                Продолжить;
            КонецЕсли;
            Если текСимвол = Разделитель Тогда
                мВозврата.Добавить(стрЗначение);    
                стрЗначение = "";
            Иначе
                стрЗначение = стрЗначение + текСимвол;
            КонецЕсли;   
		КонецЕсли; 
		ПредыдущийСимвол = текСимвол;
	КонецЦикла;
	
	Если СтрДлина(стрЗначение) > 0 Тогда
		
		мВозврата.Добавить(?(НижнийРегистр,НРег(стрЗначение),стрЗначение));
		
	КонецЕсли;
	
    Возврат(мВозврата);
КонецФункции // РазобратьСтрокуCSV(СтрокаФайла)()
