//	ЭлементHTML.setAttribute("onclick", "alert('Координаты');");	
&НаКлиенте
Функция ДобавитьКоманду(ПолеHTML, idЭлементаHTML, ТекстСкрипт, ИмяКоманды) Экспорт

	ЭлементHTML = НайтиЭлемент(ПолеHTML, idЭлементаHTML);
	
	Если ЭлементHTML = Неопределено Тогда
	
		Возврат Неопределено;	
	
	КонецЕсли;               
	
	
	ЭлементHTML.setAttribute(ИмяКоманды, ТекстСкрипт);
	
	Возврат ЭлементHTML; 
	
КонецФункции // ДобавитьКоманду() 

&НаКлиенте
Функция ПервыйБраузерДокументСформирован(ПолеHTML) Экспорт
        
	ДокументПервогоБраузера = ПолеHTML;
	ОкноПервогоБраузера = Неопределено;
	
	Попытка
		
		ОкноПервогоБраузера     = ДокументПервогоБраузера.Document.parentWindow; // IE
		
	Исключение
		
	КонецПопытки;
	
	Если ОкноПервогоБраузера = Неопределено Тогда
		
		ОкноПервогоБраузера = ДокументПервогоБраузера.Документ.defaultView; // Прочие браузеры
		
	КонецЕсли;
	
	//ОкноПервогоБраузера.createButtons(МассивКнопокПервогоБраузера);
	
	Возврат ОкноПервогоБраузера;

КонецФункции

&НаКлиенте
Функция НайтиЭлемент(ПолеHTML, idЭлементаHTML) Экспорт 

	Возврат ПолеHTML.document.getElementById(idЭлементаHTML);
	

КонецФункции // НайтиЭлемент()

&НаКлиенте
Функция ДесериализоватьИзJSON(СтрокаJSON) Экспорт
    
    #Если ВебКлиент Тогда
        ДесериализованныйОбъект = ом_JS_Сервере.ДесериализоватьИзJSONНаСервере(СтрокаJSON);
    #Иначе
        ЧтениеJSON = Новый ЧтениеJSON(); 
        ЧтениеJSON.УстановитьСтроку(СтрокаJSON); 
        ДесериализованныйОбъект = ПрочитатьJSON(ЧтениеJSON); 
        ЧтениеJSON.Закрыть();
    #КонецЕсли    
    
    Возврат ДесериализованныйОбъект;
    
КонецФункции

