 &НаКлиенте
Перем НачальноеЗначениеАктуальнаяСмета,НачальноеЗначениеИзделияЗаказчика,НуженПерерасчет;


&НаКлиенте
Процедура ОборудованиеИТехникаОборудованиеПриИзменении(Элемент)
		ТекущаяСтрока = Элементы.ОборудованиеИТехника.ТекущиеДанные;
	//ТекущаяСтрока.Цена = ВернутьЦенуМатериала(ТекущаяСтрока.Оборудование); 
	Если ТекущаяСтрока.Количество = 0 Тогда
	ТекущаяСтрока.Количество = 1; 
	КонецЕсли;
	ТекущаяСтрока.Стоимость=ТекущаяСтрока.Цена*ТекущаяСтрока.Количество; 

КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеИТехникаКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ОборудованиеИТехника.ТекущиеДанные;
	Если ТекущаяСтрока.Цена = 0 Тогда
	//ТекущаяСтрока.Цена = ВернутьЦенуМатериала(ТекущаяСтрока.Оборудование); 
	КонецЕсли;
	ТекущаяСтрока.Стоимость=ТекущаяСтрока.Цена*ТекущаяСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеИТехникаЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ОборудованиеИТехника.ТекущиеДанные;
	Если ТекущаяСтрока.Количество = 0 Тогда
	ТекущаяСтрока.Количество = 1; 
	КонецЕсли;
	ТекущаяСтрока.Стоимость=ТекущаяСтрока.Цена*ТекущаяСтрока.Количество;
КонецПроцедуры
&НаКлиенте
Процедура ФурнетураОборудованиеПриИзменении(Элемент)
	ТД = Элементы.Фурнитура.ТекущиеДанные;
	
	стПараметрыНоменклатуры = ПолучитьПараметрыНоменклатуры(ТД.Фурнитура);
	
	ТД.СтатьяЗатрат = стПараметрыНоменклатуры.стСтатьяОсновной.СтатьяЗатрат;	
	ТД.Основной 	= стПараметрыНоменклатуры.стСтатьяОсновной.Основной;
	ТД.Цена 		= стПараметрыНоменклатуры.Цена;
	
	Если ТД.Количество = 0 Тогда
		ТД.Количество = 1; 
	КонецЕсли;
	ТД.Стоимость = ТД.Цена	*	ТД.Количество;
	
	ЗаполнитьРасценки();
КонецПроцедуры

&НаКлиенте
Процедура ФурнетураКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Фурнитура.ТекущиеДанные;
	Если ТекущаяСтрока.Цена = 0 Тогда
	//ТекущаяСтрока.Цена = ВернутьЦенуМатериала(ТекущаяСтрока.Фурнитура); 
	КонецЕсли;
	ТекущаяСтрока.Стоимость=ТекущаяСтрока.Цена*ТекущаяСтрока.Количество; 
	ЗаполнитьРасценки()
КонецПроцедуры

&НаКлиенте
Процедура ФурнетураЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Фурнитура.ТекущиеДанные;
	Если ТекущаяСтрока.Количество = 0 Тогда
	ТекущаяСтрока.Количество = 1; 
	КонецЕсли;
	ТекущаяСтрока.Стоимость=ТекущаяСтрока.Цена*ТекущаяСтрока.Количество;
КонецПроцедуры

&НаСервере
Функция ПечатьКалькуляцииНаСервере()      
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.ИзделиеПредварительный.ПолучитьМакет("Макет");

	Область = Макет.ПолучитьОбласть("Шапка1");
	Область.Параметры.Изделие 		= Строка(Объект.Изделие);
	Область.Параметры.Объект 		= Объект.Изделие.Проект;
	Область.Параметры.Комментарий 	= Объект.Комментарий;
	ТабДок.Вывести(Область); 

	Область = Макет.ПолучитьОбласть("Строка1");
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("Работа"	,Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Цена"		,Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("Ед"		,Новый ОписаниеТипов("Строка"));
	
	Для Каждого Стр Из Объект.Материалы Цикл
		
		Область.Параметры.Материалы 		= Стр.Номенклатура; 
		Область.Параметры.Кол 				= Строка(Стр.Количество) + " " + Стр.ЕдиницыИзмерения;
		Область.Параметры.Цена 				= Стр.Цена;
		Область.Параметры.СуммаМатериала	= Стр.Сумма;
		ТабДок.Вывести(Область);
		
	КонецЦикла;	
	
	Область = Макет.ПолучитьОбласть("Шапка2");
	
	ТабДок.Вывести(Область);	
	Область = Макет.ПолучитьОбласть("Строка2");	 
	Для каждого Стр2 из тз цикл
		Область.Параметры.Обработка = Стр2.Работа; 
		Область.Параметры.Кол = Строка(Окр(Стр2.Количество,2)) + " " + Строка(Стр2.Ед);
		Область.Параметры.Цена = Стр2.Цена;
		Область.Параметры.СуммаОбработки =  Окр(Стр2.Количество * Стр2.Цена,2);
		ТабДок.Вывести(Область);
	КонецЦикла;
	
	
	
	Область = Макет.ПолучитьОбласть("Шапка3");
	Область.Параметры.СуммаЗИ = Объект.ЗаказныеИзделия.Итог("Стоимость");
	Область.Параметры.СуммаФ = Объект.Фурнитура.Итог("Стоимость");
	Область.Параметры.СуммаОТ = Объект.ОборудованиеИТехника.Итог("Стоимость");
	ТабДок.Вывести(Область);   
	
	Область = Макет.ПолучитьОбласть("Строка3");
	Для Каждого Стр3 Из Объект.КоммерческиеРасходы Цикл
		Область.Параметры.Усл = Стр3.КоммерческиеРасходы;	
		Область.Параметры.СуммаУСЛ = Стр3.Стоимость;		
		ТабДок.Вывести(Область); 
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабДок.ПолеСверху 			= 5;
	ТабДок.ПолеСлева 			= 10;
	ТабДок.ПолеСнизу 			= 1;
	ТабДок.ПолеСправа 			= 2;
	ТабДок.Автомасштаб 			= Истина;
	ТабДок.ТолькоПросмотр 		= Истина;
	ТабДок.ОтображатьЗаголовки 	= Истина;
	табдок.ОтображатьСетку 		= Ложь;
	Возврат ТабДок; 
КонецФункции
	
&НаКлиенте
Процедура ПечатьКалькуляции(Команда)
	ТабДок = ПечатьКалькуляцииНаСервере();
	ТабДок.Показать();
КонецПроцедуры

Функция ПечатьКалькуляцииНаСервереСводно() 
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.ИзделиеПредварительный.ПолучитьМакет("Макет");
	
	Область = Макет.ПолучитьОбласть("Шапка1");
	Область.Параметры.Изделие 		= Объект.Изделие;
	Область.Параметры.Объект 		= Объект.Изделие.Проект;
	Область.Параметры.Комментарий 	= Объект.Комментарий;
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Строка1");
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("Работа"	,Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Цена"		,Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("Сумма"		,Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("Ед"		,Новый ОписаниеТипов("Строка"));     
	
	тз1 = Новый ТаблицаЗначений;
	тз1.Колонки.Добавить("Материалы"	,Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	тз1.Колонки.Добавить("Цена"			,Новый ОписаниеТипов("Число"));
	тз1.Колонки.Добавить("Сумма"		,Новый ОписаниеТипов("Число"));
	тз1.Колонки.Добавить("Количество"	,Новый ОписаниеТипов("Число"));
	тз1.Колонки.Добавить("Ед"			,Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения")); 
	Для Каждого Стр Из Объект.Материалы Цикл
		
		НоваяСтрока = тз1.Добавить();
		НоваяСтрока.Материалы 	= Стр.Номенклатура; 
		НоваяСтрока.Количество 	= Стр.Количество;
		НоваяСтрока.Ед 			= Стр.ЕдиницыИзмерения;
		НоваяСтрока.Цена 		= Стр.Цена;
		НоваяСтрока.Сумма 		= Стр.Сумма;
		
	КонецЦикла;	
	
	Для Каждого Стр Из Объект.Детали Цикл
		
		Если Стр.Площадь > 0 И ЗначениеЗаполнено(Стр.Обработка) Тогда
			НоваяСтрока = тз.Добавить();
			НоваяСтрока.Работа 		= Строка(Стр.Обработка);
			НоваяСтрока.Ед 			= "м2";
			НоваяСтрока.Количество 	= Стр.Площадь * ?(ЗначениеЗаполнено(Стр.МатериалПокрытия1), 2, 1);
		ИначеЕсли Стр.Длина > 0 И ЗначениеЗаполнено(Стр.Обработка) Тогда
			НоваяСтрока = тз.Добавить();
			НоваяСтрока.Работа 		= Строка(Стр.Обработка);
			НоваяСтрока.Ед 			= "м";
			НоваяСтрока.Количество 	= Стр.Длина;
		КонецЕсли;
		
	КонецЦикла;	
	
	тз1.Свернуть("Материалы,Ед,Цена","Количество");
	Для каждого Стр1 из тз1 цикл
		Область.Параметры.Материалы 		= Стр1.Материалы; 
		Область.Параметры.Кол 				= Строка(Окр(Стр1.Количество,2)) + " " + Строка(Стр1.Ед);
		Область.Параметры.Цена 				= Стр1.Цена;
		Область.Параметры.СуммаМатериала 	= Окр(Стр1.Количество * Стр1.Цена,2);
		ТабДок.Вывести(Область);
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Шапка2");
	ТабДок.Вывести(Область);	
	
	Область = Макет.ПолучитьОбласть("Строка2");	 
	тз.Свернуть("Работа,Ед,Цена","Количество");
	Для каждого Стр2 из тз цикл
		Область.Параметры.Обработка 		= Стр2.Работа; 
		Область.Параметры.Кол 				= Строка(Окр(Стр2.Количество,2)) + " " + Строка(Стр2.Ед);
		Область.Параметры.Цена 				= Стр2.Цена;
		Область.Параметры.СуммаОбработки 	= Окр(Стр2.Количество * Стр2.Цена,2);
		ТабДок.Вывести(Область);
	КонецЦикла;
	
	
	
	Область = Макет.ПолучитьОбласть("Шапка3");
	Область.Параметры.СуммаЗИ 	= Объект.ЗаказныеИзделия.Итог("Стоимость");
	Область.Параметры.СуммаФ 	= Объект.Фурнитура.Итог("Стоимость");
	Область.Параметры.СуммаОТ 	= Объект.ОборудованиеИТехника.Итог("Стоимость");
	ТабДок.Вывести(Область);   
	
	Область = Макет.ПолучитьОбласть("Строка3");
	Для Каждого Стр3 Из Объект.КоммерческиеРасходы Цикл
		Область.Параметры.Усл 		= Стр3.Услуги;	
		Область.Параметры.СуммаУСЛ 	= Стр3.Стоимость;		
		ТабДок.Вывести(Область); 
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабДок.ПолеСверху 			= 5;
	ТабДок.ПолеСлева 			= 10;
	ТабДок.ПолеСнизу 			= 1;
	ТабДок.ПолеСправа 			= 2;
	ТабДок.Автомасштаб 			= Истина;
	ТабДок.ТолькоПросмотр 		= Истина;
	ТабДок.ОтображатьЗаголовки 	= Истина;
	ТабДок.ОтображатьСетку 		= Ложь;
	Возврат ТабДок; 
КонецФункции

&НаКлиенте
Процедура ПечатьКалькуляцииСводно();
	ТабДок = ПечатьКалькуляцииНаСервереСводно();
	ТабДок.Показать();
КонецПроцедуры


&НаСервере
Функция ПолучитьРучноеИзменениеЦены(ТаблицаДляАнализа)
	мРучноеИзменениеЦены = Новый Массив;
	стОтбор = Новый Структура("РучнаяУстановкаЦены",Истина);
	
	Для каждого текСтрока Из ТаблицаДляАнализа.НайтиСтроки(стОтбор) Цикл
		стДанные = Новый Структура("Номенклатура,Цена", );
		ЗаполнитьЗначенияСвойств(стДанные,текСтрока);
		мРучноеИзменениеЦены.Добавить(текСтрока);
	КонецЦикла;
	
	Возврат мРучноеИзменениеЦены;

КонецФункции // ПолучитьРучноеДобавлениеМатериалы()

&НаСервере
Функция ПолучитьРучноеДобавлениеМатериалы(ТаблицаДляАнализа)
	мРучноеДобавление = Новый Массив;
	стОтбор = Новый Структура("РучноеДобавление",Истина);
	
	Для каждого текСтрока Из ТаблицаДляАнализа.НайтиСтроки(стОтбор) Цикл
		мРучноеДобавление.Добавить(текСтрока);
	КонецЦикла;
	
	Возврат мРучноеДобавление;

КонецФункции // ПолучитьРучноеДобавлениеМатериалы()

&НаСервере
Процедура ЗаполнитьОбщуюТЧ();
	ТЧМатериалы = Объект.Материалы;
	мРучноеДобавлениеМатериалы 	= ПолучитьРучноеДобавлениеМатериалы(ТЧМатериалы);
	мРучноеИзменениеЦены 		= ПолучитьРучноеИзменениеЦены(ТЧМатериалы);
	
	ТЧМатериалы.Очистить();
	Для каждого Строка из Объект.Детали цикл

		Если ЗначениеЗаполнено(Строка.Материал) тогда
			ЗаполнитьСтрокуМатериал(ТЧМатериалы,Строка.Материал,Строка.Длина,Строка.Ширина);	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.МатериалПокрытия) тогда
			ЗаполнитьСтрокуМатериал(ТЧМатериалы,Строка.МатериалПокрытия,Строка.Длина,Строка.Ширина);	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.МатериалПокрытия1) тогда
			ЗаполнитьСтрокуМатериал(ТЧМатериалы,Строка.МатериалПокрытия1,Строка.Длина,Строка.Ширина);	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.КромкаММ) тогда
			ЗаполнитьСтрокуМатериал(ТЧМатериалы,Строка.КромкаММ,Строка.Длина,Строка.Ширина,Истина);	
		КонецЕсли; 
		
	КонецЦикла;
	

	ТЧОбщая = ТЧМатериалы.Выгрузить();
	ТЧОбщая.Свернуть("Номенклатура","Количество,Сумма,Периметр,Площадь");
	ЗаполнитьСтатьиЗатрат(ТЧОбщая);
	ТЧОбщая.Сортировать("Номенклатура");
	ТЧМатериалы.Загрузить(ТЧОбщая);
	
	ЗаполнитьНормыРасхода(ТЧМатериалы);
	
	Для каждого текРучноеДобавление Из мРучноеДобавлениеМатериалы Цикл
		ЗаполнитьЗначенияСвойств(ТЧМатериалы.Добавить(),текРучноеДобавление);	
	КонецЦикла;
	
	стОтбор = Новый Структура("Номенклатура", );
	Для каждого стРучноеИзменение Из мРучноеИзменениеЦены Цикл
		ЗаполнитьЗначенияСвойств(стОтбор,стРучноеИзменение);
		НайденыеСтроки = ТЧМатериалы.НайтиСтроки(стОтбор);
		Если НайденыеСтроки.Количество() > 0 Тогда
			Для каждого текСтрока Из НайденыеСтроки Цикл
				текСтрока.Цена = стРучноеИзменение.Цена;	
				текСтрока.Сумма = стРучноеИзменение.Цена * текСтрока.Количество;
				текСтрока.РучнаяУстановкаЦены = Истина;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНормыРасхода(ТЧМатериалы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.НормаРасхода КАК НормаРасхода,
		|	Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат,
		|	Номенклатура.СтатьяЗатрат.Основной КАК Основной
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&мНоменклатура)";
	
	Запрос.УстановитьПараметр("мНоменклатура", омТЧ_НаКлиентеСервере.КолонкуВМассив(ТЧМатериалы,"Номенклатура"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
    стОтбор = Новый Структура("Номенклатура", );
	Пока Выборка.Следующий() Цикл
		стОтбор.Номенклатура = Выборка.Номенклатура;
		
		Для каждого текСтрока Из ТЧМатериалы.НайтиСтроки(стОтбор) Цикл
			текСтрока.СтатьяЗатрат 	= Выборка.СтатьяЗатрат;
			текСтрока.Основной 		= Выборка.Основной;
			текСтрока.НормаРасхода 	= Выборка.НормаРасхода;
			текСтрока.Количество 	= текСтрока.Количество * Выборка.НормаРасхода;
			текСтрока.Сумма 		= текСтрока.Количество * текСтрока.Цена;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьНормыРасхода(ТЧМатериалы)


&НаСервере
Процедура ЗаполнитьСтрокуМатериал(ТЧМатериалы,Материал,Знач Длина,Знач Ширина,ТолькоПериметр = Ложь)
	Длина 	= Длина / 1000;	
	Ширина 	= Ширина / 1000;	
	
	НоваяСтрока = ТЧМатериалы.Добавить();
	НоваяСтрока.Номенклатура 	= Материал;
	Если Длина > 0 Тогда
		Если Ширина > 0 Тогда
			НоваяСтрока.Периметр 	= 2 * (Длина + Ширина);
			Если ТолькоПериметр Тогда
				НоваяСтрока.Количество 	= НоваяСтрока.Периметр;
			Иначе
				НоваяСтрока.Площадь 	= Длина * Ширина;
				НоваяСтрока.Количество 	= НоваяСтрока.Площадь;
			КонецЕсли;
		Иначе	
			НоваяСтрока.Количество 	= Длина;
		КонецЕсли;
	Иначе
		НоваяСтрока.Количество 	= 1;
	КонецЕсли;
	НоваяСтрока.Цена 			= омЦеныНаСервере.ПолучитьЦенуНоменклатуры(Материал);
КонецПроцедуры // ЗаполнитьСтрокуМатериал()


&НаСервере
Процедура ЗаполнитьСтатьиЗатрат(ТЧ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&Ссылка)
		|	И НЕ Номенклатура.СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", ТЧ.ВыгрузитьКолонку("Номенклатура"));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НайденаяСтрока = ТЧ.Найти(Выборка.Номенклатура,"Номенклатура");
		ЗаполнитьЗначенияСвойств(НайденаяСтрока,Выборка);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСтатьиЗатрат(ТЧОбщая)()


&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	//Объект.Цена = ВернутьСуммуМатериала();
КонецПроцедуры

&НаКлиенте
Процедура МатериалПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура РаботаЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Работа.ТекущиеДанные;
	ТекущаяСтрока.СуммаРабот = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество
КонецПроцедуры

Функция ЗаполнитьРасценки();
	ТЧДетали = Объект.Детали;
	ТЧРаботы = Объект.Работа;
	ТЧФурнитура = Объект.Фурнитура;
	стрОшибка = "";	

	мРучноеДобавлениеРабота = ПолучитьРучноеДобавлениеМатериалы(ТЧРаботы);
	ТЧРаботы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыРаботРасценки.Расценка КАК Расценка,
		|	ВидыРаботРасценки.ЧеловекоЧасы КАК ЧеловекоЧасы,
		|	ВидыРаботРасценки.Расценка.ЦенаРаботы КАК Цена,
		|	ВидыРаботРасценки.Расценка.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ВидыРаботРасценки.Расценка.ЕдиницыВидРаботы КАК ЕдиницыВидРаботы,
		|	ВидыРаботРасценки.Ссылка КАК ВидРаботы
		|ИЗ
		|	Справочник.ВидыРабот.Расценки КАК ВидыРаботРасценки
		|ГДЕ
		|	ВидыРаботРасценки.Ссылка В(&ВидРаботы)";
	
	Запрос.УстановитьПараметр("ВидРаботы", омТЧ_НаКлиентеСервере.КолонкуВМассив(ТЧДетали,"Обработка"));
	
	тзРасценкиДетали = Запрос.Выполнить().Выгрузить();
	
	тзРасценкиДетали.Индексы.Добавить("ВидРаботы");

	стОтбор = Новый Структура("ВидРаботы", );
	
	Для каждого СтрокаДетали из ТЧДетали Цикл
		Если ЗначениеЗаполнено(СтрокаДетали.Обработка) Тогда
			стОтбор.ВидРаботы = СтрокаДетали.Обработка;
			Для каждого Строка из тзРасценкиДетали.НайтиСтроки(стОтбор) Цикл
				НоваяСтрока = ТЧРаботы.Добавить();
				НоваяСтрока.Расценки 			= Строка.Расценка;
				НоваяСтрока.СтатьяЗатрат 		= Строка.СтатьяЗатрат;
				НоваяСтрока.ВремяНаРаботу 		= Строка.ЧеловекоЧасы;
				Если Строка.ЕдиницыВидРаботы = Перечисления.ВидыЕдиницДляРаботы.ПоПлощади Тогда
					НоваяСтрока.Количество 		= СтрокаДетали.Количество * СтрокаДетали.Площадь;
				ИначеЕсли Строка.ЕдиницыВидРаботы = Перечисления.ВидыЕдиницДляРаботы.ПоПериметру Тогда
					НоваяСтрока.Количество 		= 2 * СтрокаДетали.Количество * СтрокаДетали.Длина * СтрокаДетали.Ширина;
				Иначе
					НоваяСтрока.Количество 		= СтрокаДетали.Количество;
				КонецЕсли;
				НоваяСтрока.СуммаРабот			= Строка.Цена * НоваяСтрока.Количество;
				Если Строка.Цена = 0 Тогда
					стрОшибка = стрОшибка + ?(ПустаяСтрока(стрОшибка),"",Символы.ВК) + "Нет цены " + Строка.Расценка + " у " + СтрокаДетали.Обработка;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	мНоменклатура = Новый Массив;
	тзНоменклатура = ПолучитьНоменклатуруДокумента(мНоменклатура);
	тзРасценкиНоменклатуры = омРаботы.ПолучитьРаботыНоменклатуры(мНоменклатура);
	
	стОтбор = Новый Структура("Номенклатура", );
	
	Для каждого СтрокаНоменклатура из тзНоменклатура Цикл
		стОтбор.Номенклатура = СтрокаНоменклатура.Номенклатура;
		Для каждого Строка из тзРасценкиНоменклатуры.НайтиСтроки(стОтбор) Цикл
			НоваяСтрока = ТЧРаботы.Добавить();
			НоваяСтрока.Расценки 			= Строка.Расценка;
			НоваяСтрока.СтатьяЗатрат 		= Строка.СтатьяЗатрат;
			Если Строка.ЕдиницыВидРаботы = Перечисления.ВидыЕдиницДляРаботы.ПоПлощади Тогда
				НоваяСтрока.Количество 		= СтрокаДетали.Количество * СтрокаДетали.Длина * СтрокаДетали.Ширина;
			ИначеЕсли Строка.ЕдиницыВидРаботы = Перечисления.ВидыЕдиницДляРаботы.ПоПериметру Тогда
				НоваяСтрока.Количество 		= 2 * СтрокаДетали.Количество * СтрокаДетали.Длина * СтрокаДетали.Ширина;
			Иначе
				НоваяСтрока.Количество 		= СтрокаДетали.Количество;
			КонецЕсли;
			НоваяСтрока.СуммаРабот			= Строка.ЦенаРаботы * НоваяСтрока.Количество;
			Если Строка.ЦенаРаботы = 0 Тогда
				стрОшибка = стрОшибка + ?(ПустаяСтрока(стрОшибка),"",Символы.ВК) + "Нет цены " + Строка.Расценка + " у " + СтрокаНоменклатура.Номенклатура;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТЗРасценки = ТЧРаботы.Выгрузить();
	ТЗРасценки.Свернуть("Расценки,СтатьяЗатрат","Количество, ВремяНаРаботу, СуммаРабот");
	ТЗРасценки.Сортировать("Расценки");
	
	ТЧРаботы.Загрузить(ТЗРасценки);
	
	Для каждого текРучноеДобавление Из мРучноеДобавлениеРабота Цикл
		ЗаполнитьЗначенияСвойств(ТЧРаботы.Добавить(),текРучноеДобавление);	
	КонецЦикла;
	
	
	Возврат стрОшибка;
КонецФункции

&НаСервере
Функция ПолучитьНоменклатуруДокумента(мНоменклатура)
	тзНоменклатура = Новый ТаблицаЗначений;
	тзНоменклатура.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	тзНоменклатура.Колонки.Добавить("Количество", 	Новый ОписаниеТипов("Число"));
	тзНоменклатура.Колонки.Добавить("Ширина", 		Новый ОписаниеТипов("Число"));
	тзНоменклатура.Колонки.Добавить("Длина", 		Новый ОписаниеТипов("Число"));
	
	Для каждого текСтрока Из Объект.ЗаказныеИзделия Цикл
		Если текСтрока.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьНоменклатуру(текСтрока,тзНоменклатура,мНоменклатура,"Номенклатура");
	КонецЦикла;
	
	Для каждого текСтрока Из Объект.Фурнитура Цикл
		Если текСтрока.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьНоменклатуру(текСтрока,тзНоменклатура,мНоменклатура,"Фурнитура");
	КонецЦикла;

	Для каждого текСтрока Из Объект.Материалы Цикл
		Если текСтрока.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьНоменклатуру(текСтрока,тзНоменклатура,мНоменклатура,"Номенклатура");
	КонецЦикла;

	Возврат тзНоменклатура;
КонецФункции // ПолучитьНоменклатуруДокумента()

&НаСервере
Процедура ДобавитьНоменклатуру(текСтрока,тзНоменклатура,мНоменклатура,ИмяКолонки)
	НайденаяСтрока = тзНоменклатура.Найти(текСтрока[ИмяКолонки],"Номенклатура");
	Если НайденаяСтрока = Неопределено Тогда
		НС = тзНоменклатура.Добавить();
		НС.Номенклатура = текСтрока[ИмяКолонки];
	Иначе
		НайденаяСтрока.Количество = НайденаяСтрока.Количество + текСтрока.Количество;
	КонецЕсли;
	
	
	Если мНоменклатура.Найти(текСтрока[ИмяКолонки]) = Неопределено Тогда
		мНоменклатура.Добавить(текСтрока[ИмяКолонки]);	
	КонецЕсли;
КонецПроцедуры // ДобавитьНоменклатуру()


&НаКлиенте
Процедура ДеталиМатериалПокрытия1ПриИзменении(Элемент)
	ЗаполнитьОбщуюТЧ();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьМатериалы(Команда)
	ЗаполнитьОбщуюТЧ();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьРаботы(Команда)
	стрОшибка = ЗаполнитьРасценки();
	Если НЕ ПустаяСтрока(стрОшибка) Тогда
		Сообщить(стрОшибка);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьАктуальность()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктуальныеСметы.ИзделиеЭлемент КАК ИзделиеЭлемент
		|ИЗ
		|	РегистрСведений.АктуальныеСметы КАК АктуальныеСметы
		|ГДЕ
		|	АктуальныеСметы.Смета = &Смета";
	
	Запрос.УстановитьПараметр("Смета", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.АктуальнаяСмета = Истина;
	КонецЦикла;

КонецПроцедуры // ПроверитьАктуальность()

&НаСервереБезКонтекста
Функция КоличествоСметИзделия(ИздельеЗаказчика,Смета)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АктуальныеСметы.Смета) КАК Смета
		|ИЗ
		|	РегистрСведений.АктуальныеСметы КАК АктуальныеСметы
		|ГДЕ
		|	АктуальныеСметы.ИзделиеЭлемент = &ИзделиеЭлемент
		|	И АктуальныеСметы.Смета <> &Смета";
	
	Запрос.УстановитьПараметр("ИзделиеЭлемент", ИздельеЗаказчика);
	Запрос.УстановитьПараметр("Смета", Смета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Смета;
	КонецЦикла;
	
	Возврат 0;
КонецФункции // КоличествоСметИзделия()

&НаСервере
Процедура ОбновитьКартинки()	
	Перем Выборка, Запрос, КлючКартинки;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КартинкиНоменклатуры.ИзделиеЭлемент КАК ИзделиеЭлемент,
	|	КартинкиНоменклатуры.ИмяФайла КАК ИмяФайла
	|ИЗ
	|	РегистрСведений.КартинкиНоменклатуры КАК КартинкиНоменклатуры
	|ГДЕ
	|	КартинкиНоменклатуры.ИзделиеЭлемент = &ИзделиеЭлемент");
	Запрос.УстановитьПараметр("ИзделиеЭлемент", Объект.Изделие);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() тогда
		КлючКартинки = РегистрыСведений.КартинкиНоменклатуры.СоздатьКлючЗаписи(Новый Структура("ИзделиеЭлемент, ИмяФайла", Выборка.ИзделиеЗаказчика, Выборка.ИмяФайла));
		АдресКартинки = ПолучитьНавигационнуюСсылку(КлючКартинки, "Картинка");
	иначе
		АдресКартинки = "";
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьАктуальностьНаСервере(Ссылка,ИздельеЗаказчика,АктуальнаяСмета,НачальноеЗначениеИзделияЗаказчика)
	
	НаборЗаписей = РегистрыСведений.АктуальныеСметы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИздельеЗаказчика.Установить(ИздельеЗаказчика);
	
	Если АктуальнаяСмета Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ИзделиеЭлемент = ИздельеЗаказчика;
		НоваяЗапись.Смета = Ссылка;
	КонецЕсли; 
	
	НаборЗаписей.Записать();
КонецПроцедуры // ЗаписатьАктуальностьНаСервере(Ссылка,Изделие,АктуальнаяСмета)



#Область Шаблоны

&НаКлиенте
Процедура СоздатьШаблон(Команда)
	ФормаШаблон = ПолучитьФорму("Справочник.ШаблоныИзделия.ФормаОбъекта");
	СкопироватьДанные(Объект,ФормаШаблон.Объект);
	ФормаШаблон.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзШаблона(Команда)
	стДанные = ПолучитьСписокНеПустыеТЧ();
	Если стДанные.КоличествоНеПустых = 0 Тогда
	   ПослеВопросаООчиске(КодВозвратаДиалога.Нет,Неопределено);
	Иначе	
		Если стДанные.КоличествоНеПустых = 1 Тогда
			ПереченьТЧ = "Табличная часть ";
			Пустота = " не пустая";
			Таблицы = "таблицу";
		Иначе
			ПереченьТЧ = "Табличные части ";	
			Пустота = " не пустые";
			Таблицы = "таблицы";
		КонецЕсли;
		
		стрСообщение = ПереченьТЧ + стДанные.стрНеПустыеТЧ + Пустота + ". Очистить " + Таблицы + " перед заполнением?";
		
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаООчиске",ЭтаФорма);
		
		ПоказатьВопрос(Оповещение,стрСообщение,РежимДиалогаВопрос.ДаНет,,,"Очистить таблицы");
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВопросаООчиске(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        Объект.Детали.Очистить();
        Объект.ЗаказныеИзделия.Очистить();
        Объект.Фурнитура.Очистить();
        Объект.ДопОснастка.Очистить();
        Объект.ОборудованиеИТехника.Очистить();
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура("РежимВыбора",Истина);
	ОткрытьФорму("Справочник.ШаблоныИзделия.ФормаВыбора",ПараметрыФормы,ЭтаФорма);	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеИзШаблона(Шаблон)
	СкопироватьДанные(ЗаполнитьДанныеИзШаблонаНаСервере(Шаблон),Объект);
	ПересчитатьВсе(0);
КонецПроцедуры // ЗаполнитьДанныеИзШаблона() 

&НаСервереБезКонтекста
Функция ЗаполнитьДанныеИзШаблонаНаСервере(Шаблон)

	Возврат Справочники.ШаблоныИзделия.ПолучитьДанныеШаблона(Шаблон);	

КонецФункции // ЗаполнитьДанныеИзШаблона()

&НаКлиенте
Функция ПолучитьСписокНеПустыеТЧ()
	стДанные = Новый Структура("стрНеПустыеТЧ,КоличествоНеПустых","",0);
	
	Если Объект.Детали.Количество()  > 0 Тогда
		стДанные.стрНеПустыеТЧ = ДобавитьРазделитель(стДанные.стрНеПустыеТЧ) + "Детали";
		стДанные.КоличествоНеПустых = стДанные.КоличествоНеПустых + 1; 
	КонецЕсли;
	Если Объект.ЗаказныеИзделия.Количество()  > 0 Тогда
		стДанные.стрНеПустыеТЧ = ДобавитьРазделитель(стДанные.стрНеПустыеТЧ) + "Заказные изделия";
		стДанные.КоличествоНеПустых = стДанные.КоличествоНеПустых + 1; 
	КонецЕсли;
	Если Объект.Фурнитура.Количество()  > 0 Тогда
		стДанные.стрНеПустыеТЧ = ДобавитьРазделитель(стДанные.стрНеПустыеТЧ) + "Фурнитура";
		стДанные.КоличествоНеПустых = стДанные.КоличествоНеПустых + 1; 
	КонецЕсли;
	Если Объект.ДопОснастка.Количество()  > 0 Тогда
		стДанные.стрНеПустыеТЧ = ДобавитьРазделитель(стДанные.стрНеПустыеТЧ) + "Доп.оснастка";
		стДанные.КоличествоНеПустых = стДанные.КоличествоНеПустых + 1; 
	КонецЕсли;
	Если Объект.ОборудованиеИТехника.Количество()  > 0 Тогда
		стДанные.стрНеПустыеТЧ = ДобавитьРазделитель(стДанные.стрНеПустыеТЧ) + "Оборудование и техника";
		стДанные.КоличествоНеПустых = стДанные.КоличествоНеПустых + 1; 
	КонецЕсли;
	
	Возврат стДанные;
КонецФункции // ПолучитьНеПустыеТЧ()

&НаКлиенте
Функция ДобавитьРазделитель(текСтрока, Разделитель = ",")
	Если НЕ ПустаяСтрока(текСтрока) Тогда
		текСтрока = текСтрока + ", ";
	КонецЕсли;
	Возврат текСтрока;
КонецФункции // ДобавитьРазделитель()

&НаКлиенте
Процедура СкопироватьДанные(Источник,Приемник)
	ЗаполнитьТЧ(Источник,Приемник,"Детали");
	ЗаполнитьТЧ(Источник,Приемник,"ЗаказныеИзделия");
	ЗаполнитьТЧ(Источник,Приемник,"Фурнитура");
	ЗаполнитьТЧ(Источник,Приемник,"ДопОснастка");
	ЗаполнитьТЧ(Источник,Приемник,"ОборудованиеИТехника");
КонецПроцедуры // СкопироватьДанные()

&НаКлиенте
Процедура ЗаполнитьТЧ(Источник,Приемник,ИмяТЧ)
	Для каждого текСтрока Из Источник[ИмяТЧ] Цикл
		ЗаполнитьЗначенияСвойств(Приемник[ИмяТЧ].Добавить(),текСтрока);	
	КонецЦикла;
КонецПроцедуры // ЗаполнитьТЧ(Источник,Приемник,ИмяТЧ)()


#КонецОбласти

#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЭтаФорма.Параметры.Ключ.Пустая() Тогда
		ОбновитьКартинки();
		ПроверитьАктуальность();
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	//ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПересчитатьЦены.Видимость = Ложь;
	НачальноеЗначениеАктуальнаяСмета = ЭтаФорма.АктуальнаяСмета; 
	НачальноеЗначениеИзделияЗаказчика = Объект.Изделие;
	Если НЕ ЭтаФорма.АктуальнаяСмета Тогда
		ЭтаФорма.АктуальнаяСмета = ?(КоличествоСметИзделия(Объект.Изделие, Объект.Ссылка) = 0, Истина, Ложь); 
		Элементы.АктуальнаяСмета.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если НачальноеЗначениеАктуальнаяСмета = ЭтаФорма.АктуальнаяСмета И НачальноеЗначениеИзделияЗаказчика = Объект.Изделие Тогда
		Возврат;
	КонецЕсли;
	ЗаписатьАктуальностьНаСервере(Объект.Ссылка,Объект.Изделие,ЭтаФорма.АктуальнаяСмета,НачальноеЗначениеИзделияЗаказчика);
	Оповестить("ИзменениеЦены", Новый Структура("Номенклатура",омТЧ_НаКлиентеСервере.КолонкуВМассив(Объект.Материалы, "Номенклатура")));
	
КонецПроцедуры
	
	
#КонецОбласти

#Область СобытияРеквизитов

&НаКлиенте
Процедура ИзделиеПриИзменении(Элемент)
	ОбновитьКартинки();
	Если НЕ ЭтаФорма.АктуальнаяСмета Тогда
		ЭтаФорма.АктуальнаяСмета = ?(КоличествоСметИзделия(Объект.Изделие, Объект.Ссылка) = 0, Истина, Ложь);
		Если ЭтаФорма.АктуальнаяСмета Тогда
			Элементы.АктуальнаяСмета.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Тип("СправочникСсылка.ШаблоныИзделия") = ТипЗнч(ВыбранноеЗначение) Тогда
		ЗаполнитьДанныеИзШаблона(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

	

#КонецОбласти

#Область СобытияТабличныхЧастей

&НаКлиенте
Процедура ДеталиПриИзменении(Элемент)
   ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПересчитатьЦены.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказныеИзделияПриИзменении(Элемент)
   ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПересчитатьЦены.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеИТехникаПриИзменении(Элемент)
   ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПересчитатьЦены.Видимость = Истина;
КонецПроцедуры 

&НаКлиенте
Процедура ФурнитураПриИзменении(Элемент)
   ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПересчитатьЦены.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДопОснасткаПриИзменении(Элемент)
    НуженПерерасчет = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КоммерческиеРасходыПриИзменении(Элемент)
   ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПересчитатьЦены.Видимость = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоэффициентНаСервере(Материал,ЕдиницыИзмерения)

	Возврат	омЕдиницыИзмерения.ПолучитьКоэффициентНаСервере(Материал,ЕдиницыИзмерения);

КонецФункции // ПолучитьКоэффициентНаСервере(Материал,ЕдиницыИзмерения)


&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	ТД = Элементы.Материалы.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТД.Номенклатура) Тогда
		
		стПараметрыНоменклатуры = ПолучитьПараметрыНоменклатуры(ТД.Номенклатура);
		
		мЕдиницы = стПараметрыНоменклатуры.мЕдиницы;
		
		Если мЕдиницы.Количество() = 1 Тогда
			ТД.ЕдиницыИзмерения = мЕдиницы[0];
			ТД.Коэффициент = 1;
			ТД.Цена = стПараметрыНоменклатуры.Цена * ТД.Коэффициент;
			ТД.Сумма =  ТД.Цена * ТД.Количество;
		Иначе
			ТД.ЕдиницыИзмерения = ПредопределенноеЗначение("Справочник.ЕдиницыИзмерения.ПустаяСсылка");
			ТД.Количество 	= 0;
			ТД.Цена 		= 0;
			ТД.Сумма 		= 0;
		КонецЕсли;
		
		ТД.Основной 	= стПараметрыНоменклатуры.стСтатьяОсновной.Основной;
		ТД.СтатьяЗатрат = стПараметрыНоменклатуры.стСтатьяОсновной.СтатьяЗатрат;
	Иначе
		ТД.ЕдиницыИзмерения = ПредопределенноеЗначение("Справочник.ЕдиницыИзмерения.ПустаяСсылка");
		ТД.Сумма 		= 0;
		ТД.Количество 	= 0;
		ТД.Основной 	= Истина;
		ТД.СтатьяЗатрат = ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры   

&НаСервереБезКонтекста
Функция ПолучитьПараметрыНоменклатуры(Номенклатура)
	Возврат Новый Структура("мЕдиницы,Цена,стСтатьяОсновной"
	,омЕдиницыИзмерения.ЕдиницыИзмеренийНоменклатурыДляВыбора(Номенклатура)
	,омЦеныНаСервере.ПолучитьМаксимальнуюЦенуНоменклатуры(Номенклатура)
	,омНоменклатура.ПолучитьПараметрыНоменклатуры(Номенклатура));
	

КонецФункции // ПолучитьПараметрыНоменклатуры(Номенклатура)


&НаКлиенте
Процедура МатериалыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.РучноеДобавление = Истина; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекущаяСтрока.РучнаяУстановкаЦены = ТекущаяСтрока.Цена > 0;
	ТекущаяСтрока.Сумма =  ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры 

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекущаяСтрока.Сумма =  ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры


&НаКлиенте
Процедура РаботаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.РучноеДобавление = Истина; 
	КонецЕсли;
КонецПроцедуры

#Область ЗаказныеИзделия
&НаКлиенте
Процедура ЗаказныеИзделияКоличествоПриИзменении(Элемент)
	ПересчитатьСтоимостьЗаказныеИзделия();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказныеИзделияЦенаПриИзменении(Элемент)
	ПересчитатьСтоимостьЗаказныеИзделия();
КонецПроцедуры


&НаКлиенте
Процедура ЗаказныеИзделияСтоимостьПриИзменении(Элемент)
	ПересчитатьСтоимостьЗаказныеИзделия(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтоимостьЗаказныеИзделия(РасчитатьСтоимость = Истина)
	ТекущаяСтрока = Элементы.ЗаказныеИзделия.ТекущиеДанные;
	Если ТекущаяСтрока.Количество = 0 Тогда
		ТекущаяСтрока.Количество = 1; 
	КонецЕсли;
	Если РасчитатьСтоимость Тогда
		ТекущаяСтрока.Стоимость = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	Иначе
		ТекущаяСтрока.Цена = ТекущаяСтрока.Стоимость / ТекущаяСтрока.Количество;
	КонецЕсли; 
КонецПроцедуры // ПересчитатьПлощадь()

&НаКлиенте
Процедура ЗаказныеИзделияНоменклатураПриИзменении(Элемент)
	ТД = Элементы.ЗаказныеИзделия.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТД.Номенклатура) Тогда
		стПараметрыНоменклатуры = ПолучитьПараметрыНоменклатуры(ТД.Номенклатура);
		
		ТД.СтатьяЗатрат = стПараметрыНоменклатуры.стСтатьяОсновной.СтатьяЗатрат;	
		ТД.Основной 	= стПараметрыНоменклатуры.стСтатьяОсновной.Основной;
	Иначе
		ТД.СтатьяЗатрат = ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");	
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область Площадь
	
&НаКлиенте
Процедура ДеталиДлинаПриИзменении(Элемент)
	ПересчитатьПлощадь();
КонецПроцедуры

&НаКлиенте
Процедура ДеталиШиринаПриИзменении(Элемент)
	ПересчитатьПлощадь();
КонецПроцедуры

&НаКлиенте
Процедура ДеталиКоличествоПриИзменении(Элемент)
	ПересчитатьПлощадь();
КонецПроцедуры
	
&НаКлиенте
Процедура ПересчитатьПлощадь()
	ТекущаяСтрока = Элементы.Детали.ТекущиеДанные;
	ТекущаяСтрока.Площадь = ТекущаяСтрока.Длина * ТекущаяСтрока.Ширина * ТекущаяСтрока.Количество / 1000000;
КонецПроцедуры // ПересчитатьПлощадь()

&НаКлиенте
Процедура РаботаРасценкиПриИзменении(Элемент)
	ТД = Элементы.Работа.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТД.Расценки) Тогда
		ЗаполнитьЗначенияСвойств(ТД, ПолучитьДанныеРасценки(ТД.Расценки));
	Иначе
		ТД.СтатьяЗатрат 	= ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеРасценки(Расценка)
	стДанныеРасценки = Новый Структура("ЕдиницыИзмерения,СтатьяЗатрат", );
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементныеРасценки.СтатьяЗатрат КАК СтатьяЗатрат
		|ИЗ
		|	Справочник.ЭлементныеРасценки КАК ЭлементныеРасценки
		|ГДЕ
		|	ЭлементныеРасценки.Ссылка = &Расценка";
	
	Запрос.УстановитьПараметр("Расценка", Расценка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стДанныеРасценки,Выборка);
	КонецЦикла;
	

	Возврат стДанныеРасценки;	

КонецФункции // ПолучитьЕдиницуРасценки()

&НаКлиенте
Процедура КоммерческиеРасходыКоммерческиеРасходыПриИзменении(Элемент)
	ТД = Элементы.КоммерческиеРасходы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТД.КоммерческиеРасходы) Тогда
		ЗаполнитьЗначенияСвойств(ТД, ПолучитьДанныеКоммРасходы(ТД.КоммерческиеРасходы));
	Иначе
		ТД.ЕдиницыИзмерения = ПредопределенноеЗначение("Справочник.ЕдиницыИзмерения.ПустаяСсылка");
		ТД.СтатьяЗатрат 	= ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеКоммРасходы(КоммерческиеРасходы)
	стДанныеКоммРасходы = Новый Структура("ЕдиницыИзмерения,СтатьяЗатрат", );
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоммерческиеРасходы.СтатьяЗатрат КАК СтатьяЗатрат,
		|	КоммерческиеРасходы.ОсновнаяЕдиницаИзмерения КАК ЕдиницыИзмерения
		|ИЗ
		|	Справочник.КоммерческиеРасходы КАК КоммерческиеРасходы
		|ГДЕ
		|	КоммерческиеРасходы.Ссылка = &КоммерческиеРасходы";
	
	Запрос.УстановитьПараметр("КоммерческиеРасходы", КоммерческиеРасходы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стДанныеКоммРасходы,Выборка);
	КонецЦикла;
	

	Возврат стДанныеКоммРасходы;	

КонецФункции // ПолучитьЕдиницуРасценки()

&НаКлиенте
Процедура КоммерческиеРасходыКоличествоПриИзменении(Элемент)
	ТД = Элементы.КоммерческиеРасходы.ТекущиеДанные;
	ТД.Стоимость = ТД.Количество * ТД.Цена;
КонецПроцедуры

&НаКлиенте
Процедура КоммерческиеРасходыСтоимостьПриИзменении(Элемент)
	ТД = Элементы.КоммерческиеРасходы.ТекущиеДанные;
	Если ТД.Цена > 0 Тогда
		ТД.Количество = ТД.Стоимость / ТД.Цена;
	ИначеЕсли ТД.Количество > 0 Тогда
		ТД.Цена = ТД.Стоимость / ТД.Количество;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область ДопОснастка

&НаКлиенте
Процедура сСтоимостьПриИзменении(Элемент)
	ПересчитатьСтоимостьДопОснастки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ДопОснасткаДопОснасткаПриИзменении(Элемент)
	ПересчитатьСтоимостьДопОснастки();
КонецПроцедуры

&НаКлиенте
Процедура ДопОснасткаКоличествоПриИзменении(Элемент)
	ПересчитатьСтоимостьДопОснастки();
КонецПроцедуры

&НаКлиенте
Процедура ДопОснасткаЦенаПриИзменении(Элемент)
	ПересчитатьСтоимостьДопОснастки();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтоимостьДопОснастки(РасчитатьСтоимость = Истина)
	ТекущаяСтрока = Элементы.ДопОснастка.ТекущиеДанные;
	Если ТекущаяСтрока.Количество = 0 Тогда
		ТекущаяСтрока.Количество = 1; 
	КонецЕсли;
	Если РасчитатьСтоимость Тогда
		ТекущаяСтрока.Стоимость = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	Иначе
		ТекущаяСтрока.Цена = ТекущаяСтрока.Стоимость / ТекущаяСтрока.Количество;
	КонецЕсли; 
КонецПроцедуры // ПересчитатьПлощадь()

#КонецОбласти

#КонецОбласти 


#Область Команды
&НаКлиенте
Процедура ПересчитатьВсе(Команда)
	ЗаполнитьОбщуюТЧ();
	ЗаполнитьРасценки();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦены(Команда)
	ПересчитатьЦеныНаСервере();
КонецПроцедуры

	
#КонецОбласти

#Область Цены

&НаСервере
Процедура ПересчитатьЦеныНаСервере()
	мНоменклатура = Новый Массив;
	
	Для каждого текСтрока Из Объект.Материалы Цикл
		Если НЕ текСтрока.РучнаяУстановкаЦены И мНоменклатура.Найти(текСтрока.Номенклатура) = Неопределено Тогда
			мНоменклатура.Добавить(текСтрока.Номенклатура); 
		КонецЕсли;
	КонецЦикла;
	
	мЦеныНоменклатуры = омЦеныНаСервере.ПолучитьМаксимальнуюЦенуНоменклатуры(мНоменклатура);
	
	Для каждого текСтрока Из Объект.Материалы Цикл
		Если НЕ текСтрока.РучнаяУстановкаЦены Тогда
			Цена = 0;
			Для каждого текЦена Из мЦеныНоменклатуры Цикл
				Если текЦена.Номенклатура = текСтрока.Номенклатура Тогда
					Цена = текЦена.Цена;
					Прервать;
				КонецЕсли;	
			КонецЦикла;
			
			текСтрока.Цена 	= Цена; 
			текСтрока.Сумма = текСтрока.Цена * текСтрока.Количество; 
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти