
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Проект = ПриложениеКДоговору.Проект;
	
	ТаблицаКомплектыИзделия 	= омИзделиеЗаказчика.ПолучитьПодчиненыеКомплектыИзделийЗаказчика(ИзделияЗаказчика.Выгрузить().ВыгрузитьКолонку("ИзделиеЗаказчика")); 
    ТаблицаСтатусов 			= ПолучитьТекущиеСтатусы(ТаблицаКомплектыИзделия);
	ТаблицаПроводок 			= ПолучитьТаблицуПроведения();
	
	СтруктураТаблиц = Новый Структура("ТаблицаКомплектыИзделия, ТаблицаСтатусов, ТаблицаПроводок" 
										,ТаблицаКомплектыИзделия
	                                    ,ТаблицаСтатусов
	                                    ,ТаблицаПроводок
										);
	
	СтруктураОтборИзделие 			= Новый Структура("ИзделиеЗаказчика", );
	СтруктураОтборКомплект			= Новый Структура("Комплект", );
	СтруктураОтборКомплектИзделие	= Новый Структура("Комплект, ИзделиеЗаказчика", );
	
	Для каждого ТекущиеИзделиеЗаказчика Из ИзделияЗаказчика Цикл
		
		СтруктураОтборИзделие.ИзделиеЗаказчика 			= ТекущиеИзделиеЗаказчика.ИзделиеЗаказчика;
		СтруктураОтборКомплектИзделие.ИзделиеЗаказчика 	= ТекущиеИзделиеЗаказчика.ИзделиеЗаказчика;
	
		СтруктураКомплеты = ПолучитьДанныеОКомплектах(СтруктураТаблиц, СтруктураОтборИзделие, СтруктураОтборКомплектИзделие, СтруктураОтборКомплект);			
	
	КонецЦикла;
	
	Движения.ГлабольныеСостояниеКомплекта.Записывать = Истина;
	Для Каждого ТекСтрокаПроводки Из ТаблицаПроводок Цикл
		Движение = Движения.ГлабольныеСостояниеКомплекта.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаПроводки);
		Движение.Период 			= ДатаПриостановки;
		Движение.ГлобальныйСтатус 	= Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы;
		
		омСтадииКомплекта.УстановитьГлобальныйСтатусСУчетомРаботыКонструктора(ТекСтрокаПроводки.Комплект
													, Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы
													, ДатаПриостановки
													, Автор
													, Комментарий);
		
	КонецЦикла;

КонецПроцедуры 

Функция ПолучитьТаблицуПроведения()

	МасиивТипов = Новый Массив;
	МасиивТипов.Добавить(Тип("СправочникСсылка.ИзделияКомплект"));
	МасиивТипов.Добавить(Тип("СправочникСсылка.Композиции"));
	
	ТаблицаПроводок = Новый ТаблицаЗначений;
	ТаблицаПроводок.Колонки.Добавить("Комплект", 			Новый ОписаниеТипов(МасиивТипов));
	ТаблицаПроводок.Колонки.Добавить("ИзделиеЗаказчика", 	Новый ОписаниеТипов("СправочникСсылка.ИзделияЗаказчика"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущаяСтадия", 	Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийСостояние", Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЗадач"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийСтатус", 	Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийТипЗадачи", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадачКонструирования"));
	
	Возврат ТаблицаПроводок;

КонецФункции // ПолучитьТаблицуПроведения()

Функция ПолучитьДанныеОКомплектах(СтруктураТаблиц, СтруктураОтборИзделие, СтруктураОтборКомплектИзделие, СтруктураОтборКомплект)

	ТаблицаКомплектыИзделия = СтруктураТаблиц.ТаблицаКомплектыИзделия; 
	ТаблицаПроводок 		= СтруктураТаблиц.ТаблицаПроводок;

	НайденыеСтроки = ТаблицаКомплектыИзделия.НайтиСтроки(СтруктураОтборИзделие);
	
	Для каждого х Из НайденыеСтроки Цикл
		
		СтруктураОтборКомплектИзделие.Комплект 	= х.Комплект;
		СтруктураОтборКомплект.Комплект			= х.Комплект;
		
		НайденыеСтроки = ТаблицаПроводок.НайтиСтроки(СтруктураОтборКомплект);
		Если НайденыеСтроки.Количество() = 0 Тогда
			
			РасчитатьКомплект(СтруктураТаблиц, СтруктураОтборКомплектИзделие, СтруктураОтборКомплект);
			
		КонецЕсли;
			
	КонецЦикла;
                                                	
КонецФункции // ТекущиеИзделиеЗаказчика() 

Процедура РасчитатьКомплект(СтруктураТаблиц, СтруктураОтборКомплектИзделие, СтруктураОтборКомплект)

	ТаблицаСтатусов = СтруктураТаблиц.ТаблицаСтатусов;
	ТаблицаПроводок = СтруктураТаблиц.ТаблицаПроводок;
	
	НС = ТаблицаПроводок.Добавить();
	НС.Комплект				= СтруктураОтборКомплектИзделие.Комплект; 
	НС.ИзделиеЗаказчика 	= СтруктураОтборКомплектИзделие.ИзделиеЗаказчика;
	
	СтрокаСостояния = ТаблицаСтатусов.Найти(СтруктураОтборКомплектИзделие.Комплект, "Комплект");
	Если НЕ СтрокаСостояния = Неопределено Тогда
		
		НС.ПредыдущийСостояние 	= СтрокаСостояния.Состояние;
		НС.ПредыдущийСтатус 	= СтрокаСостояния.Статус;
		НС.ПредыдущийТипЗадачи 	= СтрокаСостояния.ТипЗадачи;
		НС.ПредыдущаяСтадия 	= СтрокаСостояния.ПредыдущаяСтадия;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТекущиеСтатусы(ТаблицаКомплектыИзделия)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадачСрезПоследних.Задача КАК Задача,
		|	ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ КАК Комплект,
		|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние,
		|	ТаймингЗадачСрезПоследних.Статус КАК Статус,
		|	ТаймингЗадачСрезПоследних.ТипЗадачи КАК ТипЗадачи,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ПредыдущаяСтадия
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних(&ДатаПриостановки, Задача.ОбъектТЗ В (&ОбъектТЗ)) КАК ТаймингЗадачСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	НЕ ТаймингЗадачСрезПоследних.Задача.Выполнена";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", 			ТаблицаКомплектыИзделия.ВыгрузитьКолонку("Комплект"));
	Запрос.УстановитьПараметр("ДатаПриостановки", 	ДатаПриостановки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции


