
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Проект = ПриложениеКДоговору.Проект;
	
	ТаблицаКомплектыИзделия 	= омИзделиеЗаказчика.ПолучитьПодчиненыеКомплектыИзделийЗаказчика(ИзделияЗаказчика.Выгрузить().ВыгрузитьКолонку("ИзделиеЗаказчика")); 
    ТаблицаСтатусов 			= ПолучитьТекущиеСтатусы(ТаблицаКомплектыИзделия);
	ТаблицаПроводок 			= ПолучитьТаблицуПроведения();
	ТаблицаТекущиеПриостановки	= ПолучитьТекущиеПриостановки(Проект);
	
	СтруктураОтборИзделие 	= Новый Структура("ИзделиеЗаказчика", );
	СтруктураОтборКомплект 	= Новый Структура("Комплект", );
	
	Для каждого ТекущиеИзделиеЗаказчика Из ИзделияЗаказчика Цикл
		
		СтруктураОтборИзделие.ИзделиеЗаказчика = ТекущиеИзделиеЗаказчика.ИзделиеЗаказчика;
	
		СтруктураКомплеты = ПолучитьДанныеОКомплектах(ТаблицаКомплектыИзделия, ТаблицаСтатусов, ТаблицаТекущиеПриостановки, СтруктураОтборИзделие, СтруктураОтборКомплект);			
	
	КонецЦикла;
	
	Движения.ГлабольныеСостояниеКомплекта.Записывать = Истина;
	Для Каждого ТекСтрокаПроводки Из ТаблицаПроводок Цикл
		Движение = Движения.ГлабольныеСостояниеКомплекта.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаПроводки);
		Движение.Период 				= ДатаПриостановки;
		Движение.ГлобальныйСтатус 		= Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы;
		Движение.Проект 				= Проект;
	КонецЦикла;

КонецПроцедуры 

Функция ПолучитьТаблицуПроведения()

	МасиивТипов = Новый Массив;
	МасиивТипов.Добавить(Тип("СправочникСсылка.ИзделияКомплект"));
	МасиивТипов.Добавить(Тип("СправочникСсылка.Композиции"));
	
	ТаблицаПроводок = Новый ТаблицаЗначений;
	ТаблицаПроводок.Колонки.Добавить("Комплект", 			Новый ОписаниеТипов(МасиивТипов));
	ТаблицаПроводок.Колонки.Добавить("ИзделиеЗаказчика", 	Новый ОписаниеТипов("СправочникСсылка.ИзделияЗаказчика"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийСостояние", Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЗадач"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийСтатус", 	Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийТипЗадачи", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадачКонструирования"));
	ТаблицаПроводок.Колонки.Добавить("ЧастичныйСтатус", 	Новый ОписаниеТипов("Булево"));
	
КонецФункции // ПолучитьТаблицуПроведения()


Функция ПолучитьДанныеОКомплектах(ТаблицаКомплектыИзделия, ТаблицаСтатусов, ТаблицаТекущиеПриостановки, СтруктураОтборИзделие, СтруктураОтборКомплект)

	мКомплекты = Новый Массив;
	
	НайденыеСтроки = ТаблицаКомплектыИзделия.НайтиСтроки(СтруктураОтборИзделие);
	
	Для каждого х Из НайденыеСтроки Цикл
	
		Если мКомплекты.Найти(х.Комплект) = Неопределено Тогда
		
			мКомплекты.Добавить(х.Комплект);
			
			
		
		КонецЕсли;	
	
	КонецЦикла;
                                                	
КонецФункции // ТекущиеИзделиеЗаказчика() 

Функция ПолучитьТекущиеПриостановки(Проект)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГлабольныеСостояниеКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ГлабольныеСостояниеКомплектаСрезПоследних.ИзделиеЗаказчика КАК ИзделиеЗаказчика
		|ИЗ
		|	РегистрСведений.ГлабольныеСостояниеКомплекта.СрезПоследних(&ДатаПриостановки, ) КАК ГлабольныеСостояниеКомплектаСрезПоследних
		|ГДЕ
		|	ГлабольныеСостояниеКомплектаСрезПоследних.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Проект", 			Проект);
	Запрос.УстановитьПараметр("ДатаПриостановки", 	ДатаПриостановки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТекущиеПриостановки()



Функция ПолучитьТекущиеСтатусы(ТаблицаКомплектыИзделия)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадачСрезПоследних.Задача КАК Задача,
		|	ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ КАК ЗадачаОбъектТЗ,
		|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние,
		|	ТаймингЗадачСрезПоследних.Статус КАК Статус,
		|	ТаймингЗадачСрезПоследних.ТипЗадачи КАК ТипЗадачи
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача.ОбъектТЗ В (&ОбъектТЗ)) КАК ТаймингЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ТаблицаКомплектыИзделия.ВыгрузитьКолонку("Комплект"));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции


