
&НаСервере
Процедура ОбновитьНаСервере()

	ПолеВывода.Очистить();	

	Если ВыводитьКартинки Тогда
		ВывестиСКартинками();	
	Иначе
		ВывестиБезКартинок();	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВывестиСКартинками()
	
	СтруктураТаблицДанных = ПолучитьТаблицыДанных();
	КартинкиДанных = СтруктураТаблицДанных.Картинки;
	КартинкиДанных.Индексы.Добавить("Образец");
	
	ТаблицаДанных = СтруктураТаблицДанных.Данные;
	
	мОбразцы = омТЧ_НаКлиентеСервере.КолонкуВМассив(ТаблицаДанных, "Образец");
	
	НомерСтрокиВывода = 5;
	
	
	стПараметровОбласти = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров();
	ВывестиШапкуСКартинками(стПараметровОбласти);
	
	Отбор = Новый Структура("Образец", );
	
	Для каждого Образец Из мОбразцы Цикл
	
		Отбор.Образец = Образец;
		ВывестиОбразец(Отбор, НомерСтрокиВывода, стПараметровОбласти, ТаблицаДанных, КартинкиДанных);	
		НомерСтрокиВывода = НомерСтрокиВывода + 1;
		
	КонецЦикла;
	
КонецПроцедуры  //ВывестиСКартинками 

Процедура ВывестиОбразец(Отбор, НомерСтрокиВывода, стПараметровОбласти, ТаблицаДанных, КартинкиДанных)

	НетЛиния 		= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии, 1); 
	ЛинияГраницы 	= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1); 
	
	стПараметровОбласти.НомерСтроки 			= НомерСтрокиВывода;
	стПараметровОбласти.НомерКолонки 			= 2;
	стПараметровОбласти.Текст					= "";
	
	КомплектыИзделия = ПолучитьКомплектыОбразца(Отбор, ТаблицаДанных);
	
	КоличествоКомплектов 	= КомплектыИзделия.мКомплекты.Количество();
	КоличествоИзделий 		= КомплектыИзделия.мИзделияЗаказчика.Количество();
	
	МаксимальноеКоличество = Макс(КоличествоКомплектов, КоличествоИзделий);
	
	стПараметровОбласти.ВысотаОбласти 			= ?(МаксимальноеКоличество < 4, 4, МаксимальноеКоличество);
	Область = омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти);
	Область.ОтступСправа 		= 2;	
	Область.ОтступСверху 		= 2;	
	Область.ОтступСнизу 		= 2;	
	Область.ОтступСлева 		= 2;	
	
	НайденыеСтроки = КартинкиДанных.НайтиСтроки(Отбор);
	
	Если НайденыеСтроки.Количество() = 0 Тогда
	
		Картинка = БиблиотекаКартинок.НетИзображения;
		
	Иначе
		
		Картинка = Новый Картинка(НайденыеСтроки[0].Картинка.Получить());	
	
	КонецЕсли;
	
	Область.Картинка 		= Картинка;
	
	стПараметровОбласти.Полужирный     			= Ложь; 
	стПараметровОбласти.ВысотаОбласти			= 1;
	стПараметровОбласти.НомерКолонки 			= стПараметровОбласти.НомерКолонки + 1;
	стПараметровОбласти.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	
	ОтборКомплекта = Новый Структура("Образец, Комплект", Отбор.Образец);
	
	Если КоличествоКомплектов > 0 Тогда
		
		стПараметровОбласти.ГраницаСлева 	= ЛинияГраницы;
		стПараметровОбласти.ГраницаСправа 	= ЛинияГраницы;
		стПараметровОбласти.ГраницаСверху 	= ЛинияГраницы;
		стПараметровОбласти.ГраницаСнизу 	= НетЛиния;
		
		МаксимальныйИндекс = КоличествоКомплектов - 1;
		
		Для х = 0 По МаксимальныйИндекс Цикл
			
			Комплект = КомплектыИзделия.мКомплекты[МаксимальныйИндекс];
			ОтборКомплекта.Комплект = Комплект;
			
			НайденыеСтроки = ТаблицаДанных.НайтиСтроки(ОтборКомплекта);
			
			Если НайденыеСтроки.Количество() > 0 Тогда
				
				Если МаксимальныйИндекс = х И КоличествоКомплектов = МаксимальноеКоличество Тогда
				
					стПараметровОбласти.ГраницаСнизу 	= ЛинияГраницы;
				
				КонецЕсли;
				
				стПараметровОбласти.Текст 		= НайденыеСтроки[0].КомплектНаименование;	
				стПараметровОбласти.Расшифровка = НайденыеСтроки[0].Комплект;	
				Область = омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти);
				Область.АвтоВысотаСтроки	= Ложь;
				Область.ОтступСправа 		= 2;	
				Область.ОтступСверху 		= 2;	
				Область.ОтступСнизу 		= 2;	
				Область.ОтступСлева 		= 2;	
				
			КонецЕсли;
			
			стПараметровОбласти.НомерСтроки 	= стПараметровОбласти.НомерСтроки + 1;
			стПараметровОбласти.ГраницаСверху 	= НетЛиния;

		КонецЦикла;
		
		Если НЕ МаксимальноеКоличество = КоличествоКомплектов Тогда
		
			стПараметровОбласти.Текст 		= "";	
			стПараметровОбласти.Расшифровка = Неопределено;	
			
			Для х = МаксимальныйИндекс + 1 По МаксимальноеКоличество - 1 Цикл
				
				Если МаксимальноеКоличество - 1 = х Тогда
					стПараметровОбласти.ГраницаСнизу 	= ЛинияГраницы;
				КонецЕсли;
				Область = омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти);
				стПараметровОбласти.НомерСтроки 	= стПараметровОбласти.НомерСтроки + 1;
			
			КонецЦикла;	
		
		КонецЕсли;
		
	КонецЕсли;
	
	стПараметровОбласти.НомерКолонки 			= стПараметровОбласти.НомерКолонки + 1;
	стПараметровОбласти.НомерСтроки 			= НомерСтрокиВывода;
	
	МаксимальныйИндекс = КоличествоИзделий - 1;
	Если КоличествоИзделий > 0 Тогда
		
		ОтборИзделия = Новый Структура("Образец, ИзделиеЗаказчика", Отбор.Образец);
		
		стПараметровОбласти.ГраницаСлева 	= ЛинияГраницы;
		стПараметровОбласти.ГраницаСправа 	= ЛинияГраницы;
		стПараметровОбласти.ГраницаСверху 	= ЛинияГраницы;
		стПараметровОбласти.ГраницаСнизу 	= НетЛиния;
		
		
		Для х = 0 По МаксимальныйИндекс Цикл
			
			ИзделиеЗаказчика = КомплектыИзделия.мИзделияЗаказчика[х];
			ОтборИзделия.ИзделиеЗаказчика = ИзделиеЗаказчика;
			
			НайденыеСтроки = ТаблицаДанных.НайтиСтроки(ОтборИзделия);
			
			Если НайденыеСтроки.Количество() > 0 Тогда
				
				Если МаксимальныйИндекс = х И КоличествоИзделий = МаксимальноеКоличество Тогда
				
					стПараметровОбласти.ГраницаСнизу 	= ЛинияГраницы;
				
				КонецЕсли;
				
				стПараметровОбласти.Текст 		= НайденыеСтроки[0].ИзделиеЗаказчикаНаименование;	
				стПараметровОбласти.Расшифровка = НайденыеСтроки[0].ИзделиеЗаказчика;	
				Область = омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти);
				//Область.АвтоВысотаСтроки	= Ложь;
				Область.ОтступСправа 		= 2;	
				Область.ОтступСверху 		= 2;	
				Область.ОтступСнизу 		= 2;	
				Область.ОтступСлева 		= 2;	
				
			КонецЕсли;
			
			стПараметровОбласти.НомерСтроки 	= стПараметровОбласти.НомерСтроки + 1;
			стПараметровОбласти.ГраницаСверху 	= НетЛиния;

		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ МаксимальноеКоличество = КоличествоИзделий Тогда
		
		стПараметровОбласти.Текст 		= "";	
		стПараметровОбласти.Расшифровка = Неопределено;	
		
		Для х = МаксимальныйИндекс По МаксимальноеКоличество - 1 Цикл
			
			Если МаксимальноеКоличество - 1 = х Тогда
				стПараметровОбласти.ГраницаСнизу 	= ЛинияГраницы;
			КонецЕсли;
			Область = омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти);
			стПараметровОбласти.НомерСтроки 	= стПараметровОбласти.НомерСтроки + 1;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	
КонецПроцедуры  

Функция ПолучитьКомплектыОбразца(Отбор, ТаблицаДанных)

	мКомплекты 			= Новый Массив;
	мИзделияЗаказчика 	= Новый Массив;
	
	Для каждого х Из ТаблицаДанных.НайтиСтроки(Отбор) Цикл
	
		Если мКомплекты.Найти(х.Комплект) = Неопределено Тогда
			мКомплекты.Добавить(х.Комплект);	
		КонецЕсли;	
	
		Если мИзделияЗаказчика.Найти(х.ИзделиеЗаказчика) = Неопределено Тогда
			мИзделияЗаказчика.Добавить(х.ИзделиеЗаказчика);	
		КонецЕсли;	
	
	КонецЦикла;
	
	Возврат Новый Структура("мКомплекты, мИзделияЗаказчика", мКомплекты, мИзделияЗаказчика);
	
КонецФункции // ПолучитьКомплектыОбразца()

Функция ПолучитьТаблицыДанных()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплектОбразцы.Образец КАК Образец,
		|	ИзделияКомплектОбразцы.Ссылка КАК Комплект,
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка КАК ИзделиеЗаказчика,
		|	ИзделияКомплектОбразцы.Образец.Наименование КАК ОбразецНаименование,
		|	ИзделияКомплектИзделияЭлемент.Ссылка.Наименование КАК КомплектНаименование,
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка.Наименование КАК ИзделиеЗаказчикаНаименование,
		|	ИзделияКомплектОбразцы.Образец.Код КАК ОбразецКод
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.ИзделияКомплект.Образцы КАК ИзделияКомплектОбразцы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|			ПО ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент = ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент
		|		ПО ИзделияКомплектОбразцы.Ссылка = ИзделияКомплектИзделияЭлемент.Ссылка
		|ГДЕ
		|	ИзделияКомплектОбразцы.Ссылка.Проект = &Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Образец КАК Образец
		|ПОМЕСТИТЬ втОбразец
		|ИЗ
		|	вт КАК вт
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.Образец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КартинкиОбъектов.ОбъектТЗ КАК ОбъектТЗ,
		|	МИНИМУМ(КартинкиОбъектов.НомерПоПорядку) КАК НомерПоПорядку
		|ПОМЕСТИТЬ втНомерКартинки
		|ИЗ
		|	втОбразец КАК втОбразец
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КартинкиОбъектов КАК КартинкиОбъектов
		|		ПО втОбразец.Образец.Ссылка = КартинкиОбъектов.ОбъектТЗ
		|
		|СГРУППИРОВАТЬ ПО
		|	КартинкиОбъектов.ОбъектТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Образец КАК Образец,
		|	вт.Комплект КАК Комплект,
		|	вт.ИзделиеЗаказчика КАК ИзделиеЗаказчика,
		|	вт.ОбразецНаименование КАК ОбразецНаименование,
		|	вт.КомплектНаименование КАК КомплектНаименование,
		|	вт.ИзделиеЗаказчикаНаименование КАК ИзделиеЗаказчикаНаименование
		|ИЗ
		|	вт КАК вт
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбразецНаименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КартинкиОбъектов.ОбъектТЗ КАК Образец,
		|	КартинкиОбъектов.Описание КАК Описание,
		|	КартинкиОбъектов.Картинка КАК Картинка
		|ИЗ
		|	втНомерКартинки КАК втНомерКартинки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КартинкиОбъектов КАК КартинкиОбъектов
		|		ПО втНомерКартинки.ОбъектТЗ = КартинкиОбъектов.ОбъектТЗ
		|			И втНомерКартинки.НомерПоПорядку = КартинкиОбъектов.НомерПоПорядку";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат Новый Структура("Данные, Картинки", Результат[3].Выгрузить(), Результат[4].Выгрузить());

КонецФункции // ПолучитьТаблицуДанных()

Процедура ВывестиШапкуСКартинками(стПараметровОбласти)

	мШиринаКолонок = Новый Массив(4);
	мШиринаКолонок[0] = 1;
	мШиринаКолонок[1] = 40;
	мШиринаКолонок[2] = 35;
	мШиринаКолонок[3] = 35;
	омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(ПолеВывода, мШиринаКолонок);
	
	стПараметровОбласти.НомерСтроки 			= 2;
	стПараметровОбласти.НомерКолонки 			= 2;
	стПараметровОбласти.РазмерШрифта 			= 9; 
	стПараметровОбласти.Полужирный     			= Истина; 
	стПараметровОбласти.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	стПараметровОбласти.Текст 					= Строка(Проект);
	//стПараметровОбласти.РазмещениеТекста 		= ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти);
	
	стПараметровОбласти.РазмерШрифта 			= 8; 
	стПараметровОбласти.НомерСтроки 			= 4;
	стПараметровОбласти.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	стПараметровОбласти.Текст 					= "Картинки";
	омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти);
	
	стПараметровОбласти.НомерКолонки 			= 3;
	стПараметровОбласти.Текст 					= "Комплекты";
	омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти);
	
	стПараметровОбласти.НомерКолонки 			= 4;
	стПараметровОбласти.Текст 					= "Изделия заказчика";
	омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти);
	
	омТабличныйДокументКлиентСервер.ОбвестиОбласть(ПолеВывода, , Истина, 
								"R" + стПараметровОбласти.НомерСтроки + "C2:R" + стПараметровОбласти.НомерСтроки + "C4");
	

КонецПроцедуры


Процедура ВывестиБезКартинок()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплектОбразцы.Образец КАК Образец,
		|	ИзделияКомплектОбразцы.ТребуетсяОбразец КАК ТребуетсяОбразец,
		|	ИзделияКомплектОбразцы.КомпонентИзделия КАК КомпонентИзделия,
		|	ИзделияКомплектОбразцы.Комментарий КАК Комментарий,
		|	ИзделияКомплектОбразцы.Ссылка КАК Комплект,
		|	ИзделияКомплектОбразцы.Ссылка.Наименование КАК НаименованиеКомплекта,
		|	ИзделияКомплектОбразцы.Образец.Представление КАК ОбразецПредставление
		|ИЗ
		|	Справочник.ИзделияКомплект.Образцы КАК ИзделияКомплектОбразцы
		|ГДЕ
		|	ИзделияКомплектОбразцы.Ссылка.Проект = &Проект
		|	И ВЫБОР
		|			КОГДА &НеЗаполненые
		|				ТОГДА ИзделияКомплектОбразцы.ТребуетсяОбразец
		|						И ИзделияКомплектОбразцы.Образец = ЗНАЧЕНИЕ(Справочник.Образцы.ПустаяСсылка)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеКомплекта,
		|	КомпонентИзделия";
	
	Запрос.УстановитьПараметр("Проект", 		Проект);
	Запрос.УстановитьПараметр("НеЗаполненые", 	НеЗаполненые);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = Отчеты.ТаблицаОтделок.ПолучитьМакет("Макет");
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Проект = Проект;
	ПолеВывода.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Строка");
	Пока Выборка.Следующий() Цикл
		
		Область.Параметры.Заполнить(Выборка);		
		ПолеВывода.Вывести(Область);
		
	КонецЦикла;
	
КонецПроцедуры // ПолучитьТаблицуВывода()

&НаКлиенте
Процедура Обновить(Команда)
	
	Если ЗначениеЗаполнено(Проект) Тогда
		ОбновитьНаКлиенте();
	Иначе
		ПоказатьПредупреждение(, "Не заполнен проект.");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаКлиенте()

	Если ЗначениеЗаполнено(Проект) Тогда
		ОбновитьНаСервере();
	КонецЕсли;

КонецПроцедуры // Обновить()


&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ОбновитьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура НеЗаполненыеПриИзменении(Элемент)
	ОбновитьНаКлиенте();
КонецПроцедуры


&НаКлиенте
Процедура ВыводитьКартинкиПриИзменении(Элемент)
	
	НеЗаполненые = Ложь;
	Элементы.НеЗаполненые.ТолькоПросмотр = ВыводитьКартинки;
	
	ОбновитьНаКлиенте();
КонецПроцедуры

