
&НаСервере
Процедура ОбновитьНаСервере()

	ПолеВывода.Очистить();	

	Если ВыводитьКартинки Тогда
	
		
		
	
	Иначе
	
		ВывестиБезКартинок();	
	
	КонецЕсли;	
	
КонецПроцедуры 

Функция ВывестиБезКартинок()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплектОбразцы.Образец КАК Образец,
		|	ИзделияКомплектОбразцы.ТребуетсяОбразец КАК ТребуетсяОбразец,
		|	ИзделияКомплектОбразцы.КомпонентИзделия КАК КомпонентИзделия,
		|	ИзделияКомплектОбразцы.Комментарий КАК Комментарий,
		|	ИзделияКомплектОбразцы.Ссылка КАК Комплект,
		|	ИзделияКомплектОбразцы.Ссылка.Наименование КАК НаименованиеКомплекта,
		|	ИзделияКомплектОбразцы.Образец.Представление КАК ОбразецПредставление
		|ИЗ
		|	Справочник.ИзделияКомплект.Образцы КАК ИзделияКомплектОбразцы
		|ГДЕ
		|	ИзделияКомплектОбразцы.Ссылка.Проект = &Проект
		|	И ВЫБОР
		|			КОГДА &НеЗаполненые
		|				ТОГДА ИзделияКомплектОбразцы.ТребуетсяОбразец
		|						И ИзделияКомплектОбразцы.Образец = ЗНАЧЕНИЕ(Справочник.Образцы.ПустаяСсылка)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеКомплекта,
		|	КомпонентИзделия";
	
	Запрос.УстановитьПараметр("Проект", 		Проект);
	Запрос.УстановитьПараметр("НеЗаполненые", 	НеЗаполненые);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = Отчеты.ТаблицаОтделок.ПолучитьМакет("Макет");
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Проект = Проект;
	ПолеВывода.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Строка");
	Пока Выборка.Следующий() Цикл
		
		Область.Параметры.Заполнить(Выборка);		
		ПолеВывода.Вывести(Область);
		
	КонецЦикла;
	
КонецФункции // ПолучитьТаблицуВывода()


&НаКлиенте
Процедура Обновить(Команда)
	
	Если ЗначениеЗаполнено(Проект) Тогда
		ОбновитьНаКлиенте();
	Иначе
		ПоказатьПредупреждение(, "Не заполнен проект.");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаКлиенте()

	Если ЗначениеЗаполнено(Проект) Тогда
		ОбновитьНаСервере();
	КонецЕсли;

КонецПроцедуры // Обновить()


&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ОбновитьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура НеЗаполненыеПриИзменении(Элемент)
	ОбновитьНаКлиенте();
КонецПроцедуры

