
&НаСервере
Процедура ОбновитьНаСервере()

	ПолеВывода.Очистить();	

	Если ВыводитьКартинки Тогда
		ВывестиСКартинками();	
	Иначе
		ВывестиБезКартинок();	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВывестиСКартинками()
	
	СтруктураТаблицДанных = ПолучитьТаблицыДанных();
	КартинкиДанных = СтруктураТаблицДанных.Картинки;
	КартинкиДанных.Индексы.Добавить("Образец");
	
	ТаблицаДанных = СтруктураТаблицДанных.Данные;
	
	мОбразцы = омТЧ_НаКлиентеСервере.КолонкуВМассив(ТаблицаДанных, "Образец");
	
	НомерСтрокиВывода = 5;
	
	
	стПараметровОбласти = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров(Истина);
	ВывестиШапкуСКартинками(стПараметровОбласти);
	
	Отбор = Новый Структура("Образец", );
	
	Для каждого Образец Из мОбразцы Цикл
	
		Отбор.Образец = Образец;
		ВывестиОбразец(Отбор, НомерСтрокиВывода, стПараметровОбласти, ТаблицаДанных, КартинкиДанных);	
		НомерСтрокиВывода = НомерСтрокиВывода + 1;
		
	КонецЦикла;
	
КонецПроцедуры  //ВывестиСКартинками 

Процедура ВывестиОбразец(Отбор, НомерСтрокиВывода, стПараметровОбласти, ТаблицаДанных, КартинкиДанных)

	стПараметровОбласти.НомерСтроки 			= 2;
	стПараметровОбласти.НомерКолонки 			= НомерСтрокиВывода;
	
	КомплектыИзделия = ПолучитьКомплектыОбразца(Отбор, ТаблицаДанных);
	
	МаксимальноеКоличество = Макс(КомплектыИзделия.мКомплекты.Количество(), КомплектыИзделия.мИзделияЗаказчика.Количество());
	
	стПараметровОбласти.ВысотаОбласти 			= ?(МаксимальноеКоличество < 10, 10, МаксимальноеКоличество);
	
	НайденыеСтроки = КартинкиДанных.НайтиСтроки(Отбор);
	
	Если НайденыеСтроки.Количество() = 0 Тогда
	
			
	
	КонецЕсли;
	
	

КонецПроцедуры  

Функция ПолучитьКомплектыОбразца(Отбор, ТаблицаДанных)

	мКомплекты 			= Новый Массив;
	мИзделияЗаказчика 	= Новый Массив;
	
	Для каждого х Из ТаблицаДанных.НайтиСтроки(Отбор) Цикл
	
		Если мКомплекты.Найти(х.Комплект) = Неопределено Тогда
			мКомплекты.Добавить(х.Комплект);	
		КонецЕсли;	
	
		Если мИзделияЗаказчика.Найти(х.ИзделиеЗаказчика) = Неопределено Тогда
			мИзделияЗаказчика.Добавить(х.Комплект);	
		КонецЕсли;	
	
	КонецЦикла;
	
	Возврат Новый Структура("мКомплекты, мИзделияЗаказчика", мКомплекты, мИзделияЗаказчика);
	
КонецФункции // ПолучитьКомплектыОбразца()


Функция ПолучитьТаблицыДанных()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплектОбразцы.Образец КАК Образец,
		|	ИзделияКомплектОбразцы.Ссылка КАК Комплект,
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка КАК ИзделиеЗаказчика,
		|	ИзделияКомплектОбразцы.Образец.Обработка КАК ОбразецОбработка,
		|	ИзделияКомплектОбразцы.Образец.Наименование КАК ОбразецНаименование,
		|	ИзделияКомплектИзделияЭлемент.Ссылка.Наименование КАК КомплектНаименование,
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка.Наименование КАК ИзделиеЗаказчикаНаименование,
		|	ИзделияКомплектОбразцы.Образец.Код КАК ОбразецКод
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.ИзделияКомплект.Образцы КАК ИзделияКомплектОбразцы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|			ПО ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент = ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент
		|		ПО ИзделияКомплектОбразцы.Ссылка = ИзделияКомплектИзделияЭлемент.Ссылка
		|ГДЕ
		|	ИзделияКомплектОбразцы.Ссылка.Проект = &Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Образец КАК Образец
		|ПОМЕСТИТЬ втОбразец
		|ИЗ
		|	вт КАК вт
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.Образец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОбразец.Образец КАК Образец,
		|	КартинкиОбъектов.ИмяФайла КАК ИмяФайла,
		|	КартинкиОбъектов.Расширение КАК Расширение,
		|	КартинкиОбъектов.Картинка КАК Картинка,
		|	КартинкиОбъектов.Описание КАК Описание
		|ИЗ
		|	втОбразец КАК втОбразец
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КартинкиОбъектов КАК КартинкиОбъектов
		|		ПО втОбразец.Образец.Ссылка = КартинкиОбъектов.ОбъектТЗ
		|			И (КартинкиОбъектов.НомерПоПорядку = 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Образец КАК Образец,
		|	вт.Комплект КАК Комплект,
		|	вт.ИзделиеЗаказчика КАК ИзделиеЗаказчика,
		|	вт.ОбразецОбработка КАК ОбразецОбработка,
		|	вт.ОбразецНаименование КАК ОбразецНаименование,
		|	вт.КомплектНаименование КАК КомплектНаименование,
		|	вт.ИзделиеЗаказчикаНаименование КАК ИзделиеЗаказчикаНаименование
		|ИЗ
		|	вт КАК вт
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбразецНаименование";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат Новый Структура("Данные, Картинки", Результат[3].Выгрузить(), Результат[4].Выгрузить());

КонецФункции // ПолучитьТаблицуДанных()


Процедура ВывестиШапкуСКартинками(стПараметровОбласти)

	мШиринаКолонок = Новый Массив(4);
	мШиринаКолонок[0] = 1;
	мШиринаКолонок[1] = 40;
	мШиринаКолонок[2] = 35;
	мШиринаКолонок[3] = 35;
	омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(ПолеВывода, мШиринаКолонок);
	
	стПараметровОбласти.НомерСтроки 			= 2;
	стПараметровОбласти.НомерКолонки 			= 2;
	стПараметровОбласти.РазмерШрифта 			= 9; 
	стПараметровОбласти.Полужирный     			= Истина; 
	стПараметровОбласти.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	стПараметровОбласти.Текст 					= Строка(Проект);
	//стПараметровОбласти.РазмещениеТекста 		= ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти);
	
	стПараметровОбласти.РазмерШрифта 			= 8; 
	стПараметровОбласти.НомерСтроки 			= 4;
	стПараметровОбласти.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	стПараметровОбласти.Текст 					= "Картинки";
	омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти);
	
	стПараметровОбласти.НомерКолонки 			= 3;
	стПараметровОбласти.Текст 					= "Комплекты";
	омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти);
	
	стПараметровОбласти.НомерКолонки 			= 4;
	стПараметровОбласти.Текст 					= "Изделия заказчика";
	омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти);
	
	омТабличныйДокументКлиентСервер.ОбвестиОбласть(ПолеВывода, , Истина, 
								"R" + стПараметровОбласти.НомерСтроки + "C2:R" + стПараметровОбласти.НомерСтроки + "C4");
	

КонецПроцедуры



Процедура ВывестиБезКартинок()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплектОбразцы.Образец КАК Образец,
		|	ИзделияКомплектОбразцы.ТребуетсяОбразец КАК ТребуетсяОбразец,
		|	ИзделияКомплектОбразцы.КомпонентИзделия КАК КомпонентИзделия,
		|	ИзделияКомплектОбразцы.Комментарий КАК Комментарий,
		|	ИзделияКомплектОбразцы.Ссылка КАК Комплект,
		|	ИзделияКомплектОбразцы.Ссылка.Наименование КАК НаименованиеКомплекта,
		|	ИзделияКомплектОбразцы.Образец.Представление КАК ОбразецПредставление
		|ИЗ
		|	Справочник.ИзделияКомплект.Образцы КАК ИзделияКомплектОбразцы
		|ГДЕ
		|	ИзделияКомплектОбразцы.Ссылка.Проект = &Проект
		|	И ВЫБОР
		|			КОГДА &НеЗаполненые
		|				ТОГДА ИзделияКомплектОбразцы.ТребуетсяОбразец
		|						И ИзделияКомплектОбразцы.Образец = ЗНАЧЕНИЕ(Справочник.Образцы.ПустаяСсылка)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеКомплекта,
		|	КомпонентИзделия";
	
	Запрос.УстановитьПараметр("Проект", 		Проект);
	Запрос.УстановитьПараметр("НеЗаполненые", 	НеЗаполненые);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = Отчеты.ТаблицаОтделок.ПолучитьМакет("Макет");
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Проект = Проект;
	ПолеВывода.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Строка");
	Пока Выборка.Следующий() Цикл
		
		Область.Параметры.Заполнить(Выборка);		
		ПолеВывода.Вывести(Область);
		
	КонецЦикла;
	
КонецПроцедуры // ПолучитьТаблицуВывода()

&НаКлиенте
Процедура Обновить(Команда)
	
	Если ЗначениеЗаполнено(Проект) Тогда
		ОбновитьНаКлиенте();
	Иначе
		ПоказатьПредупреждение(, "Не заполнен проект.");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаКлиенте()

	Если ЗначениеЗаполнено(Проект) Тогда
		ОбновитьНаСервере();
	КонецЕсли;

КонецПроцедуры // Обновить()


&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ОбновитьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура НеЗаполненыеПриИзменении(Элемент)
	ОбновитьНаКлиенте();
КонецПроцедуры


&НаКлиенте
Процедура ВыводитьКартинкиПриИзменении(Элемент)
	
	НеЗаполненые = Ложь;
	Элементы.НеЗаполненые.ТолькоПросмотр = ВыводитьКартинки;
	
	ОбновитьНаКлиенте();
КонецПроцедуры

