
&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Проект) Тогда
		Элементы.ПредстоящиеВыезды.Доступность = Истина;
	Иначе
		
		Элементы.ПредстоящиеВыезды.Доступность = Ложь;
		ПредстоящиеВыезды = Истина;
	
	КонецЕсли;
	
	ОбновитьНаСервере();
	
КонецПроцедуры

Процедура ОбновитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

Функция ПолучитьТекстЗапроса()

	Если ПредстоящиеВыезды Тогда
	
		Возврат ТекстЗапросаПредстоящие();	
	
	Иначе
	
		Возврат ТекстЗапросаПоСделке();	
	
	КонецЕсли;

КонецФункции // ПолучитьТекстЗапроса()

Функция ТекстЗапросаПредстоящие() 
	
КонецФункции // ТекстЗапросаПредстоящие()

Функция ТекстЗапросаПоСделке()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыездНаЗамерГабаритныеЧертежи.Помещение КАК Помещение,
		|	"""" КАК Комментарий,
		|	ВыездНаЗамерГабаритныеЧертежи.ЗамерПроизведен КАК ЗамерПроизведен,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.ДатаВыездаПлан КАК ДатаВыездаПлан,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.ДатаВыездаФакт КАК ДатаВыездаФакт,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.Ссылка КАК Ссылка,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.Исполнитель КАК Замерщик,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.Автор КАК Автор,
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыЗамера.ПустаяСсылка) КАК СтатусЗамера
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Документ.ВыездНаЗамер.ГабаритныеЧертежи КАК ВыездНаЗамерГабаритныеЧертежи
		|ГДЕ
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.Проект = &Проект
		|	И ВЫБОР
		|			КОГДА &Помещение = ЗНАЧЕНИЕ(Справочник.Помещения.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ &Помещение = ВыездНаЗамерГабаритныеЧертежи.Помещение
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаявкаНаЗамерПомещения.Помещение,
		|	"""",
		|	ЛОЖЬ,
		|	ЗаявкаНаЗамерПомещения.Ссылка.ДатаВыездаПлан,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗаявкаНаЗамерПомещения.Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
		|	ЗаявкаНаЗамерПомещения.Ссылка.Автор,
		|	ЗаявкаНаЗамерПомещения.Ссылка.ОжидаемыйСтатусЗамера
		|ИЗ
		|	Документ.ЗаявкаНаЗамер.Помещения КАК ЗаявкаНаЗамерПомещения
		|ГДЕ
		|	ЗаявкаНаЗамерПомещения.Ссылка.Проект = &Проект
		|	И ВЫБОР
		|			КОГДА &Помещение = ЗНАЧЕНИЕ(Справочник.Помещения.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ &Помещение = ЗаявкаНаЗамерПомещения.Помещение
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОзнакомительныйВыездПомещения.Помещение,
		|	ОзнакомительныйВыездПомещения.Комментарий,
		|	ЛОЖЬ,
		|	ОзнакомительныйВыездПомещения.Ссылка.ДатаВыездаПлан,
		|	ОзнакомительныйВыездПомещения.Ссылка.ДатаВыездаФакт,
		|	ОзнакомительныйВыездПомещения.Ссылка,
		|	ОзнакомительныйВыездПомещения.Ссылка.Исполнитель,
		|	ОзнакомительныйВыездПомещения.Ссылка.Автор,
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыЗамера.ПустаяСсылка)
		|ИЗ
		|	Документ.ОзнакомительныйВыезд.Помещения КАК ОзнакомительныйВыездПомещения
		|ГДЕ
		|	ОзнакомительныйВыездПомещения.Ссылка.Проект = &Проект
		|	И ВЫБОР
		|			КОГДА &Помещение = ЗНАЧЕНИЕ(Справочник.Помещения.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ &Помещение = ОзнакомительныйВыездПомещения.Помещение
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АктПриемкиПомещенияПомещения.Помещение,
		|	АктПриемкиПомещенияПомещения.Комментарий,
		|	ЛОЖЬ,
		|	АктПриемкиПомещенияПомещения.Ссылка.Дата,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	АктПриемкиПомещенияПомещения.Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
		|	АктПриемкиПомещенияПомещения.Ссылка.Автор,
		|	АктПриемкиПомещенияПомещения.Ссылка.НовыйСтатус
		|ИЗ
		|	Документ.АктПриемкиПомещения.Помещения КАК АктПриемкиПомещенияПомещения
		|ГДЕ
		|	АктПриемкиПомещенияПомещения.Ссылка.Проект = &Проект
		|	И ВЫБОР
		|			КОГДА &Помещение = ЗНАЧЕНИЕ(Справочник.Помещения.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ &Помещение = АктПриемкиПомещенияПомещения.Помещение
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Помещение КАК Помещение,
		|	ВЫРАЗИТЬ(вт.Комментарий КАК СТРОКА(100)) КАК Комментарий,
		|	вт.ЗамерПроизведен КАК ЗамерПроизведен,
		|	вт.ДатаВыездаПлан КАК ДатаВыездаПлан,
		|	вт.ДатаВыездаФакт КАК ДатаВыездаФакт,
		|	вт.Ссылка КАК Документ,
		|	вт.Ссылка.Дата КАК Дата,
		|	вт.Замерщик КАК Исполнитель,
		|	вт.Автор КАК Постановщик,
		|	вт.СтатусЗамера КАК СтатусЗамера
		|ИЗ
		|	вт КАК вт
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.ДатаВыездаФакт,
		|	вт.Ссылка,
		|	вт.СтатусЗамера,
		|	вт.ЗамерПроизведен,
		|	вт.Помещение,
		|	вт.ДатаВыездаПлан,
		|	вт.Замерщик,
		|	вт.Автор,
		|	вт.Ссылка.Дата,
		|	ВЫРАЗИТЬ(вт.Комментарий КАК СТРОКА(100))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВыездаПлан
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВыездНаЗамерГабаритныеЧертежи.Ссылка КАК Документ.ВыездНаЗамер) КАК ВыездНаЗамер,
		|	ВыездНаЗамерГабаритныеЧертежи.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
		|	ВыездНаЗамерГабаритныеЧертежи.Комментарий КАК Комментарий,
		|	ВыездНаЗамерГабаритныеЧертежи.ЗамерПроизведен КАК ЗамерПроизведен,
		|	ВыездНаЗамерГабаритныеЧертежи.Помещение КАК Помещение
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыездНаЗамер.ГабаритныеЧертежи КАК ВыездНаЗамерГабаритныеЧертежи
		|		ПО ((ВЫРАЗИТЬ(вт.Ссылка КАК Документ.ВыездНаЗамер)) = ВыездНаЗамерГабаритныеЧертежи.Ссылка)
		|			И (ВЫБОР
		|				КОГДА &Помещение = ЗНАЧЕНИЕ(Справочник.Помещения.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ &Помещение = ВыездНаЗамерГабаритныеЧертежи.Помещение
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫРАЗИТЬ(ВыездНаЗамерГабаритныеЧертежи.Ссылка КАК Документ.ВыездНаЗамер),
		|	ВыездНаЗамерГабаритныеЧертежи.ГабаритныйЧертеж,
		|	ВыездНаЗамерГабаритныеЧертежи.Комментарий,
		|	ВыездНаЗамерГабаритныеЧертежи.ЗамерПроизведен,
		|	ВыездНаЗамерГабаритныеЧертежи.Помещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(вт.Ссылка.Комментарий КАК СТРОКА(100)) КАК КомментарийДокумента,
		|	вт.Ссылка КАК Документ,
		|	вт.Ссылка.СокращенноеНазвание КАК СокращенноеНазвание
		|ИЗ
		|	вт КАК вт
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.Ссылка,
		|	ВЫРАЗИТЬ(вт.Ссылка.Комментарий КАК СТРОКА(100)),
		|	вт.Ссылка.СокращенноеНазвание";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Помещение", Помещение);
	
	Результат = Запрос.ВыполнитьПакет();
	
	тзГЧ = Результат[2].Выгрузить();
	
	тзКомментарий = Результат[3].Выгрузить();
	
	Выборка = Результат[1].Выбрать();
	
	Макет = Отчеты.ГрафикЗамеровПолный.ПолучитьМакет("Макет");
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Проект = Проект;
	
	ПолеВывода.Очистить();
	
	ПолеВывода.Вывести(Область);
	Область 	= Макет.ПолучитьОбласть("Строка");
	ОбластьГЧ 	= Макет.ПолучитьОбласть("СтрокаГЧ");
	
	стОтбор = Новый Структура("ВыездНаЗамер, Помещение", );
	
	Пока Выборка.Следующий() Цикл
		
		ЕстьВложения = Ложь;
		
		Если ТипЗнч(Выборка.Документ) = Тип("ДокументСсылка.ВыездНаЗамер") Тогда
			
			стОтбор.ВыездНаЗамер 	= Выборка.Документ;
			стОтбор.Помещение 		= Выборка.Помещение;
			
			НайденыеСтроки = тзГЧ.НайтиСтроки(стОтбор);
			
			ЕстьВложения = НайденыеСтроки.Количество() > 0;
			
		КонецЕсли;
		
		Область.Параметры.Заполнить(Выборка); 
		Область.Параметры.Проект = Проект; 
		
		НайденаяСтрока = тзКомментарий.Найти(Выборка.Документ, "Документ");
		
		Если НЕ НайденаяСтрока = Неопределено Тогда
		
			Область.Параметры.КомментарийДокумента 	= НайденаяСтрока.КомментарийДокумента;	
			Область.Параметры.СокращенноеНазвание 	= НайденаяСтрока.СокращенноеНазвание;	
		
		КонецЕсли;
		
		Если ЕстьВложения Тогда
			
			ПолеВывода.НачатьАвтогруппировкуСтрок();	
			ПолеВывода.Вывести(Область, 1, , Ложь);
			Для каждого х Из НайденыеСтроки Цикл
				
				ОбластьГЧ.Параметры.Заполнить(х);
				ОбластьГЧ.Параметры.Проект = Проект; 
				ПолеВывода.Вывести(ОбластьГЧ, 2, , Ложь);
			
			КонецЦикла;
			
			ПолеВывода.ЗакончитьАвтогруппировкуСтрок();	
			
		Иначе
			ПолеВывода.Вывести(Область);
		КонецЕсли; 
		
		
	КонецЦикла;
	

КонецФункции // ТекстЗапросаПоСделке()

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	Элементы.ГруппаПомещение.Видимость = ЗначениеЗаполнено(Помещение); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПомещениеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыводаОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Помещения") Тогда
	
		СтандартнаяОбработка = Ложь;
		Помещение = Расшифровка;
		Элементы.ГруппаПомещение.Видимость = Истина;
		
		ОбновитьНаСервере();
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПомещение(Команда)
	Помещение = Неопределено;
	Элементы.ГруппаПомещение.Видимость = ЗначениеЗаполнено(Помещение); 
	ОбновитьНаСервере();
КонецПроцедуры
