Функция ПолучитьСтркутуруДанныхДляЗаписиВРегистрДатыКомплекта(Комплект) Экспорт

	ЗначениеРесурсов = Новый Структура();
	
	Для Каждого Ресурс из Метаданные.РегистрыСведений.ДатыКомплекта.Ресурсы Цикл
		ЗначениеРесурсов.Вставить(Ресурс.Имя);
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЗначениеРесурсов, Выборка);
	КонецЦикла;
	
	Возврат ЗначениеРесурсов;
	
КонецФункции // ПолучитьСтркутуруДанныхДляЗаписиВРегистр()

Процедура ЗаписатьВРегистрДатыКомплекта(ЗначениеРесурсов) Экспорт

	Если НЕ ЗначениеЗаполнено(ЗначениеРесурсов.Комплект) Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ДатыКомплекта.СоздатьМенеджерЗаписи();
	
	Если Не ЗначениеЗаполнено(ЗначениеРесурсов.Проект) Тогда
	
		ЗначениеРесурсов.Проект = ЗначениеРесурсов.Комплект.Проект;	
	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЗначениеРесурсов);
	
	МенеджерЗаписи.Записать();

КонецПроцедуры


Процедура УвеличитьНомерДоработки(ОбъектРасчета) Экспорт
	ИзменитьНомерДоработки(ОбъектРасчета, "+1")	
КонецПроцедуры

Процедура СбросНомерДоработки(ОбъектРасчета) Экспорт
	ИзменитьНомерДоработки(ОбъектРасчета, "Сброс")	
КонецПроцедуры 

Процедура ИзменитьНомерДоработки(ОбъектРасчета, ЗначениеНомера) Экспорт

	ТипКомплекта = ТипЗнч(ОбъектРасчета);
	
	Если ТипКомплекта = Тип("ЗадачаСсылка.Задачи_ПКД") ИЛИ ТипКомплекта = Тип("ЗадачаСсылка.Задачи_РКД") Тогда
		Комплект = ОбъектРасчета.ОбъектТЗ;
	Иначе	
		Комплект = ОбъектРасчета; 	
	КонецЕсли;
	
  	ЗначениеРесурсов = ПолучитьСтркутуруДанныхДляЗаписиВРегистрДатыКомплекта(Комплект); 
	
	Если ТипЗнч(ЗначениеНомера) = Тип("Строка") Тогда
	
		Если ЗначениеНомера = "Сброс" Тогда
			НомерДоработка = 0;	
		ИначеЕсли ЗначениеНомера = "+1" Тогда
			НомерДоработка = ЗначениеРесурсов.НомерДоработка + 1;
		КонецЕсли;	
	
	Иначе
	
		НомерДоработка = ЗначениеНомера; 
	
	КонецЕсли;
	
	ЗначениеРесурсов.НомерДоработка = НомерДоработка;
	ЗаписатьВРегистрДатыКомплекта(ЗначениеРесурсов);
	
КонецПроцедуры

