Функция ПолучитьСтркутуруДанныхДляЗаписиВРегистрДатыКомплекта(Комплект) Экспорт

	ЗначениеРесурсов = Новый Структура();
	
	Для Каждого Ресурс из Метаданные.РегистрыСведений.ДатыКомплекта.Ресурсы Цикл
		ЗначениеРесурсов.Вставить(Ресурс.Имя);
	КонецЦикла;
	ЗначениеРесурсов.Вставить("Комплект", Комплект);
	ЗначениеРесурсов.Вставить("Проект");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЗначениеРесурсов, Выборка);
	КонецЦикла;
	
	Возврат ЗначениеРесурсов;
	
КонецФункции // ПолучитьСтркутуруДанныхДляЗаписиВРегистр()

Процедура ЗаписатьВРегистрДатыКомплекта(ЗначениеРесурсов) Экспорт

	Если НЕ ЗначениеЗаполнено(ЗначениеРесурсов.Комплект) Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ДатыКомплекта.СоздатьМенеджерЗаписи();
	
	Если Не ЗначениеЗаполнено(ЗначениеРесурсов.Проект) Тогда
	
		ЗначениеРесурсов.Проект = ЗначениеРесурсов.Комплект.Проект;	
	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЗначениеРесурсов);
	
	МенеджерЗаписи.Записать();

КонецПроцедуры


Процедура УвеличитьНомерСчетчика(ОбъектРасчета, НаименованиеПараметра) Экспорт
	ИзменитьНомерДоработки(ОбъектРасчета, "+1", НаименованиеПараметра);	
КонецПроцедуры

Процедура СбросНомерСчетчика(ОбъектРасчета, НаименованиеПараметра) Экспорт
	ИзменитьНомерДоработки(ОбъектРасчета, "Сброс", НаименованиеПараметра);	
КонецПроцедуры 

Процедура УстановитНомерДоработки(ОбъектРасчета, ЗначениеНомера) Экспорт
	ИзменитьНомерДоработки(ОбъектРасчета, ЗначениеНомера, "НомерДоработка");	
КонецПроцедуры 

Процедура УстановитНомерПКД(ОбъектРасчета, ЗначениеНомера) Экспорт
	ИзменитьНомерДоработки(ОбъектРасчета, ЗначениеНомера, "НомерПКД");	
КонецПроцедуры 

Процедура УстановитНомерРКД(ОбъектРасчета, ЗначениеНомера) Экспорт
	ИзменитьНомерДоработки(ОбъектРасчета, ЗначениеНомера, "НомерРКД");	
КонецПроцедуры 

Процедура ИзменитьНомерДоработки(ОбъектРасчета, ЗначениеНомера, НаименованиеПараметра)

  	ЗначениеРесурсов = ПолучитьСтркутуруДанных(ОбъектРасчета); 
	
	Если ТипЗнч(ЗначениеНомера) = Тип("Строка") Тогда
	
		Если ЗначениеНомера = "Сброс" Тогда
			ЗначениеСчетчика = 0;	
		ИначеЕсли ЗначениеНомера = "+1" Тогда
			ЗначениеСчетчика = ЗначениеРесурсов[НаименованиеПараметра] + 1;
		КонецЕсли;	
	
	Иначе
	
		ЗначениеСчетчика = ЗначениеНомера; 
	
	КонецЕсли;
	
	ЗначениеРесурсов[НаименованиеПараметра] = ЗначениеСчетчика;
	ЗаписатьВРегистрДатыКомплекта(ЗначениеРесурсов);
	
КонецПроцедуры 

Функция ПолучитьСтркутуруДанных(ОбъектРасчета)

	ТипКомплекта = ТипЗнч(ОбъектРасчета);
	
	Если ТипКомплекта = Тип("ЗадачаСсылка.Задачи_ПКД") ИЛИ ТипКомплекта = Тип("ЗадачаСсылка.Задачи_РКД") Тогда
		Комплект = ОбъектРасчета.ОбъектТЗ;
	Иначе	
		Комплект = ОбъектРасчета; 	
	КонецЕсли;
	
  	Возврат ПолучитьСтркутуруДанныхДляЗаписиВРегистрДатыКомплекта(Комплект); 

КонецФункции // ПолучитьСтркутуруДанных()


