Функция СоздатьЗадачуПоПараметрам(стДанные) Экспорт

	НоваяЗадача = Задачи.ПодготовкаПроекта.СоздатьЗадачу();
	ЗаполнитьЗначенияСвойств(НоваяЗадача, стДанные);

	НоваяЗадача.Записать();
	
КонецФункции // создатьЗадачу()

Функция ПолучитьСтруктуруДляСозданияЗадачи(ПриложениеКДоговору, ТипЗадачи, Назначение = Неопределено, Основание = Неопределено) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриложенияКДоговорам.Проект КАК Проект,
		|	ПриложенияКДоговорам.Проект.Наименование КАК ПроектНаименование
		|ИЗ
		|	Справочник.ПриложенияКДоговорам КАК ПриложенияКДоговорам
		|ГДЕ
		|	ПриложенияКДоговорам.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПриложениеКДоговору);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Проект 				= Неопределено;
	ПроектНаименование 	= Неопределено;
	
	Пока Выборка.Следующий() Цикл
		Проект 				= Выборка.Проект;
		ПроектНаименование 	= Выборка.ПроектНаименование;
	КонецЦикла;
	
	стНазначение = Неопределено;
	
	стДанные = Новый Структура();
	стДанные.Вставить("ТипЗадачи", 				ТипЗадачи);
	стДанные.Вставить("Исполнитель", 			Справочники.НазначениеАвтораДляЗадачи.ПолучитьАвтораДляЗадачи(Проект, ТипЗадачи, стНазначение));
	стДанные.Вставить("Дата", 					ТекущаяДата());
	стДанные.Вставить("КрайняяДатаИсполнения", 	стДанные.Дата + 24 * 3600 * стНазначение.Продолжительность);
	стДанные.Вставить("Проект", 				Проект);
	стДанные.Вставить("ПриложениеКДоговору", 	ПриложениеКДоговору);
	стДанные.Вставить("Назначение", 			Назначение);
	стДанные.Вставить("Основание", 				Основание);
	стДанные.Вставить("АвторСоздания", 			ПараметрыСеанса.ТекущийПользователь);
	стДанные.Вставить("Наименование", 			Строка(ТипЗадачи) + " " + ПроектНаименование);
	стДанные.Вставить("Комментарий", 			"");
	
	Возврат стДанные;

КонецФункции // ПолучитьСтруктуруДляСозданияЗадачи()

  
Процедура СоздатьЗадачиПоЗаполнению(Проект, мСсылкиКомплекты, Основание) Экспорт

	КоличествоКомплектов = мСсылкиКомплекты.Количество();
	
	Если КоличествоКомплектов = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	ТипСтрокойПроизводства 	= " срок производства"; 
	ТипСтрокойМонтаж 		= " срок монтажа";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Комплект,
		|	ИзделияКомплект.Наименование КАК КомплектНаименование
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", мСсылкиКомплекты);
	
	тзКомплектСНаименованием = Запрос.Выполнить().Выгрузить();
	
	тзСозданныеЗадачи = ПолучитьСозданныеЗадачи(мСсылкиКомплекты, Основание);
	стОтборСозданных = Новый Структура("ТипЗадачи, Комплект", );
	
	стПараметрыМонтаж 		= Задачи.ПодготовкаПроекта.ПолучитьСтруктуруДляСозданияЗадачи(Проект, Перечисления.ОбъектыЗадач.ЗаполненияДлительностиМонтажа, 		, Основание);
	стПараметрыПроизводства = Задачи.ПодготовкаПроекта.ПолучитьСтруктуруДляСозданияЗадачи(Проект, Перечисления.ОбъектыЗадач.ЗаполнениеДлительностиПроизводства, , Основание);
	
	Для х = 0 по КоличествоКомплектов - 1 Цикл
		
		стКомплект = тзКомплектСНаименованием[х];
		
		стОтборСозданных.Комплект 	= стКомплект.Комплект;
		стОтборСозданных.ТипЗадачи 	= Перечисления.ОбъектыЗадач.ЗаполненияДлительностиМонтажа;
		
		Если тзСозданныеЗадачи.НайтиСтроки(стОтборСозданных).Количество() = 0 Тогда
			
			стПараметрыМонтаж.Наименование 	= СтрШаблон("%1 %2", стКомплект.КомплектНаименование, ТипСтрокойМонтаж);
			стПараметрыМонтаж.Назначение 	= стКомплект.Комплект;
			
			Задачи.ПодготовкаПроекта.СоздатьЗадачуПоПараметрам(стПараметрыМонтаж);
			
		КонецЕсли;
		
		стОтборСозданных.ТипЗадачи 	= Перечисления.ОбъектыЗадач.ЗаполнениеДлительностиПроизводства;
		
		Если тзСозданныеЗадачи.НайтиСтроки(стОтборСозданных).Количество() = 0 Тогда
			
			стПараметрыПроизводства.Наименование 	= СтрШаблон("%1 %2", стКомплект.КомплектНаименование, ТипСтрокойПроизводства);
			стПараметрыПроизводства.Назначение 		= стКомплект.Комплект;
			
			Задачи.ПодготовкаПроекта.СоздатьЗадачуПоПараметрам(стПараметрыПроизводства);
			
		КонецЕсли;
		
	КонецЦикла;                                                             
	
КонецПроцедуры

Функция ПолучитьСозданныеЗадачи(мКомплекты, Основание)

	мТипыЗадач 		= Новый Массив(2);
	мТипыЗадач[0] 	= Перечисления.ОбъектыЗадач.ЗаполненияДлительностиМонтажа;
	мТипыЗадач[1] 	= Перечисления.ОбъектыЗадач.ЗаполнениеДлительностиПроизводства;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодготовкаПроекта.ТипЗадачи КАК ТипЗадачи,
		|	ПодготовкаПроекта.Назначение КАК Комплект
		|ИЗ
		|	Задача.ПодготовкаПроекта КАК ПодготовкаПроекта
		|ГДЕ
		|	ПодготовкаПроекта.Назначение В(&Назначение)
		|	И ПодготовкаПроекта.Основание = &Основание
		|	И ПодготовкаПроекта.ТипЗадачи В(&ТипЗадачи)";
	
	Запрос.УстановитьПараметр("Назначение", мКомплекты);
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("ТипЗадачи", мТипыЗадач);
	
	Возврат Запрос.Выполнить().Выгрузить();
	

КонецФункции // ПолучитьСозданныеЗадачи()

