
Процедура ПриВыполнении(Отказ)
	
	
	Если ТипЗадачи = Перечисления.ОбъектыЗадач.СоздатьКартуПроектаДиз Тогда   
		АнализСозданиеПланаСделки();	
	ИначеЕсли ТипЗадачи = Перечисления.ОбъектыЗадач.СоздатьКартуПроектаКон Тогда
		АнализПринятиеПланаСделки();	
	КонецЕсли;


КонецПроцедуры

Процедура АнализСозданиеПланаСделки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодготовкаПроекта.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ПодготовкаПроекта КАК ПодготовкаПроекта
		|ГДЕ
		|	ПодготовкаПроекта.Назначение = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗадачи = ПредопределенноеЗначение("Перечисление.ОбъектыЗадач.СоздатьКартуПроектаКон");	
	
	стПараметры = Задачи.ПодготовкаПроекта.ПолучитьСтруктуруДляСозданияЗадачи(ПриложениеКДоговору, ТипЗадачи, ПриложениеКДоговору);
	
	Задачи.ПодготовкаПроекта.СоздатьЗадачуПоПараметрам(стПараметры);
	
КонецПроцедуры

Процедура АнализПринятиеПланаСделки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодготовкаПроекта.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ПодготовкаПроекта КАК ПодготовкаПроекта
		|ГДЕ
		|	ПодготовкаПроекта.Назначение = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	ТипЗадачи = ПредопределенноеЗначение("Перечисление.ОбъектыЗадач.СоздатьЗапускВРаботу");	
	
	стПараметры = Задачи.ПодготовкаПроекта.ПолучитьСтруктуруДляСозданияЗадачи(ПриложениеКДоговору, ТипЗадачи, , Ссылка); 
	Задачи.ПодготовкаПроекта.СоздатьЗадачуПоПараметрам(стПараметры);
	

КонецПроцедуры 


