
Процедура ОбработкаПроведения(Отказ, Режим)

	ИзделиеКомплект = ПроизводственныйКомплект.ИзделиеКомплект;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственныеКомплекты.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ВыпускПроизводственногоКомплекта.Ссылка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьВыпуск
		|ИЗ
		|	Справочник.ПроизводственныеКомплекты КАК ПроизводственныеКомплекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыпускПроизводственногоКомплекта КАК ВыпускПроизводственногоКомплекта
		|		ПО (ВыпускПроизводственногоКомплекта.ПроизводственныйКомплект = ПроизводственныеКомплекты.Ссылка)
		|ГДЕ
		|	ПроизводственныеКомплекты.ИзделиеКомплект = &ИзделиеКомплект
		|	И ВыпускПроизводственногоКомплекта.Проведен";
	
	Запрос.УстановитьПараметр("ИзделиеКомплект", ИзделиеКомплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВсеИзготовленно = Неопределено;
	
	
	Пока Выборка.Следующий() Цикл
		Если ВсеИзготовленно = Неопределено Тогда
			ВсеИзготовленно = Выборка.ЕстьВыпуск;
		ИначеЕсли НЕ Выборка.ЕстьВыпуск Тогда
			ВсеИзготовленно = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// регистр ВыпускиПроизводственныхКомплектов
	Движения.ВыпускиПроизводственныхКомплектов.Записывать = Истина;
	Движение = Движения.ВыпускиПроизводственныхКомплектов.Добавить();
	Движение.ИзделиеКомплект = ИзделиеКомплект;
	Движение.ВсеИзготовленно = ВсеИзготовленно;

КонецПроцедуры
