
&НаКлиенте
Процедура Заполнить(Команда)
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена дата";
		Сообщение.Поле = "ДатаНачала";
		Сообщение.Сообщить();
		
	ИначеЕсли КоличествоДней = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнено количество дней";
		Сообщение.Поле = "КоличествоДней";
		Сообщение.ПутьКДанным = "КоличествоДней";
		Сообщение.Сообщить();
		
	Иначе
		
		стДанные = Новый Структура("ДатаНачала, КоличествоДней", ДатаНачала, КоличествоДней);
		Закрыть(стДанные);
		
	КонецЕсли;
КонецПроцедуры
