
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Объект = Изделие.Проект;
	
	// регистр СметаПредварительная 
	Движения.СметаПредварительная.Записывать = Истина;
	Для Каждого ТекСтрокаНоменклатура Из Номенклатура Цикл
		Движение = Движения.СметаПредварительная.Добавить();
		Движение.Период = Дата;
		Движение.Объект = Объект;
		Движение.ПредварительнаяНоменклатура = ТекСтрокаНоменклатура.Номенклатура;
		Движение.Количество = ТекСтрокаНоменклатура.Количество;
		Движение.Сумма = ТекСтрокаНоменклатура.Сумма;
	КонецЦикла;

КонецПроцедуры
