
&НаСервере
Процедура ОбновитьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКолонки.УИД КАК УИД,
		|	КанбанКолонки.Наименование КАК Наименование,
		|	КанбанКарточки.Ресурс КАК Ресурс
		|ПОМЕСТИТЬ втКолонки
		|ИЗ
		|	РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|			ПО КанбанПереходКарточкиСрезПоследних.УИДКарточка = КанбанКарточки.УИД
		|		ПО КанбанКолонки.УИД = КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка
		|ГДЕ
		|	КанбанКолонки.Доска = &Доска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКолонки.Наименование КАК НаименованиеСтатуса,
		|	Задачи_ПКД.Выполнена КАК Выполнена,
		|	ТаймингЗадачСрезПоследних.Период КАК ДатаЗаЗавершение,
		|	Задачи_ПКД.Ссылка КАК Задача,
		|	""ПКД"" КАК ТипЗадачи,
		|	ТаймингЗадачСрезПоследних.Период КАК Период,
		|	втКолонки.Ресурс.Наименование КАК РесурсНаименование,
		|	втКолонки.Ресурс КАК Комплект
		|ИЗ
		|	втКолонки КАК втКолонки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ПО втКолонки.Ресурс = Задачи_ПКД.ОбъектТЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО (Задачи_ПКД.Ссылка = ТаймингЗадачСрезПоследних.Задача)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втКолонки.Наименование,
		|	Задачи_РКД.Выполнена,
		|	ТаймингЗадачСрезПоследних.Период,
		|	Задачи_РКД.Ссылка,
		|	""РКД"",
		|	ТаймингЗадачСрезПоследних.Период,
		|	втКолонки.Ресурс.Наименование,
		|	втКолонки.Ресурс
		|ИЗ
		|	втКолонки КАК втКолонки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Задачи_РКД КАК Задачи_РКД
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|			ПО Задачи_РКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|		ПО (втКолонки.Ресурс = Задачи_РКД.ОбъектТЗ)";
	
	Запрос.УстановитьПараметр("Доска", омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПустаяДата = Дата(1, 1, 1);
	
	Отбор = Новый Структура("Комплект", );
	
	Пока Выборка.Следующий() Цикл
		
		Отбор.Комплект = Выборка.Комплект;
		
		НайденыеСтроки = Комплекты.НайтиСтроки(Отбор);
		
		Если НайденыеСтроки.Количество() = 0 Тогда
			НС = Комплекты.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Выборка); 
		Иначе	
			НС = НайденыеСтроки[0];
		КонецЕсли;
		
		
		Если Выборка.ТипЗадачи = "ПКД" Тогда
			НС.ВыполненаПКД = Выборка.Выполнена; 
			НС.ДатаЗаЗавершениеПКД = Макс(НС.ДатаЗаЗавершениеПКД, Выборка.ДатаЗаЗавершение); 
			Если ЗначениеЗаполнено(Выборка.Задача) Тогда
				НС.ЗадачаПКД = Выборка.Задача;
			КонецЕсли;
			Если НЕ НС.ВыполненаПКД  Тогда
				НС.ДатаЗаЗавершениеПКД = ПустаяДата;
			КонецЕсли;
		Иначе
			НС.ВыполненаРКД = Выборка.Выполнена; 
			НС.ДатаЗавершениеРКД = Макс(НС.ДатаЗавершениеРКД, Выборка.ДатаЗаЗавершение);
			Если ЗначениеЗаполнено(Выборка.Задача) Тогда
				НС.ЗадачаРКД = Выборка.Задача;
			КонецЕсли;
			Если НЕ НС.ВыполненаРКД Тогда
				НС.ДатаЗавершениеРКД = ПустаяДата;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого х Из Комплекты Цикл
	
		Если НЕ (х.ВыполненаПКД И х.ВыполненаРКД) Тогда
		
			х.Вопрос = Истина;	
		
		КонецЕсли;	
	
	КонецЦикла;
	
	Комплекты.Сортировать("Вопрос убыв, РесурсНаименование");
	
КонецПроцедуры 

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.Комплекты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
	
		ЗадачаПКД 				= Неопределено;
		ЗадачаРКД 				= Неопределено;
		СоглосованиеЧертежей 	= Неопределено;
	
	Иначе
	
		ЗадачаПКД 				= ТД.ЗадачаПКД;
		ЗадачаРКД 				= ТД.ЗадачаРКД;
		СоглосованиеЧертежей 	= ТД.ВнешниеСогласования;
	
	КонецЕсли;
	
КонецПроцедуры
