
&НаСервере
Процедура ОбновитьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКолонки.УИД КАК УИД,
		|	КанбанКолонки.Наименование КАК Наименование
		|ПОМЕСТИТЬ втКолонки
		|ИЗ
		|	РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|ГДЕ
		|	КанбанКолонки.Доска = &Доска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КанбанПереходКарточкиСрезПоследних.УИДКарточка КАК УИДКарточка,
		|	втКолонки.Наименование КАК НаименованиеСтатуса,
		|	КанбанКарточки.Ресурс КАК Комплект,
		|	Задачи_ПКД.Выполнена КАК ВыполненаПКД,
		|	Задачи_РКД.Выполнена КАК ВыполненаРКД,
		|	ВнешниеСогласованияЧертежейСрезПоследних.ДатаСогласования КАК ДатаСогласования,
		|	ТаймингЗадачСрезПоследних.Период КАК ДатаЗаЗавершениеПКД,
		|	ТаймингЗадачСрезПоследних.Статус КАК СтатусПКД,
		|	ТаймингЗадачСрезПоследних.Задача КАК ЗадачаПКД,
		|	ТаймингЗадачСрезПоследних1.Задача КАК ЗадачаРКД,
		|	ТаймингЗадачСрезПоследних1.Период КАК ДатаЗавершениеРКД,
		|	ТаймингЗадачСрезПоследних1.Статус КАК СтатусРКД,
		|	ВнешниеСогласованияЧертежейСрезПоследних.Регистратор КАК ВнешниеСогласования
		|ИЗ
		|	РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКолонки КАК втКолонки
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = втКолонки.УИД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|			ЛЕВОЕ СОЕДИНЕНИЕ Задача.Задачи_ПКД КАК Задачи_ПКД
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|				ПО Задачи_ПКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|			ПО КанбанКарточки.Ресурс = Задачи_ПКД.ОбъектТЗ
		|			ЛЕВОЕ СОЕДИНЕНИЕ Задача.Задачи_РКД КАК Задачи_РКД
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних1
		|				ПО Задачи_РКД.Ссылка = ТаймингЗадачСрезПоследних1.Задача
		|			ПО (Задачи_РКД.ОбъектТЗ = КанбанКарточки.Ресурс)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВнешниеСогласованияЧертежей.СрезПоследних КАК ВнешниеСогласованияЧертежейСрезПоследних
		|			ПО КанбанКарточки.Ресурс = ВнешниеСогласованияЧертежейСрезПоследних.Комплект
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДКарточка = КанбанКарточки.УИД
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВыполненаРКД,
		|	ВыполненаПКД,
		|	КанбанКарточки.Ресурс.Наименование";
	
	Запрос.УстановитьПараметр("Доска", омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НС = Комплекты.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка); 
		
		Если НЕ Выборка.ВыполненаПКД Тогда
		
			НС.Вопрос = Истина;
			НС.ДатаЗаЗавершениеПКД = Дата(1, 1, 1);
		
		КонецЕсли;
		Если НЕ Выборка.ВыполненаРКД Тогда
		
			НС.Вопрос = Истина;
			НС.ДатаЗавершениеРКД = Дата(1, 1, 1);
		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

Функция ПолучитьКомплектыВПроизводстве()

КонецФункции // ПолучитьКомплектыВПроизводстве()


&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.Комплекты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
	
		ЗадачаПКД 				= Неопределено;
		ЗадачаРКД 				= Неопределено;
		СоглосованиеЧертежей 	= Неопределено;
	
	Иначе
	
		ЗадачаПКД 				= ТД.ЗадачаПКД;
		ЗадачаРКД 				= ТД.ЗадачаРКД;
		СоглосованиеЧертежей 	= ТД.ВнешниеСогласования;
	
	КонецЕсли;
	
КонецПроцедуры
