
Функция ПолучитьПолеВыводаКомментария(ПараметрыКомментария) Экспорт

    Макет = ПолучитьОбщийМакет("МакетФайл_PDF_Комментарий");
	
	ПолеВывода = Новый ТабличныйДокумент;
	
	Если ПараметрыКомментария.ВыводитьЗаголовок Тогда
		
		Область = Макет.ПолучитьОбласть("Заголовок");
		Область.Параметры.ТекстЗаголовка = ПараметрыКомментария.ТекстЗаголовка;
		ПолеВывода.Вывести(Область);
		
	КонецЕсли;
	
	Если ПараметрыКомментария.ВыводитьКомментарий Тогда
		
		Область = Макет.ПолучитьОбласть("Комментарий");
		Область.Параметры.ТекстКомментария = ПараметрыКомментария.ТекстКомментария;
		ПолеВывода.Вывести(Область);
		
	КонецЕсли;
	
	Если ПараметрыКомментария.ВыводитьПодвал Тогда
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.ТекстПодвал = ПараметрыКомментария.ТекстПодвал;
		ПолеВывода.Вывести(Область);
		
	КонецЕсли;
	
	Возврат ПолеВывода;
	
КонецФункции // ПолучитьОбластиМакетаКомментария()


