

&НаКлиенте
Процедура ЗагрузитьИЗделия(Команда) 
	текОбъект 	= Неопределено;
	текРодитель = Неопределено;
	
	ТД = Элементы.Список.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Если ЗначениеЗаполнено(Элементы.Список.ТекущийРодитель) Тогда
			текРодитель = Элементы.Список.ТекущийРодитель;
		КонецЕсли;
	Иначе
		текСделка = ТД.Проект;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("текСделка, текРодитель", текСделка, текРодитель);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеЗагрузкиИзделей",ЭтаФорма);
	ОткрытьФорму("Обработка.ЗагрузкаИзделияЗаказчика.Форма", ПараметрыФормы,,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗагрузкиИзделей(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.Список.Обновить(); 
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Если Результат.Свойство("текОбъект") Тогда
			Если ЗначениеЗаполнено(Результат.текОбъект) Тогда
				текРодитель = ПолучитьТекущийгоРодителя(Результат.текОбъект);
				Если ЗначениеЗаполнено(текРодитель) Тогда
					Элементы.Список.ТекущийРодитель = текРодитель; 
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ПослеЗагрузкиИзделей()


&НаСервереБезКонтекста
Функция ПолучитьТекущийгоРодителя(текОбъект)

	Возврат Справочники.Проекты.ПолучитьРодительИзделияПоОбъекту(текОбъект);	
	

КонецФункции // ПолучитьТекущийгоРодителя()


&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.ТекущийЭлемент.Имя = "Актуальность" Тогда
		Отказ = Истина;
		ИзменитьАктуальностьНаСервере(Элемент.ТекущаяСтрока);
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ИзменитьАктуальностьНаСервере(ИзделиеЗаказчика)
	об = ИзделиеЗаказчика.ПолучитьОбъект();
	об.Актуальность = НЕ об.Актуальность;
	об.Записать();
КонецПроцедуры // ИзменитьАктуальностьНаСервере()

&НаСервере
Процедура ПечатьНаСервере(Таб,Объект)
	Макет = Справочники.ИзделияЭлемент.ПолучитьМакет("Макет");
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Объект = Объект;
	Таб.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Строка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияЭлемент.Наименование КАК Наименование,
		|	ИзделияЭлемент.Помещения КАК Помещения,
		|	ИзделияЭлемент.Помещения.НомерПомещения + "" "" + ИзделияЭлемент.Помещения.Наименование КАК стрПомещения,
		|	ИзделияЭлемент.Актуальность КАК Актуальность
		|ИЗ
		|	Справочник.ИзделияЭлемент КАК ИзделияЭлемент
		|ГДЕ
		|	ИзделияЭлемент.Объект = &Объект
		|	И ИзделияЭлемент.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Объект",Объект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Область.Параметры.Заполнить(Выборка);
		Таб.Вывести(Область);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	Таб = Новый ТабличныйДокумент;
	ПечатьНаСервере(Таб,Элементы.Список.ТекущиеДанные.Объект);
	Таб.Показать(Элементы.Список.ТекущиеДанные.Объект)
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменилсяПорядокИзделий" Тогда
	
		Элементы.Список.Обновить();	
	
	КонецЕсли;
КонецПроцедуры

 