Функция ПолучитьКомментарий(Комментарий) Экспорт
	
	текЗначение = СокрЛП(Комментарий);
	
	Если СтрДлина(Комментарий) < 36 Тогда
	
		Возврат текЗначение;	
	
	КонецЕсли; 
	
	КодКомментария = "_-_" + СтрЗаменить(Новый УникальныйИдентификатор, "_", "");
	
	МенеджерЗаписи = РегистрыСведений.Комментарии.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УИД 			= КодКомментария;
	МенеджерЗаписи.Комментарий 	= Комментарий;
	
    МенеджерЗаписи.Записать();
	
	Возврат КодКомментария;
	
КонецФункции // ПолучитьКомментарий()
