&НаКлиенте
Перем ОтказДоговор, НомерПоПорядкуДоговор, Проект;

&НаКлиенте
Процедура ИзделияЗаказчикаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Отказ = Истина;  
	
	ДополнительныеПараметры = Новый Структура("ТД, Отказ, НомерПоПорядку"
	,Неопределено, ОтказДоговор, НомерПоПорядкуДоговор);
	
	СтруктураДанных = Новый Структура("Проект, СсылкаДоговор, ИзделияЗаказчика", Проект, Объект.ПриложениеКДоговору, Объект.ИзделияЗаказчика);
	омИзделияЗаказчикаКлиент.ОткрытьПодборИзделияЗаказчика(СтруктураДанных, ЭтаФорма, Объект.ПриложениеКДоговору,,ДополнительныеПараметры);

КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораИзделияЗаказчика(Результат, ДополнительныеПараметры) Экспорт
	
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;                         
	
	Если ДополнительныеПараметры.ТД = Неопределено Тогда
		ТД = Объект.ИзделияЗаказчика.Добавить();
	Иначе
		ТД = ДополнительныеПараметры.ТД;	
	КонецЕсли;
	
	ТД.ИзделиеЗаказчика = Результат;
	
	ЗаполнитьЗначенияСАртикулом();
	
КонецПроцедуры // ПослеВыбораИзделияЗаказчика() 

Процедура ЗаполнитьЗначенияСАртикулом()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеИзделияЗаказчика.ИзделиеЗаказчика КАК ИзделиеЗаказчика,
		|	ДанныеИзделияЗаказчика.НаименованиеСАртикулом КАК НаименованиеСАртикулом
		|ИЗ
		|	РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
		|ГДЕ
		|	ДанныеИзделияЗаказчика.ИзделиеЗаказчика В(&ИзделиеЗаказчика)";
	
	Запрос.УстановитьПараметр("ИзделиеЗаказчика", Объект.ИзделияЗаказчика.Выгрузить().ВыгрузитьКолонку("ИзделиеЗаказчика"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	стОтбор = Новый Структура("ИзделиеЗаказчика", );
	
	Пока Выборка.Следующий() Цикл
		
		стОтбор.ИзделиеЗаказчика = Выборка.ИзделиеЗаказчика;
		НайденаяСтрока = Объект.ИзделияЗаказчика.НайтиСтроки(стОтбор);
		НайденаяСтрока[0].НаименованиеСАртикулом = Выборка.НаименованиеСАртикулом;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ИзделияЗаказчикаПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	ТД = Элементы.ИзделияЗаказчика.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТД.ИзделиеЗаказчика);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		ТолькоПросмотр = Истина;	
	
	КонецЕсли;
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеДоговора()
	
	Если ЗначениеЗаполнено(Объект.ПриложениеКДоговору) Тогда
		
		СтруктураДанныеДоговора = ПолучитьДанныеДоговораНаСервере(Объект.ПриложениеКДоговору);	
		ОтказДоговор 			= СтруктураДанныеДоговора.ОтказДоговор;
		НомерПоПорядкуДоговор 	= СтруктураДанныеДоговора.НомерПоПорядкуДоговор;
		Проект 					= СтруктураДанныеДоговора.Проект;
		
	КонецЕсли;

КонецПроцедуры // ПолучитьДанныеДоговора()   

&НаСервереБезКонтекста
Функция ПолучитьДанныеДоговораНаСервере(ПриложениеКДоговору)

	СтруктураДанныеДоговора = Новый Структура("ОтказДоговор, НомерПоПорядкуДоговор, Проект", );
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриложенияКДоговорам.НомерПоПорядку КАК НомерПоПорядкуДоговор,
		|	ПриложенияКДоговорам.Отказ КАК ОтказДоговор,
		|	ПриложенияКДоговорам.Проект КАК Проект
		|ИЗ
		|	Справочник.ПриложенияКДоговорам КАК ПриложенияКДоговорам
		|ГДЕ
		|	ПриложенияКДоговорам.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПриложениеКДоговору);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураДанныеДоговора, Выборка);
	КонецЦикла;
	
	Возврат СтруктураДанныеДоговора;
	
КонецФункции // ПолучитьДанныеДоговораНаСервере()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПолучитьДанныеДоговора();
	ЗаполнитьЗначенияСАртикулом();

КонецПроцедуры


&НаКлиенте
Процедура ПриложениеКДоговоруПриИзменении(Элемент)
	ПолучитьДанныеДоговора();
КонецПроцедуры

