
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ПотребностьДляКомплектаИзделия 
	
	Движения.ПотребностьВМатериалах.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
		Движение 					= Движения.ПотребностьВМатериалах.Добавить();
		Движение.Период 			= Дата;
		Движение.ИзделиеКомплект 	= ИзделиеКомплект;
		Движение.Номенклатура 		= ТекСтрокаМатериалы.Номенклатура;
		Движение.Потребность 		= ТекСтрокаМатериалы.Количество * ТекСтрокаМатериалы.Коэффициент;
	КонецЦикла;
	
	// регистр ПотребностьПредварительнойНоменклатуры Приход
	Сделка = ИзделиеКомплект.Проект;
	
	Движения.ПотребностьПредварительнойНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаПредварительныеНоменклатуры Из ПредварительныеНоменклатуры Цикл
		Движение 								= Движения.ПотребностьПредварительнойНоменклатуры.Добавить();
		Движение.ВидДвижения 					= ВидДвиженияНакопления.Приход;
		Движение.Период 						= Дата;
		Движение.Проект 						= Сделка;
		Движение.ИзделиеКомплект 				= ИзделиеКомплект;
		Движение.ПредварительнаяНоменклатура 	= ТекСтрокаПредварительныеНоменклатуры.ПредварительнаяНоменклатура;
		Движение.Количество 					= ТекСтрокаПредварительныеНоменклатуры.Количество;
	КонецЦикла;

	
	СохранитьСсылки();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСсылки()

	НаборЗаписей = РегистрыСведений.СсылкиНаНоменклатуруПоставщика.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПотребностьВМатериалах.Установить(Ссылка);
	
	Для каждого х Из Материалы Цикл
		Если ПустаяСтрока(х.URL) И ПустаяСтрока(х.Комментарий) Тогда
			Продолжить;	
		КонецЕсли;
		
	    НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ПотребностьВМатериалах = Ссылка;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, х);
		
	КонецЦикла;
	
    НаборЗаписей.Записать();
КонецПроцедуры // СохранитьСсылки()

