&НаКлиенте
Перем ОтказДоговор, НомерПоПорядкуДоговор, Проект;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		//ТолькоПросмотр = Истина;	
	
	КонецЕсли;
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);

КонецПроцедуры

&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.ИзделияКомплект.Количество() = 0 Тогда 
		ОткрытьФормуВыбораПроекта();
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОСменеПроекта",ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения,"При смене Проекта будет очищена табличная часть. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПроекта()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",				Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",		Ложь);
	ПараметрыФормы.Вставить("НеПоказыватьСделки",		Истина);
	ПараметрыФормы.Вставить("МассивПроектовПоказывать",	ПолучитьМассивПроектов());

	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыборкаПроекта", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Проекты.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ОткрытьФормуВыбораПроекта()

&НаКлиенте
Процедура ПослеВопросаОСменеПроекта(Результат, ДополнительныйПараметр) Экспорт
	
	Если Результат = КодВозвратаДиалога.ДА Тогда
        ОткрытьФормуВыбораПроекта();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыборкаПроекта(Значение, ДополнительныйПараметр) Экспорт

    Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        Возврат;
	КонецЕсли;
	
	Объект.Проект = Значение;
	Объект.ИзделияКомплект.Очистить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивПроектов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	НЕ Проекты.НеВыводитьНаДиаграмму";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции // ПолучитьМассивПроектов()

&НаКлиенте
Процедура ИзделияКомплектПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		НеПоказыватьИзделиеКомплект = Новый Массив;
		
		Для каждого х Из Объект.ИзделияКомплект Цикл
			НеПоказыватьИзделиеКомплект.Добавить(х.ИзделиеКомплект);	
		КонецЦикла;
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзделиеКомплект", ЭтаФорма);
		
		стПараметры = Новый Структура("Проект", 	Объект.Проект); 
		стПараметры.Вставить("НеПоказыватьВВыборе", НеПоказыватьИзделиеКомплект);
		
		ОткрытьФорму("Справочник.ИзделияКомплект.ФормаВыбора",стПараметры, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
	Иначе	
		ПоказатьПредупреждение(,"Не заполнен Проект");
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораИзделиеКомплект(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;                         
	
	Если ДополнительныеПараметры = Неопределено Тогда
		НС = Объект.ИзделияКомплект.Добавить();
		НС.ИзделиеКомплект = Результат; 
	Иначе
		ДополнительныеПараметры.ТД.ИзделиеКомплект = Результат;	
	КонецЕсли;
	
КонецПроцедуры // ПослеВыбораЭлементовСделки()


