
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ПотребностьВМатериалах 
	Движения.ПотребностьВМатериалах.Записывать = Истина;
	Для Каждого ТекСтрока Из Номеклатура Цикл
		Движение 					= Движения.ПотребностьВМатериалах.Добавить();
		Движение.Период 			= Дата;
		Движение.ИзделиеКомплект 	= ТекСтрока.ИзделиеКомплект;
		Движение.Номенклатура 		= ТекСтрока.Номенклатура;
		Движение.Потребность 		= ТекСтрока.Количество;
	КонецЦикла;

	// регистр ПотребностьПредварительнойНоменклатуры Расход
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК ИзделиеКомплект,
		|	ИзделияКомплект.Проект КАК Проект
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", ПредварительнаяНомеклатура.ВыгрузитьКолонку("ИзделиеКомплект"));
	
	тзСделки = Запрос.Выполнить().Выгрузить();
	
	Движения.ПотребностьПредварительнойНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрока Из ПредварительнаяНомеклатура Цикл
		Движение 								= Движения.ПотребностьПредварительнойНоменклатуры.Добавить();
		Движение.ВидДвижения 					= ВидДвиженияНакопления.Расход;
		Движение.Период 						= Дата;
		Движение.Проект 						= тзСделки.Найти(ТекСтрока.ИзделиеКомплект,"ИзделиеКомплект").Сделка;
		Движение.ИзделиеКомплект 				= ТекСтрока.ИзделиеКомплект;
		Движение.ПредварительнаяНоменклатура 	= ТекСтрока.ПредварительнаяНоменклатура;
		Движение.Количество 					= ТекСтрока.Количество;
	КонецЦикла;

КонецПроцедуры
