#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
  
Функция НаличиеИзмененийПоНастройкеПодключения(НастройкаПодключения) Экспорт

	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения);
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_СМ_ТаблицаИзменений.ИдентификаторОбъекта КАК ИдентификаторОбъекта
	|ИЗ
	|	РегистрСведений.Б24_СМ_ТаблицаИзменений КАК Б24_СМ_ТаблицаИзменений
	|ГДЕ
	|	Б24_СМ_ТаблицаИзменений.НастройкаПодключения = &НастройкаПодключения";
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Возврат НЕ ВыполненныйЗапрос.Пустой();

КонецФункции
	
#КонецЕсли  
