
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Проект") Тогда
		Проект 							= Параметры.Проект;
		Элементы.Список.Отображение 	= ОтображениеТаблицы.Список;
		Элементы.Проект.ТолькоПросмотр = Истина;
	Иначе
		Проект 							= Справочники.Проекты.ПустаяСсылка();
	КонецЕсли; 
	
	УстановитьПараметры();

КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ЭтаФорма.Проект) Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список; 
	Иначе
		Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок; 
	КонецЕсли;
	
	УстановитьПараметры();
	
КонецПроцедуры

Процедура УстановитьПараметры()
	
	Список.Параметры.УстановитьЗначениеПараметра("Проект",				Проект);
	Список.Параметры.УстановитьЗначениеПараметра("ИспользоватьОтбор",	ЗначениеЗаполнено(Проект));
	
КонецПроцедуры // УстановитьПараметры()

