
Процедура ОбработкаПроведения(Отказ, Режим)
	
	стОтбор = Новый Структура("РучнаяУстановкаЦены", Истина);
	омЦеныНаСервере.СоздатьЗаписиВРегистреЦен(Ссылка,Материалы.НайтиСтроки(стОтбор),Перечисления.СпособыЗаполненияЦен.Предварительный,Дата);
	ДвиженияСмета(Отказ);
КонецПроцедуры

Процедура ДвиженияСмета(Отказ)
	
	тзДанные = ПодготовитьТаблицуПроведения();

	Движения.Смета.Записывать = Истина;
	Для Каждого ТекСтрокаДетали Из тзДанные Цикл
		Движение = Движения.Смета.Добавить();
		ЗаполнитьЗначенияСвойств(Движение,ТекСтрокаДетали);
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Функция ПодготовитьТаблицуПроведения()
	тзДанные = СоздатьТаблицуДанных();
	
	Объект = Изделие.Проект;
	
	ЗаполнитьМатериалы(тзДанные,Объект);
	ЗаполнитьРаботы(Объект);

	Возврат тзДанные;
КонецФункции // ПодготовитьТаблицуПроведения()

&НаСервере
Процедура ЗаполнитьРаботы(Объект)
	Движения.Смета.Записывать = Истина;
	Для каждого текСтрока Из Работа Цикл
		Движение = Движения.Смета.Добавить();
		Движение.Период 			= Дата;
		Движение.Объект 			= Объект;
		Движение.ИзделияЭлемент 	= Изделие;
		Движение.ВидЗатрат 			= текСтрока.Расценки;
		Движение.ТипыЗатрат			= текСтрока.Расценки.ВидРасценки;
		Движение.Основной 			= Истина;
		Движение.Количество 		= текСтрока.Количество;
		Движение.Сумма 				= текСтрока.СуммаРабот;
	КонецЦикла;
	

КонецПроцедуры // ЗаполнитьМтериалы(тзДанные)

&НаСервере
Функция ЗаполнитьМатериалы(тзДанные,Объект)
	Движения.Смета.Записывать = Истина;
	Для каждого текСтрока Из Материалы Цикл
		Если текСтрока.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.Смета.Добавить();
		Движение.Период 			= Дата;
		Движение.Объект 			= Объект;
		Движение.ИзделияЭлемент 	= Изделие;
		Движение.СтатьяЗатрат 		= текСтрока.СтатьяЗатрат;
		Движение.ВидЗатрат 			= текСтрока.Номенклатура;
		Движение.Основной 			= текСтрока.Основной;
		Движение.ТипыЗатрат 		= текСтрока.Номенклатура.ВидНоменклатуры;
		Движение.Количество 		= текСтрока.Количество * текСтрока.Коэффициент;
		Движение.Сумма 				= текСтрока.Сумма;
		Движение.Фурнитура			= Ложь; 
		
	КонецЦикла;
	Для каждого текСтрока Из Фурнитура Цикл
		Если текСтрока.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.Смета.Добавить();
		Движение.Период 			= Дата;
		Движение.Объект 			= Объект;
		Движение.ИзделияЭлемент 	= Изделие;
		Движение.СтатьяЗатрат 		= текСтрока.СтатьяЗатрат;
		Движение.ВидЗатрат 			= текСтрока.Номенклатура;
		Движение.Основной 			= текСтрока.Основной;
		Движение.ТипыЗатрат 		= текСтрока.Номенклатура.ВидНоменклатуры;
		Движение.Количество 		= текСтрока.Количество;
		Движение.Сумма 				= текСтрока.Стоимость;
		Движение.Фурнитура			= Истина;
		
	КонецЦикла;
	Для каждого текСтрока Из ОборудованиеИТехника Цикл
		Если текСтрока.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.Смета.Добавить();
		Движение.Период 			= Дата;
		Движение.Объект 			= Объект;
		Движение.ИзделияЭлемент 	= Изделие;
		Движение.СтатьяЗатрат 		= текСтрока.СтатьяЗатрат;
		Движение.ВидЗатрат 			= текСтрока.Оборудование;
		Движение.Основной 			= Истина;
		Движение.ТипыЗатрат 		= текСтрока.Оборудование.ВидОборудования;
		Движение.Количество 		= текСтрока.Количество;
		Движение.Сумма 				= текСтрока.Стоимость;
		Движение.Фурнитура			= Ложь;
	КонецЦикла;
	Для каждого текСтрока Из ЗаказныеИзделия Цикл
		Если текСтрока.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.Смета.Добавить();
		Движение.Период 			= Дата;
		Движение.Объект 			= Объект;
		Движение.ИзделияЭлемент 	= Изделие;
		Движение.СтатьяЗатрат 		= текСтрока.СтатьяЗатрат;
		Движение.ВидЗатрат 			= текСтрока.Номенклатура;
		Движение.Основной 			= Истина;
		Движение.ТипыЗатрат 		= текСтрока.Номенклатура.ВидОборудования;
		Движение.Количество 		= текСтрока.Количество;
		Движение.Сумма 				= текСтрока.Стоимость;
		Движение.Фурнитура			= Ложь;
		
	КонецЦикла;
	
КонецФункции // ЗаполнитьМтериалы(тзДанные)


&НаСервере
Функция СоздатьТаблицуДанных()
	
	тзДанные = Новый ТаблицаЗначений;
	тзДанные.Колонки.Добавить("Объект"			,Новый ОписаниеТипов("СправочникСсылка.Объекты"));
	тзДанные.Колонки.Добавить("ИзделияКомплект"	,Новый ОписаниеТипов("СправочникСсылка.ИзделияКомплект"));
	тзДанные.Колонки.Добавить("ВидЗатрат");
	тзДанные.Колонки.Добавить("Основной"		,Новый ОписаниеТипов("Булево"));
	тзДанные.Колонки.Добавить("ТипыЗатрат");
	тзДанные.Колонки.Добавить("Количество"		,Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3, ДопустимыйЗнак.Неотрицательный)));
	тзДанные.Колонки.Добавить("Сумма"			,Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Неотрицательный)));
	
	Возврат тзДанные;
КонецФункции // СоздатьТаблицуДанных()


