
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

	Заголовок = Объект.Наименование;
	
	Элементы.ГруппаРедактирование.Видимость = РольДоступна("Программист");
	
	Если НЕ(РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Менеджер")) Тогда
	
		Элементы.Выполнить.Видимость = Ложь;
	
	КонецЕсли;
	
	Если Объект.Выполнена Тогда
		
		Элементы.Группа2.ТолькоПросмотр 		= Истина;
		Элементы.ГруппаКнопки.Видимость 		= Ложь;
		Элементы.ДобавитьКомментарий.Видимость 	= Ложь; 
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Исполнитель) Тогда	
		
		Элементы.ГруппаКнопки.Видимость = Ложь;
		
	Иначе	
		
		Если Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееПКД Тогда
			
			Элементы.Согласовано.Видимость 			= Ложь;
			Элементы.ДоработкаДизайнера.Видимость 	= Ложь;
			
		ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееСогласование Тогда
			
			Элементы.Контроль.Видимость 					= Ложь;
			Элементы.ДоработкаВедущийКонструктор.Видимость 	= Ложь;
		Иначе
			
			Элементы.Контроль.Видимость 					= Ложь;
			Элементы.Согласовано.Видимость 					= Ложь;
			Элементы.ДоработкаДизайнера.Видимость 			= Ложь;
			Элементы.ДоработкаВедущийКонструктор.Видимость 	= Ложь;
			Элементы.ДоработкаДизайнера.Видимость 			= Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураТипа	= омВнешнееПроизводство.ТипВнешнегоПроизводства(Объект.ОбъектТЗ);
	
	Если СтруктураТипа.ПКД Тогда
		ТипВнешнегоПроизводства = "Внешнее ПКД, РКД, Производство";
	ИначеЕсли СтруктураТипа.РКД Тогда 
		ТипВнешнегоПроизводства = "Внешнее РКД, Производство"; 
		Элементы.ГруппаПользователи.Видимость = Ложь;
	Иначе
		ТипВнешнегоПроизводства = "Внешнее Производство";
		Элементы.ГруппаПользователи.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ВедущийКонструктор) Тогда
			Объект.ВедущийКонструктор = омСотрудники.ПолучитьРабочееВремяСотрудников(Объект.Проект.ВедущийКонструктор);	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Дизайнер) Тогда
			Объект.Дизайнер = омСотрудники.ПолучитьРабочееВремяСотрудников(Объект.Проект.Дизайнер);	
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ДатаОкончанияПКД.Видимость	= СтруктураТипа.ПКД;
	
	Комментарий = омКомментарий.Получить_HTML_комментарий(Объект.Комментарии);

КонецПроцедуры

&НаКлиенте
Процедура Записать_задачу(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНаСервере()

	ЗадачаОбъект = Объект.Ссылка.ПолучитьОбъект();
	ЗадачаОбъект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееПроизводствоГотово;
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецПроцедуры

&НаКлиенте
Процедура Выполнить_задачу(Команда)
	
	ТипИзделия = Строка(Объект.ОбъектТЗ) + ?(ТипЗнч(Объект.ОбъектТЗ) = Тип("СправочникСсылка.Композиции"), " готова и отгружена", " готов и отгружен");
	
	ТекстВопроса = СтрШаблон("Вы подтверждает, что %1 на наш склад?", ТипИзделия); 
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаВыполнения", ЭтотОбъект, Параметры);
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, , , "Выполнение");   
	
	ВыполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаВыполнения(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьНаСервере();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Контроль(Команда)

	стДанные = ДействияНаСервере("Контроль", Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Оповестить("ИзмененениеЗадачаВнешнееПроизводство");
	Закрыть();
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель = Неопределено, Параметр = Неопределено)

	Возврат Задачи.ЗадачаВнешнееПроизводство.ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель, Параметр);	

КонецФункции // ДействияНаСервере("НачатьВыполнение", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.СтатусЗадачи)()

&НаКлиенте
Процедура Согласовано(Команда)
	
	стДанные = ДействияНаСервере("Согласовано", Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Оповестить("ИзмененениеЗадачаВнешнееПроизводство");
	Закрыть();
	
КонецПроцедуры

 &НаКлиенте
Процедура ДоработкаДизайнера(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКомментария", ЭтаФорма, "Доработка диз");
	ПоказатьВводСтроки(Оповещение, "", "Ввод комментария", 150);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоработкаВедущийКонструктор(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКомментария", ЭтаФорма, "Доработка ведкон");
	ПоказатьВводСтроки(Оповещение, "", "Ввод комментария", 150);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКомментария", ЭтаФорма);
	ПоказатьВводСтроки(Оповещение, "", "Ввод комментария", 150);
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаКомментария(Значение, ДополнительныеПараметры)  Экспорт

	Если ЗначениеЗаполнено(Значение) Тогда
	
		
		Если ДополнительныеПараметры = "Доработка диз" Тогда
			
			ЗаполнитьКомментарийНаСервере(Значение, ?(ЗначениеЗаполнено(ДополнительныеПараметры), ДополнительныеПараметры, ""));	
			Записать();
			стДанные = ДействияНаСервере("ДоработкаДиз", Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
			
			Закрыть();
			Оповестить("ИзмененениеЗадачаВнешнееПроизводство");
			
		Иначе
			
			ЗаполнитьКомментарийНаСервере(Значение, ?(ЗначениеЗаполнено(ДополнительныеПараметры), ДополнительныеПараметры, ""));	
			Модифицированность = Истина;
			
		КонецЕсли;

	КонецЕсли;	

КонецПроцедуры // ПослеВводаКомментария()

Процедура ЗаполнитьКомментарийНаСервере(Значение, ТипКомментария = "")

	НС = Объект.Комментарии.Вставить(0);
	НС.Автор			= ПараметрыСеанса.ТекущийПользователь;
	НС.Дата 			= ТекущаяДата();
	НС.ТипКомментария 	= ТипКомментария;
	НС.Текст 			= Значение;
	
	Комментарий 		= омКомментарий.Получить_HTML_комментарий(Объект.Комментарии);

КонецПроцедуры


 
