
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Объект.Наименование;
	
	ТолькоПросмотр 						= Объект.Выполнена;
	
	Если Объект.Выполнена Тогда
		ТолькоПросмотр = Истина;
		Элементы.ГруппаКнопки.Видимость = Ложь;
	Иначе	
		
		Если Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееПКД Тогда
			Элементы.Согласовано.Видимость 			= Ложь;
			Элементы.ДоработкаДизайнера.Видимость 	= Ложь;
		ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееСогласование Тогда
			Элементы.Контроль.Видимость 					= Ложь;
			Элементы.ДоработкаВедущийКонструктор.Видимость 	= Ложь;
		Иначе
			Элементы.Контроль.Видимость 					= Ложь;
			Элементы.Согласовано.Видимость 					= Ложь;
			Элементы.ДоработкаДизайнера.Видимость 			= Ложь;
			Элементы.ДоработкаВедущийКонструктор.Видимость 	= Ложь;
			Элементы.ДоработкаДизайнера.Видимость 			= Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Выполнить.Видимость 		= Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееПроизводство;
	Элементы.ФормаЗаписать.Видимость 	= НЕ ТолькоПросмотр;
КонецПроцедуры

&НаКлиенте
Процедура Записать_задачу(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНаСервере()

	ЗадачаОбъект = Объект.Ссылка.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецПроцедуры

&НаКлиенте
Процедура Выполнить_задачу(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Контроль(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура Согласовано(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

 &НаКлиенте
Процедура ДоработкаДизайнера(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	//стДанные = ДействияНаСервере("ДоработкаДизайнера", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ДоработкаВедущийКонструктор(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	//стДанные = ДействияНаСервере("ДоработкаВедущийКонструктор", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель);
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

