
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Объект.Наименование;
	
	ТолькоПросмотр 						= Объект.Выполнена;
	
	Если Объект.Выполнена Тогда
		ТолькоПросмотр = Истина;
		Элементы.ГруппаКнопки.Видимость = Ложь;
	Иначе	
		
		Если Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееПКД Тогда
			Элементы.Согласовано.Видимость 			= Ложь;
			Элементы.ДоработкаДизайнера.Видимость 	= Ложь;
		ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееСогласование Тогда
			Элементы.Контроль.Видимость 					= Ложь;
			Элементы.ДоработкаВедущийКонструктор.Видимость 	= Ложь;
		Иначе
			Элементы.Контроль.Видимость 					= Ложь;
			Элементы.Согласовано.Видимость 					= Ложь;
			Элементы.ДоработкаДизайнера.Видимость 			= Ложь;
			Элементы.ДоработкаВедущийКонструктор.Видимость 	= Ложь;
			Элементы.ДоработкаДизайнера.Видимость 			= Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Выполнить.Видимость 		= Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееПроизводство;
	Элементы.ФормаЗаписать.Видимость 	= НЕ ТолькоПросмотр;
	
	СтруктураТипа						= омВнешнееПроизводство.ТипВнешнегоПроизводства(Объект.ОбъектТЗ);
	ТипВнешнегоПроизводства 			= ?(СтруктураТипа = Неопределено, 
												Перечисления.ТипыВнешнегоПроизводства.ПустаяСсылка(),
												СтруктураТипа.ТипВнешнегоПроизводства);
	Элементы.ДатаОкончанияПКД.Видимость	= ТипВнешнегоПроизводства = Перечисления.ТипыВнешнегоПроизводства.ПКД_РКД_Производство;
	
	Комментарий = омКомментарий.Получить_HTML_комментарий(Объект.Комментарии);

КонецПроцедуры

&НаКлиенте
Процедура Записать_задачу(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНаСервере()

	ЗадачаОбъект = Объект.Ссылка.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецПроцедуры

&НаКлиенте
Процедура Выполнить_задачу(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Контроль(Команда)

	стДанные = ДействияНаСервере("Контроль", Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Оповестить("ИзмененениеЗадачаВнешнееПроизводство");
	Закрыть();
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель = Неопределено, Параметр = Неопределено)

	Возврат Задачи.ЗадачаВнешнееПроизводство.ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель, Параметр);	

КонецФункции // ДействияНаСервере("НачатьВыполнение", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.СтатусЗадачи)()

                
&НаКлиенте
Процедура Согласовано(Команда)
	стДанные = ДействияНаСервере("Согласовано", Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Оповестить("ИзмененениеЗадачаВнешнееПроизводство");
	Закрыть();
КонецПроцедуры

 &НаКлиенте
Процедура ДоработкаДизайнера(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКомментария", ЭтаФорма, "Доработка диз");
	ПоказатьВводСтроки(Оповещение, "", "Ввод комментария", 150);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоработкаВедущийКонструктор(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКомментария", ЭтаФорма, "Доработка ведкон");
	ПоказатьВводСтроки(Оповещение, "", "Ввод комментария", 150);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКомментария", ЭтаФорма);
	ПоказатьВводСтроки(Оповещение, "", "Ввод комментария", 150);
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаКомментария(Значение, ДополнительныеПараметры)  Экспорт

	Если ЗначениеЗаполнено(Значение) Тогда
	
		
		Если ДополнительныеПараметры = "Доработка диз" Тогда
			
			ЗаполнитьКомментарийНаСервере(Значение, ?(ЗначениеЗаполнено(ДополнительныеПараметры), ДополнительныеПараметры, ""));	
			Записать();
			стДанные = ДействияНаСервере("ДоработкаДиз", Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
			
			Закрыть();
			Оповестить("ИзмененениеЗадачаВнешнееПроизводство");
			
		Иначе
			
			ЗаполнитьКомментарийНаСервере(Значение, ?(ЗначениеЗаполнено(ДополнительныеПараметры), ДополнительныеПараметры, ""));	
			Модифицированность = Истина;
			
		КонецЕсли;

	КонецЕсли;	

КонецПроцедуры // ПослеВводаКомментария()

Процедура ЗаполнитьКомментарийНаСервере(Значение, ТипКомментария = "")

	НС = Объект.Комментарии.Вставить(0);
	НС.Автор			= ПараметрыСеанса.ТекущийПользователь;
	НС.Дата 			= ТекущаяДата();
	НС.ТипКомментария 	= ТипКомментария;
	НС.Текст 			= Значение;
	
	Комментарий 		= омКомментарий.Получить_HTML_комментарий(Объект.Комментарии);

КонецПроцедуры

 
