Функция ПолучитьСтруктуруПараметров() Экспорт

	стПараметры = Новый Структура();
	стПараметры.Вставить("НомерКолонки",	1);
	стПараметры.Вставить("НомерСтроки",		1);
	стПараметры.Вставить("ДлинаОбласти",	1);
	стПараметры.Вставить("ВысотаОбласти",	1);
	стПараметры.Вставить("ЦветФона",		"255255255");
	стПараметры.Вставить("Объединять",		Истина);
	
	//Граница
	стПараметры.Вставить("ГраницаСлева",	Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1));
	стПараметры.Вставить("ГраницаСправа",	Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1));
	стПараметры.Вставить("ГраницаСверху",	Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1));
	стПараметры.Вставить("ГраницаСнизу",	Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1));
	стПараметры.Вставить("ЦветРамки", 		"000000000");
	
	//Шрифт
	стПараметры.Вставить("ИмяШрифта",		"Arial");
	стПараметры.Вставить("РазмерШрифта",	8);
	стПараметры.Вставить("Полужирный",		Ложь);
	стПараметры.Вставить("Наклонный",		Ложь);
	стПараметры.Вставить("Наклонный", 		Ложь);
	стПараметры.Вставить("Подчеркивание",	Ложь);
	стПараметры.Вставить("Зачеркивание",	Ложь);
	стПараметры.Вставить("МасштабШрифта",	100);
	стПараметры.Вставить("ЦветТекста", 		"000000000");
	
	//Положение
	стПараметры.Вставить("ГоризонтальноеПоложение",	ГоризонтальноеПоложение.Центр);
	стПараметры.Вставить("ВертикальноеПоложение",	ВертикальноеПоложение.Центр);
	
	стПараметры.Вставить("Текст",		"");
	стПараметры.Вставить("Расшифровка",	Неопределено);
	
	стПараметры.Вставить("РазмещениеТекста", ТипРазмещенияТекстаТабличногоДокумента.Обрезать);
	
	Возврат стПараметры;
КонецФункции // ПолучитьСтруктуруПараметров() 

Функция ИзменитьПараметрШрифта(Шрифт, 	Вид = Неопределено, 
										Размера = Неопределено, 
										Полужирный = Неопределено, 
										Наклонный = Неопределено, 
										Подчеркивание = Неопределено, 
										Зачеркивание = Неопределено, 
										Масштаб = Неопределено) Экспорт 
	

										
	стШрифт = Новый Структура("ИмяШрифта, РазмерШрифта, Полужирный, Наклонный, Подчеркивание, Зачеркивание, МасштабШрифта", 
							Шрифт.Вид, Шрифт.Размер, Шрифт.Полужирный, Шрифт.Наклонный, Шрифт.Подчеркивание, Шрифт.Зачеркивание, Шрифт.Масштаб);
							
	Если НЕ Вид = Неопределено Тогда
		стШрифт.Вид = Вид;
	КонецЕсли;
	
	Если НЕ Размера = Неопределено Тогда
		стШрифт.РазмерШрифта = Размера;
	КонецЕсли;
	
	Если НЕ Полужирный = Неопределено Тогда
		стШрифт.Полужирный = Полужирный;
	КонецЕсли;
	
	Если НЕ Наклонный = Неопределено Тогда
		стШрифт.Наклонный = Наклонный;
	КонецЕсли;
	
	Если НЕ Подчеркивание = Неопределено Тогда
		стШрифт.Подчеркивание = Подчеркивание;
	КонецЕсли;
	
	Если НЕ Зачеркивание = Неопределено Тогда
		стШрифт.Зачеркивание = Зачеркивание;
	КонецЕсли;
	
	Если НЕ Масштаб = Неопределено Тогда
		стШрифт.Масштаб = Масштаб;
	КонецЕсли;
	
	Возврат ПолучитьШрифт(стШрифт);

КонецФункции // ИзменитьПараметрШрифта()

Функция ПолучитьШрифт(стШрифт)
  Возврат Новый Шрифт(стШрифт.ИмяШрифта,стШрифт.РазмерШрифта,стШрифт.Полужирный,стШрифт.Наклонный,стШрифт.Подчеркивание,стШрифт.Зачеркивание,стШрифт.МасштабШрифта);

КонецФункции // ПолучитьШрифт()

Функция ЧислоБезРазделителей(Число) Экспорт

	Возврат Формат(Число, "ЧГ=0");	

КонецФункции // ЧислоБезРазделителей()
 
Функция СформироватьОбластьТабличногоДокумента(ТабДок, стПараметры, КэшЦвета = Неопределено) Экспорт
	
	ИмяОбласти = "R" + ЧислоБезРазделителей(стПараметры.НомерСтроки) + "C" + ЧислоБезРазделителей(стПараметры.НомерКолонки);
	Если стПараметры.ДлинаОбласти > 1 ИЛИ стПараметры.ВысотаОбласти  > 1 Тогда
		ИмяОбласти = ИмяОбласти + ":R" + ЧислоБезРазделителей(стПараметры.НомерСтроки + стПараметры.ВысотаОбласти - 1)
		+ "C" + ЧислоБезРазделителей(стПараметры.НомерКолонки + стПараметры.ДлинаОбласти - 1);
		Область = ТабДок.Область(ИмяОбласти);
		Если стПараметры.Объединять Тогда
			Область.Объединить();
		КонецЕсли;
	Иначе
		Область = ТабДок.Область(ИмяОбласти);
	КонецЕсли;
	
	Область.ГоризонтальноеПоложение 	= стПараметры.ГоризонтальноеПоложение;
	Область.ВертикальноеПоложение 		= стПараметры.ВертикальноеПоложение;
	Область.Шрифт 						= ПолучитьШрифт(стПараметры);
	
	Область.ГраницаСверху      			= стПараметры.ГраницаСверху; 
	Область.ГраницаСлева       			= стПараметры.ГраницаСлева; 
	Область.ГраницаСнизу        		= стПараметры.ГраницаСнизу; 
	Область.ГраницаСправа       		= стПараметры.ГраницаСправа; 
	
	Если КэшЦвета = Неопределено Тогда
		ЦветФона 	= ?(ТипЗнч(стПараметры.ЦветФона) 	= Тип("Цвет"), 	стПараметры.ЦветФона, 	омЦветНаСервереПовтор.ПолучитьЦветИзСтроки(стПараметры.ЦветФона));
		ЦветТекста 	= ?(ТипЗнч(стПараметры.ЦветТекста) 	= Тип("Цвет"), 	стПараметры.ЦветТекста, омЦветНаСервереПовтор.ПолучитьЦветИзСтроки(стПараметры.ЦветТекста));
		ЦветРамки   = ?(ТипЗнч(стПараметры.ЦветРамки) 	= Тип("Цвет"), 	стПараметры.ЦветРамки, 	омЦветНаСервереПовтор.ПолучитьЦветИзСтроки(стПараметры.ЦветРамки));
		
		Область.ЦветФона 				= ЦветФона;
		Область.ЦветТекста 				= ЦветТекста;
		Область.ЦветРамки 				= ЦветРамки;
		КэшЦвета = Новый Структура("ЦветФона,ЦветТекста,ЦветРамки",ЦветФона,ЦветТекста,ЦветРамки);
	Иначе
		Область.ЦветФона 				= КэшЦвета.ЦветФона;
		Область.ЦветТекста 				= КэшЦвета.ЦветТекста;
		Область.ЦветРамки 				= КэшЦвета.ЦветРамки;
	КонецЕсли;
	
	Область.Текст                       = стПараметры.Текст;
	Область.Расшифровка                 = стПараметры.Расшифровка;
	
	Область.РазмещениеТекста            = стПараметры.РазмещениеТекста;
	Возврат Область;
	
КонецФункции // ПолучитьОбластьТабличногоДокумента()

Функция ВывестиЛинию(ТабДок, стПараметры) Экспорт
	
	КоличествоМиллиметровВПикселе = омТабличныйДокументСерверПовтор.ПолучитьКоличествоМиллиметровВПикселе();
	Линия = ТабДок.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямая);
	Линия.Лево 		= стПараметры.Лево / КоличествоМиллиметровВПикселе;
	Линия.Верх 		= стПараметры.Верх / КоличествоМиллиметровВПикселе;
	Линия.Ширина 	= стПараметры.Ширина / КоличествоМиллиметровВПикселе;
	Линия.Высота 	= стПараметры.Высота / КоличествоМиллиметровВПикселе;

	Линия.ЦветЛинии = омЦветНаСервереПовтор.ПолучитьЦветИзСтроки(стПараметры.ЦветЛинииСтрокой);
КонецФункции // ВывестиЛинию()

Функция ПолучитьСтруктуруПараметровЛинии() Экспорт
	стПараметры = Новый Структура();
	стПараметры.Вставить("Лево",			0);
	стПараметры.Вставить("Верх",			0);
	стПараметры.Вставить("Ширина",			0);
	стПараметры.Вставить("Высота",			0);
	стПараметры.Вставить("ЦветЛинииСтрокой","000000000");
	
	Возврат стПараметры;
КонецФункции // ВывестиЛинию() 

Процедура УстановитьШиринуКолонок(ТабДок,мШиринаКолонок) Экспорт
	
	НомерСтолбца = 1;
	Для Каждого ШиринаКолонки Из мШиринаКолонок Цикл
		Область = ТабДок.Область("R1C" + Формат(НомерСтолбца,"ЧГ=0"));
		Область.ШиринаКолонки = ШиринаКолонки;
		
		НомерСтолбца = НомерСтолбца + 1;
	Конеццикла;
	
	
КонецПроцедуры // УстановитьШиринуКолонок()

Процедура УстановитьВысотуСтрок(ТабДок,мВысотаСтрок) Экспорт
	
	НомерСтроки = 1;
	Для Каждого ВысотаСтроки Из мВысотаСтрок Цикл
		Область = ТабДок.Область("R" + Формат(НомерСтроки,"ЧГ=0") + "C1");
		Область.ВысотаСтроки = ВысотаСтроки;
		
		НомерСтроки = НомерСтроки + 1;
	Конеццикла;
	
	
КонецПроцедуры // УстановитьШиринуКолонок()

Функция РазобратьИмяЯчейки(текИмяОбласти) Экспорт
    текСтрока  = "";
    текКолонка = "";
	флИмяСтрока = Истина;
	флПервыйРаз = Истина;
    буфер = СокрЛП(текИмяОбласти);
    Для х = 1 По СтрДлина(буфер) Цикл
        текЗнак = Сред(буфер, х, 1);
        Если текЗнак = ":" Тогда
            Прервать;
        КонецЕсли; 
        Если текЗнак = "R" Тогда
            Если НЕ флПервыйРаз Тогда
                Прервать;
            КонецЕсли; 
        	флПервыйРаз = Ложь;
            Продолжить;
        КонецЕсли; 
        Если текЗнак = "C" Тогда
            Если флИмяСтрока Тогда
                флИмяСтрока = Ложь;
            КонецЕсли; 
            Продолжить;
        КонецЕсли; 
        Если флИмяСтрока Тогда
            текСтрока  = текСтрока  + текЗнак;
        Иначе
            текКолонка = текКолонка + текЗнак;
        КонецЕсли; 
    КонецЦикла; 
    стрВозврата = Новый Структура("Строка", Число(текСтрока));
    стрВозврата.Вставить("Колонка",  Число(текКолонка));
    Возврат(стрВозврата);
КонецФункции // ()

Функция СвернутьМассивСтуктур(мСтруктур, мРеквизиты, мРесурсы) Экспорт
	
	мВозврата = Новый Массив;
	
	стрПоляСтруктуры = "";	
	
	количествоРеквизитов = мРеквизиты.Количество() - 1;
	Если количествоРеквизитов >= 0 Тогда
		стрПоляСтруктуры = мРеквизиты[0];
		
		Для х = 1 По количествоРеквизитов Цикл
			стрПоляСтруктуры = стрПоляСтруктуры + "," + мРеквизиты[х];
		КонецЦикла;
	
	КонецЕсли; 
	
	количествоРесурсов = мРесурсы.Количество() - 1;
	
	Если количествоРесурсов >= 0 Тогда
		Если ПустаяСтрока(стрПоляСтруктуры) Тогда
			стрПоляСтруктуры = мРесурсы[0];
		Иначе 
			стрПоляСтруктуры = стрПоляСтруктуры + "," + мРесурсы[0];
		КонецЕсли;
		
		Для х = 1 По количествоРесурсов Цикл
			стрПоляСтруктуры = стрПоляСтруктуры + "," + мРесурсы[х];
		КонецЦикла;
	КонецЕсли;
	
	Для каждого элементСтруктуры Из мСтруктур Цикл
		
		НайденЭлемент = Ложь;
		
		Для каждого элементВозврата Из мВозврата Цикл
			
			НайденЭлемент = Истина;
			
			Для каждого текРеквизит Из мРеквизиты Цикл
				Если НЕ элементВозврата[текРеквизит] = элементСтруктуры[текРеквизит] Тогда
					НайденЭлемент = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НайденЭлемент Тогда
				Прервать;
			КонецЕсли; 
		КонецЦикла;
		
		Если НайденЭлемент Тогда
			Для каждого текРесурс Из мРесурсы Цикл
				элементВозврата[текРесурс] = элементВозврата[текРесурс] + элементСтруктуры[текРесурс];
			КонецЦикла;
		Иначе
			новыйЭлемент = Новый Структура(стрПоляСтруктуры);
			ЗаполнитьЗначенияСвойств(новыйЭлемент, элементСтруктуры); 
			
			мВозврата.Добавить(новыйЭлемент);
		КонецЕсли;
		
	КонецЦикла;
	

	Возврат мВозврата;
КонецФункции // СвернутьМассив()
 