
&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектТЗПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОбъектТЗ) Тогда
		
		ДанныеКомпозиции = ПолучитьПроектНаСервере(Объект.ОбъектТЗ);
		
		Объект.Проект = ДанныеКомпозиции.Проект;

		Объект.Комплекты.Очистить();
		Для каждого х Из ДанныеКомпозиции.Комплекты Цикл
			ЗаполнитьЗначенияСвойств(Объект.Комплекты.Добавить(), х);
		КонецЦикла;
		
	Иначе
		Объект.Проект = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроектНаСервере(ОбъектТЗ)
	
	Возврат Задачи.ПересогласованиеКомпозиции.ПолучитьПроектНаСервере(ОбъектТЗ);	
	
КонецФункции // ПолучитьПроектНаСервере()


&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Элементы.ОбъектТЗ.ТолькоПросмотр = НЕ Параметры.Ключ.Пустая();

	Заголовок = Объект.Наименование;
	
	
	Если Копирование Тогда
		Модифицированность 	= Истина;
		Объект.Выполнена 	= Ложь;
		
	ИначеЕсли Объект.Выполнена Тогда
		
		ТолькоПросмотр 							= Истина;
		Элементы.ФормаПринять.Видимость 		= Ложь;
		Элементы.ФормаЗаписатьЗадачу.Видимость 	= Ложь;
		
	КонецЕсли;
	
	ОбновитьСтадии(Неопределено);
	
КонецПроцедуры


Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	омКомментарииНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКомментарий);
	ДополнительныеПараметры = Неопределено;
	Этаформа.Комментарий_авто = омКомментарииНаСервере.Получить_HTML_комментарий(Объект.Комментарии, , , ДополнительныеПараметры);
	Элементы.ГруппаКомментарий.Заголовок = омКомментарийКлиентСервер.ПолучитьЗаголовокСтраницы(ДополнительныеПараметры);
	
	Копирование = ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
	
КонецПроцедуры 


#Область Комментарии

&НаКлиенте
Процедура ОбщаяКомандаКомментарий(Команда)
	омКомментарииНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяКомандаВсеКомментарии(Команда)
	омКомментарииНаКлиенте.ВсеКомментарий(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры

#КонецОбласти


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПустаяСтрока(ТекущийОбъект.Наименование) Тогда
		ТекущийОбъект.Наименование = ТекущийОбъект.ПолучитьЗаголовок();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда) 
	
	Если ВозвможностьПринятия() Тогда
		
		Если Модифицированность Тогда
			Записать();
		КонецЕсли;
		
		ВыполнитьНаСервере(Объект.Ссылка);
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ВыполнитьНаСервере(СсылкаОбъекта)

	ЗадачаОбъект = СсылкаОбъекта.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецПроцедуры


&НаКлиенте
Функция ВозвможностьПринятия()

	Если Не ЗначениеЗаполнено(Объект.ОбъектТЗ) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не заполнена композиция.";
		Сообщение.Поле 			= "ОбъектТЗ";
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Исполнитель) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не заполнен Исполнитель.";
		Сообщение.Поле 			= "Исполнитель";
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.КонструкторКомпозиции) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не заполнен конструктор композиции.";
		Сообщение.Поле 			= "КонструкторКомпозиции";
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	
	КонецЕсли;
	
	ВыбранКомплект = Ложь;
	
	Для  х = 0 По Объект.Комплекты.Количество() - 1 Цикл
		
		Если Объект.Комплекты[х].Выбрать Тогда
			
			Если ЗначениеЗаполнено(Объект.Комплекты[х].Конструктор) Тогда
				
				ВыбранКомплект = Истина;
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст 		= "Не заполнен конструктор у комплекта " + Объект.Комплекты[х].Комплект + ".";
				Сообщение.Поле 			= "Объект.Комплекты[" + х + "].Комплект";
				Сообщение.ПутьКДанным 	= "Объект";
				Сообщение.Сообщить();
				
				Возврат Ложь;
				
			КонецЕсли;
			
			Если Объект.Комплекты[х].Уконструктора Тогда
			
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст 		= "Комплект " + Объект.Комплекты[х].Комплект + " находится в работе у констурктора.";
				Сообщение.Поле 			= "Объект.Комплекты[" + х + "].Комплект";
				Сообщение.ПутьКДанным 	= "Объект";
				Сообщение.Сообщить();
				
				Возврат Ложь;
				
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ВыбранКомплект Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не выбран ни один комплект.";
		Сообщение.Поле 			= "Объект.Комплекты";
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	
	Возврат Истина;
	
КонецФункции // ВозвможностьПринятия()

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьСтадииНаСервере(МассивКомплектов)
	Возврат омЗадачиРКДНаСервере.ЗадачиУКонструктора(МассивКомплектов);
КонецФункции

&НаКлиенте
Процедура ОбновитьСтадии(Команда)
	
	МассивКомплектов = Новый Массив;
	Для каждого х Из Объект.Комплекты Цикл
		МассивКомплектов.Добавить(х.Комплект);	
	КонецЦикла;
		
	СтадииКомплектов = ОбновитьСтадииНаСервере(МассивКомплектов);
	
	Для каждого ТекущийКомплект Из Объект.Комплекты Цикл
		
		ТекущийКомплект.ТекущаяСтадия 			= "";
		ТекущийКомплект.УКонструктора 	= Ложь;
		
		Для каждого ТекущаяСтадия Из СтадииКомплектов Цикл
			
			Если ТекущаяСтадия.ОбъектТЗ = ТекущийКомплект.Комплект Тогда
				
				ТекущийКомплект.ТекущаяСтадия = ТекущаяСтадия.ТекущаяСтадия;		
				ТекущийКомплект.УКонструктора = ТекущаяСтадия.УКонструктора;		
			
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломИзменения(Элемент, Отказ)
	
	ТД = Элементы.Комплекты.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если Элементы.Комплекты.ТекущийЭлемент.Имя = "КомплектыКомплект" Тогда
		
		Отказ = Истина;
		ПоказатьЗначение(, ТД.Комплект);
		
	Иначе
		
		Если ТД.УКонструктора Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры



