
&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектТЗПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОбъектТЗ) Тогда
		
		ДанныеКомпозиции = ПолучитьПроектНаСервере(Объект.ОбъектТЗ);
		
		Объект.Проект = ДанныеКомпозиции.Проект;

		Объект.Комплекты.Очистить();
		Для каждого х Из ДанныеКомпозиции.Комплекты Цикл
			ЗаполнитьЗначенияСвойств(Объект.Комплекты.Добавить(), х);
		КонецЦикла;
		
	Иначе
		Объект.Проект = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроектНаСервере(ОбъектТЗ)
	
	Возврат Задачи.ПересогласованиеКомпозиции.ПолучитьПроектНаСервере(ОбъектТЗ);	
	
КонецФункции // ПолучитьПроектНаСервере()


&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Элементы.ОбъектТЗ.ТолькоПросмотр = НЕ Параметры.Ключ.Пустая();

	Заголовок = Объект.Наименование;
	
	Элементы.ФормаПринять.Видимость = НЕ Объект.Выполнена;
	
	Модифицированность = Копирование;
	
КонецПроцедуры


Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	омКомментарииНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКомментарий);
	ДополнительныеПараметры = Неопределено;
	Этаформа.Комментарий_авто = омКомментарииНаСервере.Получить_HTML_комментарий(Объект.Комментарии, , , ДополнительныеПараметры);
	Элементы.ГруппаКомментарий.Заголовок = омКомментарийКлиентСервер.ПолучитьЗаголовокСтраницы(ДополнительныеПараметры);
	
	Копирование = ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
	
КонецПроцедуры 


#Область Комментарии

&НаКлиенте
Процедура ОбщаяКомандаКомментарий(Команда)
	омКомментарииНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяКомандаВсеКомментарии(Команда)
	омКомментарииНаКлиенте.ВсеКомментарий(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры

#КонецОбласти


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПустаяСтрока(ТекущийОбъект.Наименование) Тогда
		ТекущийОбъект.Наименование = ТекущийОбъект.ПолучитьЗаголовок();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда) 
	
	Если ВозвможностьПринятия() Тогда
		
		Если Модифицированность Тогда
			Записать();
		КонецЕсли;
		
		ВыполнитьНаСервере(Объект.Ссылка);
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ВыполнитьНаСервере(СсылкаОбъекта)

	ЗадачаОбъект = СсылкаОбъекта.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецПроцедуры


&НаКлиенте
Функция ВозвможностьПринятия()

	Если Не ЗначениеЗаполнено(Объект.ОбъектТЗ) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не заполнена композиция.";
		Сообщение.Поле 			= "ОбъектТЗ";
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Исполнитель) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не заполнен Исполнитель.";
		Сообщение.Поле 			= "Исполнитель";
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.КонструкторКомпозиции) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не заполнен конструктор композиции.";
		Сообщение.Поле 			= "КонструкторКомпозиции";
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	
	КонецЕсли;
	
	Для  х = 0 По Объект.Комплекты.Количество() - 1 Цикл
		
		Если НЕ ЗначениеЗаполнено(Объект.Комплекты[х].Конструктор) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст 		= "Не заполнен конструктор у комплекта " + Объект.Комплекты[х].Комплект + ".";
			Сообщение.Поле 			= "Объект.Комплекты[" + х + "].Комплект";
			Сообщение.ПутьКДанным 	= "Объект";
			Сообщение.Сообщить();
			
			Возврат Ложь;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	
	Возврат Истина;
	
КонецФункции // ВозвможностьПринятия()

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
	Закрыть();
КонецПроцедуры



