
// Процедура - Обрабатывает событие перед записью элемента СМ
//
// Параметры:
//  ИмяСмартПроцесса		 - Строка	 	- Имя смарт процесса 
//  Параметры	 			 - Структура	- Передаваемые данные для выполнения 
//  УжеОбработан	 		 - Булево		- Если Истина, то алгоритм из настроек не выполняется 
// 
Процедура ОбработатьСобытиеПередЗаписьюЭлемента(ИмяСмартПроцесса, Параметры, УжеОбработан) Экспорт
	
	//Если ИмяСмартПроцесса = "1" Тогда 
	//	
	//	УжеОбработан = Истина;
	//	
	//КонецЕсли;  
	
КонецПроцедуры        


// Процедура - Обрабатывает событие после записи элемента СМ
//
// Параметры:
//  ИдСмартПроцесса			 - Строка	 	- Имя смарт процесса 
//  Параметры	 			 - Структура	- Передаваемые данные для выполнения 
//  УжеОбработан	 		 - Булево		- Если Истина, то алгоритм из настроек не выполняется 
//
Процедура ОбработатьСобытиеПослеЗаписиЭлемента(ИмяСмартПроцесса, Параметры, УжеОбработан) Экспорт
	
	//Если ИмяСмартПроцесса = "1" Тогда 
	//	
	//	УжеОбработан = Истина;
	//	
	//КонецЕсли;  
	
КонецПроцедуры


