
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область РаботаСНастройками

Функция ПолучитьМассивНастроекСинхронизации(КлючНастройки = "", ЗначениеНастройки = "") Экспорт

	Возврат Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьМассивНастроекСинхронизации(КлючНастройки, ЗначениеНастройки);
	
КонецФункции

Функция ПолучитьКоличествоНастроекПодключенияСинхронизации(КлючНастройки = "", ЗначениеНастройки = "") Экспорт
	
УстановитьПривилегированныйРежим(Истина);
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Если НЕ КлючНастройки = "" Тогда
		Запрос.УстановитьПараметр("ПараметрПоиска", ЗначениеНастройки);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Б24_КС_НастройкиСинхронизации.НастройкаПодключения) КАК Количество
	|ИЗ
	|	РегистрСведений.Б24_КС_НастройкиСинхронизации КАК Б24_КС_НастройкиСинхронизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Б24_К_НастройкиПодключения КАК Б24_К_НастройкиПодключения
	|		ПО Б24_КС_НастройкиСинхронизации.НастройкаПодключения = Б24_К_НастройкиПодключения.Ссылка
	|ГДЕ
	|	Б24_К_НастройкиПодключения.ПометкаУдаления = ЛОЖЬ";
	
	Если НЕ КлючНастройки = "" Тогда
		Запрос.Текст = Запрос.Текст + "
		|" + " И Б24_КС_НастройкиСинхронизации."+КлючНастройки+" = &ПараметрПоиска";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Количество; 
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНастройкуПодключенияПоУмолчаниюСинхронизации(КлючНастройки = "", ЗначениеНастройки = "") Экспорт
	
УстановитьПривилегированныйРежим(Истина);
	
	Результат = Справочники.Б24_К_НастройкиПодключения.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Если НЕ КлючНастройки = "" Тогда
		Запрос.УстановитьПараметр("ПараметрПоиска", ЗначениеНастройки);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_КС_НастройкиСинхронизации.НастройкаПодключения КАК НастройкаПодключения
	|ИЗ
	|	РегистрСведений.Б24_КС_НастройкиСинхронизации КАК Б24_КС_НастройкиСинхронизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Б24_К_НастройкиПодключения КАК Б24_К_НастройкиПодключения
	|		ПО Б24_КС_НастройкиСинхронизации.НастройкаПодключения = Б24_К_НастройкиПодключения.Ссылка
	|ГДЕ
	|	Б24_К_НастройкиПодключения.ПометкаУдаления = ЛОЖЬ";
	
	Если НЕ КлючНастройки = "" Тогда
		Запрос.Текст = Запрос.Текст + "
		|" + " И Б24_КС_НастройкиСинхронизации."+КлючНастройки+" = &ПараметрПоиска";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.НастройкаПодключения; 	
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения) Экспорт

	Возврат Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);
	
КонецФункции

#КонецОбласти


#Область Прочее

Процедура ДобавитьНастройкуВСтруктуру(СтруктураНастроек, НазваниеНастройки, ЗначениеНастройки) Экспорт
	
	Если СтруктураНастроек.Свойство(НазваниеНастройки) Тогда
		СтруктураНастроек[НазваниеНастройки] = ЗначениеНастройки;	
	Иначе
		СтруктураНастроек.Вставить(НазваниеНастройки, ЗначениеНастройки);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруСхемКомпоновки() Экспорт
	
	Результат = Новый Структура();
	
	Результат.Вставить("ВыгрузкаПользовательскихПолей"		, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиПользовательскихПолей")); 	
	Результат.Вставить("ВыгрузкаСвойствТоваров"				, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиСвойствТоваров")); 
	Результат.Вставить("ВыгрузкаСвойствПредложений"			, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиСвойствПредложений")); 
	Результат.Вставить("ВыгрузкаЗначенийСвойств"			, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиЗначенийСвойств")); 
	
	Результат.Вставить("ВыгрузкаПартнеров"					, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиПартнеров")); 	
	Результат.Вставить("ВыгрузкаКонтрагентов"				, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиКонтрагентов")); 	
	Результат.Вставить("ВыгрузкаОрганизаций"				, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиОрганизаций")); 	
	Результат.Вставить("ВыгрузкаКонтактныхЛиц"				, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиКонтактныхЛиц")); 	
	Результат.Вставить("ВыгрузкаБанкСчетовОрганизаций"		, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиБанкСчетовОрганизаций")); 	
	Результат.Вставить("ВыгрузкаБанкСчетовКонтрагентов"		, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиБанкСчетовКонтрагентов")); 	
	
	Результат.Вставить("ВыгрузкаЕдиницИзмерения"			, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиЕдиницИзмерения")); 
	Результат.Вставить("ВыгрузкаНоменклатуры"				, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиНоменклатуры")); 	
	Результат.Вставить("ВыгрузкаТоваров"					, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиТоваров")); 	
	Результат.Вставить("ВыгрузкаПредложений"				, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиПредложений")); 	
	Результат.Вставить("ВыгрузкаКартинокФайлов"				, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиКартинокФайлов")); 	
	Результат.Вставить("ВыгрузкаЦен"						, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиЦен")); 	
	Результат.Вставить("ВыгрузкаОстатков"					, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиОстатков")); 	
	
	Результат.Вставить("ВыгрузкаСчетов"						, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиСчетов")); 	
	Результат.Вставить("ВыгрузкаЗаказовCRM"					, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиЗаказовCRM")); 	
	
	Результат.Вставить("ВыгрузкаЗаказовМагазина"			, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиЗаказовМагазина")); 	
	Результат.Вставить("ВыгрузкаОтгрузок"					, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиОтгрузок")); 	
	Результат.Вставить("ВыгрузкаОплатНаличными"				, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиОплатНаличными")); 	
	Результат.Вставить("ВыгрузкаОплатЭквайрингом"			, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиОплатЭквайрингом")); 	
	Результат.Вставить("ВыгрузкаОплатБезналом"				, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиОплатБезналом")); 	
	Результат.Вставить("ВыгрузкаСделки"						, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("СхемаВыгрузкиПроекта")); 	
		
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНастройкиСинхронизацииПоУмолчанию() Экспорт
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	
	СтруктураССхемами = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСтруктуруСхемКомпоновки();
	
	НастройкиОбмена = Новый Структура;
	
		НастройкиСинхронизацииТоваров = Новый Структура;
		НастройкиСинхронизацииТоваров.Вставить("ИсточникИерархии"		, "Иерархия номенклатуры");
		НастройкиСинхронизацииТоваров.Вставить("ВыгружатьТовары"		, Истина);
		НастройкиСинхронизацииТоваров.Вставить("ВыгружатьПредложения"	, Истина);
		
		НастройкиСинхронизацииТоваров.Вставить("ПакетнаяРегистрацияИзменений", Ложь);
		НастройкиСинхронизацииТоваров.Вставить("ВыгружатьКартинкиИФайлы" , Истина);
		НастройкиСинхронизацииТоваров.Вставить("ЗагружатьКартинкиИФайлы" , Ложь);
		
		НастройкиСинхронизацииТоваров.Вставить("ИдентификаторКаталогаТоваров" 		, "");
		НастройкиСинхронизацииТоваров.Вставить("ИдентификаторКаталогаПредложений" 	, "");
		НастройкиСинхронизацииТоваров.Вставить("ДеревоГрупп" 						, Справочники.Б24_КС_ПользовательскиеГруппыТоваров.ПустаяСсылка());   
		НастройкиСинхронизацииТоваров.Вставить("Склад" 								, Справочники.Склады.ПустаяСсылка());
		
	НастройкиОбмена.Вставить("НастройкиСинхронизацииТоваров", НастройкиСинхронизацииТоваров);
	
	
	///////////////////////////////////////////
	// 			КОНТРАГЕНТЫ					//
	/////////////////////////////////////////
	
		НастройкиСинхронизацииКлиентов = Новый Структура;    
	
		НастройкиСинхронизацииКлиентов.Вставить("ВидМеткиДляСквознойАналитики"		, "По умолчанию");
		НастройкиСинхронизацииКлиентов.Вставить("ВыгружатьМеткуСквознойАналитики"	, Ложь);
		НастройкиСинхронизацииКлиентов.Вставить("СвойствоДляСквознойАналитики"		, Неопределено);
		НастройкиСинхронизацииКлиентов.Вставить("ИсточникДляСквознойАналитики"		, Неопределено);
		
		НастройкиСинхронизацииКлиентов.Вставить("ВыгружатьФайлыКлиентов"			, Ложь);
		НастройкиСинхронизацииКлиентов.Вставить("ВыгружатьВзаиморасчетыКлиентов"	, Ложь);
		
	НастройкиОбмена.Вставить("НастройкиСинхронизацииКлиентов", НастройкиСинхронизацииКлиентов);
	
	
	///////////////////////////////////////////
	// 				СЧЕТА			  		//
	/////////////////////////////////////////
	
		НастройкиСинхронизацииСчетов = Новый Структура;
		
		НастройкиСинхронизацииСчетов.Вставить("ИсточникДатыДокумента"		, "Автоматически в 1С");
		НастройкиСинхронизацииСчетов.Вставить("ИсточникНомераДокумента"		, "Автоматически в 1С");
		
		//НастройкиСинхронизацииСчетов.Вставить("Подразделение"				, Справочники.СтруктураПредприятия.ПустаяСсылка());
		НастройкиСинхронизацииСчетов.Вставить("Подразделение"				, Справочники.Подразделения.ПустаяСсылка());
		НастройкиСинхронизацииСчетов.Вставить("ДатаНачалаЗагрузкиСчетов"	, ТекущаяДатаСеанса()- 60*60*24*30);
		НастройкиСинхронизацииСчетов.Вставить("ДатаНачалаВыгрузкиСчетов"	, ТекущаяДатаСеанса()- 60*60*24*30);
		
		НастройкиСинхронизацииКлиентов.Вставить("ВыгружатьФайлыСчетов"		, Ложь);
		
		ПечатныеФормыСчетов = Новый ТаблицаЗначений;
		ПечатныеФормыСчетов.Колонки.Добавить("НаименованиеПечатнойФормы");
		ПечатныеФормыСчетов.Колонки.Добавить("ИдПечатнойФормы");
		ПечатныеФормыСчетов.Колонки.Добавить("Используется");
		ПечатныеФормыСчетов.Колонки.Добавить("ТипКлиента");
		ПечатныеФормыСчетов.Колонки.Добавить("Организация");
		
		НастройкиСинхронизацииСчетов.Вставить("ПечатныеФормыСчетов", ПечатныеФормыСчетов);
		
	НастройкиОбмена.Вставить("НастройкиСинхронизацииСчетов", НастройкиСинхронизацииСчетов);
	
	
	///////////////////////////////////////////
	// 				СДЕЛКИ			  		//
	/////////////////////////////////////////
	
		НастройкиСинхронизацииСделок = Новый Структура;
		
		НастройкиСинхронизацииСделок.Вставить("ИсточникДатыДокумента"		, "Автоматически в 1С");
		НастройкиСинхронизацииСделок.Вставить("ИсточникНомераДокумента"		, "Автоматически в 1С");
		
		НастройкиСинхронизацииСделок.Вставить("Подразделение"	, Справочники.Подразделения.ПустаяСсылка());
		НастройкиСинхронизацииСделок.Вставить("Организация"		, Справочники.Организации.ОрганизацияПоУмолчанию());
		//НастройкиСинхронизацииСделок.Вставить("Соглашение"		, Справочники.СоглашенияСКлиентами.ПустаяСсылка());
		НастройкиСинхронизацииСделок.Вставить("Соглашение"		, "");
		НастройкиСинхронизацииСделок.Вставить("НоменклатураДоставка"		, Справочники.Номенклатура.ПустаяСсылка());	  
		
		НастройкиСинхронизацииСделок.Вставить("ДатаНачалаЗагрузкиСделок"	, ТекущаяДатаСеанса()- 60*60*24*30);
		НастройкиСинхронизацииСделок.Вставить("ДатаНачалаВыгрузкиСделок"	, ТекущаяДатаСеанса()- 60*60*24*30);
		
		НастройкиСинхронизацииСделок.Вставить("ВидМеткиДляСквознойАналитики"		, "По умолчанию");
		НастройкиСинхронизацииСделок.Вставить("ВыгружатьМеткуСквознойАналитики"		, Ложь);
		НастройкиСинхронизацииСделок.Вставить("СвойствоДляСквознойАналитики"		, Неопределено);
		НастройкиСинхронизацииСделок.Вставить("ИсточникДляСквознойАналитики"		, Неопределено);
		
		НастройкиСинхронизацииКлиентов.Вставить("ВыгружатьФайлыСделок"		, Ложь);
		
	НастройкиОбмена.Вставить("НастройкиСинхронизацииСделок", НастройкиСинхронизацииСделок);	
	
	///////////////////////////////////////////
	// 				ЗАКАЗЫ			 		 //
	/////////////////////////////////////////
	
		НастройкиСинхронизацииЗаказов = Новый Структура;
		
		НастройкиСинхронизацииЗаказов.Вставить("ИсточникДатыДокумента"		, "Автоматически в 1С");
		НастройкиСинхронизацииЗаказов.Вставить("ИсточникНомераДокумента"	, "Автоматически в 1С");
		НастройкиСинхронизацииЗаказов.Вставить("КогдаОтменен"				, "Помечать на удаление");		
		
		НастройкиСинхронизацииЗаказов.Вставить("ДатаНачалаЗагрузкиЗаказов"	, ТекущаяДатаСеанса()- 60*60*24*30);
		НастройкиСинхронизацииЗаказов.Вставить("ДатаНачалаВыгрузкиЗаказов"	, ТекущаяДатаСеанса()- 60*60*24*30);
		
		НастройкиСинхронизацииЗаказов.Вставить("Подразделение"				, Справочники.Подразделения.ПустаяСсылка());
		НастройкиСинхронизацииЗаказов.Вставить("Организация"				, Справочники.Организации.ОрганизацияПоУмолчанию());
		//НастройкиСинхронизацииЗаказов.Вставить("Соглашение"					, Справочники.СоглашенияСКлиентами.ПустаяСсылка());
		НастройкиСинхронизацииЗаказов.Вставить("Соглашение"					, "");
		НастройкиСинхронизацииЗаказов.Вставить("ВидЗаказа"					, Неопределено);
		НастройкиСинхронизацииЗаказов.Вставить("Ответственный"				, Справочники.Пользователи.ПустаяСсылка());	
		НастройкиСинхронизацииЗаказов.Вставить("Склад"						, Справочники.Склады.СкладПоУмолчанию());		
		НастройкиСинхронизацииЗаказов.Вставить("НоменклатураДоставка"		, Справочники.Номенклатура.ПустаяСсылка());		
		//НастройкиСинхронизацииЗаказов.Вставить("СтавкаНДСРасшифровки"		, Справочники.СтавкиНДС.ПустаяСсылка());		
		//НастройкиСинхронизацииЗаказов.Вставить("СтатьяДДС"					, Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());		
		НастройкиСинхронизацииЗаказов.Вставить("СтавкаНДСРасшифровки"		, "");		
		НастройкиСинхронизацииЗаказов.Вставить("СтатьяДДС"					, "");		
		
	НастройкиОбмена.Вставить("НастройкиСинхронизацииЗаказов", НастройкиСинхронизацииЗаказов);
	
	
		СопоставлениеПользователей = Новый ТаблицаЗначений;
		СопоставлениеПользователей.Колонки.Добавить("ИдПользователя");
		СопоставлениеПользователей.Колонки.Добавить("ФИО");
		СопоставлениеПользователей.Колонки.Добавить("Пользователь1С");
		
	НастройкиОбмена.Вставить("СопоставлениеПользователей", СопоставлениеПользователей);
	
	
	СтруктураДанныхКонструктораИнтеграцийПоУмолчанию = ПолучитьСтруктуруДанныхКонструктораИнтеграцийПоУмолчанию();
		
	НастройкиОбмена.Вставить("Сущности"										, СтруктураДанныхКонструктораИнтеграцийПоУмолчанию.Сущности);
	НастройкиОбмена.Вставить("СоответствияПолейСущностейДляВыгрузкиНаПортал", СтруктураДанныхКонструктораИнтеграцийПоУмолчанию.ВсеСоответствияВыгрузки);
	НастройкиОбмена.Вставить("СоответствияПолейСущностейДляЗагрузкиВ1С"		, СтруктураДанныхКонструктораИнтеграцийПоУмолчанию.ВсеСоответствияЗагрузки);
	НастройкиОбмена.Вставить("ОтборыДляВыгрузкиНаПортал"					, СтруктураДанныхКонструктораИнтеграцийПоУмолчанию.ВсеОтборыПоВыгрузкаДанныхНаПортал);
	НастройкиОбмена.Вставить("ОтборыДляЗагрузкиДанныхВ1С"					, СтруктураДанныхКонструктораИнтеграцийПоУмолчанию.ВсеОтборыПоЗагрузкеДанныхВ1С);
	
	НастройкиОбмена.Вставить("СоответствияПолейСущностейТабЧастейДляВыгрузкиНаПортал"	, СтруктураДанныхКонструктораИнтеграцийПоУмолчанию.ВсеСоответствияВыгрузкиТабЧасть);
	НастройкиОбмена.Вставить("СоответствияПолейСущностейТабЧастейДляЗагрузкиВ1С"		, СтруктураДанныхКонструктораИнтеграцийПоУмолчанию.ВсеСоответствияЗагрузкиТабЧасть);
	
	Возврат НастройкиОбмена;
	
КонецФункции

Функция ПолучитьСхемуКомпоновки(ВидСущности, ИмяОбъекта) Экспорт
	
	СтруктураССхемами = ПолучитьСтруктуруСхемКомпоновки();
	
	Схема = Неопределено;
	
	Если ВидСущности = "Компания" Тогда
		
		Если ИмяОбъекта = "Партнеры" Тогда
			Схема = СтруктураССхемами.ВыгрузкаПартнеров;	
		ИначеЕсли ИмяОбъекта = "Организации" Тогда
			Схема = СтруктураССхемами.ВыгрузкаОрганизаций;	
		КонецЕсли;
		
	ИначеЕсли ВидСущности = "Контакт" Тогда
		
		Если ИмяОбъекта = "Партнеры" Тогда
			Схема = СтруктураССхемами.ВыгрузкаПартнеров;	
		ИначеЕсли ИмяОбъекта = "КонтактныеЛицаПартнеров" Тогда
			Схема = СтруктураССхемами.ВыгрузкаКонтактныхЛиц;	
		КонецЕсли;
		
	ИначеЕсли ВидСущности = "Реквизит" Тогда
		
		Если ИмяОбъекта = "Контрагенты" Тогда
			Схема = СтруктураССхемами.ВыгрузкаКонтрагентов;	
		ИначеЕсли ИмяОбъекта = "Организации" Тогда
			Схема = СтруктураССхемами.ВыгрузкаОрганизаций;	
		КонецЕсли;
		
	ИначеЕсли ВидСущности = "Банковский счет" Тогда
		
		Если ИмяОбъекта = "БанковскиеСчетаКонтрагентов" Тогда
			Схема = СтруктураССхемами.ВыгрузкаБанкСчетовКонтрагентов;	
		ИначеЕсли ИмяОбъекта = "БанковскиеСчетаОрганизаций" Тогда
			Схема = СтруктураССхемами.ВыгрузкаБанкСчетовОрганизаций;	
		КонецЕсли;
		
	ИначеЕсли ВидСущности = "Товар" Тогда
		
		Если ИмяОбъекта = "Номенклатура" Тогда
			Схема = СтруктураССхемами.ВыгрузкаНоменклатуры;	
		КонецЕсли;
		
	ИначеЕсли ВидСущности = "Товар2" Тогда
		
		Если ИмяОбъекта = "Номенклатура" Тогда
			Схема = СтруктураССхемами.ВыгрузкаТоваров;	
		КонецЕсли;
		
	ИначеЕсли ВидСущности = "Предложение" ИЛИ ВидСущности = "Товар2" Тогда
		
			Если ИмяОбъекта = "ХарактеристикиНоменклатуры" Тогда
				Схема = СтруктураССхемами.ВыгрузкаПредложений;
			ИначеЕсли ИмяОбъекта = "Номенклатура" Тогда
				Схема = СтруктураССхемами.ВыгрузкаТоваров;	
			КонецЕсли;
		
	ИначеЕсли ВидСущности = "Счет" ИЛИ ВидСущности = "Счет2" Тогда
		
		Если ИмяОбъекта = "СчетНаОплатуКлиенту" Тогда
			Схема = СтруктураССхемами.ВыгрузкаСчетов;	
		КонецЕсли;
		
	ИначеЕсли ВидСущности = "Проект" Тогда
		
		Если ИмяОбъекта = "ЗаказКлиента" Тогда
			Схема = СтруктураССхемами.ВыгрузкаЗаказовCRM;	
		ИначеЕсли ИмяОбъекта = "Проекты" Тогда
			Схема = СтруктураССхемами.ВыгрузкаСделки;	
		КонецЕсли;
		
	ИначеЕсли ВидСущности = "Заказ" Тогда
		
		Если ИмяОбъекта = "ЗаказКлиента" Тогда
			Схема = СтруктураССхемами.ВыгрузкаЗаказовМагазина;	
		КонецЕсли;
		
	ИначеЕсли ВидСущности = "Оплата" Тогда
		
		Если ИмяОбъекта = "ПоступлениеБезналичныхДенежныхСредств" Тогда
			Схема = СтруктураССхемами.ВыгрузкаОплатБезналом;	
		ИначеЕсли ИмяОбъекта = "ПриходныйКассовыйОрдер" Тогда
			Схема = СтруктураССхемами.ВыгрузкаОплатНаличными;	
		ИначеЕсли ИмяОбъекта = "ОперацияПоПлатежнойКарте" Тогда
			Схема = СтруктураССхемами.ВыгрузкаОплатЭквайрингом;	
		КонецЕсли;
		
	ИначеЕсли ВидСущности = "Отгрузка" Тогда
		
		Если ИмяОбъекта = "РеализацияТоваровУслуг" Тогда
			Схема = СтруктураССхемами.ВыгрузкаОтгрузок;	
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Схема;
	
КонецФункции

#КонецОбласти


#Область ВыгрузкаНастроек

Процедура ВыгрузитьНастройкиВФоне(ПараметрыВыгрузки, АдресРезультата) Экспорт
	
	НастройкаПодключения 		= ПараметрыВыгрузки.НастройкаПодключения;
	Если ПараметрыВыгрузки.Свойство("НастройкаУдалена") Тогда
		НастройкаУдалена = ПараметрыВыгрузки.НастройкаУдалена;	
	Иначе
	 	Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.СформироватьСтруктуруСвойств(НастройкаПодключения);
		НастройкаУдалена = Ложь;	
	КонецЕсли;
	
	СтруктураНастроек =  Б24_К_ОбщегоНазначенияВызовСервера.СформироватьСтруктуруНастроек(НастройкаПодключения, Истина);  
	
	Если СтруктураНастроек = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтруктураНастроек.ПараметрКоннектора = "auth_connector=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(СтруктураНастроек.ИдентификаторПодключения);

	ВидыСобытийЭлементовБ24 = ПолучитьВидыСобытийЭлементовБ24();
	
	СтруктураНастроек.Логирование.Измерение1 = "Служебные операции";
	СтруктураНастроек.Логирование.Измерение2 = "Добавление/удаление подписок на события";
	
	Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Удаление подписок на события");
#Область УдалениеПодписокНаСобытия   
	СформированныеЗапросы = Новый Массив;
	ДанныеПортала = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПортал(СтруктураНастроек, "/rest/event.get", ""); 
	Если ДанныеПортала <> Неопределено Тогда
	
		СобытияПортала = ДанныеПортала.Получить("result");
		Если СобытияПортала <> Неопределено Тогда     
			
			Для каждого ТекЭлемент Из СобытияПортала Цикл   
				Если Строка(ТекЭлемент.Получить("offline")) = "1" И ТекЭлемент.Получить("connector_id") = СтруктураНастроек.ИдентификаторПодключения Тогда 
					Запрос = "event.unbind?event=" + ТекЭлемент.Получить("event") + "&event_type=offline&" + СтруктураНастроек.ПараметрКоннектора;
					СформированныеЗапросы.Добавить("cmd[]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Запрос));
				КонецЕсли;   
			КонецЦикла;   
			
			Для каждого ТекЭлемент Из СобытияПортала Цикл  
				Если ТекЭлемент.Получить("event") = "ONOFFLINEEVENT" Тогда 
					
					АдресХэндлера 	= ТекЭлемент.Получить("handler");      
					СтрокаПоиска 	= "idAdress=" + СтруктураНастроек.ИдентификаторПодключения;       
					НайденнаяПозиция= СтрНайти(АдресХэндлера, СтрокаПоиска);
					
					Если НайденнаяПозиция > 0 И НайденнаяПозиция = СтрДлина(АдресХэндлера)-СтрДлина(СтрокаПоиска)+1 Тогда 
						Запрос = "event.unbind?event="+ВидыСобытийЭлементовБ24.ОфлайнСобытие+"&handler="+АдресХэндлера;
						СформированныеЗапросы.Добавить("cmd[]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Запрос));
					КонецЕсли; 
					
				КонецЕсли;   
			КонецЦикла;  
			
		КонецЕсли;           
	КонецЕсли;           
	
	КоличествоВЗапросе = 0;	
	ТелоHTTPЗапроса= "";
	Для каждого ТекЭлемент Из СформированныеЗапросы Цикл
		
		ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + ТекЭлемент;	
		
		КоличествоВЗапросе = КоличествоВЗапросе + 1;
		
		Если КоличествоВЗапросе = 50 Тогда
			Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);
			КоличествоВЗапросе = 0;	
			ТелоHTTPЗапроса = "";
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоВЗапросе > 0 Тогда
		Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);
	КонецЕсли;
#КонецОбласти

	Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало добавления подписок на события");
#Область ДобавлениеПодписокНаСобытия   
	
	СформированныеДанные = Новый Массив;
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	ДобавлениеСобытийПартнеров 		= ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, "Компания", 	"Партнеры", НастройкаУдалена);
	ДобавлениеСобытийОрганизаций 	= ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, "Компания",	"Организации", НастройкаУдалена);

	ДобавлениеСобытия = ДобавлениеСобытийПартнеров ИЛИ ДобавлениеСобытийОрганизаций;
	Если ДобавлениеСобытия Тогда
		мСобытияКомпаний = ПолучитьМассивСобытийКомпаний();	
		Для Каждого ТекЭлемент Из мСобытияКомпаний Цикл
			СформированныеДанные.Добавить("event.bind?event=" + ТекЭлемент + "&event_type=offline&" + СтруктураНастроек.ПараметрКоннектора);
		КонецЦикла;    
	КонецЕсли;
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	ДобавлениеСобытийПартнеров 	= ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, "Контакт", 	"Партнеры", НастройкаУдалена);
	ДобавлениеСобытийКонтЛиц 	= ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, "Контакт",	"КонтактныеЛицаПартнеров", НастройкаУдалена);
	
	ДобавлениеСобытия = ДобавлениеСобытийПартнеров ИЛИ ДобавлениеСобытийКонтЛиц;                                     
	Если ДобавлениеСобытия Тогда
		мСобытияКонтактов = ПолучитьМассивСобытийКонтактов();	
		Для Каждого ТекЭлемент Из мСобытияКонтактов Цикл
			СформированныеДанные.Добавить("event.bind?event=" + ТекЭлемент + "&event_type=offline&" + СтруктураНастроек.ПараметрКоннектора);
		КонецЦикла;
	КонецЕсли;
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	ДобавлениеСобытийКонтрагентов 	= ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, "Реквизит", 	"Контрагенты", НастройкаУдалена);
	ДобавлениеСобытийОрганизаций 	= ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, "Реквизит",	"Организации", НастройкаУдалена);
	
	ДобавлениеСобытия = ДобавлениеСобытийКонтрагентов ИЛИ ДобавлениеСобытийОрганизаций;
	Если ДобавлениеСобытия Тогда
		мСобытияКонтактов = ПолучитьМассивСобытийРеквизитов();	
		Для Каждого ТекЭлемент Из мСобытияКонтактов Цикл
			СформированныеДанные.Добавить("event.bind?event=" + ТекЭлемент + "&event_type=offline&" + СтруктураНастроек.ПараметрКоннектора);
		КонецЦикла;
	КонецЕсли;
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	ДобавлениеСобытийБанкСчетовК = ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, "Банковский счет", 	"БанковскиеСчетаКонтрагентов", НастройкаУдалена);
	ДобавлениеСобытийБанкСчетовО = ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, "Банковский счет", 	"БанковскиеСчетаОрганизаций", НастройкаУдалена);
	Если ДобавлениеСобытийБанкСчетовК ИЛИ ДобавлениеСобытийБанкСчетовО Тогда
		мСобытияКонтактов = ПолучитьМассивСобытийБанкСчетов();	
		Для Каждого ТекЭлемент Из мСобытияКонтактов Цикл
			СформированныеДанные.Добавить("event.bind?event=" + ТекЭлемент + "&event_type=offline&" + СтруктураНастроек.ПараметрКоннектора);
		КонецЦикла;
	КонецЕсли;
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	ДобавлениеСобытийТоваров = ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, "Товар", "Номенклатура", НастройкаУдалена);
	Если ДобавлениеСобытийТоваров Тогда
		мСобытияТоваров = ПолучитьМассивСобытийТоваров();	
		Для Каждого ТекЭлемент Из мСобытияТоваров Цикл
			СформированныеДанные.Добавить("event.bind?event=" + ТекЭлемент + "&event_type=offline&" + СтруктураНастроек.ПараметрКоннектора);
		КонецЦикла;
	КонецЕсли;
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	ДобавлениеСобытийТоваров2 = ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, "Товар2", "Номенклатура", НастройкаУдалена);
	Если ДобавлениеСобытийТоваров2 Тогда
		мСобытияТоваров = ПолучитьМассивСобытийТоваров2();	
		Для Каждого ТекЭлемент Из мСобытияТоваров Цикл
			СформированныеДанные.Добавить("event.bind?event=" + ТекЭлемент + "&event_type=offline&" + СтруктураНастроек.ПараметрКоннектора);
		КонецЦикла;
	КонецЕсли; 
	
	
	ДобавлениеСобытийПредложенийХ = ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, "Предложение", "ХарактеристикиНоменклатуры", НастройкаУдалена);
	ДобавлениеСобытийПредложенийН = ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, "Предложение", "Номенклатура", НастройкаУдалена);
	Если (ДобавлениеСобытийПредложенийХ ИЛИ ДобавлениеСобытийПредложенийН) И НЕ ДобавлениеСобытийТоваров2 Тогда
		мСобытияТоваров = ПолучитьМассивСобытийПредложений();	
		Для Каждого ТекЭлемент Из мСобытияТоваров Цикл
			СформированныеДанные.Добавить("event.bind?event=" + ТекЭлемент + "&event_type=offline&" + СтруктураНастроек.ПараметрКоннектора);
		КонецЦикла;
	КонецЕсли; 
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	ДобавлениеСобытийСчетов = ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, "Счет", "СчетНаОплатуКлиенту", НастройкаУдалена);
	Если ДобавлениеСобытийСчетов Тогда
		мСобытияСчетов = ПолучитьМассивСобытийСчетов();	
		Для Каждого ТекЭлемент Из мСобытияСчетов Цикл
			СформированныеДанные.Добавить("event.bind?event=" + ТекЭлемент + "&event_type=offline&" + СтруктураНастроек.ПараметрКоннектора);
		КонецЦикла;
	КонецЕсли; 
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	ДобавлениеСобытийСчетов2 = ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, "Счет2", "СчетНаОплатуКлиенту", НастройкаУдалена);
	Если ДобавлениеСобытийСчетов2 Тогда
		мСобытияСчетов2 = ПолучитьМассивСобытийСчетов2();	
		Для Каждого ТекЭлемент Из мСобытияСчетов2 Цикл
			СформированныеДанные.Добавить("event.bind?event=" + ТекЭлемент + "&event_type=offline&" + СтруктураНастроек.ПараметрКоннектора);
		КонецЦикла;
	КонецЕсли; 
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	ДобавлениеСобытийСделок = ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, "Проект", "ЗаказКлиента", НастройкаУдалена);
	Если ДобавлениеСобытийСделок Тогда
		мСобытияСделок = ПолучитьМассивСобытийСделок();	
		Для Каждого ТекЭлемент Из мСобытияСделок Цикл
			СформированныеДанные.Добавить("event.bind?event=" + ТекЭлемент + "&event_type=offline&" + СтруктураНастроек.ПараметрКоннектора);
		КонецЦикла;
	КонецЕсли; 
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	ДобавлениеСобытийЗаказов = ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, "Заказ", "ЗаказКлиента", НастройкаУдалена);
	Если ДобавлениеСобытийЗаказов Тогда    
		мСобытияЗаказов = ПолучитьМассивСобытийЗаказов();	
		Для Каждого ТекЭлемент Из мСобытияЗаказов Цикл
			СформированныеДанные.Добавить("event.bind?event=" + ТекЭлемент + "&event_type=offline&" + СтруктураНастроек.ПараметрКоннектора);
		КонецЦикла;
	КонецЕсли; 
	
	СпособВзаимодействияСБитрикс24 = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеХранилищаНастроек("ОбщиеНастройки", "СпособВзаимодействияСБитрикс24");
	Если Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.БазаИспользуетсяВМоделиСервиса() ИЛИ СпособВзаимодействияСБитрикс24 = "Через http-сервисы" Тогда
		НастройкиСинхронизации = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);
		Если Б24_К_RestApiВызовСервера.РеалтаймИспользуется(НастройкаПодключения) Тогда 
			АдресДоХэндлераОфлайнСобытий = Б24_К_RestApiВызовСервера.ПолучитьАдресДоХэндлераСработкиОфлайнСобытияПриложенияБитрикс24() + "?idAdress="+СтруктураНастроек.ИдентификаторПодключения;
			СформированныеДанные.Добавить("event.bind?event="+ВидыСобытийЭлементовБ24.ОфлайнСобытие+"&minTimeout=5&handler="+АдресДоХэндлераОфлайнСобытий);
		КонецЕсли;
	КонецЕсли;
	
	Если СформированныеДанные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Итератор 			= 0;
	КоличествоВЗапросе 	= 0;	
	ТелоHTTPЗапроса		= "";
	Для каждого ТекЭлемент Из СформированныеДанные Цикл
		
		КоличествоВЗапросе 	= КоличествоВЗапросе + 1;
		Итератор			= Итератор + 1;
		
		ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + "cmd["+Формат(Итератор,"ЧГ=0")+"]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекЭлемент);	
		
		Если КоличествоВЗапросе = 50 Тогда
			Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);
			КоличествоВЗапросе 	= 0;	
			ТелоHTTPЗапроса		= "";
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоВЗапросе > 0 Тогда
		Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);
	КонецЕсли;
#КонецОбласти  

КонецПроцедуры

#КонецОбласти


#Область СобытияБитрикс24

Функция ПолучитьВидыСобытийЭлементовБ24() Экспорт
	
	Результат = Новый Структура;   
	
	Результат.Вставить("ОфлайнСобытие"				, "onOfflineEvent");
	
#Область CRM	
	Результат.Вставить("ДобавлениеКомпании"	 		, "onCrmCompanyAdd");	
	Результат.Вставить("ОбновлениеКомпании"	 		, "onCrmCompanyUpdate");
	Результат.Вставить("УдалениеКомпании"	 		, "onCrmCompanyDelete");
	
	Результат.Вставить("ДобавлениеКонтакта" 		, "onCrmContactAdd");	
	Результат.Вставить("ОбновлениеКонтакта" 		, "onCrmContactUpdate");
	Результат.Вставить("УдалениеКонтакта"	 		, "onCrmContactDelete");
	
	Результат.Вставить("ДобавлениеРеквизита"		, "onCrmRequisiteAdd");	
	Результат.Вставить("ОбновлениеРеквизита"		, "onCrmRequisiteUpdate");	
	Результат.Вставить("УдалениеРеквизита"			, "onCrmRequisiteDelete");	
	
	Результат.Вставить("ДобавлениеБанкСчета" 		, "onCrmBankDetailAdd");	
	Результат.Вставить("ОбновлениеБанкСчета" 		, "onCrmBankDetailUpdate");
	Результат.Вставить("УдалениеБанкСчета" 			, "onCrmBankDetailDelete");
	
	Результат.Вставить("ДобавлениеАдреса"	 		, "onCrmAddressRegister");	
	Результат.Вставить("УдалениеАдреса"	 			, "onCrmAddressUnregister");	
	
	
	Результат.Вставить("ДобавлениеСчета"	 		, "onCrmInvoiceAdd");	
	Результат.Вставить("ОбновлениеСчета"	 		, "onCrmInvoiceUpdate");	
	Результат.Вставить("ОбновлениеСтатусаСчета"	 	, "onCrmInvoiceSetStatus");	
	Результат.Вставить("УдалениеСчета"	 			, "onCrmInvoiceDelete");	
	
	Результат.Вставить("ДобавлениеСделки"	 		, "onCrmDealAdd");	
	Результат.Вставить("ОбновлениеСделки"	 		, "onCrmDealUpdate");	
	Результат.Вставить("УдалениеСделки"	 			, "onCrmDealDelete");	
#КонецОбласти	
	
#Область ТоварыПредложения	
	Результат.Вставить("ДобавлениеТовара"	 		, "onCrmProductAdd");	
	Результат.Вставить("ОбновлениеТовара"	 		, "onCrmProductUpdate");
	Результат.Вставить("УдалениеТовара"	 			, "onCrmProductDelete");
	
	Результат.Вставить("ДобавлениеЕдИзм"	 		, "onCrmMeasureAdd");	
	Результат.Вставить("ОбновлениеЕдИзм"	 		, "onCrmMeasureUpdate");	
	Результат.Вставить("УдалениеЕдИзм"	 			, "onCrmMeasureDelete");	
	
	Результат.Вставить("ДобавлениеСвойстваТовара" 	, "onCrmProductPropertyAdd");	
	Результат.Вставить("ОбновлениеСвойстваТовара" 	, "onCrmProductPropertyUpdate");	
	Результат.Вставить("УдалениеСвойстваТовара" 	, "onCrmProductPropertyDelete");	
	
	Результат.Вставить("ДобавлениеРаздела"	 		, "onCrmProductSectionAdd");	
	Результат.Вставить("ОбновлениеРаздела"	 		, "onCrmProductSectionUpdate");	
	Результат.Вставить("УдалениеРаздела"	 		, "onCrmProductSectionDelete");	
	
	
	Результат.Вставить("ДобавлениеТовара2"	 		, "CATALOG.PRODUCT.ON.ADD");	
	Результат.Вставить("ОбновлениеТовара2"	 		, "CATALOG.PRODUCT.ON.UPDATE");
	Результат.Вставить("УдалениеТовара2"	 		, "CATALOG.PRODUCT.ON.DELETE");
	
	Результат.Вставить("ДобавлениеЕдИзм2"	 		, "CATALOG.MEASURE.ON.ADD");	
	Результат.Вставить("ОбновлениеЕдИзм2"	 		, "CATALOG.MEASURE.ON.UPDATE");	
	Результат.Вставить("УдалениеЕдИзм2"	 			, "CATALOG.MEASURE.ON.DELETE");	
	
	Результат.Вставить("ДобавлениеСвойстваТовараПредложения" 	, "ONCRMPRODUCTPROPERTYADD");	
	Результат.Вставить("ОбновлениеСвойстваТовараПредложения" 	, "ONCRMPRODUCTPROPERTYUPDATE");	
	Результат.Вставить("УдалениеСвойстваТовараПредложения" 		, "ONCRMPRODUCTPROPERTYDELETE");	
	
	//Результат.Вставить("ДобавлениеРаздела2"	 		, "CATALOG.GROUP.ON.ADD");	
	//Результат.Вставить("ОбновлениеРаздела2"	 		, "CATALOG.GROUP.ON.UPDATE");	
	//Результат.Вставить("УдалениеРаздела2"	 		, "CATALOG.GROUP.ON.DELETE");	
	
	Результат.Вставить("ДобавлениеЦены"	 			, "CATALOG.PRICE.ON.ADD");	
	Результат.Вставить("ОбновлениеЦены"	 			, "CATALOG.PRICE.ON.ADD");	
	Результат.Вставить("УдалениеЦены"	 			, "CATALOG.PRICE.ON.ADD");	
#КонецОбласти	
	
#Область ПользовательскиеПоля	
	Результат.Вставить("ДобавлениеСвойстваКомпаний" 	, "ONCRMCOMPANYUSERFIELDADD");	
	Результат.Вставить("ОбновлениеСвойстваКомпаний" 	, "ONCRMCOMPANYUSERFIELDUPDATE");	
	Результат.Вставить("УдалениеСвойстваКомпаний" 		, "ONCRMCOMPANYUSERFIELDDELETE");	
	Результат.Вставить("ОбновлениеЗначенийСвойствКомпаний", "ONCRMCOMPANYUSERFIELDSETENUMVALUES");	
	
	Результат.Вставить("ДобавлениеСвойстваКонтактов" 	, "ONCRMCONTACTUSERFIELDADD");	
	Результат.Вставить("ОбновлениеСвойстваКонтактов" 	, "ONCRMCONTACTUSERFIELDUPDATE");	
	Результат.Вставить("УдалениеСвойстваКонтактов" 		, "ONCRMCONTACTUSERFIELDDELETE");	
	Результат.Вставить("ОбновлениеЗначенийСвойствКонтактов", "ONCRMCONTACTUSERFIELDSETENUMVALUES");	
	
	Результат.Вставить("ДобавлениеСвойстваСделок" 		, "ONCRMDEALUSERFIELDADD");	
	Результат.Вставить("ОбновлениеСвойстваСделок" 		, "ONCRMDEALUSERFIELDUPDATE");	
	Результат.Вставить("УдалениеСвойстваСделок" 		, "ONCRMDEALUSERFIELDDELETE");	
	Результат.Вставить("ОбновлениеЗначенийСвойствСделок", "ONCRMDEALUSERFIELDSETENUMVALUES");	
	
	Результат.Вставить("ДобавлениеСвойстваСчетов" 		, "ONCRMINVOICEUSERFIELDADD");	
	Результат.Вставить("ОбновлениеСвойстваСчетов" 		, "ONCRMINVOICEUSERFIELDUPDATE");	
	Результат.Вставить("УдалениеСвойстваСчетов" 		, "ONCRMINVOICEUSERFIELDDELETE");	
	Результат.Вставить("ОбновлениеЗначенийСвойствСчетов", "ONCRMINVOICEUSERFIELDSETENUMVALUES");	
#КонецОбласти	

#Область Заказы	
	Результат.Вставить("ДобавлениеЗаказа" 				, "onSaleOrderSaved");	
	Результат.Вставить("УдалениеЗаказа" 				, "onSaleBeforeOrderDelete");	
	                                            	                                    
	Результат.Вставить("ДобавлениеОплаты" 			, "onPaymentEntitySaved");	
	Результат.Вставить("УдалениеОплаты"				, "onPaymentDeleted");
	
	Результат.Вставить("ДобавлениеОтгрузки" 		, "onShipmentEntitySaved");	
	Результат.Вставить("УдалениеОтгрузки"			, "onShipmentDeleted");	
	                                            	
	Результат.Вставить("ДобавлениеСвойстваЗаказов" 	, "OnPropertyValueEntitySaved");	
	Результат.Вставить("УдалениеСвойстваЗаказов" 	, "OnOrderPropsDelete");	
#КонецОбласти	
	
#Область СмартПроцессы	
	Результат.Вставить("ДобавлениеСмартПроцесса"	, "onCrmDynamicItemAdd");	
	Результат.Вставить("ОбновлениеСмартПроцесса"	, "onCrmDynamicItemUpdate");	
	Результат.Вставить("УдалениеСмартПроцесса"		, "onCrmDynamicItemDelete");	
	
	Результат.Вставить("ДобавлениеСвойстваСмартПроцесса" 		, "onCrmTypeUserFieldAdd");	
	Результат.Вставить("ОбновлениеСвойстваСмартПроцесса" 		, "onCrmTypeUserFieldUpdate");	
	Результат.Вставить("УдалениеСвойстваСмартПроцесса" 			, "onCrmTypeUserFieldDelete");	
	Результат.Вставить("ОбновлениеЗначенийСвойствСмартПроцесса"	, "onCrmTypeUserFieldSetEnumValues");
#КонецОбласти

	Возврат Результат;

КонецФункции

Функция ПолучитьМассивСобытийКомпаний() 
	
	События = ПолучитьВидыСобытийЭлементовБ24();
	
	Результат = Новый Массив;
	
	Результат.Добавить(События.ДобавлениеКомпании);
	Результат.Добавить(События.ОбновлениеКомпании);
	Результат.Добавить(События.УдалениеКомпании);
	
	Результат.Добавить(События.ДобавлениеСвойстваКомпаний);
	Результат.Добавить(События.ОбновлениеСвойстваКомпаний);
	Результат.Добавить(События.УдалениеСвойстваКомпаний);
	Результат.Добавить(События.ОбновлениеЗначенийСвойствКомпаний);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивСобытийКонтактов() 
	
	События = ПолучитьВидыСобытийЭлементовБ24();
	
	Результат = Новый Массив;
	
	Результат.Добавить(События.ДобавлениеКонтакта);
	Результат.Добавить(События.ОбновлениеКонтакта);
	Результат.Добавить(События.УдалениеКонтакта);
	
	Результат.Добавить(События.ДобавлениеСвойстваКонтактов);
	Результат.Добавить(События.ОбновлениеСвойстваКонтактов);
	Результат.Добавить(События.УдалениеСвойстваКонтактов);
	Результат.Добавить(События.ОбновлениеЗначенийСвойствКонтактов);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивСобытийРеквизитов() 
	
	События = ПолучитьВидыСобытийЭлементовБ24();
	
	Результат = Новый Массив;
	
	Результат.Добавить(События.ДобавлениеРеквизита);
	Результат.Добавить(События.ОбновлениеРеквизита);
	Результат.Добавить(События.УдалениеРеквизита);
	
	Результат.Добавить(События.ДобавлениеАдреса);
	Результат.Добавить(События.УдалениеАдреса);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивСобытийБанкСчетов() 
	
	События = ПолучитьВидыСобытийЭлементовБ24();
	
	Результат = Новый Массив;
	
	Результат.Добавить(События.ДобавлениеБанкСчета);
	Результат.Добавить(События.ОбновлениеБанкСчета);
	Результат.Добавить(События.УдалениеБанкСчета);
	
	Возврат Результат;
	
КонецФункции



Функция ПолучитьМассивСобытийТоваров() 
	
	События = ПолучитьВидыСобытийЭлементовБ24();
	
	Результат = Новый Массив;
	
	Результат.Добавить(События.ДобавлениеТовара);
	Результат.Добавить(События.ОбновлениеТовара);
	Результат.Добавить(События.УдалениеТовара);
	
	Результат.Добавить(События.ДобавлениеЕдИзм);
	Результат.Добавить(События.ОбновлениеЕдИзм);
	Результат.Добавить(События.УдалениеЕдИзм);
	
	Результат.Добавить(События.ДобавлениеСвойстваТовара);
	Результат.Добавить(События.ОбновлениеСвойстваТовара);
	Результат.Добавить(События.УдалениеСвойстваТовара);
	
	Результат.Добавить(События.ДобавлениеРаздела);
	Результат.Добавить(События.ОбновлениеРаздела);
	Результат.Добавить(События.УдалениеРаздела);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивСобытийТоваров2() 
	
	События = ПолучитьВидыСобытийЭлементовБ24();
	
	Результат = Новый Массив;
	
	Результат.Добавить(События.ДобавлениеТовара2);
	Результат.Добавить(События.ОбновлениеТовара2);
	Результат.Добавить(События.УдалениеТовара2);
	
	Результат.Добавить(События.ДобавлениеЕдИзм2);
	Результат.Добавить(События.ОбновлениеЕдИзм2);
	Результат.Добавить(События.УдалениеЕдИзм2);
	
	Результат.Добавить(События.ДобавлениеСвойстваТовараПредложения);
	Результат.Добавить(События.ОбновлениеСвойстваТовараПредложения);
	Результат.Добавить(События.УдалениеСвойстваТовараПредложения);
	
	//Результат.Добавить(События.ДобавлениеРаздела2);
	//Результат.Добавить(События.ОбновлениеРаздела2);
	//Результат.Добавить(События.УдалениеРаздела2);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивСобытийПредложений() 
	
	События = ПолучитьВидыСобытийЭлементовБ24();
	
	Результат = Новый Массив;
	
	Результат.Добавить(События.ДобавлениеЕдИзм2);
	Результат.Добавить(События.ОбновлениеЕдИзм2);
	Результат.Добавить(События.УдалениеЕдИзм2);
	
	Результат.Добавить(События.ДобавлениеТовара2);
	Результат.Добавить(События.ОбновлениеТовара2);
	Результат.Добавить(События.УдалениеТовара2);
	
	Результат.Добавить(События.ДобавлениеСвойстваТовараПредложения);
	Результат.Добавить(События.ОбновлениеСвойстваТовараПредложения);
	Результат.Добавить(События.УдалениеСвойстваТовараПредложения);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивСобытийСчетов() 
	
	События = ПолучитьВидыСобытийЭлементовБ24();
	
	Результат = Новый Массив;
	
	Результат.Добавить(События.ДобавлениеСчета);
	Результат.Добавить(События.ОбновлениеСчета);
	Результат.Добавить(События.ОбновлениеСтатусаСчета);
	Результат.Добавить(События.УдалениеСчета);
	
	Результат.Добавить(События.ДобавлениеСвойстваСчетов);
	Результат.Добавить(События.ОбновлениеСвойстваСчетов);
	Результат.Добавить(События.УдалениеСвойстваСчетов);
	Результат.Добавить(События.ОбновлениеЗначенийСвойствСчетов);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивСобытийСчетов2() 
	
	События = ПолучитьВидыСобытийЭлементовБ24();
	
	Результат = Новый Массив;
	
	Результат.Добавить(События.ДобавлениеСмартПроцесса);
	Результат.Добавить(События.ОбновлениеСмартПроцесса);
	Результат.Добавить(События.УдалениеСмартПроцесса);
	
	Результат.Добавить(События.ДобавлениеСвойстваСмартПроцесса);
	Результат.Добавить(События.ОбновлениеСвойстваСмартПроцесса);
	Результат.Добавить(События.УдалениеСвойстваСмартПроцесса);
	Результат.Добавить(События.ОбновлениеЗначенийСвойствСмартПроцесса);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивСобытийСделок() 
	
	События = ПолучитьВидыСобытийЭлементовБ24();
	
	Результат = Новый Массив;
	
	Результат.Добавить(События.ДобавлениеСделки);
	Результат.Добавить(События.ОбновлениеСделки);
	Результат.Добавить(События.УдалениеСделки);
	
	Результат.Добавить(События.ДобавлениеСвойстваСделок);
	Результат.Добавить(События.ОбновлениеСвойстваСделок);
	Результат.Добавить(События.УдалениеСвойстваСделок);
	Результат.Добавить(События.ОбновлениеЗначенийСвойствСделок);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивСобытийЗаказов() 
	
	События = ПолучитьВидыСобытийЭлементовБ24();
	
	Результат = Новый Массив;
	
	Результат.Добавить(События.ДобавлениеЗаказа);
	Результат.Добавить(События.УдалениеЗаказа);
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьНеобходимостьРегистрацииСобытийНаПорталеПоТипуДанных(НастройкаПодключения, ВидСущности, ИмяОбъекта, НастройкаУдалена) Экспорт
	
	Результат = Ложь;
	
	Если НастройкаУдалена Тогда
		Возврат Результат;
	КонецЕсли;
	
	Настройки = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкиСинхронизации(НастройкаПодключения);
	Если Настройки = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	НастройкиСинхронизации = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);
	
	Если ВидСущности = "Компания" ИЛИ ВидСущности = "Контакт" ИЛИ ВидСущности = "Реквизит" ИЛИ ВидСущности = "Банковский счет" Тогда
		Результат = НастройкиСинхронизации.СинхронизацияКлиентов И Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(НастройкаПодключения, ВидСущности, ИмяОбъекта, "ЗагружатьВ1С") = Истина;
	ИначеЕсли ВидСущности = "Товар" И НастройкиСинхронизации.ВерсияТоваров <> "v.2" Тогда
		Результат = НастройкиСинхронизации.СинхронизацияТоваров И Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(НастройкаПодключения, ВидСущности, ИмяОбъекта, "ЗагружатьВ1С") = Истина;
	ИначеЕсли ВидСущности = "Товар2" И НастройкиСинхронизации.ВерсияТоваров = "v.2" Тогда
		Результат = НастройкиСинхронизации.СинхронизацияТоваров И Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(НастройкаПодключения, ВидСущности, ИмяОбъекта, "ЗагружатьВ1С") = Истина;
	ИначеЕсли ВидСущности = "Предложение" И НастройкиСинхронизации.ВерсияТоваров = "v.2" Тогда
		Результат = НастройкиСинхронизации.СинхронизацияТоваров И Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(НастройкаПодключения, ВидСущности, ИмяОбъекта, "ЗагружатьВ1С") = Истина;
	ИначеЕсли ВидСущности = "Счет" И НастройкиСинхронизации.ВерсияСчетов <> "v.2" Тогда
		Результат = НастройкиСинхронизации.СинхронизацияСчетов И Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(НастройкаПодключения, ВидСущности, ИмяОбъекта, "ЗагружатьВ1С") = Истина;
	ИначеЕсли ВидСущности = "Счет2" И НастройкиСинхронизации.ВерсияСчетов = "v.2" Тогда
		Результат = НастройкиСинхронизации.СинхронизацияСчетов И Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(НастройкаПодключения, ВидСущности, ИмяОбъекта, "ЗагружатьВ1С") = Истина;
	ИначеЕсли ВидСущности = "Проект" Тогда
		Результат = НастройкиСинхронизации.СинхронизацияСделок И Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(НастройкаПодключения, ВидСущности, ИмяОбъекта, "ЗагружатьВ1С") = Истина;
	ИначеЕсли ВидСущности = "Заказ" Тогда
		Результат = НастройкиСинхронизации.СинхронизацияЗаказов И Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(НастройкаПодключения, ВидСущности, ИмяОбъекта, "ЗагружатьВ1С") = Истина;
	ИначеЕсли ВидСущности = "Оплата" Тогда
		Результат = НастройкиСинхронизации.СинхронизацияЗаказов И Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(НастройкаПодключения, ВидСущности, ИмяОбъекта, "ЗагружатьВ1С") = Истина;
	ИначеЕсли ВидСущности = "Отгрузка" Тогда
		Результат = НастройкиСинхронизации.СинхронизацияЗаказов И Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(НастройкаПодключения, ВидСущности, ИмяОбъекта, "ЗагружатьВ1С") = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 


#Область ЗаполнениеКонструктораИнтеграцииПоУмолчанию

Функция ПолучитьСтруктуруДанныхКонструктораИнтеграцийПоУмолчанию() Экспорт
	
	мСущности = ПолучитьСущностиПоУмолчанию();
	
	Результат = Новый Структура;
	Результат.Вставить("Сущности"							, мСущности); 
	Результат.Вставить("ВсеСоответствияВыгрузки"			, ПолучитьСоответствияВыгрузкиПоУмолчанию(мСущности)); 
	Результат.Вставить("ВсеСоответствияЗагрузки"			, ПолучитьСоответствияЗагрузкиПоУмолчанию(мСущности)); 
	Результат.Вставить("ВсеСоответствияВыгрузкиТабЧасть"	, ПолучитьСоответствияТабЧастейДляВыгрузкиПоУмолчанию(мСущности)); 
	Результат.Вставить("ВсеСоответствияЗагрузкиТабЧасть"	, ПолучитьСоответствияТабЧастейДляЗагрузкиПоУмолчанию(мСущности)); 
	Результат.Вставить("ВсеОтборыПоВыгрузкаДанныхНаПортал"	, ПолучитьОтборыПоВыгрузкеДанныхНаПорталПоУмолчанию(мСущности)); 
	Результат.Вставить("ВсеОтборыПоЗагрузкеДанныхВ1С"		, ПолучитьОтборыПоЗагрузкиДанныхВ1СПоУмолчанию(мСущности)); 
	
	Возврат Результат;						
							
КонецФункции


Функция ПолучитьСущностиПоУмолчанию() 
	
	Результат = Новый Массив;
	
//Компании	

	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Компания";
	//	НоваяЗапись.ВидОбъекта 			= "Справочник";
	//	НоваяЗапись.ИмяОбъекта 			= "Партнеры";
	//	НоваяЗапись.НаименованиеОбъекта = "Партнеры";
	//	НоваяЗапись.ЗагружатьВ1С 		= Истина;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Истина;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= Ложь;
	//Результат.Добавить(НоваяЗапись);
	//
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Компания";
	//	НоваяЗапись.ВидОбъекта 			= "Справочник";
	//	НоваяЗапись.ИмяОбъекта 			= "Организации";
	//	НоваяЗапись.НаименованиеОбъекта = "Организации";
	//	НоваяЗапись.ЗагружатьВ1С 		= Ложь;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Ложь;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= Ложь;
	//Результат.Добавить(НоваяЗапись);
	
//Контакты	
	
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Контакт";
	//	НоваяЗапись.ВидОбъекта 			= "Справочник";
	//	НоваяЗапись.ИмяОбъекта 			= "Партнеры";
	//	НоваяЗапись.НаименованиеОбъекта = "Партнеры";
	//	НоваяЗапись.ЗагружатьВ1С 		= Истина;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Истина;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= Ложь;
	//Результат.Добавить(НоваяЗапись);
	//
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Контакт";
	//	НоваяЗапись.ВидОбъекта 			= "Справочник";
	//	НоваяЗапись.ИмяОбъекта 			= "КонтактныеЛицаПартнеров";
	//	НоваяЗапись.НаименованиеОбъекта = "Контактные лица";
	//	НоваяЗапись.ЗагружатьВ1С 		= Истина;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Истина;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= Ложь;
	//Результат.Добавить(НоваяЗапись);
	
//Реквизиты	

	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Реквизит";
	//	НоваяЗапись.ВидОбъекта 			= "Справочник";
	//	НоваяЗапись.ИмяОбъекта 			= "Контрагенты";
	//	НоваяЗапись.НаименованиеОбъекта = "Контрагенты";
	//	НоваяЗапись.ЗагружатьВ1С 		= Истина;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Истина;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= Ложь;
	//Результат.Добавить(НоваяЗапись);
	
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Реквизит";
	//	НоваяЗапись.ВидОбъекта 			= "Справочник";
	//	НоваяЗапись.ИмяОбъекта 			= "Организации";
	//	НоваяЗапись.НаименованиеОбъекта = "Организации";
	//	НоваяЗапись.ЗагружатьВ1С 		= Ложь;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Ложь;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= Ложь;
	//Результат.Добавить(НоваяЗапись);
	//
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Банковский счет";
	//	НоваяЗапись.ВидОбъекта 			= "Справочник";
	//	НоваяЗапись.ИмяОбъекта 			= "БанковскиеСчетаКонтрагентов";
	//	НоваяЗапись.НаименованиеОбъекта = "Банковские счета";
	//	НоваяЗапись.ЗагружатьВ1С 		= Истина;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Истина;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= Ложь;
	//Результат.Добавить(НоваяЗапись);
	//
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Банковский счет";
	//	НоваяЗапись.ВидОбъекта 			= "Справочник";
	//	НоваяЗапись.ИмяОбъекта 			= "БанковскиеСчетаОрганизаций";
	//	НоваяЗапись.НаименованиеОбъекта = "Банковские счета организаций";
	//	НоваяЗапись.ЗагружатьВ1С 		= Истина;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Истина;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= Ложь;
	//Результат.Добавить(НоваяЗапись);
	//
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Товар";
	//	НоваяЗапись.ВидОбъекта 			= "Справочник";
	//	НоваяЗапись.ИмяОбъекта 			= "Номенклатура";
	//	НоваяЗапись.НаименованиеОбъекта = "Номенклатура";
	//	НоваяЗапись.ЗагружатьВ1С 		= Ложь;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Ложь;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= Ложь;
	//Результат.Добавить(НоваяЗапись);
	//
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Товар2";
	//	НоваяЗапись.ВидОбъекта 			= "Справочник";
	//	НоваяЗапись.ИмяОбъекта 			= "Номенклатура";
	//	НоваяЗапись.НаименованиеОбъекта = "Номенклатура";
	//	НоваяЗапись.ЗагружатьВ1С 		= Ложь;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Ложь;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= Ложь;
	//Результат.Добавить(НоваяЗапись);
	//
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Предложение";
	//	НоваяЗапись.ВидОбъекта 			= "Справочник";
	//	НоваяЗапись.ИмяОбъекта 			= "Номенклатура";
	//	НоваяЗапись.НаименованиеОбъекта = "Номенклатура";
	//	НоваяЗапись.ЗагружатьВ1С 		= Ложь;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Ложь;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= Ложь;
	//Результат.Добавить(НоваяЗапись);
	//
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Предложение";
	//	НоваяЗапись.ВидОбъекта 			= "Справочник";
	//	НоваяЗапись.ИмяОбъекта 			= "ХарактеристикиНоменклатуры";
	//	НоваяЗапись.НаименованиеОбъекта = "Характеристики номенклатуры";
	//	НоваяЗапись.ЗагружатьВ1С 		= Ложь;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Ложь;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= Ложь;
	//Результат.Добавить(НоваяЗапись);
	
	НоваяЗапись = ПолучитьСтруктуруСущностей();
		НоваяЗапись.ВидСущности 		= "Проект";
		НоваяЗапись.ВидОбъекта 			= "Справочник";
		НоваяЗапись.ИмяОбъекта 			= "Проекты";
		НоваяЗапись.НаименованиеОбъекта = "Проекты";
		НоваяЗапись.ЗагружатьВ1С 		= Истина;
		НоваяЗапись.ВыгружатьНаПортал 	= Истина;
		НоваяЗапись.ОбновлятьВ1С 		= Истина;
		НоваяЗапись.ОбновлятьНаПортале 	= Истина;
		НоваяЗапись.РежимЗаписи 		= Ложь;
	Результат.Добавить(НоваяЗапись);
	
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Счет";
	//	НоваяЗапись.ВидОбъекта 			= "Документ";
	//	НоваяЗапись.ИмяОбъекта 			= "СчетНаОплатуКлиенту";
	//	НоваяЗапись.НаименованиеОбъекта = "Счет на оплату клиенту";
	//	НоваяЗапись.ЗагружатьВ1С 		= Истина;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Истина;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= "Проводить оплаченные";
	//Результат.Добавить(НоваяЗапись);
	//
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Счет2";
	//	НоваяЗапись.ВидОбъекта 			= "Документ";
	//	НоваяЗапись.ИмяОбъекта 			= "СчетНаОплатуКлиенту";
	//	НоваяЗапись.НаименованиеОбъекта = "Счет на оплату";
	//	НоваяЗапись.ЗагружатьВ1С 		= Истина;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Истина;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= "Только записывать";
	//Результат.Добавить(НоваяЗапись);
	//
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Заказ";
	//	НоваяЗапись.ВидОбъекта 			= "Документ";
	//	НоваяЗапись.ИмяОбъекта 			= "ЗаказКлиента";
	//	НоваяЗапись.НаименованиеОбъекта = "Заказ клиента";
	//	НоваяЗапись.ЗагружатьВ1С 		= Истина;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Истина;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= "Проводить закрытые";
	//Результат.Добавить(НоваяЗапись);
	//
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Оплата";
	//	НоваяЗапись.ВидОбъекта 			= "Документ";
	//	НоваяЗапись.ИмяОбъекта 			= "ПоступлениеБезналичныхДенежныхСредств";
	//	НоваяЗапись.НаименованиеОбъекта = "Поступление на счет";
	//	НоваяЗапись.ЗагружатьВ1С 		= Истина;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Истина;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= "Проводить оплаченные";
	//Результат.Добавить(НоваяЗапись);
	//
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Оплата";
	//	НоваяЗапись.ВидОбъекта 			= "Документ";
	//	НоваяЗапись.ИмяОбъекта 			= "ПриходныйКассовыйОрдер";
	//	НоваяЗапись.НаименованиеОбъекта = "Приходный кассовый ордер";
	//	НоваяЗапись.ЗагружатьВ1С 		= Истина;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Истина;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= "Проводить оплаченные";
	//Результат.Добавить(НоваяЗапись);
	//
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Оплата";
	//	НоваяЗапись.ВидОбъекта 			= "Документ";
	//	НоваяЗапись.ИмяОбъекта 			= "ОперацияПоПлатежнойКарте";
	//	НоваяЗапись.НаименованиеОбъекта = "Операция по платежной карте";
	//	НоваяЗапись.ЗагружатьВ1С 		= Истина;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Истина;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= "Проводить оплаченные";
	//Результат.Добавить(НоваяЗапись);
	//
	//НоваяЗапись = ПолучитьСтруктуруСущностей();
	//	НоваяЗапись.ВидСущности 		= "Отгрузка";
	//	НоваяЗапись.ВидОбъекта 			= "Документ";
	//	НоваяЗапись.ИмяОбъекта 			= "РеализацияТоваровУслуг";
	//	НоваяЗапись.НаименованиеОбъекта = "Реализация товаров и услуг";
	//	НоваяЗапись.ЗагружатьВ1С 		= Истина;
	//	НоваяЗапись.ВыгружатьНаПортал 	= Истина;
	//	НоваяЗапись.ОбновлятьВ1С 		= Истина;
	//	НоваяЗапись.ОбновлятьНаПортале 	= Истина;
	//	НоваяЗапись.РежимЗаписи 		= "Проводить отгруженные";
	//Результат.Добавить(НоваяЗапись);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруСущностей()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВидСущности"		, "");
	Результат.Вставить("ВидОбъекта"			, "");
	Результат.Вставить("ИмяОбъекта"			, "");
	Результат.Вставить("НаименованиеОбъекта", "");
	Результат.Вставить("ЗагружатьВ1С"		, Ложь);
	Результат.Вставить("ВыгружатьНаПортал"	, Ложь);
	Результат.Вставить("ОбновлятьВ1С"		, Ложь);
	Результат.Вставить("ОбновлятьНаПортале"	, Ложь);
	Результат.Вставить("РежимЗаписи"		, "");
	
	Результат.Вставить("АлгоритмПриВыгрузкеДанныхНаПортал"	, "");
	Результат.Вставить("АлгоритмПриЗагрузкеДанныхВ1С"		, "");
	
	Результат.Вставить("ПравилаПоискаПриВыгрузкеНаПортал"	, "");
	Результат.Вставить("ПравилаПоискаПриЗагрузкеВ1С"		, "");
	
	Возврат Результат;
	
КонецФункции


#Область ЗаполнениеТаблицВыгрузки

Функция ПолучитьСоответствияВыгрузкиПоУмолчанию(Сущности) Экспорт 
	
	Результат = Новый Массив;
	
	АктуальныеПоля = Новый СписокЗначений;
	
	Для каждого ТекЭлемент Из Сущности Цикл
		
		Если ТекЭлемент.ВидСущности = "Компания" Тогда
			АктуальныеПоля = ПолучитьПоляКомпанийПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Контакт" Тогда
			АктуальныеПоля = ПолучитьПоляКонтактовПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Реквизит" Тогда
			АктуальныеПоля = ПолучитьПоляРеквизитовПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Банковский счет" Тогда
			АктуальныеПоля = ПолучитьПоляБанкСчетовПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Товар" Тогда
			АктуальныеПоля = ПолучитьПоляТоваровПоУмолчанию();
		ИначеЕсли ТекЭлемент.ВидСущности = "Товар2" Тогда
			АктуальныеПоля = ПолучитьПоляТоваров2ПоУмолчанию();
		ИначеЕсли ТекЭлемент.ВидСущности = "Предложение" Тогда
			АктуальныеПоля = ПолучитьПоляПредложенийПоУмолчанию();
		ИначеЕсли ТекЭлемент.ВидСущности = "Счет" Тогда
			АктуальныеПоля = ПолучитьПоляСчетовПоУмолчанию();
		ИначеЕсли ТекЭлемент.ВидСущности = "Счет2" Тогда
			АктуальныеПоля = ПолучитьПоляСчетов2ПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Проект" Тогда
			АктуальныеПоля = ПолучитьПоляСделокПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Заказ" Тогда
			АктуальныеПоля = ПолучитьПоляЗаказовПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Оплата" Тогда
			АктуальныеПоля = ПолучитьПоляОплатПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Отгрузка" Тогда
			АктуальныеПоля = ПолучитьПоляОтгрузокПоУмолчанию();	
		КонецЕсли;
		
		Для каждого ТекПоле Из АктуальныеПоля Цикл 
			
			НоваяЗапись = ПолучитьСтруктуруСоответствийВыгрузки();
			
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекЭлемент);
			
			НоваяЗапись.КлючЗапроса = ТекПоле.Значение;	
			НоваяЗапись.Описание 	= ТекПоле.Представление;	
			
			Если ТекПоле.Пометка Тогда
				НоваяЗапись.ИсточникДанных 	= "Предопределенный алгоритм";	
				НоваяЗапись.Значение 		= ТекПоле.Представление;	
			КонецЕсли;
			
			Результат.Добавить(НоваяЗапись);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруСоответствийВыгрузки() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВидСущности"		, "");
	Результат.Вставить("ВидОбъекта"			, "");
	Результат.Вставить("ИмяОбъекта"			, "");
	Результат.Вставить("КлючЗапроса"		, "");
	Результат.Вставить("ИсточникДанных"		, "");
	Результат.Вставить("Значение"			, "");
	Результат.Вставить("Описание"			, "");
	Результат.Вставить("Идентификатор"		, "");
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьПоляКомпанийПоУмолчанию()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("TITLE"			, "Наименование элемента справочника", Истина);
	Результат.Добавить("COMPANY_TYPE"	, "Тип компании", Истина);
	
	Результат.Добавить("ORIGINATOR_ID"	, "Идентификатор источника данных", Истина);
	Результат.Добавить("ORIGIN_ID"		, "Идентификатор элемента в источнике данных", Истина);
	
	Результат.Добавить("COMMENTS"		, "Комментарий", Истина);
	
	Результат.Добавить("ASSIGNED_BY_ID"	, "Ответственный", Истина);
	Результат.Добавить("INDUSTRY"		, "Сфера деятельности");
	
	Результат.Добавить("CURRENCY_ID"	, "Валюта");
	Результат.Добавить("REVENUE"		, "Годовой оборот");
	Результат.Добавить("IS_MY_COMPANY"	, "Признак организации", Истина);
	
	Результат.Добавить("UTM_CONTENT"	, "Например, для контекстных объявлений");
	Результат.Добавить("UTM_TERM"		, "Например, ключевые слова контекстной рекламы");
	Результат.Добавить("UTM_MEDIUM"		, "CPC (объявления), CPM (баннеры)");
	Результат.Добавить("UTM_SOURCE"		, "Yandex-Direct, Google-Adwords и другие", Истина);
	Результат.Добавить("UTM_CAMPAIGN"	, "Метка компаний", Истина);

	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляКонтактовПоУмолчанию()
	
	Результат = Новый СписокЗначений;
	
	
	Результат.Добавить("NAME"				, "Имя", Истина);
	Результат.Добавить("SECOND_NAME"		, "Отчество", Истина);
	Результат.Добавить("LAST_NAME"			, "Фамилия", Истина);
	
	Результат.Добавить("COMPANY_ID"			, "Ид компании", Истина);
	Результат.Добавить("ASSIGNED_BY_ID"		, "Ответственный", Истина);
	Результат.Добавить("TYPE_ID"			, "Тип контакта", Истина);
	
	Результат.Добавить("ORIGINATOR_ID"		, "Идентификатор источника данных", Истина);
	Результат.Добавить("ORIGIN_ID"			, "Идентификатор элемента в источнике данных", Истина);
	
	Результат.Добавить("COMMENTS"			, "Комментарий", Истина);
	
	Результат.Добавить("BIRTHDATE"			, "Дата рождения", Истина);
	Результат.Добавить("POST"				, "Должность", Истина);
	
	Результат.Добавить("HONORIFIC"			, "Это ИП"	, Истина);
	
	Результат.Добавить("UTM_CONTENT"	, "Например, для контекстных объявлений");
	Результат.Добавить("UTM_TERM"		, "Например, ключевые слова контекстной рекламы");
	Результат.Добавить("UTM_MEDIUM"		, "CPC (объявления), CPM (баннеры)");
	Результат.Добавить("UTM_SOURCE"		, "Yandex-Direct, Google-Adwords и другие", Истина);
	Результат.Добавить("UTM_CAMPAIGN"	, "Метка компаний", Истина);

	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляРеквизитовПоУмолчанию()
	
	Результат = Новый СписокЗначений;
	
	
	Результат.Добавить("ENTITY_TYPE_ID"		, "Тип владельца", Истина);
	Результат.Добавить("ENTITY_ID"			, "Идентификатор владельца", Истина);
	
	Результат.Добавить("ACTIVE"				, "Доступность", Истина);
	Результат.Добавить("ORIGINATOR_ID"		, "Идентификатор источника данных", Истина);
	Результат.Добавить("XML_ID"				, "Идентификатор элемента в источнике данных", Истина);
	
	Результат.Добавить("PRESET_ID"			, "Идентификатор шаблона", Истина);
	Результат.Добавить("NAME"				, "Наименование реквизита", Истина);
	
	//Результат.Добавить("RQ_COMPANY_NAME"		, "Сокращенное наименование организации", Истина);
	//Результат.Добавить("RQ_COMPANY_FULL_NAME"	, "Полное наименование организации", Истина);
	Результат.Добавить("RQ_COMPANY_FULL_NAME"	, "Сокращенное наименование организации", Истина);
	Результат.Добавить("RQ_COMPANY_NAME"		, "Полное наименование организации", Истина);
	
	Результат.Добавить("RQ_COMPANY_REG_DATE"	, "Дата регистрации компании");
	
	
	Результат.Добавить("RQ_NAME"			, "Полное ФИО", Истина);
	Результат.Добавить("RQ_FIRST_NAME"		, "Имя", Истина);
	Результат.Добавить("RQ_SECOND_NAME"		, "Отчество", Истина);
	Результат.Добавить("RQ_LAST_NAME"		, "Фамилия", Истина);

	Результат.Добавить("RQ_IDENT_DOC"			, "Документ св. о гос. регистрации");
	Результат.Добавить("RQ_IDENT_DOC_SER"		, "Серия св. о гос. регистрации");
	Результат.Добавить("RQ_IDENT_DOC_NUM"		, "Номер св. о гос. регистрации");
	Результат.Добавить("RQ_IDENT_DOC_DATE"		, "Дата св. о гос. регистрации");
	Результат.Добавить("RQ_RESIDENCE_COUNTRY"	, "Страна", Истина);
	
	Результат.Добавить("RQ_CONTACT"		, "Контактное лицо");
	
	Результат.Добавить("RQ_DIRECTOR"	, "Директор");
	Результат.Добавить("RQ_ACCOUNTANT"	, "Бухгалтер");
	
	Результат.Добавить("RQ_INN"		, "ИНН", Истина);
	Результат.Добавить("RQ_IIN"		, "ИИН");
	Результат.Добавить("RQ_OGRN"	, "ОГРН", Истина);
	Результат.Добавить("RQ_BIN"		, "БИН");
	Результат.Добавить("RQ_IFNS"	, "ИФНС");
	Результат.Добавить("RQ_KPP"		, "КПП", Истина);
	Результат.Добавить("RQ_OKVED"	, "ОКВЕД");
	Результат.Добавить("RQ_KBE"		, "КБЕ");
	Результат.Добавить("RQ_DRFO"	, "ДРФО");
	Результат.Добавить("RQ_EDRPOU"	, "ЕДРОУ");
	Результат.Добавить("RQ_OKPO"	, "ОКПО", Истина);
	Результат.Добавить("RQ_OKTMO"	, "ОКТМО");
	Результат.Добавить("RQ_OGRNIP"	, "ОГРНИП", Истина);
	Результат.Добавить("RQ_USRLE"	, "ЕГРЮЛ");
	
	Результат.Добавить("RQ_EMAIL"	, "Почта");
	Результат.Добавить("RQ_PHONE"	, "Телефон");
	
	Результат.Добавить("RQ_FAX"		, "Факс");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляБанкСчетовПоУмолчанию()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("NAME"			, "Наименование элемента справочника", Истина);
	Результат.Добавить("ENTITY_ID"		, "Идентификатор владельца", Истина);
	Результат.Добавить("ENTITY_TYPE_ID"	, "Тип владельца банк. счетов", Истина);
	
	Результат.Добавить("ACTIVE"				, "Доступность", Истина);
	Результат.Добавить("ORIGINATOR_ID"		, "Идентификатор источника данных", Истина);
	Результат.Добавить("XML_ID"				, "Идентификатор элемента в источнике данных", Истина);
	
	Результат.Добавить("RQ_BANK_NAME"			, "Наименование банка", Истина);
	Результат.Добавить("RQ_BANK_ADDR"			, "Адрес банка", Истина);
	Результат.Добавить("RQ_BANK_ROUTE_NUM"		, "");
	Результат.Добавить("RQ_COR_ACC_NUM"			, "Корр счет банка", Истина);
	Результат.Добавить("RQ_BIK"					, "Бик банка", Истина);
	
	Результат.Добавить("RQ_ACC_NUM"				, "Номер счета", Истина);
	Результат.Добавить("RQ_SWIFT"				, "СВИФТ банка", Истина);
	Результат.Добавить("RQ_ACC_CURRENCY"		, "Символьный код валюты", Истина);
	
	Результат.Добавить("COUNTRY_ID"				, "Страна");
	Результат.Добавить("RQ_BIC"					, "");
	Результат.Добавить("RQ_MFO"					, "");
	Результат.Добавить("RQ_IIK"					, "");
	Результат.Добавить("RQ_IBAN"				, "");
	Результат.Добавить("COMMENTS"				, "");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляТоваровПоУмолчанию()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("XML_ID"				, "Внешний код товара", Истина);
	
	Результат.Добавить("ACTIVE"				, "Признак активности товара"	, Истина);
	Результат.Добавить("NAME"				, "Название товара", Истина);
	Результат.Добавить("DESCRIPTION"		, "Описание товара", Истина);
	
	Результат.Добавить("SECTION_ID"			, "Идентификатор раздела"		, Истина);
	Результат.Добавить("MEASURE"			, "Единица измерения товара"	, Истина);
	Результат.Добавить("VAT_ID"				, "Идентификатор ставки НДС"	, Истина);
	
	Результат.Добавить("CREATED_BY"			, "Кем создан товар");
	Результат.Добавить("CURRENCY_ID"		, "Символьный код валюты"		, Истина);
	Результат.Добавить("DESCRIPTION_TYPE"	, "Тип описания");
	Результат.Добавить("DATE_CREATE"		, "Дата создания товара");
	Результат.Добавить("MODIFIED_BY"		, "Кем изменён товар");
	
	Результат.Добавить("PRICE"				, "Цена товара", Истина);
	Результат.Добавить("SORT"				, "Сортировка");
	Результат.Добавить("TIMESTAMP_X"		, "Дата изменения товара");
	Результат.Добавить("VAT_INCLUDED"		, "НДС включён в цену", Истина);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляТоваров2ПоУмолчанию()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("active"				, "Признак активности товара"	, Истина);
	Результат.Добавить("available"			, "Признак доступности товара"	, Истина);
	Результат.Добавить("xmlId"				, "Внешний код товара"			, Истина);
	Результат.Добавить("iblockSectionId"	, "Идентификатор раздела"		, Истина);
	Результат.Добавить("name"				, "Наименование товара"			, Истина);
	Результат.Добавить("measure"			, "Единица измерения товара"	, Истина);
	
	Результат.Добавить("vatId"				, "Идентификатор ставки НДС"	, Истина);
	Результат.Добавить("vatIncluded"		, "НДС включён в цену"			, Истина);
	
	Результат.Добавить("weight"				, "Вес товара"					, Истина);
	
	Результат.Добавить("width"				, "Ширина товара"				, Истина);
	Результат.Добавить("length"				, "Длина товара"				, Истина);
	Результат.Добавить("height"				, "Высота товара"				, Истина);
	
	Результат.Добавить("previewTextType"	, "Тип текста описания анонса"		, Истина);
	Результат.Добавить("detailTextType"		, "Тип текста детального описания"	, Истина);
	
	Результат.Добавить("previewText"		, "Описание для анонса"			, Истина);
	Результат.Добавить("detailText"			, "Детальное описание"			, Истина);   
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляПредложенийПоУмолчанию()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("active"				, "Признак активности предложения"	, Истина);
	Результат.Добавить("available"			, "Признак доступности предложения"	, Истина);
	Результат.Добавить("xmlId"				, "Внешний код предложения"			, Истина);
	Результат.Добавить("name"				, "Наименование предложения"		, Истина);    
	Результат.Добавить("shortName"			, "Краткое наименование предложения", Истина);
	Результат.Добавить("measure"			, "Единица измерения предложения", Истина);
	
	Результат.Добавить("vatId"				, "Идентификатор ставки НДС"	, Истина);
	Результат.Добавить("vatIncluded"		, "НДС включён в цену"			, Истина);
	
	Результат.Добавить("weight"				, "Вес предложения"				, Истина);
	
	Результат.Добавить("width"				, "Ширина предложения"			, Истина);
	Результат.Добавить("length"				, "Длина предложения"			, Истина);
	Результат.Добавить("height"				, "Высота предложения"			, Истина);
	
	Результат.Добавить("previewTextType"	, "Тип текста описания анонса"		, Истина);
	Результат.Добавить("detailTextType"		, "Тип текста детального описания"	, Истина);
	
	Результат.Добавить("previewText"		, "Описание для анонса"			, Истина);
	Результат.Добавить("detailText"			, "Детальное описание"			, Истина);   
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляСчетовПоУмолчанию()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("ORIGINATOR_ID"		, "Идентификатор источника данных", Истина);
	Результат.Добавить("XML_ID"				, "Идентификатор элемента в источнике данных", Истина);
	Результат.Добавить("ACCOUNT_NUMBER"		, "Номер", Истина);
	Результат.Добавить("ORDER_TOPIC"		, "Тема", Истина);
	Результат.Добавить("STATUS_ID"			, "Идентификатор статуса", Истина);
	
	
	Результат.Добавить("COMMENTS"			, "Комментарий", Истина);
	Результат.Добавить("USER_DESCRIPTION"	, "Пользовательский комментарий", Истина);
	
	Результат.Добавить("CURRENCY"			, "Символьный код валюты", Истина);
	Результат.Добавить("PRICE"				, "Сумма", Истина);
	Результат.Добавить("DATE_BILL"			, "Дата выставления", Истина);
	
	
	Результат.Добавить("PERSON_TYPE_ID"		, "Идентификатор типа плательщика", Истина);
	Результат.Добавить("UF_COMPANY_ID"		, "Идентификатор компании", Истина);
	Результат.Добавить("UF_CONTACT_ID"		, "Идентификатор контакта", Истина);
	Результат.Добавить("PAY_SYSTEM_ID"		, "Идентификатор печатной формы", Истина);
	
	Результат.Добавить("RESPONSIBLE_ID"		, "Ответственный", Истина);
	Результат.Добавить("UF_MYCOMPANY_ID"	, "Идентификатор своей компании", Истина);
	Результат.Добавить("UF_DEAL_ID"			, "Идентификатор связанной Проекты", Истина);

	
	Результат.Добавить("DATE_MARKED"		, "Дата отклонения");
	Результат.Добавить("DATE_PAY_BEFORE"	, "Срок оплаты");
	
	
	Результат.Добавить("PAY_VOUCHER_DATE"	, "Дата оплаты");
	Результат.Добавить("PAY_VOUCHER_NUM"	, "Номер документа оплаты");
	Результат.Добавить("PAYED"				, "Признак оплаченности");
	Результат.Добавить("REASON_MARKED"		, "Комментарий статуса");
	
	Результат.Добавить("PR_LOCATION"		, "Идентификатор местоположения");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляСчетов2ПоУмолчанию()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("xmlId"			, "Идентификатор элемента в источнике данных", Истина);
	Результат.Добавить("title"			, "Название", Истина);
	Результат.Добавить("accountNumber"	, "Номер", Истина);
	Результат.Добавить("begindate"		, "Дата выставления", Истина);
	
	Результат.Добавить("stageId"		, "Идентификатор статуса", Истина);
	Результат.Добавить("companyId"		, "Идентификатор компании", Истина);
	Результат.Добавить("contactId"		, "Идентификатор контакта", Истина);
	Результат.Добавить("mycompanyId"	, "Идентификатор своей компании", Истина);
	Результат.Добавить("parentId2"		, "Идентификатор связанной Проекты", Истина);
	
	Результат.Добавить("assignedById"	, "Ответственный", Истина);
	
	Результат.Добавить("comments"		, "Комментарий", Истина);
	
	Результат.Добавить("currencyId"		, "Символьный код валюты", Истина);
	Результат.Добавить("opportunity"	, "Сумма", Истина);
	Результат.Добавить("taxValue"		, "Сумма налога", Истина);
	
	Результат.Добавить("utmSource"		, "Yandex-Direct, Google-Adwords и другие", Истина);
	Результат.Добавить("utmCampaign"	, "Метка компаний", Истина);
	
	Результат.Добавить("closedate"			, "Срок оплаты");
	Результат.Добавить("opened"				, "Доступно для всех");
	Результат.Добавить("isManualOpportunity", "Режим расчёта суммы");
	Результат.Добавить("parentId7"			, "Предложение");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляСделокПоУмолчанию()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("ORIGIN_ID"				, "Идентификатор элемента в источнике данных", Истина);
	Результат.Добавить("ORIGINATOR_ID"			, "Идентификатор источника данных", Истина);
	Результат.Добавить("BEGINDATE"				, "Дата начала", Истина);
	
	Результат.Добавить("ID"						, "Номер Проекты", Истина);
	Результат.Добавить("CLOSED"					, "Завершена");
	Результат.Добавить("CLOSEDATE"				, "Дата завершения", Истина);
	Результат.Добавить("COMPANY_ID"				, "Идентификатор привязанной компании", Истина);
	Результат.Добавить("CONTACT_ID"				, "Идентификатор привязанного контакта", Истина);
	Результат.Добавить("REQUISITE_ID"			, "Идентификатор привязанного реквизита", Истина);
	Результат.Добавить("CATEGORY_ID"			, "Идентификатор направления", Истина);
	Результат.Добавить("STAGE_ID"				, "Идентификатор стадии", Истина);
	Результат.Добавить("ASSIGNED_BY_ID"			, "Ответственный", Истина);
	Результат.Добавить("COMMENTS"				, "Комментарий", Истина);
	Результат.Добавить("TITLE"					, "Название", Истина);
	Результат.Добавить("CURRENCY_ID"			, "Символьный код валюты", Истина);
	Результат.Добавить("OPPORTUNITY"			, "Сумма", Истина);
	Результат.Добавить("TAX_VALUE"				, "Сумма налога", Истина);
	
	Результат.Добавить("UTM_CONTENT"			, "Например, для контекстных объявлений");
	Результат.Добавить("UTM_TERM"				, "Например, ключевые слова контекстной рекламы");
	Результат.Добавить("UTM_MEDIUM"				, "CPC (объявления), CPM (баннеры)");
	Результат.Добавить("UTM_SOURCE"				, "Yandex-Direct, Google-Adwords и другие", Истина);
	Результат.Добавить("UTM_CAMPAIGN"			, "Метка компаний", Истина);
	
	Результат.Добавить("ADDITIONAL_INFO"		, "Дополнительная информация");
	Результат.Добавить("IS_NEW"					, "Флаг новой сделки (т. е. Проект в первой стадии)");
	Результат.Добавить("LEAD_ID"				, "Идентификатор привязанного лида");
	Результат.Добавить("OPENED"					, "Доступен для всех");
	Результат.Добавить("REQUISITE_ID"			, "Идентификатор привязанного реквизита", Истина);
	Результат.Добавить("SOURCE_ID"				, "Источник Проекты");
	Результат.Добавить("SOURCE_DESCRIPTION"		, "Дополнительно об источнике");
	Результат.Добавить("TYPE_ID"				, "Тип Проекты");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляЗаказовПоУмолчанию()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("id"					, "Идентификатор", Истина);
	Результат.Добавить("xmlId"				, "Внешний идентификатор", Истина);
	Результат.Добавить("datePayBefore"		, "Дата, до которой необходимо оплатить счет", Истина);
	Результат.Добавить("statusId"			, "Идентификатор статуса", Истина);
	Результат.Добавить("responsibleId"		, "ID ответственного", Истина);
	Результат.Добавить("deliveryDocNum"		, "Номер документа отгрузки", Истина);
	Результат.Добавить("dateBill"			, "Дата выставления", Истина);
	Результат.Добавить("reasonCanceled"		, "Причина отмены", Истина);
	Результат.Добавить("orderTopic"			, "Тема заказа", Истина);
	Результат.Добавить("userDescription"	, "Пользовательское описание", Истина);
	Результат.Добавить("comments"			, "Комментарий", Истина);
	Результат.Добавить("canceled"			, "Отменен", Истина);
	
	Результат.Добавить("lid"				, "Идентификатор сайта");
	Результат.Добавить("personTypeId"		, "Идентификатор типа плательщика");
	Результат.Добавить("marked"				, "Промаркирован ли заказ");
	Результат.Добавить("reasonMarked"		, "Причина, по которой заказ был промаркирован");
	Результат.Добавить("price"				, "Цена");
	Результат.Добавить("discountValue"		, "Значение скидки");
	Результат.Добавить("additionalInfo"		, "Дополнительная информация");
	Результат.Добавить("companyId"			, "ID компании, привязанной к заказу");
	Результат.Добавить("recountFlag"		, "Флаг пересчета (Y/N)");
	Результат.Добавить("affiliateId"		, "Идентификатор аффилиата");
	Результат.Добавить("updated1c"			, "Обновлен ли через 1С");
	Результат.Добавить("id1c"				, "Идентификатор в 1С");
	Результат.Добавить("version1c"			, "Версия в 1С");
	
	Результат.Добавить("externalOrder"		, "Флаг Y/N: заказ из внешней системы или нет");
	Результат.Добавить("userId"				, "Идентификатор клиента");
	Результат.Добавить("currency"			, "Символьный код валюты");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляОтгрузокПоУмолчанию()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("id"						, "Идентификатор отгрузки", Истина);
	Результат.Добавить("orderId"				, "Идентификатор заказа", Истина);
	Результат.Добавить("xmlId"					, "Внешний идентификатор", Истина);
	
	Результат.Добавить("responsibleId"			, "ID пользователя, ответственного за отгрузку", Истина);
	Результат.Добавить("dateResponsibleId"		, "Дата назначения ответственного", Истина);
	Результат.Добавить("trackingStatus"			, "Статус отправления", Истина);
	Результат.Добавить("trackingDescription"	, "Описание статуса отправления", Истина);
	Результат.Добавить("trackingLastCheck"		, "Дата последней проверки статуса отправления", Истина);
	Результат.Добавить("allowDelivery"			, "Флаг разрешения доставки: Y/N", Истина);
	Результат.Добавить("dateAllowDelivery"		, "Дата разрешения доставки", Истина);
	Результат.Добавить("currency"				, "Символьный код валюты", Истина);
	Результат.Добавить("comments"				, "Комментарий", Истина);
	Результат.Добавить("customPriceDelivery"	, "Флаг, установлена ли цена вручную", Истина);
	Результат.Добавить("deliveryDocNum"			, "Номер документа отгрузки", Истина);
	Результат.Добавить("deliveryDocDate"		, "Дата документа отгрузки", Истина);
	Результат.Добавить("deducted"				, "Флаг отгрузки: Y/N", Истина);
	Результат.Добавить("dateDeducted"			, "Дата отгрузки", Истина);
	Результат.Добавить("deliveryId"				, "ID службы доставки", Истина);
	Результат.Добавить("deliveryName"			, "Название службы доставки", Истина);
	Результат.Добавить("trackingNumber"			, "Трек-номер", Истина);
	Результат.Добавить("statusId"				, "Статус отгрузки", Истина);
	Результат.Добавить("basePriceDelivery"		, "Базовая стоимость доставки", Истина);
	Результат.Добавить("priceDelivery"			, "Стоимость доставки", Истина);
	Результат.Добавить("discountPrice"			, "Сумма итоговой скидки/наценки для отгрузки", Истина);
	
	Результат.Добавить("reasonUndoDeducted"	, "Причина отмены отгрузки");
	Результат.Добавить("canceled"			, "Отменена ли отгрузка");
	Результат.Добавить("dateCanceled"		, "Дата отмены отгрузки");
	Результат.Добавить("marked"				, "Промаркирована ли отгрузка");
	Результат.Добавить("reasonMarked"		, "Причина маркировки");
	Результат.Добавить("system"				, "Флаг, устанавливающий, системная это отгрузка или нет");
	Результат.Добавить("companyId"			, "ID компании, занимающейся отгрузкой");
	Результат.Добавить("updated1c"			, "Обновлена ли отгрузка через 1С");
	Результат.Добавить("id1c"				, "ID отгрузки в 1С");
	Результат.Добавить("version1c"			, "Версия документа отгрузки от 1С");
	Результат.Добавить("externalDelivery"	, "Флаг Y/N: доставка из внешней системы или нет");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляОплатПоУмолчанию()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("id"					, "Идентификатор оплаты", Истина);
	Результат.Добавить("orderId"			, "Идентификатор заказа", Истина);
	Результат.Добавить("xmlId"				, "Внешний идентификатор", Истина);
	Результат.Добавить("dateBill"			, "Дата счета на оплату", Истина);
	Результат.Добавить("accountNumber"		, "Номер счета на оплаты", Истина);
	Результат.Добавить("paid"				, "Флаг оплаченности: Y или N", Истина);
	Результат.Добавить("sum"				, "Сумма оплаты", Истина);
	Результат.Добавить("currency"			, "Символьный код валюты", Истина);
	Результат.Добавить("comments"			, "Комментарий", Истина);
	Результат.Добавить("payVoucherNum"		, "Номер платежного документа", Истина);
	Результат.Добавить("payVoucherDate"		, "Дата платежного документа", Истина);
	Результат.Добавить("responsibleId"		, "ID пользователя, ответственного за оплату", Истина);
	Результат.Добавить("payReturnDate"		, "Дата документа возврата", Истина);
	Результат.Добавить("dateResponsibleId"	, "Дата назначения ответственного", Истина);
	Результат.Добавить("datePayBefore"		, "Дата, до которой необходимо оплатить счет (в магазине не используется)", Истина);
	Результат.Добавить("payReturnComment"	, "Комментарий к возврату", Истина);
	Результат.Добавить("paySystemId"		, "ID платежной системы", Истина);
	Результат.Добавить("paySystemName"		, "Название платежной системы", Истина);
	Результат.Добавить("datePaid"			, "Дата оплаты", Истина);
	
	Результат.Добавить("empPaidId"			, "Кто оплатил");
	Результат.Добавить("psStatus"			, "Данные, пришедшие от платежной системы: статус транзакции");
	
	Результат.Добавить("psStatusCode"		, "Данные, пришедшие от платежной системы: код транзакции");
	Результат.Добавить("psInvoiceId"		, "Идентификатор оплаты в платежной системе");
	Результат.Добавить("psStatusDescription", "Данные, пришедшие от платежной системы: описание транзакции");
	Результат.Добавить("psStatusMessage"	, "Данные, пришедшие от платежной системы: сообщение");
	Результат.Добавить("psSum"				, "Данные, пришедшие от платежной системы: сумма транзакции");
	Результат.Добавить("psCurrency"			, "Данные, пришедшие от платежной системы: валюта");
	Результат.Добавить("psResponseDate"		, "Данные, пришедшие от платежной системы: дата ответа от платежной системы");
	Результат.Добавить("priceCod"			, "Стоимость оплаты при доставке (используется, например, для наложенного платежа)");
	Результат.Добавить("companyId"			, "ID компании, которая будет принимать оплату");
	Результат.Добавить("payReturnNum"		, "Номер документа возврата");
	Результат.Добавить("isReturn"			, "Выполнялся ли возврат");
	Результат.Добавить("marked"				, "Промаркирована ли оплата");
	Результат.Добавить("reasonMarked"		, "Причина маркировки");
	Результат.Добавить("updated1c"			, "Обновлена ли через 1С");
	Результат.Добавить("id1c"				, "Идентификатор в 1С");
	Результат.Добавить("version1c"			, "Версия документа оплаты от 1С");
	Результат.Добавить("externalPayment"	, "Флаг Y/N: внешняя оплата или нет");
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьСоответствияТабЧастейДляВыгрузкиПоУмолчанию(Сущности) 
	
	Результат = Новый Массив;
	
	АктуальныеПоля = Новый СписокЗначений;

	Для каждого ТекЭлемент Из Сущности Цикл
		
		Если ТекЭлемент.ВидСущности = "Счет" Тогда
			АктуальныеПоля = ПолучитьПоляТЧСчетовПоУмолчанию();	 
		ИначеЕсли ТекЭлемент.ВидСущности = "Счет2" Тогда
			АктуальныеПоля = ПолучитьПоляТЧСчетов2ПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Проект" Тогда
			АктуальныеПоля = ПолучитьПоляТЧСделокПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Заказ" Тогда
			АктуальныеПоля = ПолучитьПоляТЧЗаказовПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Оплата" И ТекЭлемент.ИмяОбъекта = "ПриходныйКассовыйОрдер" Тогда
			АктуальныеПоля = ПолучитьПоляТЧОплатПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Оплата" И ТекЭлемент.ИмяОбъекта = "ПоступлениеБезналичныхДенежныхСредств" Тогда
			АктуальныеПоля = ПолучитьПоляТЧОплатПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Оплата" И ТекЭлемент.ИмяОбъекта = "ОперацияПоПлатежнойКарте" Тогда
			АктуальныеПоля = ПолучитьПоляТЧОплатПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Отгрузка" Тогда
			АктуальныеПоля = ПолучитьПоляТЧОтгрузокПоУмолчанию();	
		КонецЕсли;
		
		Для каждого ТекПоле Из АктуальныеПоля Цикл 
			
			НоваяЗапись = ПолучитьСтруктуруСоответствийТабЧастейДляВыгрузки();
			
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекЭлемент);
			
			НоваяЗапись.КлючЗапроса = ТекПоле.Значение;	
			НоваяЗапись.Описание 	= ТекПоле.Представление;	
			
			Если ТекПоле.Пометка Тогда
				НоваяЗапись.ИсточникДанных 	= "Предопределенный алгоритм";	
				НоваяЗапись.Значение 		= ТекПоле.Представление;	
			КонецЕсли;
			
			Результат.Добавить(НоваяЗапись);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруСоответствийТабЧастейДляВыгрузки() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВидСущности"		, "");
	Результат.Вставить("ВидОбъекта"			, "");
	Результат.Вставить("ИмяОбъекта"			, "");
	Результат.Вставить("КлючЗапроса"		, "");
	Результат.Вставить("ИсточникДанных"		, "");
	Результат.Вставить("Значение"			, "");
	Результат.Вставить("Описание"			, "");
	Результат.Вставить("Идентификатор"		, "");
	Результат.Вставить("ИмяТабЧасти"		, "");
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьПоляТЧСчетовПоУмолчанию()

	Результат = Новый СписокЗначений;
	
	Результат.Добавить("ID"						, "Идентификатор позиции товара", Истина);
	Результат.Добавить("PRODUCT_ID"				, "Идентификатор товара в каталоге", Истина);
	Результат.Добавить("PRODUCT_XML_ID"			, "Внешний код товарной позиции", Истина);
	Результат.Добавить("PRODUCT_NAME"			, "Наименование товарной позиции", Истина);
	
	Результат.Добавить("MEASURE_CODE"			, "Код единицы измерения", Истина);
	Результат.Добавить("QUANTITY"				, "Количество", Истина);
	Результат.Добавить("PRICE"					, "Цена", Истина);
	
	Результат.Добавить("DISCOUNT_PRICE"			, "Скидка на единицу товара", Истина);
	Результат.Добавить("VAT_RATE"				, "Ставка НДС/100", Истина);
	Результат.Добавить("VAT_INCLUDED"			, "НДС включён в цену ('Y' или 'N')", Истина);
	Результат.Добавить("MEASURE_NAME"			, "Условное обозначение единицы измерения");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляТЧСчетов2ПоУмолчанию()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("id"						, "Идентификатор позиции товара", Истина);
	Результат.Добавить("productId"				, "Идентификатор товара в каталоге", Истина);
	Результат.Добавить("productName"			, "Наименование товарной позиции", Истина);
	Результат.Добавить("price"					, "Цена", Истина);
	Результат.Добавить("measureCode"			, "Код единицы измерения", Истина);
	Результат.Добавить("measureName"			, "Условное обозначение единицы измерения", Истина);
	Результат.Добавить("quantity"				, "Количество", Истина);
	Результат.Добавить("discountTypeId"			, "Тип скидки", Истина);
	Результат.Добавить("discountRate"			, "Процент скидки", Истина);
	Результат.Добавить("discountSum"			, "Сумма скидки", Истина);
	Результат.Добавить("taxRate"				, "Ставка НДС", Истина);
	Результат.Добавить("taxIncluded"			, "НДС включён в цену ('Y' или 'N')", Истина);
	Результат.Добавить("customized"				, "Признак кастомной цены", Истина);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляТЧСделокПоУмолчанию()

	Результат = Новый СписокЗначений;
	
	Результат.Добавить("ID"						, "Идентификатор позиции товара", Истина);
	Результат.Добавить("PRODUCT_ID"				, "Идентификатор товара в каталоге", Истина);
	Результат.Добавить("PRODUCT_DESCRIPTION"	, "Описание товарной позиции", Истина);
	Результат.Добавить("PRODUCT_NAME"			, "Наименование товарной позиции", Истина);
	Результат.Добавить("PRICE"					, "Цена", Истина);
	Результат.Добавить("PRICE_NETTO"			, "Цена без налога и без скидки", Истина);
	Результат.Добавить("PRICE_EXCLUSIVE"		, "Цена без налога, но со скидкой", Истина);
	Результат.Добавить("PRICE_BRUTTO"			, "Цена с налогом, но без скидки", Истина);
	Результат.Добавить("MEASURE_CODE"			, "Код единицы измерения", Истина);
	Результат.Добавить("MEASURE_NAME"			, "Условное обозначение единицы измерения", Истина);
	Результат.Добавить("QUANTITY"				, "Количество", Истина);
	Результат.Добавить("DISCOUNT_TYPE_ID"		, "Тип скидки", Истина);
	Результат.Добавить("DISCOUNT_RATE"			, "Процент скидки", Истина);
	Результат.Добавить("DISCOUNT_SUM"			, "Сумма скидки", Истина);
	Результат.Добавить("TAX_RATE"				, "Ставка НДС", Истина);
	Результат.Добавить("TAX_INCLUDED"			, "НДС включён в цену ('Y' или 'N')", Истина);
	Результат.Добавить("CUSTOMIZED"				, "Признак кастомной цены", Истина);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляТЧЗаказовПоУмолчанию()

	Результат = Новый СписокЗначений;
	
	Результат.Добавить("id"					, "Идентификатор позиции товара", Истина);
	Результат.Добавить("xmlId"				, "Внешний идентификатор позиции товара", Истина);
	Результат.Добавить("productXmlId"		, "Внешний код товарной позиции", Истина);
	Результат.Добавить("productId"			, "Идентификатор товара в каталоге", Истина);
	Результат.Добавить("name"				, "Наименование товарной позиции", Истина);
	Результат.Добавить("measureCode"		, "Код единицы измерения", Истина);
	Результат.Добавить("measureName"		, "Условное обозначение единицы измерения", Истина);
	Результат.Добавить("quantity"			, "Количество", Истина);
	Результат.Добавить("basePrice"			, "Цена товара без учета скидок и наценок", Истина);
	Результат.Добавить("price"				, "Цена товара с учетом скидок и наценок", Истина);
	Результат.Добавить("vatRate"			, "Ставка НДС/100", Истина);
	Результат.Добавить("vatIncluded"		, "НДС включён в цену ('Y' или 'N')", Истина);
	Результат.Добавить("currency"			, "Символьный код валюты", Истина);
	Результат.Добавить("customPrice"		, "Признак кастомной цены", Истина);
	
	Результат.Добавить("lid"				, "Сайт, на котором сделана покупка");
	Результат.Добавить("productPriceId"		, "Идентификатор цены товара");
	Результат.Добавить("priceTypeId"		, "Идентификатор типа цены товара");
	Результат.Добавить("weight"				, "Вес");
	Результат.Добавить("discountPrice"		, "Скидка");
	Результат.Добавить("discountName"		, "Название скидки");
	Результат.Добавить("discountValue"		, "Значение скидки");
	Результат.Добавить("discountCoupon"		, "Купон на скидку");
	Результат.Добавить("dimensions"			, "Размеры");
	Результат.Добавить("type"				, "Тип товара");
	Результат.Добавить("recommendation"		, "Рекомендация");
	Результат.Добавить("sort"				, "Сортировка");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляТЧОплатПоУмолчанию()

	Результат = Новый СписокЗначений;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоляТЧОтгрузокПоУмолчанию()

	Результат = Новый СписокЗначений;
	Результат.Добавить("basketId"			, "Идентификатор позиции товаров заказе", Истина);
	Результат.Добавить("id"					, "Идентификатор позиции товара в отгрузке", Истина);
	Результат.Добавить("xmlId"				, "Внешний идентификатор позиции товара", Истина);
	Результат.Добавить("quantity"			, "Количество", Истина);
	Результат.Добавить("reservedQuantity"	, "Зарезервировано", Истина);
	
	Возврат Результат;
	
КонецФункции



Функция ПолучитьМассивПредопределенныхАлгоритмовВыгрузки(ВидСущности) Экспорт
	
	Результат = Новый Массив;
	
	ОписаниеПолей = Новый СписокЗначений;
	
	Если ВидСущности = "Компания" Тогда
		ОписаниеПолей = ПолучитьПоляКомпанийПоУмолчанию();
	ИначеЕсли ВидСущности = "Контакт" Тогда
		ОписаниеПолей = ПолучитьПоляКонтактовПоУмолчанию();
	ИначеЕсли ВидСущности = "Реквизит" Тогда
		ОписаниеПолей = ПолучитьПоляРеквизитовПоУмолчанию();
	ИначеЕсли ВидСущности = "Банковский счет" Тогда
		ОписаниеПолей = ПолучитьПоляБанкСчетовПоУмолчанию();
		
	ИначеЕсли ВидСущности = "Товар" Тогда
		ОписаниеПолей = ПолучитьПоляТоваровПоУмолчанию();
		
	ИначеЕсли ВидСущности = "Товар2" Тогда
		ОписаниеПолей = ПолучитьПоляТоваров2ПоУмолчанию();
		
	ИначеЕсли ВидСущности = "Предложение" Тогда
		ОписаниеПолей = ПолучитьПоляПредложенийПоУмолчанию();
		
	ИначеЕсли ВидСущности = "Счет" Тогда
		ОписаниеПолей = ПолучитьПоляСчетовПоУмолчанию();
	ИначеЕсли ВидСущности = "Счет2" Тогда
		ОписаниеПолей = ПолучитьПоляСчетов2ПоУмолчанию();
	ИначеЕсли ВидСущности = "Проект" Тогда
		ОписаниеПолей = ПолучитьПоляСделокПоУмолчанию();
		
	ИначеЕсли ВидСущности = "Заказ" Тогда
		ОписаниеПолей = ПолучитьПоляЗаказовПоУмолчанию();
	ИначеЕсли ВидСущности = "Оплата" Тогда
		ОписаниеПолей = ПолучитьПоляОплатПоУмолчанию();
	ИначеЕсли ВидСущности = "Отгрузка" Тогда
		ОписаниеПолей = ПолучитьПоляОтгрузокПоУмолчанию();
	КонецЕсли;
	
	Для каждого ТекЭлемент Из ОписаниеПолей Цикл
		
		Если ЗначениеЗаполнено(ТекЭлемент.Представление) И ТекЭлемент.Пометка Тогда
			Результат.Добавить(ТекЭлемент.Представление);	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивПредопределенныхАлгоритмовВыгрузкиТЧ(ВидСущности) Экспорт
	
	Результат = Новый Массив;
	
	ОписаниеПолей = Новый СписокЗначений;
	
	Если ВидСущности = "Счет" Тогда
		ОписаниеПолей = ПолучитьПоляТЧСчетовПоУмолчанию();
	ИначеЕсли ВидСущности = "Счет2" Тогда
		ОписаниеПолей = ПолучитьПоляТЧСчетов2ПоУмолчанию();
	ИначеЕсли ВидСущности = "Проект" Тогда
		ОписаниеПолей = ПолучитьПоляТЧСделокПоУмолчанию();
	ИначеЕсли ВидСущности = "Заказ" Тогда
		ОписаниеПолей = ПолучитьПоляТЧЗаказовПоУмолчанию();
	ИначеЕсли ВидСущности = "Оплата" Тогда
		ОписаниеПолей = ПолучитьПоляТЧОплатПоУмолчанию();
	ИначеЕсли ВидСущности = "Отгрузка" Тогда
		ОписаниеПолей = ПолучитьПоляТЧОтгрузокПоУмолчанию();
	КонецЕсли;
	
	Для каждого ТекЭлемент Из ОписаниеПолей Цикл
		
		Если ЗначениеЗаполнено(ТекЭлемент.Представление) И ТекЭлемент.Пометка Тогда
			Результат.Добавить(ТекЭлемент.Представление);	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 


#Область ЗаполнениеТаблицЗагрузки

Функция ПолучитьСоответствияЗагрузкиПоУмолчанию(Сущности) Экспорт 
	
	Результат = Новый Массив;
	
	АктуальныеПоля = Новый СписокЗначений;
	
	Для каждого ТекЭлемент Из Сущности Цикл
		
		Если ТекЭлемент.ВидСущности = "Компания" И ТекЭлемент.ИмяОбъекта = "Партнеры" Тогда
			АктуальныеПоля = ПолучитьРеквизитыПартнеровДляКомпанийПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Компания" И ТекЭлемент.ИмяОбъекта = "Организации" Тогда
			АктуальныеПоля = ПолучитьРеквизитыОрганизацийДляКомпанийПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Контакт" И ТекЭлемент.ИмяОбъекта = "Партнеры" Тогда
			АктуальныеПоля = ПолучитьРеквизитыПартнеровДляКонтактовПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Контакт" И ТекЭлемент.ИмяОбъекта = "КонтактныеЛицаПартнеров" Тогда
			АктуальныеПоля = ПолучитьРеквизитыКонтактныхЛицДляКонтактовПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Реквизит" И ТекЭлемент.ИмяОбъекта = "Контрагенты" Тогда
			АктуальныеПоля = ПолучитьРеквизитыКонтрагентовДляРеквизитовПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Реквизит" И ТекЭлемент.ИмяОбъекта = "Организации" Тогда
			АктуальныеПоля = ПолучитьРеквизитыОрганизацийДляРеквизитовПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Банковский счет" И ТекЭлемент.ИмяОбъекта = "БанковскиеСчетаКонтрагентов" Тогда
			АктуальныеПоля = ПолучитьРеквизитыБанкСчетовДляБанкСчетовПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Банковский счет" И ТекЭлемент.ИмяОбъекта = "БанковскиеСчетаОрганизаций" Тогда
			АктуальныеПоля = ПолучитьРеквизитыБанкСчетовДляБанкСчетовПоУмолчанию();	
		ИначеЕсли (ТекЭлемент.ВидСущности = "Товар" ИЛИ ТекЭлемент.ВидСущности = "Товар2") И ТекЭлемент.ИмяОбъекта = "Номенклатура" Тогда
			АктуальныеПоля = ПолучитьРеквизитыНоменклатурыДляТоваровПоУмолчанию();	 
		ИначеЕсли (ТекЭлемент.ВидСущности = "Предложение") И ТекЭлемент.ИмяОбъекта = "ХарактеристикиНоменклатуры" Тогда   
			АктуальныеПоля = ПолучитьРеквизитыХарактеристикДляПредложенийПоУмолчанию();	   
		ИначеЕсли (ТекЭлемент.ВидСущности = "Счет" ИЛИ ТекЭлемент.ВидСущности = "Счет2") И ТекЭлемент.ИмяОбъекта = "СчетНаОплатуКлиенту" Тогда
			АктуальныеПоля = ПолучитьРеквизитыСчетовДляСчетовПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Проект" И ТекЭлемент.ИмяОбъекта = "ЗаказКлиента" Тогда
			АктуальныеПоля = ПолучитьРеквизитыЗаказовДляСделокПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Заказ" И ТекЭлемент.ИмяОбъекта = "ЗаказКлиента" Тогда
			АктуальныеПоля = ПолучитьРеквизитыЗаказовДляЗаказовПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Оплата" И ТекЭлемент.ИмяОбъекта = "ПриходныйКассовыйОрдер" Тогда
			АктуальныеПоля = ПолучитьРеквизитыОплатДляОплатПоУмолчанию("Y");	
		ИначеЕсли ТекЭлемент.ВидСущности = "Оплата" И ТекЭлемент.ИмяОбъекта = "ПоступлениеБезналичныхДенежныхСредств" Тогда
			АктуальныеПоля = ПолучитьРеквизитыОплатДляОплатПоУмолчанию("N");	
		ИначеЕсли ТекЭлемент.ВидСущности = "Оплата" И ТекЭлемент.ИмяОбъекта = "ОперацияПоПлатежнойКарте" Тогда
			АктуальныеПоля = ПолучитьРеквизитыОплатДляОплатПоУмолчанию("A");	
		ИначеЕсли ТекЭлемент.ВидСущности = "Отгрузка" И ТекЭлемент.ИмяОбъекта = "РеализацияТоваровУслуг" Тогда
			АктуальныеПоля = ПолучитьРеквизитыОтгрузокДляОтгрузокПоУмолчанию();	
		КонецЕсли;
		
		Для каждого ТекПоле Из АктуальныеПоля Цикл 
			
			НоваяЗапись = ПолучитьСтруктуруСоответствийЗагрузки();
			
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекЭлемент);
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекПоле);
			
			Результат.Добавить(НоваяЗапись);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруСоответствийЗагрузки() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВидСущности"		, "");
	Результат.Вставить("ВидОбъекта"			, "");
	Результат.Вставить("ИмяОбъекта"			, "");
	Результат.Вставить("Реквизит1С"			, "");
	Результат.Вставить("ИсточникДанных"		, "");
	Результат.Вставить("Значение"			, "");
	Результат.Вставить("Наименование"		, "");
	Результат.Вставить("ТипРеквизита"		, "");
	Результат.Вставить("Приоритет"			, "");
	Результат.Вставить("СсылкаНаСвойство"	, "");
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьРеквизитыПартнеровДляКомпанийПоУмолчанию()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Наименование"						, "Предопределенный алгоритм"	, "Наименование"						, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПометкаУдаления"					, "Предопределенный алгоритм"	, "Удален на портале"					, "СтандартныеРеквизиты"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("НаименованиеПолное"				, "Предопределенный алгоритм"	, "Публичное наименование компании"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Клиент"							, "Предопределенный алгоритм"	, "Это покупатель"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Поставщик"						, "Предопределенный алгоритм"	, "Это поставщик"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Конкурент"						, "Предопределенный алгоритм"	, "Это конкурент"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПрочиеОтношения"					, "Предопределенный алгоритм"	, "Это прочие отношения"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Комментарий"						, "Ключ JSON"					, "COMMENTS"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ОсновнойМенеджер"					, "Предопределенный алгоритм"	, "Ответственный"));

	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыОрганизацийДляКомпанийПоУмолчанию()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Наименование"						, "Предопределенный алгоритм"	, "Наименование"						, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПометкаУдаления"					, "Предопределенный алгоритм"	, "Удален на портале"					, "СтандартныеРеквизиты"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("НаименованиеСокращенное"			, "Предопределенный алгоритм"	, "Сокращенное юр. наименование компании"));

	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыПартнеровДляКонтактовПоУмолчанию()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Наименование"						, "Предопределенный алгоритм"	, "Наименование"						, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПометкаУдаления"					, "Предопределенный алгоритм"	, "Удален на портале"					, "СтандартныеРеквизиты"));

	Результат.Добавить(ПолучитьОписаниеРеквизита("НаименованиеПолное"				, "Предопределенный алгоритм"	, "Полное наименование контакта"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Клиент"							, "Предопределенный алгоритм"	, "Это покупатель"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Поставщик"						, "Предопределенный алгоритм"	, "Это поставщик"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Конкурент"						, "Предопределенный алгоритм"	, "Это конкурент"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПрочиеОтношения"					, "Предопределенный алгоритм"	, "Это прочие отношения"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Комментарий"						, "Ключ JSON"					, "COMMENTS"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ОсновнойМенеджер"					, "Предопределенный алгоритм"	, "Ответственный"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ДатаРождения"						, "Предопределенный алгоритм"	, "Дата рождения"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Пол"								, "Предопределенный алгоритм"	, "Пол"));

	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыКонтактныхЛицДляКонтактовПоУмолчанию()

	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Владелец"							, "Предопределенный алгоритм"	, "Владелец контактного лица"			, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Наименование"						, "Предопределенный алгоритм"	, "Наименование"						, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПометкаУдаления"					, "Предопределенный алгоритм"	, "Удален на портале"					, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Комментарий"						, "Ключ JSON"					, "COMMENTS"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Автор"							, "Предопределенный алгоритм"	, "Ответственный"));
	                                                                        	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ДолжностьПоВизитке"				, "Предопределенный алгоритм"	, "Должность"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ДатаРождения"						, "Предопределенный алгоритм"	, "Дата рождения"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Пол"								, "Предопределенный алгоритм"	, "Пол"));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыКонтрагентовДляРеквизитовПоУмолчанию()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПометкаУдаления"					, "Предопределенный алгоритм"	, "Удален на портале"					, "СтандартныеРеквизиты"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Наименование"						, "Предопределенный алгоритм"	, "Наименование полное"					, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("НаименованиеПолное"				, "Предопределенный алгоритм"	, "Наименование"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ЮрФизЛицо"						, "Предопределенный алгоритм"	, "Юр/Физлицо"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ЮридическоеФизическоеЛицо"		, "Предопределенный алгоритм"	, "Юридическое физическое лицо"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ИНН"								, "Предопределенный алгоритм"	, "ИНН"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("КПП"								, "Предопределенный алгоритм"	, "КПП"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("КодПоОКПО"						, "Предопределенный алгоритм"	, "Код по ОКПО"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("РегистрационныйНомер"				, "Предопределенный алгоритм"	, "ОГРН"));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыОрганизацийДляРеквизитовПоУмолчанию()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПометкаУдаления"					, "Предопределенный алгоритм"	, "Удален на портале"					, "СтандартныеРеквизиты"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("НаименованиеПолное"				, "Предопределенный алгоритм"	, "Наименование полное"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ЮрФизЛицо"						, "Предопределенный алгоритм"	, "Юр/Физлицо"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ЮридическоеФизическоеЛицо"		, "Предопределенный алгоритм"	, "Юридическое физическое лицо"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ИНН"								, "Предопределенный алгоритм"	, "ИНН"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("КПП"								, "Предопределенный алгоритм"	, "КПП"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("КодПоОКПО"						, "Предопределенный алгоритм"	, "Код по ОКПО"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ОГРН"								, "Предопределенный алгоритм"	, "ОГРН"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("СвидетельствоСерияНомер"			, "Предопределенный алгоритм"	, "Свидетельство с.н"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СвидетельствоДатаВыдачи"			, "Предопределенный алгоритм"	, "Свидетельство дата выдачи"));

	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыБанкСчетовДляБанкСчетовПоУмолчанию()
	
	Результат = Новый Массив;

	Результат.Добавить(ПолучитьОписаниеРеквизита("Наименование"						, "Предопределенный алгоритм"	, "Наименование"						, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПометкаУдаления"					, "Предопределенный алгоритм"	, "Удален на портале"					, "СтандартныеРеквизиты"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("НомерСчета"						, "Предопределенный алгоритм"	, "Номер счета"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ВалютаДенежныхСредств"			, "Предопределенный алгоритм"	, "Валюта"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Банк"								, "Предопределенный алгоритм"	, "Банк"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("РучноеИзменениеРеквизитовБанка"	, "Предопределенный алгоритм"	, "Ручное изменение реквизитов банка"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СВИФТБанка"						, "Предопределенный алгоритм"	, "СВИФТ банка"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("НаименованиеБанка"				, "Предопределенный алгоритм"	, "Наименование банка"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("АдресБанка"						, "Предопределенный алгоритм"	, "Адрес банка"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("БИКБанка"							, "Предопределенный алгоритм"	, "БИК банка"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("КоррСчетБанка"					, "Предопределенный алгоритм"	, "Корр cчет банка"));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыНоменклатурыДляТоваровПоУмолчанию()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Наименование"						, "Предопределенный алгоритм"	, "Наименование"						, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПометкаУдаления"					, "Предопределенный алгоритм"	, "Удален на портале"					, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Родитель"							, "Предопределенный алгоритм"	, "Группа"								, "СтандартныеРеквизиты"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("НаименованиеПолное"				, "Предопределенный алгоритм"	, "Полное наименование"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Описание"							, "Предопределенный алгоритм"	, "Описание"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Артикул"							, "Предопределенный алгоритм"	, "Артикул"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ВидНоменклатуры"					, "Предопределенный алгоритм"	, "Вид номенклатуры"));
	                                                                             	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ТипНоменклатуры"					, "Предопределенный алгоритм"	, "Тип номенклатуры"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ИспользованиеХарактеристик"		, "Предопределенный алгоритм"	, "Использование характеристик"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ИспользоватьУпаковки"				, "Предопределенный алгоритм"	, "Использовать упаковки"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("НаборУпаковок"					, "Предопределенный алгоритм"	, "Набор упаковок"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ВариантОформленияПродажи"			, "Предопределенный алгоритм"	, "Вариант оформления продажи"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ГруппаДоступа"					, "Предопределенный алгоритм"	, "Группа доступа"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ЕдиницаИзмерения"					, "Предопределенный алгоритм"	, "Единица измерения"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ЕдиницаДляОтчетов"				, "Предопределенный алгоритм"	, "Единица измерения"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Качество"							, "Предопределенный алгоритм"	, "Качество"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("СтавкаНДС"						, "Предопределенный алгоритм"	, "Ставка НДС"));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыХарактеристикДляПредложенийПоУмолчанию()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Наименование"						, "Предопределенный алгоритм"	, "Наименование"						, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПометкаУдаления"					, "Предопределенный алгоритм"	, "Удален на портале"					, "СтандартныеРеквизиты"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("НаименованиеПолное"				, "Предопределенный алгоритм"	, "Наименование для печати"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Артикул"							, "Предопределенный алгоритм"	, "Артикул"));
	
	Возврат Результат;
	
КонецФункции  

Функция ПолучитьРеквизитыСчетовДляСчетовПоУмолчанию()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Дата"							, "Предопределенный алгоритм"	, "Дата документа"					, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Номер"						, "Предопределенный алгоритм"	, "Номер документа"					, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПометкаУдаления"				, "Предопределенный алгоритм"	, "Удален на портале"				, "СтандартныеРеквизиты"));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыЗаказовДляСделокПоУмолчанию()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Дата"							, "Предопределенный алгоритм"	, "Дата документа"					, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Номер"						, "Предопределенный алгоритм"	, "Номер документа"					, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПометкаУдаления"				, "Предопределенный алгоритм"	, "Удален на портале"				, "СтандартныеРеквизиты"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Подразделение"				, "Предопределенный алгоритм"	, "Подразделение"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Организация"					, "Предопределенный алгоритм"	, "Организация"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Соглашение"					, "Предопределенный алгоритм"	, "Соглашение"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Партнер"						, "Предопределенный алгоритм"	, "Партнер"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Контрагент"					, "Предопределенный алгоритм"	, "Контрагент"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("КонтактноеЛицо"				, "Предопределенный алгоритм"	, "Контактное лицо"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Договор"						, "Предопределенный алгоритм"	, "Договор"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("БанковскийСчетКонтрагента"	, "Предопределенный алгоритм"	, "Банковский счет контрагента"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("БанковскийСчет"				, "Предопределенный алгоритм"	, "Банковский счет"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("СпособДоставки"				, "Предопределенный алгоритм"	, "Способ доставки"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Склад"						, "Предопределенный алгоритм"	, "Склад"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Приоритет"					, "Предопределенный алгоритм"	, "Приоритет"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ДатаОтгрузки"					, "Предопределенный алгоритм"	, "Дата завершения"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Валюта"						, "Предопределенный алгоритм"	, "Валюта"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ЦенаВключаетНДС"				, "Предопределенный алгоритм"	, "Сумма включает НДС"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("НалогообложениеНДС"			, "Предопределенный алгоритм"	, "Налогообложение НДС"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СуммаДокумента"				, "Предопределенный алгоритм"	, "Сумма документа"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Комментарий"					, "Предопределенный алгоритм"	, "Комментарий"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ХозяйственнаяОперация"		, "Предопределенный алгоритм"	, "Хозяйственная операция"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ФормаОплаты"					, "Предопределенный алгоритм"	, "Форма оплаты"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("СкидкиРассчитаны"				, "Фиксированное значение"		, Истина));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Менеджер"						, "Предопределенный алгоритм"	, "Ответственный"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ГрафикОплаты"					, "Предопределенный алгоритм"	, "График оплаты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Статус"						, "Предопределенный алгоритм"	, "Статус"));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыЗаказовДляЗаказовПоУмолчанию()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Дата"							, "Предопределенный алгоритм"	, "Дата документа"					, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Номер"						, "Предопределенный алгоритм"	, "Номер документа"					, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПометкаУдаления"				, "Предопределенный алгоритм"	, "Удален на портале"				, "СтандартныеРеквизиты"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Подразделение"				, "Предопределенный алгоритм"	, "Подразделение"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Организация"					, "Предопределенный алгоритм"	, "Организация"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Соглашение"					, "Предопределенный алгоритм"	, "Соглашение"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Партнер"						, "Предопределенный алгоритм"	, "Партнер"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Контрагент"					, "Предопределенный алгоритм"	, "Контрагент"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("КонтактноеЛицо"				, "Предопределенный алгоритм"	, "Контактное лицо"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Договор"						, "Предопределенный алгоритм"	, "Договор"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("БанковскийСчетКонтрагента"	, "Предопределенный алгоритм"	, "Банковский счет контрагента"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("БанковскийСчет"				, "Предопределенный алгоритм"	, "Банковский счет"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("АдресДоставки"				, "Предопределенный алгоритм"	, "Адрес доставки"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("АдресДоставкиЗначенияПолей"	, "Предопределенный алгоритм"	, "Адрес доставки значения полей"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("АдресДоставкиПеревозчика"				, "Предопределенный алгоритм"	, "Адрес доставки перевозчика"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("АдресДоставкиПеревозчикаЗначенияПолей", "Предопределенный алгоритм"	, "Адрес доставки перевозчика значения полей"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("СпособДоставки"				, "Предопределенный алгоритм"	, "Способ доставки"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПеревозчикПартнер"			, "Предопределенный алгоритм"	, "Перевозчик партнер"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Склад"						, "Предопределенный алгоритм"	, "Склад"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Приоритет"					, "Предопределенный алгоритм"	, "Приоритет"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ДатаОтгрузки"					, "Предопределенный алгоритм"	, "Дата завершения"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Валюта"						, "Предопределенный алгоритм"	, "Валюта"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ЦенаВключаетНДС"				, "Предопределенный алгоритм"	, "Сумма включает НДС"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("НалогообложениеНДС"			, "Предопределенный алгоритм"	, "Налогообложение НДС"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СуммаДокумента"				, "Предопределенный алгоритм"	, "Сумма документа"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Комментарий"					, "Предопределенный алгоритм"	, "Комментарий"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ХозяйственнаяОперация"		, "Предопределенный алгоритм"	, "Хозяйственная операция"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ФормаОплаты"					, "Предопределенный алгоритм"	, "Форма оплаты"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("СкидкиРассчитаны"				, "Фиксированное значение"		, Истина));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Менеджер"						, "Предопределенный алгоритм"	, "Ответственный"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ГрафикОплаты"					, "Предопределенный алгоритм"	, "График оплаты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Статус"						, "Предопределенный алгоритм"	, "Статус"));

	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыОтгрузокДляОтгрузокПоУмолчанию()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Дата"							, "Предопределенный алгоритм"	, "Дата документа"					, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Номер"						, "Предопределенный алгоритм"	, "Номер документа"					, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПометкаУдаления"				, "Предопределенный алгоритм"	, "Удален на портале"				, "СтандартныеРеквизиты"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("РеализацияПоЗаказам"			, "Фиксированное значение"		, Истина));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ЗаказКлиента"					, "Предопределенный алгоритм"	, "Заказ"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Подразделение"				, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Организация"					, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Соглашение"					, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Партнер"						, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Контрагент"					, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("КонтактноеЛицо"				, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Договор"						, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("БанковскийСчетКонтрагента"	, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("БанковскийСчетОрганизации"	, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("НаправлениеДеятельности"		, "Из основания"				, ""));
	
	//Результат.Добавить(ПолучитьОписаниеРеквизита("Статус"						, "Фиксированное значение"		, Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Статус"						, "Фиксированное значение"		, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ВариантОформленияПродажи"		, "Предопределенный алгоритм"	, "Вариант оформления продажи"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СпособДоставки"				, "Предопределенный алгоритм"	, "Способ доставки"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("АдресДоставки"				, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("АдресДоставкиЗначенияПолей"	, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПеревозчикПартнер"			, "Предопределенный алгоритм"	, "Перевозчик партнер"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("АдресДоставкиПеревозчика"				, "Предопределенный алгоритм"	, "Адрес доставки перевозчика"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("АдресДоставкиПеревозчикаЗначенияПолей", "Предопределенный алгоритм"	, "Адрес доставки перевозчика значения полей"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Валюта"						, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ВалютаВзаиморасчетов"			, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("НалогообложениеНДС"			, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ХозяйственнаяОперация"		, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ФормаОплаты"					, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ЦенаВключаетНДС"				, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Менеджер"						, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Склад"						, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Комментарий"					, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СкидкиРассчитаны"				, "Фиксированное значение"		, Истина));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыОплатДляОплатПоУмолчанию(ВидОплаты)
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Дата"							, "Предопределенный алгоритм"	, "Дата документа"					, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Номер"						, "Предопределенный алгоритм"	, "Номер документа"					, "СтандартныеРеквизиты"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПометкаУдаления"				, "Предопределенный алгоритм"	, "Удален на портале"				, "СтандартныеРеквизиты"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Организация"					, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Подразделение"				, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("НаправлениеДеятельности"		, "Из основания"				, ""));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Партнер"						, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Контрагент"					, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Договор"						, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Валюта"						, "Из основания"				, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СуммаДокумента"				, "Предопределенный алгоритм"	, "Сумма документа"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СтатьяДвиженияДенежныхСредств", "Предопределенный алгоритм"	, "Статья ДДС"));
	
	//Результат.Добавить(ПолучитьОписаниеРеквизита("ХозяйственнаяОперация"		, "Фиксированное значение"		, Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ХозяйственнаяОперация"		, "Фиксированное значение"		, ""));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ОбъектРасчетов"				, "Предопределенный алгоритм"	, "Объект расчетов"));
	
	Если ВидОплаты = "Y" Тогда
		
		Результат.Добавить(ПолучитьОписаниеРеквизита("ДокументОснование"		, "Предопределенный алгоритм"	, "Заказ"));
		Результат.Добавить(ПолучитьОписаниеРеквизита("Касса"					, "Предопределенный алгоритм"	, "Касса"));
		
	ИначеЕсли ВидОплаты = "N" Тогда
		
		Результат.Добавить(ПолучитьОписаниеРеквизита("ДокументОснование"		, "Предопределенный алгоритм"	, "Заказ"));
		//Результат.Добавить(ПолучитьОписаниеРеквизита("ТипПлатежногоДокумента"	, "Фиксированное значение"		, Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение));
		Результат.Добавить(ПолучитьОписаниеРеквизита("ТипПлатежногоДокумента"	, "Фиксированное значение"		, ""));
		Результат.Добавить(ПолучитьОписаниеРеквизита("БанковскийСчет"			, "Предопределенный алгоритм"	, "Банковский счет организации"));
		
	ИначеЕсли ВидОплаты = "A" Тогда
		
		Результат.Добавить(ПолучитьОписаниеРеквизита("НомерПлатежнойКарты"		, "Фиксированное значение"		, "123456"));
		Результат.Добавить(ПолучитьОписаниеРеквизита("ЭквайринговыйТерминал"	, "Предопределенный алгоритм"	, "Эквайринговый терминал"));
		Результат.Добавить(ПолучитьОписаниеРеквизита("ДоговорЭквайринга"		, "Предопределенный алгоритм"	, "Договор эквайринга"));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции



Функция ПолучитьСоответствияТабЧастейДляЗагрузкиПоУмолчанию(Сущности) 
	
	Результат = Новый Массив;
	
	АктуальныеПоля = Новый СписокЗначений;
	
	Для каждого ТекЭлемент Из Сущности Цикл
		
		Если (ТекЭлемент.ВидСущности = "Счет" ИЛИ ТекЭлемент.ВидСущности = "Счет2") И ТекЭлемент.ИмяОбъекта = "СчетНаОплатуКлиенту" Тогда
			АктуальныеПоля = ПолучитьРеквизитыТЧСчетовДляСчетовПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Проект" И ТекЭлемент.ИмяОбъекта = "ЗаказКлиента" Тогда
			АктуальныеПоля = ПолучитьРеквизитыТЧЗаказовДляСделокПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Заказ" И ТекЭлемент.ИмяОбъекта = "ЗаказКлиента" Тогда
			АктуальныеПоля = ПолучитьРеквизитыТЧЗаказовДляЗаказовПоУмолчанию();	
		ИначеЕсли ТекЭлемент.ВидСущности = "Оплата" И ТекЭлемент.ИмяОбъекта = "ПриходныйКассовыйОрдер" Тогда
			АктуальныеПоля = ПолучитьРеквизитыТЧОплатДляОплатПоУмолчанию("Y");	
		ИначеЕсли ТекЭлемент.ВидСущности = "Оплата" И ТекЭлемент.ИмяОбъекта = "ПоступлениеБезналичныхДенежныхСредств" Тогда
			АктуальныеПоля = ПолучитьРеквизитыТЧОплатДляОплатПоУмолчанию("N");	
		ИначеЕсли ТекЭлемент.ВидСущности = "Оплата" И ТекЭлемент.ИмяОбъекта = "ОперацияПоПлатежнойКарте" Тогда
			АктуальныеПоля = ПолучитьРеквизитыТЧОплатДляОплатПоУмолчанию("A");	
		ИначеЕсли ТекЭлемент.ВидСущности = "Отгрузка" И ТекЭлемент.ИмяОбъекта = "РеализацияТоваровУслуг" Тогда
			АктуальныеПоля = ПолучитьРеквизитыТЧОтгрузокДляОтгрузокПоУмолчанию();	
		КонецЕсли;
		
		Для каждого ТекПоле Из АктуальныеПоля Цикл 
			
			НоваяЗапись = ПолучитьСтруктуруСоответствийТабЧастейДляЗагрузки();
			
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекЭлемент);
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекПоле);
			
			Результат.Добавить(НоваяЗапись);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруСоответствийТабЧастейДляЗагрузки() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВидСущности"		, "");
	Результат.Вставить("ВидОбъекта"			, "");
	Результат.Вставить("ИмяОбъекта"			, "");
	Результат.Вставить("Реквизит1С"			, "");
	Результат.Вставить("ИсточникДанных"		, "");
	Результат.Вставить("Значение"			, "");
	Результат.Вставить("Наименование"		, "");
	Результат.Вставить("ТипРеквизита"		, "");
	Результат.Вставить("ИмяТабЧасти"		, "");
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьРеквизитыТЧСчетовДляСчетовПоУмолчанию()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Номенклатура"			, "Предопределенный алгоритм", "Номенклатура"			,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Характеристика"		, "Предопределенный алгоритм", "Характеристика"			,, "Товары"));

	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыТЧЗаказовДляСделокПоУмолчанию()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Номенклатура"			, "Предопределенный алгоритм", "Номенклатура"			,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Характеристика"		, "Предопределенный алгоритм", "Характеристика"			,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Упаковка"				, "Предопределенный алгоритм",  "Упаковка"				,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СтавкаНДС"			, "Предопределенный алгоритм", "Ставка НДС"				,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ДатаОтгрузки"			, "Предопределенный алгоритм", "Дата отгрузки"			,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Склад"				, "Предопределенный алгоритм", "Склад"					,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ВариантОбеспечения"	, "Предопределенный алгоритм", "Вариант обеспечения"	,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Содержание"			, "Предопределенный алгоритм", "Содержание"				,, "Товары"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Количество"			, "Предопределенный алгоритм", "Количество"				,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("КоличествоУпаковок"	, "Предопределенный алгоритм", "Количество"				,, "Товары"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Цена"					, "Предопределенный алгоритм", "Цена"					,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПроцентРучнойСкидки"	, "Предопределенный алгоритм", "Процент ручной скидки"	,, "Товары"));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыТЧЗаказовДляЗаказовПоУмолчанию()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("КлючСвязи"			, "Предопределенный алгоритм", "Ключ связи"				,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("КодСтроки"			, "Предопределенный алгоритм", "Код строки"				,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Номенклатура"			, "Предопределенный алгоритм", "Номенклатура"			,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Характеристика"		, "Предопределенный алгоритм", "Характеристика"			,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Упаковка"				, "Предопределенный алгоритм", "Упаковка"				,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СтавкаНДС"			, "Предопределенный алгоритм", "Ставка НДС"				,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Склад"				, "Предопределенный алгоритм", "Склад"					,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ВариантОбеспечения"	, "Предопределенный алгоритм", "Вариант обеспечения"	,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Содержание"			, "Предопределенный алгоритм", "Содержание"				,, "Товары"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Количество"			, "Предопределенный алгоритм", "Количество"				,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("КоличествоУпаковок"	, "Предопределенный алгоритм", "Количество"				,, "Товары"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Цена"					, "Предопределенный алгоритм", "Цена"					,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ДатаОтгрузки"			, "Предопределенный алгоритм", "Дата отгрузки"			,, "Товары"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПроцентАвтоматическойСкидки"	, "Фиксированное значение", 0	,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СуммаАвтоматическойСкидки"	, "Фиксированное значение", 0	,, "Товары"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПроцентРучнойСкидки"	, "Фиксированное значение"	, 0			,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СуммаРучнойСкидки"	, "Фиксированное значение"	, 0			,, "Товары"));

	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыТЧОтгрузокДляОтгрузокПоУмолчанию()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("КлючСвязи"			, "Предопределенный алгоритм", "Ключ связи"				,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("КодСтроки"			, "Предопределенный алгоритм", "Код строки"				,, "Товары"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ЗаказКлиента"			, "Предопределенный алгоритм", "Заказ"					,, "Товары"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Номенклатура"			, "Предопределенный алгоритм", "Номенклатура"			,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Характеристика"		, "Предопределенный алгоритм", "Характеристика"			,, "Товары"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Упаковка"				, "Предопределенный алгоритм",  "Упаковка"				,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СтавкаНДС"			, "Предопределенный алгоритм", "Ставка НДС"				,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Склад"				, "Предопределенный алгоритм", "Склад"					,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Количество"			, "Предопределенный алгоритм", "Количество"				,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("КоличествоУпаковок"	, "Предопределенный алгоритм", "Количество"				,, "Товары"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Цена"					, "Предопределенный алгоритм", "Цена"					,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПроцентАвтоматическойСкидки"	, "Предопределенный алгоритм", "Процент автоматической скидки"	,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СуммаАвтоматическойСкидки"	, "Предопределенный алгоритм", "Сумма автоматической скидки"	,, "Товары"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ПроцентРучнойСкидки"	, "Предопределенный алгоритм", "Процент ручной скидки"	,, "Товары"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СуммаРучнойСкидки"	, "Предопределенный алгоритм", "Сумма ручной скидки"	,, "Товары"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Сумма"				, "Предопределенный алгоритм", "Сумма"					,, "Товары"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("ОбъектРасчетов"		, "Предопределенный алгоритм", "Объект расчетов"		,, "Товары"));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыТЧОплатДляОплатПоУмолчанию(ВидОплаты)
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Заказ"						, "Предопределенный алгоритм"	, "Заказ"					,, "РасшифровкаПлатежа"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Партнер"						, "Предопределенный алгоритм"	, "Партнер"					,, "РасшифровкаПлатежа"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ВалютаВзаиморасчетов"			, "Предопределенный алгоритм"	, "Валюта взаиморасчетов"	,, "РасшифровкаПлатежа"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СтатьяДвиженияДенежныхСредств", "Предопределенный алгоритм"	, "Статья ДДС"				,, "РасшифровкаПлатежа"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Сумма"						, "Предопределенный алгоритм"	, "Сумма платежа"			,, "РасшифровкаПлатежа"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СуммаВзаиморасчетов"			, "Предопределенный алгоритм"	, "Сумма платежа"			,, "РасшифровкаПлатежа"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СтавкаНДС"					, "Предопределенный алгоритм"	, "Ставка НДС"				,, "РасшифровкаПлатежа"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("СуммаНДС"						, "Предопределенный алгоритм"	, "Сумма НДС"				,, "РасшифровкаПлатежа"));
	
	Результат.Добавить(ПолучитьОписаниеРеквизита("Подразделение"				, "Предопределенный алгоритм"	, "Подразделение"			,, "РасшифровкаПлатежа"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("Организация"					, "Предопределенный алгоритм"	, "Организация"				,, "РасшифровкаПлатежа"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("НаправлениеДеятельности"		, "Предопределенный алгоритм"	, "Направление деятельности",, "РасшифровкаПлатежа"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ОбъектРасчетов"				, "Предопределенный алгоритм"	, "Объект расчетов"			,, "РасшифровкаПлатежа"));
	Результат.Добавить(ПолучитьОписаниеРеквизита("ОснованиеПлатежа"				, "Предопределенный алгоритм"	, "Основание платежа"		,, "РасшифровкаПлатежа"));

	Возврат Результат;
	
КонецФункции



Функция ПолучитьОписаниеРеквизита(Реквизит1С, ИсточникДанных, Значение, ТипРеквизита = "", ИмяТабЧасти = "")
	
	Результат = Новый Структура;
	
	Результат.Вставить("Реквизит1С"		,Реквизит1С);
	Результат.Вставить("Значение"		, Значение);
	Результат.Вставить("ТипРеквизита"	, ТипРеквизита);
	Результат.Вставить("ИсточникДанных"	, ИсточникДанных);
	Результат.Вставить("ИмяТабЧасти"	, ИмяТабЧасти);
	
	Если ТипРеквизита = "СтандартныеРеквизиты" Тогда
		Результат.Вставить("Приоритет", 1);
	ИначеЕсли ТипРеквизита = "Свойство" Тогда
		Результат.Вставить("Приоритет", 2);
	ИначеЕсли ТипРеквизита = "Сведение" Тогда
		Результат.Вставить("Приоритет", 3);
	Иначе
		Результат.Вставить("Приоритет", 10);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьМассивПредопределенныхАлгоритмовЗагрузки(ВидСущности, НаименованиеОбъекта) Экспорт
	
	Результат = Новый Массив;
	
	ОписаниеПолей = Новый СписокЗначений;
	
	Если ВидСущности = "Компания" И НаименованиеОбъекта = "Партнеры" Тогда
		ОписаниеПолей = ПолучитьРеквизитыПартнеровДляКомпанийПоУмолчанию();	
	ИначеЕсли ВидСущности = "Компания" И НаименованиеОбъекта = "Организации" Тогда
		ОписаниеПолей = ПолучитьРеквизитыОрганизацийДляКомпанийПоУмолчанию();	
	ИначеЕсли ВидСущности = "Контакт" И НаименованиеОбъекта = "Партнеры" Тогда
		ОписаниеПолей = ПолучитьРеквизитыПартнеровДляКонтактовПоУмолчанию();	
	ИначеЕсли ВидСущности = "Контакт" И НаименованиеОбъекта = "КонтактныеЛицаПартнеров" Тогда
		ОписаниеПолей = ПолучитьРеквизитыКонтактныхЛицДляКонтактовПоУмолчанию();	
	ИначеЕсли ВидСущности = "Реквизит" И НаименованиеОбъекта = "Контрагенты" Тогда
		ОписаниеПолей = ПолучитьРеквизитыКонтрагентовДляРеквизитовПоУмолчанию();	
	ИначеЕсли ВидСущности = "Реквизит" И НаименованиеОбъекта = "Организации" Тогда
		ОписаниеПолей = ПолучитьРеквизитыОрганизацийДляРеквизитовПоУмолчанию();	
	ИначеЕсли ВидСущности = "Банковский счет" И (НаименованиеОбъекта = "БанковскиеСчетаКонтрагентов" ИЛИ НаименованиеОбъекта = "БанковскиеСчетаОрганизаций") Тогда
		ОписаниеПолей = ПолучитьРеквизитыБанкСчетовДляБанкСчетовПоУмолчанию();  
	ИначеЕсли (ВидСущности = "Товар" ИЛИ ВидСущности = "Товар2") И НаименованиеОбъекта = "Номенклатура" Тогда
		ОписаниеПолей = ПолучитьРеквизитыНоменклатурыДляТоваровПоУмолчанию();	 
	ИначеЕсли ВидСущности = "Предложение" И НаименованиеОбъекта = "ХарактеристикиНоменклатуры" Тогда
		ОписаниеПолей = ПолучитьРеквизитыХарактеристикДляПредложенийПоУмолчанию();	   
	ИначеЕсли (ВидСущности = "Счет" ИЛИ ВидСущности = "Счет2") И НаименованиеОбъекта = "СчетНаОплатуКлиенту" Тогда
		ОписаниеПолей = ПолучитьРеквизитыСчетовДляСчетовПоУмолчанию();	
	ИначеЕсли ВидСущности = "Проект" И НаименованиеОбъекта = "ЗаказКлиента" Тогда
		ОписаниеПолей = ПолучитьРеквизитыЗаказовДляСделокПоУмолчанию();	
	ИначеЕсли ВидСущности = "Заказ" И НаименованиеОбъекта = "ЗаказКлиента" Тогда
		ОписаниеПолей = ПолучитьРеквизитыЗаказовДляЗаказовПоУмолчанию();	
	ИначеЕсли ВидСущности = "Оплата" И НаименованиеОбъекта = "ПриходныйКассовыйОрдер" Тогда
		ОписаниеПолей = ПолучитьРеквизитыОплатДляОплатПоУмолчанию("Y");	
	ИначеЕсли ВидСущности = "Оплата" И НаименованиеОбъекта = "ПоступлениеБезналичныхДенежныхСредств" Тогда
		ОписаниеПолей = ПолучитьРеквизитыОплатДляОплатПоУмолчанию("N");	
	ИначеЕсли ВидСущности = "Оплата" И НаименованиеОбъекта = "ОперацияПоПлатежнойКарте" Тогда
		ОписаниеПолей = ПолучитьРеквизитыОплатДляОплатПоУмолчанию("A");	
	ИначеЕсли ВидСущности = "Отгрузка" И НаименованиеОбъекта = "РеализацияТоваровУслуг" Тогда
		ОписаниеПолей = ПолучитьРеквизитыОтгрузокДляОтгрузокПоУмолчанию();	
	КонецЕсли;
	
	Для каждого ТекЭлемент Из ОписаниеПолей Цикл
		
		Если ТекЭлемент.ИсточникДанных = "Предопределенный алгоритм"  Тогда
			Результат.Добавить(ТекЭлемент.Значение);	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивПредопределенныхАлгоритмовЗагрузкиТЧ(ВидСущности, НаименованиеОбъекта) Экспорт
	
	Результат = Новый Массив;
	
	ОписаниеПолей = Новый СписокЗначений;
	
	Если (ВидСущности = "Счет" ИЛИ ВидСущности = "Счет2") И НаименованиеОбъекта = "СчетНаОплатуКлиенту" Тогда
		ОписаниеПолей = ПолучитьРеквизитыТЧСчетовДляСчетовПоУмолчанию();	
	ИначеЕсли ВидСущности = "Проект" И НаименованиеОбъекта = "ЗаказКлиента" Тогда
		ОписаниеПолей = ПолучитьРеквизитыТЧЗаказовДляСделокПоУмолчанию();	
	ИначеЕсли ВидСущности = "Заказ" И НаименованиеОбъекта = "ЗаказКлиента" Тогда
		ОписаниеПолей = ПолучитьРеквизитыТЧЗаказовДляЗаказовПоУмолчанию();	
	ИначеЕсли ВидСущности = "Оплата" И НаименованиеОбъекта = "ПриходныйКассовыйОрдер" Тогда
		ОписаниеПолей = ПолучитьРеквизитыТЧОплатДляОплатПоУмолчанию("Y");	
	ИначеЕсли ВидСущности = "Оплата" И НаименованиеОбъекта = "ПоступлениеБезналичныхДенежныхСредств" Тогда
		ОписаниеПолей = ПолучитьРеквизитыТЧОплатДляОплатПоУмолчанию("N");	
	ИначеЕсли ВидСущности = "Оплата" И НаименованиеОбъекта = "ОперацияПоПлатежнойКарте" Тогда
		ОписаниеПолей = ПолучитьРеквизитыТЧОплатДляОплатПоУмолчанию("A");	
	ИначеЕсли ВидСущности = "Отгрузка" И НаименованиеОбъекта = "РеализацияТоваровУслуг" Тогда
		ОписаниеПолей = ПолучитьРеквизитыТЧОтгрузокДляОтгрузокПоУмолчанию();	
	КонецЕсли;
	
	Для каждого ТекЭлемент Из ОписаниеПолей Цикл
		
		Если ТекЭлемент.ИсточникДанных = "Предопределенный алгоритм"  Тогда
			Результат.Добавить(ТекЭлемент.Значение);	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 


#Область ЗаполнениеОтборовПоВыгрузкеДанныхНаПортал

Функция ПолучитьОтборыПоВыгрузкеДанныхНаПорталПоУмолчанию(Сущности) Экспорт 
	
	Результат = Новый Массив;
	
	СтруктураССхемами = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСтруктуруСхемКомпоновки();
	
	Для каждого ТекЭлемент Из Сущности Цикл
		
		Если ТекЭлемент.ВидСущности = "Компания" Тогда
		
			//Если ТекЭлемент.ИмяОбъекта = "Партнеры" Тогда
			//	Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаПартнеров));
			//ИначеЕсли ТекЭлемент.ИмяОбъекта = "Организации" Тогда
			Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаОрганизаций));
			//КонецЕсли;
			
		ИначеЕсли ТекЭлемент.ВидСущности = "Контакт" Тогда
			
			//Если ТекЭлемент.ИмяОбъекта = "Партнеры" Тогда
			//	Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаПартнеров));
			//ИначеЕсли ТекЭлемент.ИмяОбъекта = "КонтактныеЛицаПартнеров" Тогда
			//	Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаКонтактныхЛиц));
			//КонецЕсли;
				
		ИначеЕсли ТекЭлемент.ВидСущности = "Реквизит" Тогда
			
			Если ТекЭлемент.ИмяОбъекта = "Контрагенты" Тогда
				Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаКонтрагентов));
			ИначеЕсли ТекЭлемент.ИмяОбъекта = "Организации" Тогда
				Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаОрганизаций));
			КонецЕсли;
	
		ИначеЕсли ТекЭлемент.ВидСущности = "Банковский счет" Тогда
			
			//Если ТекЭлемент.ИмяОбъекта = "БанковскиеСчетаКонтрагентов" Тогда
			//	Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаБанкСчетовКонтрагентов));
			//ИначеЕсли ТекЭлемент.ИмяОбъекта = "БанковскиеСчетаОрганизаций" Тогда
			//	Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаБанкСчетовОрганизаций));
			//КонецЕсли;   
			
		ИначеЕсли ТекЭлемент.ВидСущности = "Товар" Тогда
			
			Если ТекЭлемент.ИмяОбъекта = "Номенклатура" Тогда
				Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаНоменклатуры));
			КонецЕсли;
			
		ИначеЕсли ТекЭлемент.ВидСущности = "Товар2" Тогда
			
			Если ТекЭлемент.ИмяОбъекта = "Номенклатура" Тогда
				Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаТоваров));
			КонецЕсли;
			
		ИначеЕсли ТекЭлемент.ВидСущности = "Предложение" Тогда
			
			//Если ТекЭлемент.ИмяОбъекта = "ХарактеристикиНоменклатуры" Тогда
			//	Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаПредложений));
			//ИначеЕсли ТекЭлемент.ИмяОбъекта = "Номенклатура" Тогда
			//	Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаТоваров));
			//КонецЕсли;
			
		ИначеЕсли ТекЭлемент.ВидСущности = "Счет" ИЛИ ТекЭлемент.ВидСущности = "Счет2" Тогда
			
			//Если ТекЭлемент.ИмяОбъекта = "СчетНаОплатуКлиенту" Тогда
			//	Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаСчетов));
			//КонецЕсли;
			
		ИначеЕсли ТекЭлемент.ВидСущности = "Проект" Тогда
			
			Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаСделки));
			//Если ТекЭлемент.ИмяОбъекта = "ЗаказКлиента" Тогда
			//	Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаЗаказовCRM));
			//КонецЕсли;
			
		ИначеЕсли ТекЭлемент.ВидСущности = "Заказ" Тогда
			
			//Если ТекЭлемент.ИмяОбъекта = "ЗаказКлиента" Тогда
			//	Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаЗаказовМагазина));
			//КонецЕсли;
			
		ИначеЕсли ТекЭлемент.ВидСущности = "Оплата" Тогда
			
			//Если ТекЭлемент.ИмяОбъекта = "ПоступлениеБезналичныхДенежныхСредств" Тогда
			//	Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаОплатБезналом));
			//ИначеЕсли ТекЭлемент.ИмяОбъекта = "ПриходныйКассовыйОрдер" Тогда
			//	Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаОплатНаличными));
			//ИначеЕсли ТекЭлемент.ИмяОбъекта = "ОперацияПоПлатежнойКарте" Тогда
			//	Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаОплатЭквайрингом));
			//КонецЕсли;
			
		ИначеЕсли ТекЭлемент.ВидСущности = "Отгрузка" Тогда
			
			//Если ТекЭлемент.ИмяОбъекта = "РеализацияТоваровУслуг" Тогда
			//	Результат.Добавить(ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ТекЭлемент.ВидСущности, ТекЭлемент.ВидОбъекта, ТекЭлемент.ИмяОбъекта, СтруктураССхемами.ВыгрузкаОтгрузок));
			//КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПользовательскиеНастройкиДляОтборовВыгрузкиДанныхНаПортал(ВидСущности, ВидОбъекта, ИмяОбъекта, СхемаВыгрузки)
	
	Настройки = Неопределено;
	Если НЕ СхемаВыгрузки = Неопределено Тогда
		СтруктураДанных = ПолучитьСтруктуруСоответствийОтборовПоВыгрузкеДанныхНаПортал();
		УникальныйИдентификатор = Новый УникальныйИдентификатор;
		АдресСхемы = ПоместитьВоВременноеХранилище(СхемаВыгрузки, УникальныйИдентификатор);
		КомпоновщикНастроекКомпоновкиДанныхСчетов = Новый КомпоновщикНастроекКомпоновкиДанных;		
		КомпоновщикНастроекКомпоновкиДанныхСчетов.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
		КомпоновщикНастроекКомпоновкиДанныхСчетов.ЗагрузитьНастройки(СхемаВыгрузки.НастройкиПоУмолчанию);  
		Настройки = КомпоновщикНастроекКомпоновкиДанныхСчетов.ПолучитьНастройки();	
	КонецЕсли;
	
	СтруктураДанных.ВидСущности = ВидСущности;
	СтруктураДанных.ВидОбъекта 	= ВидОбъекта;
	СтруктураДанных.ИмяОбъекта 	= ИмяОбъекта;
	СтруктураДанных.Значение 	= Настройки;
	СтруктураДанных.Схема 		= СхемаВыгрузки;
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПолучитьСтруктуруСоответствийОтборовПоВыгрузкеДанныхНаПортал() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВидСущности"	, "");
	Результат.Вставить("ВидОбъекта"		, "");
	Результат.Вставить("ИмяОбъекта"		, "");
	Результат.Вставить("Значение"		, "");
	Результат.Вставить("Схема"			, "");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 


#Область ЗаполнениеОтборовПоЗагрузкиДанныхВ1С

Функция ПолучитьОтборыПоЗагрузкиДанныхВ1СПоУмолчанию(Сущности) 
	
	Результат = Новый Массив;
	
	Возврат Результат;	
	
КонецФункции

Функция ПолучитьСтруктуруСоответствийОтборовПоЗагрузкеДанныхВ1С() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВидСущности"			, "");
	Результат.Вставить("ВидОбъекта"				, "");
	Результат.Вставить("ИмяОбъекта"				, "");
	Результат.Вставить("КлючЗапроса"			, "");
	Результат.Вставить("Значение"				, "");
	Результат.Вставить("Описание"				, "");
	Результат.Вставить("Идентификатор"			, "");
	Результат.Вставить("ИдентификаторЗначения"	, "");
	Результат.Вставить("ВидСравнения"			, "");
	Результат.Вставить("ТипПоля"				, "");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#КонецОбласти 


#Область ДанныеПользовательскихПолей

Функция ПолучитьКлючиПользовательскиеПоляСущностиПортала(НастройкаПодключения, ВидСущности, ИдентификаторКаталогаТоваров = "", ИдентификаторКаталогаПредложений = "") Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ключи"							, Новый Массив);
	Результат.Вставить("ПользовательскиеПоля"			, Новый Массив);
	Результат.Вставить("ЗначенияПользовательскихПолей"	, Новый Массив);
	
	МетодКлючей		= "";
	МетодППГ 		= "";   
	ПараметрыМетода = "";
	ЭтоСмартПроцесс = Ложь;
	ЭтоТовар2 		= Ложь;
	ЭтоПредложение	= Ложь;
	ТипВладельца		= "";
	СтроковоеОбновление	= "";
	
	Если ВидСущности = "Компания" Тогда
		МетодКлючей = "/rest/crm.company.fields";
		СтроковоеОбозначение 	= "COMPANY";
	ИначеЕсли ВидСущности = "Контакт" Тогда
		МетодКлючей = "/rest/crm.contact.fields";	
		СтроковоеОбозначение 	= "CONTACT";
	ИначеЕсли ВидСущности = "Реквизит" Тогда
		МетодКлючей = "/rest/crm.requisite.fields";
	ИначеЕсли ВидСущности = "Банковский счет" Тогда
		МетодКлючей = "/rest/crm.requisite.bankdetail.fields";
	ИначеЕсли ВидСущности = "Товар" Тогда
		МетодКлючей = "/rest/crm.product.fields";
		МетодППГ = "crm.product.property.get";
	ИначеЕсли ВидСущности = "Товар2" Тогда
		ЭтоТовар2 = Истина;	
		МетодКлючей = "/rest/catalog.product.getFieldsByFilter"; 
		МетодППГ = "catalog.productProperty.get";     
	ИначеЕсли ВидСущности = "Предложение" Тогда
		ЭтоПредложение = Истина;	
		МетодКлючей = "/rest/catalog.product.offer.getFieldsByFilter"; 
		МетодППГ = "catalog.productProperty.get";     
	ИначеЕсли ВидСущности = "Счет" Тогда
		МетодКлючей = "/rest/crm.invoice.fields";
		СтроковоеОбозначение 	= "INVOICE";
	ИначеЕсли ВидСущности = "Счет2" Тогда       
		ЭтоСмартПроцесс 		= Истина;
		МетодКлючей 			= "/rest/crm.item.fields";
		ТипВладельца 			= "31";
		СтроковоеОбозначение 	= "SMART_INVOICE";
	ИначеЕсли ВидСущности = "Проект" Тогда
		МетодКлючей = "/rest/crm.deal.fields";
		СтроковоеОбозначение 	= "DEAL";
	ИначеЕсли ВидСущности = "Заказ" Тогда
		МетодКлючей = "/rest/sale.order.getFields";
	ИначеЕсли ВидСущности = "Оплата" Тогда
		МетодКлючей = "/rest/sale.payment.getFields";
	ИначеЕсли ВидСущности = "Отгрузка" Тогда
		МетодКлючей = "/rest/sale.shipment.getFields";
	КонецЕсли;	
	
	Если МетодКлючей = "" И НЕ ЭтоСмартПроцесс И НЕ ЭтоТовар2 Тогда
		Возврат Результат;	
	КонецЕсли;
	
	СтруктураНастроек =  Б24_К_ОбщегоНазначенияВызовСервера.СформироватьСтруктуруНастроек(НастройкаПодключения, Истина);  
	Если СтруктураНастроек = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	СтруктураНастроек.Логирование.Измерение1 = "Служебные операции";
	СтруктураНастроек.Логирование.Измерение2 = "Получение полей данных";
	
	
	мПользовательскиеПоляИдФормы = Новый Массив;
	
	Если ЭтоСмартПроцесс Тогда
			
		ПараметрыЗапроса 	= "&entityTypeId=" + ТипВладельца;
		
		ДанныеСПортала = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПортал(СтруктураНастроек, МетодКлючей, ПараметрыЗапроса); 
		Если ДанныеСПортала = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
		result = ДанныеСПортала.Получить("result");
		Если result <> Неопределено Тогда
			
			fields = result.Получить("fields");
			Если fields <> Неопределено Тогда
					
				Для каждого ТекЭлемент Из fields Цикл
					
					Если ТекЭлемент.Значение.Получить("isMultiple") = Истина Тогда
						Продолжить;
					КонецЕсли;
					
					Если Лев(ТекЭлемент.Ключ,5)= "ufCrm" Тогда
						мПользовательскиеПоляИдФормы.Добавить(ТекЭлемент.Ключ);	
					Иначе
						Результат.Ключи.Добавить(Новый Структура("ВидСущности, КлючЗапроса", ВидСущности, ТекЭлемент.Ключ)); 	
					КонецЕсли;
					
				КонецЦикла;
				                
			КонецЕсли;                                                     
		КонецЕсли;                             
		
	ИначеЕсли ЭтоТовар2 ИЛИ ЭтоПредложение Тогда   
		
		Если ЭтоТовар2 Тогда
			ПараметрыЗапроса = "&filter[iblockId]="+ИдентификаторКаталогаТоваров+"&filter[productType]=1";
		Иначе
			ПараметрыЗапроса = "&filter[iblockId]="+ИдентификаторКаталогаПредложений;
		КонецЕсли;
		
		ДанныеСПортала = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПортал(СтруктураНастроек, МетодКлючей, ПараметрыЗапроса); 
		Если ДанныеСПортала = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
		result = ДанныеСПортала.Получить("result");
		Если result <> Неопределено Тогда
			
			Если ЭтоТовар2 Тогда   
				ДанныеПортала = result.Получить("product");   
			Иначе    
				ДанныеПортала = result.Получить("offer"); 
			КонецЕсли;
			
			Если ДанныеПортала <> Неопределено Тогда  
				
				Для каждого ТекЭлемент Из ДанныеПортала Цикл
					
					Если ТекЭлемент.Значение.Получить("isMultiple") = Истина Тогда
						Продолжить;
					КонецЕсли;
					
					Если Лев(ТекЭлемент.Ключ,8)= "property" Тогда
						мПользовательскиеПоляИдФормы.Добавить(СтрЗаменить(ТекЭлемент.Ключ, "property", ""));	
					Иначе
						Результат.Ключи.Добавить(Новый Структура("ВидСущности, КлючЗапроса", ВидСущности, ТекЭлемент.Ключ)); 	
					КонецЕсли;
					
				КонецЦикла;
				                
			КонецЕсли;                                                     
		КонецЕсли;   
		
	Иначе
		
		ДанныеСПортала = ПолучитьДанныеСПортала(СтруктураНастроек, МетодКлючей);
		Для каждого ТекЭлемент Из ДанныеСПортала Цикл
			Если Лев(ТекЭлемент.Ключ, 7) = "UF_CRM_" Тогда
				мПользовательскиеПоляИдФормы.Добавить(ТекЭлемент.Ключ);  
			ИначеЕсли Лев(ТекЭлемент.Ключ, 9) = "PROPERTY_" Тогда
				мПользовательскиеПоляИдФормы.Добавить(Прав(ТекЭлемент.Ключ, СтрДлина(ТекЭлемент.Ключ)-9));    
			Иначе
				
				Если ВидСущности = "Заказ" ИЛИ ВидСущности = "Оплата" ИЛИ ВидСущности = "Отгрузка" Тогда
					
					Если ТипЗнч(ТекЭлемент.Значение) = Тип("Соответствие") Тогда
						Для каждого ТекСоответствие Из ТекЭлемент.Значение Цикл
							
							Результат.Ключи.Добавить(Новый Структура("ВидСущности, КлючЗапроса", ВидСущности, ТекСоответствие.Ключ)); 
							
						КонецЦикла;	
					КонецЕсли;
						
				Иначе
					
					Результат.Ключи.Добавить(Новый Структура("ВидСущности, КлючЗапроса", ВидСущности, ТекЭлемент.Ключ)); 
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ВидСущности = "Товар" Тогда
		
		мБатчЗапросыПоСвойствам = Новый Массив;
		Для каждого ТекЭлемент Из мПользовательскиеПоляИдФормы Цикл
			мБатчЗапросыПоСвойствам.Добавить("cmd["+ТекЭлемент+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(МетодППГ + "?id="  + ТекЭлемент));
		КонецЦикла;
		
		мСвойства = ПолучитьДанныеСПорталаЧерезБатч(НастройкаПодключения, мБатчЗапросыПоСвойствам);
		Для каждого ТекЭлемент Из мСвойства Цикл
			
			ДанныеСвойства = ТекЭлемент.Значение;
			
			НаименованиеПП 		= ДанныеСвойства.Получить("NAME");
			ИдЭлемента 			= Формат(ДанныеСвойства.Получить("ID"), "ЧГ=0");
			
			ТипСвойства 		= ДанныеСвойства.Получить("PROPERTY_TYPE");
			ПользовательскийТип = ДанныеСвойства.Получить("USER_TYPE");
			Множественное 		= ДанныеСвойства.Получить("MULTIPLE");
			
			лТип = Строка(ТипСвойства) + "_" + Строка(ПользовательскийТип);
			
			Результат.ПользовательскиеПоля.Добавить(ПолучитьОписаниеПользовательскиеПоля(ВидСущности, "PROPERTY_"+ИдЭлемента, НаименованиеПП, ИдЭлемента, лТип, Множественное)); 

			ЗначенияПолей = ДанныеСвойства.Получить("VALUES");
			Если ЗначенияПолей <> Неопределено Тогда
				Для каждого ЗначениеСвойства Из ЗначенияПолей Цикл
					ТекЗначение =  ЗначениеСвойства.Значение;            
					Результат.ЗначенияПользовательскихПолей.Добавить(ПолучитьОписаниеЗначенияПользовательскогоПоля(ВидСущности, ИдЭлемента, Формат(ТекЗначение.Получить("ID"), "ЧГ=0"), ТекЗначение.Получить("VALUE"))); 
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ВидСущности = "Товар2" ИЛИ ВидСущности = "Предложение" Тогда
		
		мБатчЗапросыПоСвойствам = Новый Массив;
		Для каждого ТекЭлемент Из мПользовательскиеПоляИдФормы Цикл
			мБатчЗапросыПоСвойствам.Добавить("cmd["+ТекЭлемент+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(МетодППГ + "?id="  + ТекЭлемент));
		КонецЦикла;
		
		мСвойства = ПолучитьДанныеСПорталаЧерезБатч(НастройкаПодключения, мБатчЗапросыПоСвойствам);
		Для каждого ТекЭлемент Из мСвойства Цикл
			
			ДанныеСвойства = ТекЭлемент.Значение.Получить("productProperty");
			Если ДанныеСвойства = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НаименованиеПП 		= ДанныеСвойства.Получить("name");
			ИдЭлемента 			= Формат(ДанныеСвойства.Получить("id"), "ЧГ=0");
			
			ТипСвойства 		= ДанныеСвойства.Получить("propertyType");
			ПользовательскийТип = ДанныеСвойства.Получить("userType");
			ВидЭлемента 		= ДанныеСвойства.Получить("listType");
			Множественное		= ДанныеСвойства.Получить("multiple");
	
			лТип = Строка(ТипСвойства) + "_" + Строка(ПользовательскийТип);
			
			Результат.ПользовательскиеПоля.Добавить(ПолучитьОписаниеПользовательскиеПоля(ВидСущности, "property"+ИдЭлемента, НаименованиеПП, ИдЭлемента, лТип, Множественное)); 
			
			Если ТипСвойства = "L" Тогда
			
				ЗначенияСвойства = Б24_К_RestApiВызовСервера.ПолучитьМассивДанныхСПорталаЧерезСписок(СтруктураНастроек, "/rest/catalog.productPropertyEnum.list", "id", "&filter[propertyId]="+ИдЭлемента, "productPropertyEnums");
				Для каждого ЗначениеСвойства Из ЗначенияСвойства Цикл           
					
					НаименованиеЗначенияСвойства = ЗначениеСвойства.Получить("value");
					
					Если НаименованиеЗначенияСвойства = "Y" И ВидЭлемента = "C" Тогда
						Результат.ЗначенияПользовательскихПолей.Добавить(ПолучитьОписаниеЗначенияПользовательскогоПоля(ВидСущности, ИдЭлемента, "Y", "Y"));      
						Результат.ЗначенияПользовательскихПолей.Добавить(ПолучитьОписаниеЗначенияПользовательскогоПоля(ВидСущности, ИдЭлемента, "N", "N"));      
					Иначе
						Результат.ЗначенияПользовательскихПолей.Добавить(Новый Структура("ВидСущности, Идентификатор, ИдентификаторЗначения, ПредставлениеЗначения"
						, ВидСущности, ИдЭлемента, Формат(ЗначениеСвойства.Получить("id"), "ЧГ=0"), НаименованиеЗначенияСвойства)); 
					КонецЕсли;
	
				КонецЦикла;   
			 
			КонецЕсли;	
			
		КонецЦикла;
		
		
	Иначе	
		мБатчЗапросыПоПользовательскимПолям = Новый Массив;
		
		ТелоЗапроса = "&moduleId=crm&filter[entityId]=CRM_"+СтроковоеОбозначение;
		ДанныеПользовательскихПолей = Б24_К_RestApiВызовСервера.ПолучитьМассивДанныхСПорталаЧерезСписок(СтруктураНастроек, "/rest/userfieldconfig.list", "id", ТелоЗапроса, "fields");	
		
		Для каждого ТекЭлемент Из ДанныеПользовательскихПолей Цикл
			
			ИдПоляФормы = СтрЗаменить(ТекЭлемент.Получить("fieldName"), "UF_CRM_SMART_INVOICE_", "ufCrm_SMART_INVOICE_");
			
			ИдСвойства = Формат(ТекЭлемент.Получить("id"), "ЧГ=0");
			
			мБатчЗапросыПоПользовательскимПолям.Добавить("cmd["+ИдПоляФормы+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("userfieldconfig.get?moduleId=crm&id="+ИдСвойства));
			
		КонецЦикла;
			
		мПользовательскиеПоля = ПолучитьДанныеСПорталаЧерезБатч(НастройкаПодключения, мБатчЗапросыПоПользовательскимПолям);
		Для каждого ТекЭлемент Из мПользовательскиеПоля Цикл
			
			ДанныеПолей = ТекЭлемент.Значение;
			ДанныеПользовательскогоПоля = ДанныеПолей.Получить("field");
			Если ДанныеПользовательскогоПоля = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НаименованиеПП = "";
			НаименованияНаФормах = ДанныеПользовательскогоПоля.Получить("editFormLabel");
			Если НаименованияНаФормах <> Неопределено Тогда
				НаименованиеПП = НаименованияНаФормах.Получить(Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЛокализациюБитрикс24());		
			КонецЕсли;

			ИдентификаторПоля 	= Формат(ДанныеПользовательскогоПоля.Получить("id"), "ЧГ=0");                            
			КлючЗапроса 		= СтрЗаменить(ДанныеПользовательскогоПоля.Получить("fieldName"), "UF_CRM_SMART_INVOICE_", "ufCrm_SMART_INVOICE_");      
			ПользователськийТип	= ДанныеПользовательскогоПоля.Получить("userTypeId");
			Множественное		= ДанныеПользовательскогоПоля.Получить("multiple");

			КлючиСлужебныхПользовательскихПолей = КлючиСлужебныхПользовательскихПолей();
			Если КлючиСлужебныхПользовательскихПолей.Найти(КлючЗапроса) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Результат.ПользовательскиеПоля.Добавить(ПолучитьОписаниеПользовательскиеПоля(ВидСущности, КлючЗапроса, НаименованиеПП, ИдентификаторПоля, ПользователськийТип, Множественное)); 

			ЗначенияПолей = ДанныеПользовательскогоПоля.Получить("enum");
			Если ЗначенияПолей <> Неопределено Тогда
				Для каждого ТекЗначениеПоля Из ЗначенияПолей Цикл
					Результат.ЗначенияПользовательскихПолей.Добавить(ПолучитьОписаниеЗначенияПользовательскогоПоля(ВидСущности, ИдентификаторПоля, Формат(ТекЗначениеПоля.Получить("id"), "ЧГ=0"), ТекЗначениеПоля.Получить("value"))); 
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

Функция ПолучитьОписаниеПользовательскиеПоля(ВидСущности, КлючЗапроса, Описание, Идентификатор, ТипПоля, Множественное) 

	Результат = Новый Структура;
	Результат.Вставить("ВидСущности"	, ВидСущности);	
	Результат.Вставить("КлючЗапроса"	, КлючЗапроса);	
	Результат.Вставить("Описание"		, Описание);	
	Результат.Вставить("Идентификатор"	, Формат(Идентификатор, "ЧГ=0"));	
	Результат.Вставить("ТипПоля"		, ТипПоля);	
	Результат.Вставить("Множественное"	, Множественное = "Y");	
	
	Возврат Результат;
	
КонецФункции   

Функция ПолучитьОписаниеЗначенияПользовательскогоПоля(ВидСущности, Идентификатор, ИдентификаторЗначения, ПредставлениеЗначения) 

	Результат = Новый Структура;
	Результат.Вставить("ВидСущности"			, ВидСущности);	
	Результат.Вставить("Идентификатор"			, Формат(Идентификатор, "ЧГ=0"));	
	Результат.Вставить("ИдентификаторЗначения"	, Формат(ИдентификаторЗначения, "ЧГ=0"));	
	Результат.Вставить("ПредставлениеЗначения"	, ПредставлениеЗначения);	
	
	Возврат Результат;
	
КонецФункции 

Функция ПолучитьДанныеСПорталаЧерезБатч(НастройкаПодключения, БатчЗапросы)
	
	Результат = Новый Массив;
	
	СтруктураНастроек =  Б24_К_ОбщегоНазначенияВызовСервера.СформироватьСтруктуруНастроек(НастройкаПодключения, Истина);  
	Если СтруктураНастроек = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	СтруктураНастроек.Логирование.Измерение1 = "Служебные операции";
	СтруктураНастроек.Логирование.Измерение2 = "Получение полей данных";
	
	ТелоHTTPЗапроса	= "";
	Итератор 		= 0;
	
	Для каждого ТекЭлемент Из БатчЗапросы Цикл
		
		Итератор = Итератор + 1;
		ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + ТекЭлемент;	
		
		Если Итератор = 50 Тогда
			
			СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);      
			Если СтруктураОтвета = Неопределено Тогда
				Прервать;
			КонецЕсли;  
			
			result = СтруктураОтвета.Получить("result");
			Если result <> Неопределено Тогда
				result2 = result.Получить("result");
				Если result2 <> Неопределено Тогда
					Для каждого ТекСтрока Из result2 Цикл
						Результат.Добавить(ТекСтрока);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
			ТелоHTTPЗапроса = "";
			Итератор 		= 0;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Если ТелоHTTPЗапроса <> "" Тогда
		
		СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);
		Если СтруктураОтвета = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;    
		
		result = СтруктураОтвета.Получить("result");
		Если result <> Неопределено Тогда
			result2 = result.Получить("result");
			Если result2 <> Неопределено Тогда
				Для каждого ТекСтрока Из result2 Цикл
					Результат.Добавить(ТекСтрока);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции	

Функция ПолучитьДанныеСПортала(СтруктураНастроек, Метод)
	
	Результат = Новый Массив;
	
	СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПортал(СтруктураНастроек, Метод, ""); 
	Если СтруктураОтвета = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если СтруктураОтвета.Получить("result") <> Неопределено Тогда
		Для каждого ТекЭлемент Из СтруктураОтвета.Получить("result") Цикл
			Результат.Добавить(ТекЭлемент);
		КонецЦикла;
	КонецЕсли;
	
	Следующие = СтруктураОтвета.Получить("next"); 
	Пока ЗначениеЗаполнено(Следующие) Цикл
		
		Следующие = Формат(Следующие, "ЧГ=0");
	
		ТелоHTTPЗапроса = "&start="+Следующие;	
		
		СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПортал(СтруктураНастроек, Метод, ТелоHTTPЗапроса); 
		Если СтруктураОтвета = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Если СтруктураОтвета.Получить("result") <> Неопределено Тогда
			Для каждого ТекЭлемент Из СтруктураОтвета.Получить("result") Цикл
				Результат.Добавить(ТекЭлемент);
			КонецЦикла;
		КонецЕсли;
		
	   Следующие = СтруктураОтвета.Получить("next");
	   
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция КлючиСлужебныхПользовательскихПолей()

	Результат = Новый Массив;
	Результат.Добавить("UF_LOGO");
	Результат.Добавить("UF_ACCOUNTANT_SIGN");
	Результат.Добавить("UF_STAMP");
	Результат.Добавить("UF_DIRECTOR_SIGN");

	Возврат Результат;

КонецФункции  

#КонецОбласти

#КонецЕсли
