&НаКлиенте
Перем мТипыЗадачСкрытоеМеню;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мТипыЗадачСкрытоеМеню = Новый Массив;
	мТипыЗадачСкрытоеМеню.Добавить(ПредопределенноеЗначение("Перечисление.ОбъектыЗадач.ПодготовитьОзнакомительныйВыезд"));
	мТипыЗадачСкрытоеМеню.Добавить(ПредопределенноеЗначение("Перечисление.ОбъектыЗадач.СоздатьЗапускВРаботу"));

	Заголовок = Строка(Объект.ТипЗадачи);
	
	Элементы.Основание.Видимость = ЗначениеЗаполнено(Объект.Основание);
	
	ДобавитьДополнительныеРеквизиты(); 
	
	ВидимостьЭлементов();
	
	Если Объект.Выполнена Тогда
	
		ЭтаФорма.ТолькоПросмотр = Истина;	
	
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВидимостьЭлементов()

	
	Если НЕ мТипыЗадачСкрытоеМеню.Найти(Объект.ТипЗадачи) = Неопределено Тогда
	
		КоманднаяПанель.Видимость =	Ложь;	
	
	КонецЕсли;
	
	Элементы.ДекорацияВыполнена.Видимость 	= Объект.Выполнена;
	Элементы.Назначение.Видимость 			= ЗначениеЗаполнено(Объект.Назначение);
	Элементы.Основание.Видимость 			= ЗначениеЗаполнено(Объект.Основание);

КонецПроцедуры // ВидимостьЭлементов()


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//АнализПодготовительногоВыезда();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьДополнительныеРеквизиты()

	Если НЕ мТипыЗадачСкрытоеМеню.Найти(Объект.ТипЗадачи) = Неопределено Тогда
		
		ДобавитьДополнительныеРеквизитыНаСервере();			
		
	КонецЕсли;	
	
КонецПроцедуры // ДобавитьДополнительныеРеквизиты() ОбщегоНазначения.ЕстьРеквизитОбъекта("СоздатьОзнакомительныйВыезд", Объект.метаданные) 

Процедура ДобавитьДополнительныеРеквизитыНаСервере()

	Если Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ОбъектыЗадач.ПодготовитьОзнакомительныйВыезд") Тогда
		
		Если НЕ ЕстьОзнакомительныйВыезд(Объект.Ссылка) Тогда
			СоздатьКнопку("СоздатьОзнакомительныйВыезд", "Создать ознакомительный выезд");	
		КонецЕсли;
	ИначеЕсли Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ОбъектыЗадач.СоздатьЗапускВРаботу") Тогда
		
		Если НЕ ЕстьЗапускВРаботу(Объект.Ссылка) Тогда
			СоздатьКнопку("СоздатьЗапускВРаботу", "Создать запуск в работу");	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры // ДобавитьДополнительныеРеквизиты()

Процедура СоздатьКнопку(Действие, Заголовок)
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить(Действие);
	НоваяКоманда.Действие 	= "НажатиеКнопки";
	НоваяКоманда.Заголовок 	= Заголовок;
	
	ИмяКнопки 										= Действие;
	КнопкаСоздатьОзнакомительныйВыезд 				= Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), Элементы.ГруппаКоманднаяПанель);
	КнопкаСоздатьОзнакомительныйВыезд.Вид 			= ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаСоздатьОзнакомительныйВыезд.ИмяКоманды 	= Действие;
	
КонецПроцедуры

&НаКлиенте
Процедура НажатиеКнопки(Команда)
	
	Если Команда.Имя = "СоздатьОзнакомительныйВыезд" Тогда
		
		Форма = ПолучитьФорму("Документ.ОзнакомительныйВыезд.ФормаОбъекта");
		
		ДанныеФормы = Форма.Объект;
		
		стПараметры = Новый Структура("Проект, Основание, ТипДокумента", );
		стПараметры.Проект 		= Объект.Проект;
		стПараметры.Основание 	= Объект.Ссылка;
		
		ЗаполнитьДокументНаСервере(ДанныеФормы, стПараметры);
		КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); 	
		
	ИначеЕсли Команда.Имя = "СоздатьЗапускВРаботу" Тогда
		
		Форма = ПолучитьФорму("Документ.ЗапускВРаботу.ФормаОбъекта");
		
		ДанныеФормы = Форма.Объект;
		
		стПараметры = Новый Структура("Проект, Основание, ТипДокумента", );
		стПараметры.Проект 			= Объект.Проект;
		стПараметры.Основание 		= Объект.Ссылка;
		стПараметры.ТипДокумента 	= "ЗапускВРаботу";
		
		ЗаполнитьДокументНаСервере(ДанныеФормы, стПараметры);
		КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); 	
		
		
	КонецЕсли;
	
	Форма.Открыть();
	
КонецПроцедуры // СоздатьОзнакомительныйВыезд()


&НаСервереБезКонтекста
Функция ЗаполнитьДокументНаСервере(ДанныеФормы, стПараметры);
	
	Док = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект." + стПараметры.ТипДокумента)); 
	
	Док = Документы[стПараметры.ТипДокумента].СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	ЗаполнитьЗначенияСвойств(Док, стПараметры);
	
	ЗначениеВДанныеФормы(Док, ДанныеФормы); 
	
КонецФункции


Функция ЕстьОзнакомительныйВыезд(СсылкаНаЗадачу)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОзнакомительныйВыезд.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОзнакомительныйВыезд КАК ОзнакомительныйВыезд
		|ГДЕ
		|	ОзнакомительныйВыезд.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", СсылкаНаЗадачу);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
    Если Выборка.Количество() = 0 Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ЕстьОзнакомительныйВыезд()


Функция ЕстьЗапускВРаботу(СсылкаНаЗадачу)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗапускВРаботу.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗапускВРаботу КАК ЗапускВРаботу
		|ГДЕ
		|	ЗапускВРаботу.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", СсылкаНаЗадачу);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
    Если Выборка.Количество() = 0 Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ЕстьЗапускВРаботу()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеЗамеров" Тогда
		
		Если Тип("ДокументСсылка.ОзнакомительныйВыезд") = ТипЗнч(Параметр) Тогда
			
			ИмяКнопки = "СоздатьОзнакомительныйВыезд";
			
		ИначеЕсли Тип("ДокументСсылка.ЗапускВРаботу") = ТипЗнч(Параметр) Тогда
			
			ИмяКнопки = "СоздатьЗапускВРаботу";
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
			Если НЕ Элементы.Найти(ИмяКнопки) = Неопределено Тогда
				
				Элементы[ИмяКнопки].Видимость 			= Ложь;	
				Элементы.ДекорацияВыполнена.Видимость 	= Истина;
				
			КонецЕсли;
			
		
	КонецЕсли;
	
КонецПроцедуры


 