//ТипАктивности = "РедактироватьПлан"

Функция ПолучитьПользователяАктивности(ТипАктивности, Проект) Экспорт
	
	ДанныеАктивности = Новый Структура("Активность, Пользователь, ВремяАктивности", 
										Ложь,
										Справочники.Пользователи.ПустаяСсылка(),
										Дата(1, 1, 1));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктивностьПользователей.ВремяАктивности КАК ВремяАктивности,
		|	АктивностьПользователей.Пользователь КАК Пользователь,
		|	АктивностьПользователей.СтатусАктивности КАК Активность
		|ИЗ
		|	РегистрСведений.АктивностьПользователей КАК АктивностьПользователей
		|ГДЕ
		|	АктивностьПользователей.ТипАктивности = &ТипАктивности
		|	И АктивностьПользователей.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Проект", 		Проект);
	Запрос.УстановитьПараметр("ТипАктивности", 	ТипАктивности);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеАктивности, Выборка); 
	КонецЦикла;
	
	Возврат ДанныеАктивности;

КонецФункции // ПолучитьПользователяАктивности()

Функция УстановитьПользователяАктивности(ТипАктивности, Проект, Пользователь) Экспорт
	
	Попытка
		
		НачатьТранзакцию();
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.АктивностьПользователей");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ТипАктивности", ТипАктивности);
		ЭлементБлокировки.УстановитьЗначение("Проект", Проект);
		БлокировкаДанных.Заблокировать();
		
		ДанныеАктивности = ПолучитьПользователяАктивности(ТипАктивности, Проект);
		ДанныеАктивности.Вставить("АктивностьИзменена" ,Ложь);
		
		
		Если ДанныеАктивности.Активность Тогда
			
			Возврат ДанныеАктивности;	
			
		КонецЕсли;
		
		ВремяАктивности 		= ТекущаяДата();
		ТекущийПользователь  	= ПараметрыСеанса.ТекущийПользователь;
		
		МенеджерЗаписи = РегистрыСведений.АктивностьПользователей.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.СтатусАктивности = Истина;
		МенеджерЗаписи.ВремяАктивности 	= ВремяАктивности;
		МенеджерЗаписи.Пользователь 	= ТекущийПользователь; 
		МенеджерЗаписи.Комплект			= Справочники.Композиции.ПустаяСсылка(); 
		МенеджерЗаписи.Проект			= Проект; 
		МенеджерЗаписи.ТипАктивности 	= ТипАктивности;
		
		МенеджерЗаписи.Записать();
		
		ДанныеАктивности.АктивностьИзменена = Истина;
		ДанныеАктивности.Активность 		= Истина;
		ДанныеАктивности.Пользователь 		= ТекущийПользователь;
		ДанныеАктивности.ВремяАктивности	= ВремяАктивности;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ДанныеАктивности;
КонецФункции // ПолучитьПользователяАктивности()


Процедура ОчиститьАктивностьРедактироватьПлан() Экспорт
	
	МенеджерЗаписи = РегистрыСведений.АктивностьПользователей.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ТипАктивности 	= "РедактироватьПлан";
	МенеджерЗаписи.Пользователь 	= ПараметрыСеанса.ТекущийПользователь;
	
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры
