
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Проект) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПриложенияКДоговорам.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ПриложенияКДоговорам КАК ПриложенияКДоговорам
		|ГДЕ
		|	ПриложенияКДоговорам.Ссылка <> &Ссылка
		|	И ПриложенияКДоговорам.Проект = &Проект
		|	И ПриложенияКДоговорам.ЭтоГруппа = ИСТИНА";
	
	Запрос.УстановитьПараметр("Проект", ТекущийОбъект.Проект);
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Сообщить("Уже существует каталог " + Выборка.Наименование + " с сделкой " + ТекущийОбъект.Проект);
		Отказ = Истина;
	КонецЦикла;
КонецПроцедуры
