
Функция ВернутьТолькоБуквыИЦифры(ИсходнаяСтрока, ПерваяНеЦифра = Истина, ДопустимыеСимволы = "") Экспорт
	АлфавитЛат 	= "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	АлфавитРус 	= "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЬЫЪЭЮЯ";
	Цифры 		= "0123456789_";
	
	Если НЕ ПустаяСтрока(ДопустимыеСимволы) Тогда
	
		Цифры = Цифры + ДопустимыеСимволы;
	
	КонецЕсли;
	
	текСтрока = СокрЛП(ИсходнаяСтрока);
	СтрокаВозврата = "";
	НайденаБуква = Ложь;
	
	ДлинаСтроки = СтрДлина(текСтрока);
	
	Для счетчик = 1 По ДлинаСтроки Цикл
		текСимвол = Сред(текСтрока,счетчик,1);
		
		Если ПерваяНеЦифра И НЕ НайденаБуква Тогда
			Если СтрНайти(Цифры,текСимвол) > 0 Тогда
				Продолжить;	
			КонецЕсли;	
			
			НайденаБуква = Истина;	
		КонецЕсли;
		
		
		Если СтрНайти(Цифры,текСимвол) > 0 Тогда
			СтрокаВозврата = СтрокаВозврата + текСимвол;
		Иначе	
			текСимволВРег = ВРег(текСимвол);
			Если СтрНайти(АлфавитРус,текСимволВРег) > 0 Тогда
				СтрокаВозврата = СтрокаВозврата + текСимвол; 
			ИначеЕсли СтрНайти(АлфавитРус,текСимволВРег) > 0 Тогда
				СтрокаВозврата = СтрокаВозврата + текСимвол; 
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрокаВозврата;
	
КонецФункции // ВернутьТолькоБуквыИЦифры()

Функция ДобавитьРазделительНеПустойСтроке(текСтрока,Разделитель = ", ") Экспорт
	
	Если НЕ ПустаяСтрока(текСтрока) Тогда
		текСтрока = текСтрока + Разделитель;
	КонецЕсли;	
	
	Возврат текСтрока;
	
КонецФункции // ДобавитьРазделительНеПустойСтроке()

Функция ОставитьТолькоЦифры(ИсходнаяСтрока, Ошибка = Ложь) Экспорт
	Цифры = "0123456789";
	
	ЕстьРазделитель = Ложь;
	
	текСтрока = СокрЛП(ИсходнаяСтрока);
	ДлинаСтроки = СтрДлина(текСтрока);
	
	РезультатСтрокой = "";
	
	Для счетчик = 1 По ДлинаСтроки Цикл
		текСимвол = Сред(текСтрока,счетчик,1);
		
		Если текСимвол = "-" И счетчик = 1 Тогда
			РезультатСтрокой = "-";
		ИначеЕсли (текСимвол = "." ИЛИ текСимвол = ",") И НЕ ЕстьРазделитель Тогда
			РезультатСтрокой = РезультатСтрокой + ".";
			ЕстьРазделитель = Истина;
		ИначеЕсли СтрНайти(Цифры, текСимвол) > 0 Тогда
			РезультатСтрокой = РезультатСтрокой + текСимвол;
		Иначе	
			Ошибка = Истина;
			РезультатСтрокой = "0";
			Прервать;
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат РезультатСтрокой;
	
КонецФункции // ОставитьТИолькоЦифры()
