&НаКлиенте
Перем НачалоПериод;

#Область Команды

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура СледующийИнтерал(Команда)
	ЭтаФорма.Период.ДатаНачала = НачалоДня(ЭтаФорма.Период.ДатаОкончания + 24 * 3600);
	ЭтаФорма.Период.ДатаОкончания = омДаты.ПолучитьДатуОтИнтервала(ЭтаФорма.Интервал, ЭтаФорма.Период.ДатаНачала);
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущийИнтервал(Команда)
	ЭтаФорма.Период.ДатаОкончания = НачалоДня(ЭтаФорма.Период.ДатаНачала - 24 * 3600);
	ЭтаФорма.Период.ДатаНачала = омДаты.ПолучитьДатуОтИнтервала(ЭтаФорма.Интервал, ЭтаФорма.Период.ДатаОкончания,Ложь);
	СформироватьОтчет();
КонецПроцедуры
	
#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНастройки();
	СформироватьПериод();
	СформироватьОтчет();
КонецПроцедуры


&НаСервере
Функция СформироватьПериод()
	ЭтаФорма.Период.ДатаНачала = НачалоДня(ТекущаяДата());
	ЭтаФорма.Период.ДатаОкончания = омДаты.ПолучитьДатуОтИнтервала(ЭтаФорма.Интервал, ЭтаФорма.Период.ДатаНачала);
КонецФункции // СформироватьПериод()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачалоПериод = ЭтаФорма.Период;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки()
	стНастройки = Новый Массив(1);
	стНастройки[0] = "ПериодЗагрузкаКонструкторскогоОтдела";
	
	стНастройки = омКанбан.ПолучитьНастройкиКанбан(стНастройки);
	
	Если стНастройки.Свойство("ПериодЗагрузкаКонструкторскогоОтдела") Тогда
		ЭтаФорма.Интервал = стНастройки.ПериодЗагрузкаКонструкторскогоОтдела;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьНастройки()

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если НЕ НачалоПериод = ЭтаФорма.Интервал Тогда
		ЗаписатьНаСервереНастройки("ПериодЗагрузкаКонструкторскогоОтдела", ЭтаФорма.Интервал);
	КонецЕсли;
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ЗаписатьНаСервереНастройки(НаименованиеНастройки,ЗначениеНастройки)
	РегистрыСведений.НастройкиКанбан.ЗаписатьНастройку(НаименованиеНастройки,ЗначениеНастройки);
КонецПроцедуры // ЗаписатьНаСервереНастройки()


&НаКлиенте
Процедура ДиаграммаПриОкончанииРедактированияИнтервала(Элемент, ИнтервалГранта, ОтменаРедактирования)
	УстановитьТекстЗначения(ИнтервалГранта.Значение.Текст, ИнтервалГранта.Начало, ИнтервалГранта.Конец);	
КонецПроцедуры  

#Область Служебные

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекстЗначения(Текст, ДатаНачала, ДатаОкончания)
	Текст = Формат(ДатаНачала, "ДЛФ=DDT") + " - " + Формат(ДатаОкончания, "ДЛФ=DDT");	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура СформироватьОтчет()
	ЗаполнитьДанныеДиаграммы();	
	ПостроитьДиаграммуГанта();
КонецПроцедуры 

&НаСервере
Процедура ПостроитьДиаграммуГанта() 
	
	// ТЗ для связей
	Связи = Новый ТаблицаЗначений;
	Связи.Колонки.Добавить("ПредшественникНомер");
	Связи.Колонки.Добавить("Интервал");	
	
	Диаграмма.Очистить();
	
	// Будет 2 серии - план, факт
	СерияПлан = Диаграмма.Серии.Добавить();
	СерияПлан.Текст = "План";
	СерияПлан.Цвет = WebЦвета.СинеФиолетовый;
	
	СерияФакт = Диаграмма.Серии.Добавить();
	СерияФакт.Текст = "Факт";
	СерияФакт.Цвет = WebЦвета.КрасноФиолетовый;
	
	
	// Пример иерархии, создаем верхний уровень "Демо"
	ДобавитьДемоИнтервалы(СерияПлан);
	

	Для Каждого СтрокаТЧЗадачи Из ТЗЗадачи Цикл 
		
		Точка = Диаграмма.УстановитьТочку(СтрокаТЧЗадачи.Этап, "Демо"); // Родитель = "Демо"
		Точка.Текст = СтрокаТЧЗадачи.Этап;
		Точка.Картинка = БиблиотекаКартинок.Реквизит;
		
		
		// *****************************
		// Добавляем интервал серии план				
		
		Значение = Диаграмма.ПолучитьЗначение(Точка, СерияПлан);
		Значение.Редактирование = Истина;
		
		ИнтервалГранта = Значение.Добавить();
		ИнтервалГранта.Начало = СтрокаТЧЗадачи.ДатаНачалаПлан;
		ИнтервалГранта.Конец = СтрокаТЧЗадачи.ДатаОкончанияПлан;
		ИнтервалГранта.Текст = "Интервал план";
		
		УстановитьТекстЗначения(Значение.Текст, СтрокаТЧЗадачи.ДатаНачалаПлан, СтрокаТЧЗадачи.ДатаОкончанияПлан);   

		// Строить связи будем только по серии план
		
		// Создаем заранее сохраненную связь в ТЗ связи (ищем интервал предшесвенник в ТЗ)
		Если СтрокаТЧЗадачи.Предшественник <> 0 Тогда 
			Отбор = Новый Структура("ПредшественникНомер", СтрокаТЧЗадачи.НомерСтроки);
			НайденныеСтроки = Связи.НайтиСтроки(Отбор);
			
			Для Каждого НайденненнаяСвязь Из НайденныеСтроки Цикл 
				НайденненнаяСвязь.Интервал.Добавить(ИнтервалГранта);	
			КонецЦикла;
			
		КонецЕсли;

		// Если текущий интервал является предшественником для добавленных в будущем в цикле интервалов
		// тогда сохраняем связь в ТЗ связи
		Отбор = Новый Структура("Предшественник", СтрокаТЧЗадачи.НомерСтроки);
		НайденныеСтроки = ТЗЗадачи.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки <> 0 Тогда 
			Для Каждого НайденненнаяСвязь Из НайденныеСтроки Цикл 
				НоваяСвязь = Связи.Добавить();
				НоваяСвязь.ПредшественникНомер = НайденненнаяСвязь.НомерСтроки;
				НоваяСвязь.Интервал = ИнтервалГранта;
			КонецЦикла;
		КонецЕсли;
		
		
		// *****************************
		// Добавляем интервал серии факт
				
		Значение = Диаграмма.ПолучитьЗначение(Точка, СерияФакт);	
		ИнтервалГранта = Значение.Добавить();
		ИнтервалГранта.Начало = СтрокаТЧЗадачи.ДатаНачалаФакт;
		ИнтервалГранта.Конец = СтрокаТЧЗадачи.ДатаОкончанияФакт;
		ИнтервалГранта.Текст = "Интервал факт";
		
	КонецЦикла;
	

	// Метки времени. Добавляем метку времени их можно добавлять несколько на разные шкалы времени
	
	Шкала = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы[1];
	
	МеткаВремени = Шкала.Метки.Добавить(НачалоДня(ТекущаяДата()));
	МеткаВремени.Текст = "Текущая дата " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	МеткаВремени.ЦветТекста = WebЦвета.Красный;				
	МеткаВремени.ЦветЛинии = WebЦвета.Красный;
	
	
	// Фон, выделяем выходные	
	ТекущийПериод = НачалоМесяца(Диаграмма.НачалоПолногоИнтервала - 1);
	КонечныйПериода = Диаграмма.КонецПолногоИнтервала;
	
	Пока ТекущийПериод < КонечныйПериода Цикл 
		Если КонецНедели(ТекущийПериод) = КонецДня(ТекущийПериод) Тогда 
			ИнтервалФона = Диаграмма.ИнтервалыФона.Добавить(НачалоДня(ТекущийПериод - 86400), КонецДня(ТекущийПериод));
			ИнтервалФона.Цвет = WebЦвета.БледноЛиловый;
		КонецЕсли;
		
		ТекущийПериод = КонецДня(ТекущийПериод) + 1;	
	КонецЦикла;
	
	
	
	// Получаем верхнюю точку "Демо" и разворачиваем иерархию
	Точка = Диаграмма.УстановитьТочку("Демо");
	Диаграмма.РазвернутьТочку(Точка, Истина);
КонецПроцедуры

&НаСервере
Процедура ДобавитьДемоИнтервалы(Серия)
		
	Точка = Диаграмма.Точки.Добавить();
	Точка.Текст = "Демо";
	Точка.Значение = "Демо";
	Точка.Картинка = БиблиотекаКартинок.СводнаяДиаграмма;
	
	
	Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		
	ТекущийПериод = НачалоГода(ТекущаяДата());
	
	Для Итерация = 1 По 25 Цикл 
		
		ЦветИнтервала = Новый Цвет(Итерация * 10, Итерация * 10, Итерация * 10);
		
		ИнтервалГранта = Значение.Добавить();
		ИнтервалГранта.Цвет = ЦветИнтервала;
		ИнтервалГранта.Начало = НачалоДня(ТекущийПериод);
		ИнтервалГранта.Конец = КонецДня(ТекущийПериод);
			
		
		ТекущийПериод = КонецДня(ТекущийПериод) + 1;
	КонецЦикла;
	
	
	Палира = Новый Массив;
	Палира.Добавить(WebЦвета.Красный);
	Палира.Добавить(WebЦвета.Оранжевый);
	Палира.Добавить(WebЦвета.Желтый);
	Палира.Добавить(WebЦвета.Зеленый);
	Палира.Добавить(WebЦвета.Голубой);
	Палира.Добавить(WebЦвета.Синий);
	Палира.Добавить(WebЦвета.Фиолетовый);
	
	
	Для Итерация = 0 По 6 Цикл 
		
		ИнтервалГранта = Значение.Добавить();
		ИнтервалГранта.Цвет = Палира[Итерация];
		ИнтервалГранта.Начало = НачалоДня(ТекущийПериод);
		ИнтервалГранта.Конец = КонецДня(ТекущийПериод);
				
		
		ТекущийПериод = КонецДня(ТекущийПериод) + 1;
	КонецЦикла;
		
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДиаграммы()

	НачальнаяДата = НачалоГода(ТекущаяДата());
	
	НоваяСтрока = ТЗЗадачи.Добавить();
	НоваяСтрока.НомерСтроки = 1;
	НоваяСтрока.Этап = "Обследование";
	НоваяСтрока.ДатаНачалаПлан 		= НачальнаяДата;
	НоваяСтрока.ДатаОкончанияПлан 	= НачальнаяДата + (86400 * 10);
	НоваяСтрока.ДатаНачалаФакт 		= НачальнаяДата;
	НоваяСтрока.ДатаОкончанияФакт 	= НачальнаяДата + (86400 * 7);
	
	НачальнаяДата = НачальнаяДата + (86400 * 10);
	
	НоваяСтрока = ТЗЗадачи.Добавить();
	НоваяСтрока.НомерСтроки = 2;
	НоваяСтрока.Этап = "Разработка ТЗ";
	НоваяСтрока.Предшественник = 1;
	НоваяСтрока.ДатаНачалаПлан 		= НачальнаяДата;
	НоваяСтрока.ДатаОкончанияПлан 	= НачальнаяДата + (86400 * 15);
	НоваяСтрока.ДатаНачалаФакт 		= НачальнаяДата - (86400 * 3);
	НоваяСтрока.ДатаОкончанияФакт 	= НачальнаяДата + (86400 * 15);
	
	НачальнаяДата = НачальнаяДата + (86400 * 15);
	
	НоваяСтрока = ТЗЗадачи.Добавить();
	НоваяСтрока.НомерСтроки = 3;
	НоваяСтрока.Предшественник = 2;
	НоваяСтрока.Этап = "Программирование";
	НоваяСтрока.ДатаНачалаПлан 		= НачальнаяДата;
	НоваяСтрока.ДатаОкончанияПлан 	= НачальнаяДата + (86400 * 30);
	//НоваяСтрока.ДатаНачалаФакт 		= НачальнаяДата;
	//НоваяСтрока.ДатаОкончанияФакт 	= НачальнаяДата + (86400 * 30);	

КонецПроцедуры // ЗаполнитьДанныеДиаграммы()


