
Функция ПоставитьОбъектВОчередь(ОбъектВыгрузки, ТипОбмена) Экспорт
	
	ДанныеОперации 	= Новый Структура("Результат, ОписаниеОшибки, УИД", Истина, "", "");
	ПустаяДата		= Дата(1, 1, 1);
	
	НачатьТранзакцию();
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОчередьВыгрузкиPDM");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьВыгрузкиPDM.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
		|ГДЕ
		|	ОчередьВыгрузкиPDM.ОбъектВыгрузки = &ОбъектВыгрузки
		|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)
		|	И ОчередьВыгрузкиPDM.ТипОбмена = &ТипОбмена";
		
		Запрос.УстановитьПараметр("ОбъектВыгрузки", ОбъектВыгрузки);
		Запрос.УстановитьПараметр("ТипОбмена", 		ТипОбмена);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДанныеОперации.УИД 				= Выборка.УИД;
			ДанныеОперации.Результат 		= Ложь;
			ДанныеОперации.ОписаниеОшибки 	= "Повторный запуск действия " + ТипОбмена + " для объекта " + ОбъектВыгрузки;
			Возврат ДанныеОперации;
		КонецЦикла;
		
		МенеджерЗаписи 					= РегистрыСведений.ОчередьВыгрузкиPDM.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.УИД 				= Новый УникальныйИдентификатор();
		МенеджерЗаписи.ОбъектВыгрузки 	= ОбъектВыгрузки;
		МенеджерЗаписи.ТипОбмена 		= ТипОбмена;
		МенеджерЗаписи.ЗавершенОбмен 	= ПустаяДата;
		МенеджерЗаписи.Автор 			= ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.ДатаОчередь 		= ТекущаяДата();
		
		МенеджерЗаписи.Записать()
		
	Исключение
		
	    ДанныеОперации.Результат 		= Ложь;
		ДанныеОперации.ОписаниеОшибки 	= ОписаниеОшибки();
		ОтменитьТранзакцию();
		
		Возврат ДанныеОперации;

	КонецПопытки; 
	
	ЗафиксироватьТранзакцию();
	
	Возврат ДанныеОперации;
	
КонецФункции // ДобавитьОбъектВОчередь()

Функция ПолучитьДанныеИзОчереди() Экспорт

	ДанныеОперации 	= Новый Структура("Результат, ОписаниеОшибки, ОбъектВыгрузки", Истина, "");
	
	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОчередьВыгрузкиPDM");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		ТипыВыполняемыхДействий = ТипыВыполняемыхДействий();

	Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОчередьВыгрузкиPDM.ТипОбмена КАК ТипОбмена,
			|	МИНИМУМ(ОчередьВыгрузкиPDM.ДатаОчередь) КАК ДатаОчередь
			|ПОМЕСТИТЬ вт
			|ИЗ
			|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
			|ГДЕ
			|	ОчередьВыгрузкиPDM.НачалоОбмена = ДАТАВРЕМЯ(1, 1, 1)
			|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)
			|	И НЕ ОчередьВыгрузкиPDM.ТипОбмена В (&ТипыВыполняемыхДействий)
			|
			|СГРУППИРОВАТЬ ПО
			|	ОчередьВыгрузкиPDM.ТипОбмена,
			|	ОчередьВыгрузкиPDM.СчетчикДействий
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОчередьВыгрузкиPDM.ОбъектВыгрузки КАК ОбъектВыгрузки,
			|	ОчередьВыгрузкиPDM.ТипОбмена КАК ТипОбмена,
			|	ОчередьВыгрузкиPDM.СчетчикДействий КАК СчетчикДействий,
			|	ОчередьВыгрузкиPDM.УИД КАК УИД
			|ИЗ
			|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
			|		ПО ОчередьВыгрузкиPDM.ДатаОчередь = вт.ДатаОчередь
			|			И ОчередьВыгрузкиPDM.ТипОбмена = вт.ТипОбмена
			|ГДЕ
			|	ОчередьВыгрузкиPDM.НачалоОбмена = ДАТАВРЕМЯ(1, 1, 1)
			|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)
			|	И НЕ ОчередьВыгрузкиPDM.ТипОбмена В (&ТипыВыполняемыхДействий)";
		
		
		Запрос.УстановитьПараметр("ТипыВыполняемыхДействий", ТипыВыполняемыхДействий);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДанныеОперации.Результат = Новый ТаблицаЗначений; 
		
		Строка36 = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36));
		
		ДанныеОперации.Результат.Колонки.Добавить("ОбъектВыгрузки");
		ДанныеОперации.Результат.Колонки.Добавить("ТипОбмена", 		Новый ОписаниеТипов("ПеречислениеСсылка.ТипыОбменаPDM"));
		ДанныеОперации.Результат.Колонки.Добавить("УИД",			Строка36);
		
		Пока Выборка.Следующий() Цикл
			
			Если ДанныеОперации.Результат.Найти(Выборка.ТипОбмена, "ТипОбмена") = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ДанныеОперации.Результат.Добавить(), Выборка);
			Иначе
				Продолжить;
			КонецЕсли;
		
			МенеджерЗаписи = РегистрыСведений.ОчередьВыгрузкиPDM.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.УИД = Выборка.УИД;
			МенеджерЗаписи.Прочитать();
			
			МенеджерЗаписи.НачалоОбмена = ТекущаяДата();
			
			МенеджерЗаписи.Записать();
		
		КонецЦикла;
		
	Исключение
		
	    ДанныеОперации.Результат 		= Ложь;
		ДанныеОперации.ОписаниеОшибки 	= ОписаниеОшибки();

		ОтменитьТранзакцию();
		
		Возврат ДанныеОперации;
		
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
 	Возврат ДанныеОперации;

КонецФункции // ПолучитьДанныеИзОчереди() 

Функция ТипыВыполняемыхДействий()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОчередьВыгрузкиPDM.ТипОбмена КАК ТипОбмена
		|ИЗ
		|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
		|ГДЕ
		|	НЕ ОчередьВыгрузкиPDM.НачалоОбмена = ДАТАВРЕМЯ(1, 1, 1)
		|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)";
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТипОбмена");
	
КонецФункции // ТипыВыполняемыхДействий()

Функция ОтметкаОВыполнении(УИД)

	НачатьТранзакцию();
	
	ДанныеОперации 	= Новый Структура("Результат, ОписаниеОшибки", Истина, "");
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОчередьВыгрузкиPDM");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("УИД", 	УИД);
		БлокировкаДанных.Заблокировать();
		
		
		МенеджерЗаписи 		= РегистрыСведений.ОчередьВыгрузкиPDM.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.УИД 	= УИД;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			МенеджерЗаписи.ЗавершенОбмен = ТекущаяДата();
			МенеджерЗаписи.Записать();
			
		КонецЕсли;
		
		
	Исключение
		
	    ДанныеОперации.Результат 		= Ложь;
		ДанныеОперации.ОписаниеОшибки 	= ОписаниеОшибки(); 
		
		ОтменитьТранзакцию();
		
		Возврат ДанныеОперации;

	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	Возврат ДанныеОперации;

КонецФункции

Функция НуженКонтрольНовыхФайловОтвета() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОчередьВыгрузкиPDM.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
		|ГДЕ
		|	НЕ ОчередьВыгрузкиPDM.НачалоОбмена = ДАТАВРЕМЯ(1, 1, 1)
		|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции // НуженКонтрольНовыхФайловОтвета()

Функция ВернутьДействиеВОчередь(УИД) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОчередьВыгрузкиPDM.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УИД = УИД;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.УИД 				= УИД;
	МенеджерЗаписи.НачалоОбмена 	= ТекущаяДата();
	МенеджерЗаписи.СчетчикДействий 	= МенеджерЗаписи.СчетчикДействий + 1;
	
	МенеджерЗаписи.Записать();
	
КонецФункции // ВернутьДействиеВОчередь(УИД)

Функция СоздатьЗаписьВЛог(УИД, ОписаниеОшибки, ЗавершитьЗадачу = Истина) Экспорт

    МенеджерЗаписи = РегистрыСведений.ОшибкиВыгрузкиPDM.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УИД 				= УИД;
	МенеджерЗаписи.Дата 			= ТекущаяДата();
	МенеджерЗаписи.ОписаниеОшибки 	= ОписаниеОшибки;
	
	МенеджерЗаписи.Записать(); 
	
	МенеджерЗаписи = РегистрыСведений.ОчередьВыгрузкиPDM.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УИД = УИД;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() И ЗавершитьЗадачу Тогда
	
		МенеджерЗаписи.ЗавершенОбмен = ТекущаяДата();
		МенеджерЗаписи.Записать();
	
	КонецЕсли;

КонецФункции // СоздатьЗаписьВЛог()

Процедура ЗавершитьДействие(ТипыОбменаPDM) Экспорт

	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОчередьВыгрузкиPDM");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОчередьВыгрузкиPDM.УИД КАК УИД
			|ИЗ
			|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
			|ГДЕ
			|	НЕ ОчередьВыгрузкиPDM.НачалоОбмена = ДАТАВРЕМЯ(1, 1, 1)
			|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)
			|	И ОчередьВыгрузкиPDM.ТипОбмена = &ТипыОбменаPDM";
		
		
		Запрос.УстановитьПараметр("ТипыОбменаPDM", ТипыОбменаPDM);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			МенеджерЗаписи 		= РегистрыСведений.ОчередьВыгрузкиPDM.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.УИД 	= Выборка.УИД;
			МенеджерЗаписи.Прочитать();
			
			МенеджерЗаписи.ЗавершенОбмен = ТекущаяДата();
			
			МенеджерЗаписи.Записать();
		
		КонецЦикла;
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Возврат;
		
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	

КонецПроцедуры

Процедура ЗавершитьДействиеСОшибкой(ТипыОбменаPDM, ОписаниеОшибки) Экспорт

	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОчередьВыгрузкиPDM");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОчередьВыгрузкиPDM.УИД КАК УИД1
			|ИЗ
			|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
			|ГДЕ
			|	НЕ ОчередьВыгрузкиPDM.НачалоОбмена = ДАТАВРЕМЯ(1, 1, 1)
			|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)
			|	И ОчередьВыгрузкиPDM.ТипОбмена = &ТипыОбменаPDM";
		
		
		Запрос.УстановитьПараметр("ТипыОбменаPDM", ТипыОбменаPDM);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СоздатьЗаписьВЛог(Выборка.УИД, ОписаниеОшибки);
		
		КонецЦикла;
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Возврат;
		
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	

КонецПроцедуры


Функция СостояниеДействия(ОбъектВыгрузки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ОчередьВыгрузкиPDM.ДатаОчередь) КАК ДатаОчередь
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
		|ГДЕ
		|	ОчередьВыгрузкиPDM.ОбъектВыгрузки = &ОбъектВыгрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОчередьВыгрузкиPDM.Автор КАК Автор,
		|	ОчередьВыгрузкиPDM.ЗавершенОбмен КАК ЗавершенОбмен,
		|	ОчередьВыгрузкиPDM.ТипОбмена КАК ТипОбмена,
		|	ОчередьВыгрузкиPDM.ДатаОчередь КАК ДатаОчередь,
		|	ЕСТЬNULL(ОшибкиВыгрузкиPDM.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОшибки,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ОшибкиВыгрузкиPDM.ОписаниеОшибки, """") КАК СТРОКА(100)) КАК ОписаниеОшибки,
		|	ОчередьВыгрузкиPDM.НачалоОбмена КАК НачалоОбмена
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОшибкиВыгрузкиPDM КАК ОшибкиВыгрузкиPDM
		|			ПО ОчередьВыгрузкиPDM.УИД = ОшибкиВыгрузкиPDM.УИД
		|		ПО вт.ДатаОчередь = ОчередьВыгрузкиPDM.ДатаОчередь
		|ГДЕ
		|	ОчередьВыгрузкиPDM.ОбъектВыгрузки = &ОбъектВыгрузки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОчередьВыгрузкиPDM.Автор,
		|	ОчередьВыгрузкиPDM.ТипОбмена,
		|	ОчередьВыгрузкиPDM.ЗавершенОбмен,
		|	ОчередьВыгрузкиPDM.ДатаОчередь,
		|	ЕСТЬNULL(ОшибкиВыгрузкиPDM.Дата, ДАТАВРЕМЯ(1, 1, 1)),
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ОшибкиВыгрузкиPDM.ОписаниеОшибки, """") КАК СТРОКА(100)),
		|	ОчередьВыгрузкиPDM.НачалоОбмена
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОшибки УБЫВ";
	
	Запрос.УстановитьПараметр("ОбъектВыгрузки", ОбъектВыгрузки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СостояниеДействия = Новый Структура("ДатаОчередь, Автор, ТипОбмена, ЗавершенОбмен, НачалоОбмена, ОписаниеОшибки", Дата(1, 1, 1));
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СостояниеДействия, Выборка);
	КонецЦикла;
	
	Возврат СостояниеДействия;

КонецФункции // СостоЯнимеДействия()
