
Функция ПоставитьОбъектВОчередь(ОбъектВыгрузки, ТипОбмена) Экспорт
	
	ДанныеОперации 	= Новый Структура("Результат, ОписаниеОшибки", Истина, "");
	ПустаяДата		= Дата(1, 1, 1);
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОчередьВыгрузкиPDM");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ОбъектВыгрузки", 	ОбъектВыгрузки);
		ЭлементБлокировки.УстановитьЗначение("ЗавершенОбмен", 	ПустаяДата);
		ЭлементБлокировки.УстановитьЗначение("НачалоОбмена", 	ПустаяДата);
		БлокировкаДанных.Заблокировать();
		
		МенеджерЗаписи 					= РегистрыСведений.ОчередьВыгрузкиPDM.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ОбъектВыгрузки 	= ОбъектВыгрузки;
		МенеджерЗаписи.ТипОбмена 		= ТипОбмена;
		МенеджерЗаписи.ЗавершенОбмен 	= ПустаяДата;
		МенеджерЗаписи.Автор 			= ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.ДатаОчередь 		= ТекущаяДата();
		
		МенеджерЗаписи.Записать()
		
	Исключение
		
	    ДанныеОперации.Результат 		= Ложь;
		ДанныеОперации.ОписаниеОшибки 	= ОписаниеОшибки();

	КонецПопытки;
	
	Возврат ДанныеОперации;
	
КонецФункции // ДобавитьОбъектВОчередь()

Функция ПолучитьДанныеИзОчереди() Экспорт

	ДанныеОперации 	= Новый Структура("Результат, ОписаниеОшибки, ОбъектВыгрузки", Истина, "");
	ПустаяДата		= Дата(1, 1, 1);
	
	ТипыВыполняемыхДействий = ТипыВыполняемыхДействий();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОчередьВыгрузкиPDM");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ЗавершенОбмен", 	ПустаяДата);
		ЭлементБлокировки.УстановитьЗначение("НачалоОбмена", 	ПустаяДата);
		БлокировкаДанных.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОчередьВыгрузкиPDM.ТипОбмена КАК ТипОбмена,
			|	МИНИМУМ(ОчередьВыгрузкиPDM.ДатаОчередь) КАК ДатаОчередь,
			|	ОчередьВыгрузкиPDM.СчетчикДействий КАК СчетчикДействий
			|ПОМЕСТИТЬ вт
			|ИЗ
			|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
			|ГДЕ
			|	ОчередьВыгрузкиPDM.НачалоОбмена = ДАТАВРЕМЯ(1, 1, 1)
			|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)
			|	И НЕ ОчередьВыгрузкиPDM.ТипОбмена В (&ТипыВыполняемыхДействий)
			|
			|СГРУППИРОВАТЬ ПО
			|	ОчередьВыгрузкиPDM.ТипОбмена,
			|	ОчередьВыгрузкиPDM.СчетчикДействий
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОчередьВыгрузкиPDM.ОбъектВыгрузки КАК ОбъектВыгрузки,
			|	ОчередьВыгрузкиPDM.ТипОбмена КАК ТипОбмена,
			|	ОчередьВыгрузкиPDM.УИД КАК УИД
			|ИЗ
			|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
			|		ПО ОчередьВыгрузкиPDM.ДатаОчередь = вт.ДатаОчередь
			|			И ОчередьВыгрузкиPDM.ТипОбмена = вт.ТипОбмена
			|ГДЕ
			|	ОчередьВыгрузкиPDM.НачалоОбмена = ДАТАВРЕМЯ(1, 1, 1)
			|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)";
		
		Запрос.УстановитьПараметр("ТипыВыполняемыхДействий", ТипыВыполняемыхДействий);
		
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДанныеОперации.Результат = Новый ТаблицаЗначений; 
		
		Строка36 = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36));
		
		ДанныеОперации.Результат.Колонки.Добавить("ОбъектВыгрузки");
		ДанныеОперации.Результат.Колонки.Добавить("ТипОбмена", 		Новый ОписаниеТипов("ПеречислениеСсылка.ТипыОбменаPDM"));
		ДанныеОперации.Результат.Колонки.Добавить("УИД",			Строка36);
		
		Пока Выборка.Следующий() Цикл
			
			Если ДанныеОперации.Результат.Найти(Выборка.ТипОбмена, "ТипОбмена") = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ДанныеОперации.Результат.Добавить(), Выборка);
			Иначе
				Продолжить;
			КонецЕсли;
		
			МенеджерЗаписи = РегистрыСведений.ОчередьВыгрузкиPDM.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.УИД = Выборка.УИД;
			МенеджерЗаписи.Прочитать();
			
			МенеджерЗаписи.НачалоОбмена = ТекущаяДата();
			
			МенеджерЗаписи.Записать();
		
		КонецЦикла;
		
	Исключение
		
	    ДанныеОперации.Результат 		= Ложь;
		ДанныеОперации.ОписаниеОшибки 	= ОписаниеОшибки();

	КонецПопытки; 
	
	Возврат ДанныеОперации;

КонецФункции // ПолучитьДанныеИзОчереди() 

Функция ТипыВыполняемыхДействий()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОчередьВыгрузкиPDM.ТипОбмена КАК ТипОбмена
		|ИЗ
		|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
		|ГДЕ
		|	НЕ ОчередьВыгрузкиPDM.НачалоОбмена = ДАТАВРЕМЯ(1, 1, 1)
		|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)";
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТипОбмена");
	
КонецФункции // ТипыВыполняемыхДействий()

Функция ОтметкаОВыполнении(УИД)

	ДанныеОперации 	= Новый Структура("Результат, ОписаниеОшибки", Истина, "");
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОчередьВыгрузкиPDM");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("УИД", 	УИД);
		БлокировкаДанных.Заблокировать();
		
		
		МенеджерЗаписи 		= РегистрыСведений.ОчередьВыгрузкиPDM.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.УИД 	= УИД;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			МенеджерЗаписи.ЗавершенОбмен = ТекущаяДата();
			МенеджерЗаписи.Записать();
			
		КонецЕсли;
		
		
	Исключение
		
	    ДанныеОперации.Результат 		= Ложь;
		ДанныеОперации.ОписаниеОшибки 	= ОписаниеОшибки();

	КонецПопытки; 
	
	Возврат ДанныеОперации;

КонецФункции

Функция НуженКонтрольНовыхФайловОтвета() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОчередьВыгрузкиPDM.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
		|ГДЕ
		|	НЕ ОчередьВыгрузкиPDM.НачалоОбмена = ДАТАВРЕМЯ(1, 1, 1)
		|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции // НуженКонтрольНовыхФайловОтвета()

Функция ВернутьДействиеВОчередь(УИД) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОчередьВыгрузкиPDM.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УИД = УИД;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.УИД 				= УИД;
	МенеджерЗаписи.НачалоОбмена 	= ТекущаяДата();
	МенеджерЗаписи.СчетчикДействий 	= МенеджерЗаписи.СчетчикДействий + 1;
	
	МенеджерЗаписи.Записать();
	
КонецФункции // ВернутьДействиеВОчередь(УИД)

