
Функция ПоставитьОбъектВОчередь(ОбъектВыгрузки, ТипОбмена) Экспорт
	
	ДанныеОперации 	= Новый Структура("Результат, ОписаниеОшибки", Истина, "");
	ПустаяДата		= Дата(1, 1, 1);
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОчередьВыгрузкиPDM");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ОбъектВыгрузки", 	ОбъектВыгрузки);
		ЭлементБлокировки.УстановитьЗначение("ЗавершенОбмен", 	ПустаяДата);
		ЭлементБлокировки.УстановитьЗначение("НачалоОбмена", 	ПустаяДата);
		БлокировкаДанных.Заблокировать();
		
		МенеджерЗаписи 					= РегистрыСведений.ОчередьВыгрузкиPDM.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ОбъектВыгрузки 	= ОбъектВыгрузки;
		МенеджерЗаписи.ТипОбмена 		= ТипОбмена;
		МенеджерЗаписи.ЗавершенОбмен 	= ПустаяДата;
		МенеджерЗаписи.Автор 			= ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.ДатаОчередь 		= ТекущаяДата();
		
		МенеджерЗаписи.Записать()
		
	Исключение
		
	    ДанныеОперации.Результат 		= Ложь;
		ДанныеОперации.ОписаниеОшибки 	= ОписаниеОшибки();

	КонецПопытки;
	
	Возврат ДанныеОперации;
	
КонецФункции // ДобавитьОбъектВОчередь()

Функция ПолучитьДанныеИзОчереди() Экспорт

	ДанныеОперации 	= Новый Структура("Результат, ОписаниеОшибки, ОбъектВыгрузки", Истина, "");
	ПустаяДата		= Дата(1, 1, 1);
	
	ТивыВыполняемыхДействий = ТипыВыполняемыхДействий();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОчередьВыгрузкиPDM");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ЗавершенОбмен", 	ПустаяДата);
		ЭлементБлокировки.УстановитьЗначение("НачалоОбмена", 	ПустаяДата);
		БлокировкаДанных.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьВыгрузкиPDM.ТипОбмена КАК ТипОбмена,
		|	МИНИМУМ(ОчередьВыгрузкиPDM.ДатаОчередь) КАК ДатаОчередь
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
		|
		|СГРУППИРОВАТЬ ПО
		|	ОчередьВыгрузкиPDM.ТипОбмена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОчередьВыгрузкиPDM.ОбъектВыгрузки КАК ОбъектВыгрузки,
		|	ОчередьВыгрузкиPDM.ТипОбмена КАК ТипОбмена,
		|	ОчередьВыгрузкиPDM.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО ОчередьВыгрузкиPDM.ДатаОчередь = вт.ДатаОчередь
		|			И ОчередьВыгрузкиPDM.ТипОбмена = вт.ТипОбмена
		|ГДЕ
		|	ОчередьВыгрузкиPDM.НачалоОбмена = ДАТАВРЕМЯ(1, 1, 1)
		|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ ОчередьВыгрузкиPDM.ТипОбмена В (&ТивыВыполняемыхДействий)";
		
		Запрос.УстановитьПараметр("ТивыВыполняемыхДействий", ТивыВыполняемыхДействий);
		
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		ДанныеОперации.Результат = Результат.СкопироватьКолонки();
		
		Для каждого ДанныеВыгрузки Из ДанныеОперации.Результат Цикл
			
			Если Результат.Найти(Результат.ТипОбмена, "ТипОбмена") = Неопределено Тогда
			
				ЗаполнитьЗначенияСвойств(ДанныеОперации.Результат.Добавить(), ДанныеВыгрузки);
				
			Иначе
				
				Продолжить;
			
			КонецЕсли;
		
			МенеджерЗаписи = РегистрыСведений.ОчередьВыгрузкиPDM.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.УИД = ДанныеВыгрузки.УИД;
			МенеджерЗаписи.Прочитать();
			
			МенеджерЗаписи.НачалоОбмена = ТекущаяДата();
			
			МенеджерЗаписи.Записать();
		
		КонецЦикла;
		
	Исключение
		
	    ДанныеОперации.Результат 		= Ложь;
		ДанныеОперации.ОписаниеОшибки 	= ОписаниеОшибки();

	КонецПопытки; 
	
	Возврат ДанныеОперации;

КонецФункции // ПолучитьДанныеИзОчереди() 

Функция ТипыВыполняемыхДействий()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОчередьВыгрузкиPDM.ТипОбмена КАК ТипОбмена
		|ИЗ
		|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
		|ГДЕ
		|	НЕ ОчередьВыгрузкиPDM.НачалоОбмена = ДАТАВРЕМЯ(1, 1, 1)
		|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)";
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТипОбмена");
	
КонецФункции // ТипыВыполняемыхДействий()

Функция ОтметкаОВыполнении(УИД)

	ДанныеОперации 	= Новый Структура("Результат, ОписаниеОшибки", Истина, "");
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОчередьВыгрузкиPDM");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("УИД", 	УИД);
		БлокировкаДанных.Заблокировать();
		
		
		МенеджерЗаписи 		= РегистрыСведений.ОчередьВыгрузкиPDM.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.УИД 	= УИД;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			МенеджерЗаписи.ЗавершенОбмен = ТекущаяДата();
			МенеджерЗаписи.Записать();
			
		КонецЕсли;
		
		
	Исключение
		
	    ДанныеОперации.Результат 		= Ложь;
		ДанныеОперации.ОписаниеОшибки 	= ОписаниеОшибки();

	КонецПопытки; 
	
	Возврат ДанныеОперации;

КонецФункции

Функция НуженКотрольНовыхФайловОтвета() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОчередьВыгрузкиPDM.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
		|ГДЕ
		|	НЕ ОчередьВыгрузкиPDM.НачалоОбмена = ДАТАВРЕМЯ(1, 1, 1)
		|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции // НуженКотрольНовыхФайловОтвета()
