
Функция ПоставитьОбъектВОчередь(ОбъектВыгрузки, ТипОбмена = Неопределено) Экспорт

	Возврат РегистрыСведений.ОчередьВыгрузкиPDM.ДобавитьОбъектВОчередь(ОбъектВыгрузки, ТипОбмена); 		

КонецФункции // ПоставитьОбъектВОчередь()


Функция ПолучитьДанныеИзОчереди() Экспорт

	ДанныеОперации 	= Новый Структура("ОписаниеОшибки, ОбъектВыгрузки", "");
	ПустаяДата		= Дата(1, 1, 1);
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОчередьВыгрузкиPDM");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ЗавершенОбмен", 	ПустаяДата);
		ЭлементБлокировки.УстановитьЗначение("НачалоОбмена", 	ПустаяДата);
		БлокировкаДанных.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьВыгрузкиPDM.ОбъектВыгрузки КАК ОбъектВыгрузки,
		|	ОчередьВыгрузкиPDM.ТипОбмена КАК ТипОбмена
		|ИЗ
		|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
		|ГДЕ
		|	ОчередьВыгрузкиPDM.НачалоОбмена = ДАТАВРЕМЯ(1, 1, 1)
		|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)";
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
		КонецЦикла;
		
		
	Исключение
		
	    ДанныеОперации.Результат 		= Ложь;
		ДанныеОперации.ОписаниеОшибки 	= ОписаниеОшибки();

	КонецПопытки;

КонецФункции // ПолучитьДанныеИзОчереди()

Процедура ОтметкаОВыполнении()

	

КонецПроцедуры
