//Получает цвет из строки 999999999, где 3 символа определяют копоненту красную, зеленую и синию
Функция ПолучитьЦветИзСтроки(КодЦвета, ВидЦвета = "абсолютный", ЦветПоУмолчаниюБелый = Истина) Экспорт
	Если ЦветПоУмолчаниюБелый Тогда
		ВозратПриОшибке = Новый Цвет(255,255,255);
	Иначе
		ВозратПриОшибке = Новый Цвет(0,0,0);
	КонецЕсли;
	
	Если НЕ ТипЗнч(КодЦвета) = Тип("Строка") ИЛИ ПустаяСтрока(КодЦвета) Тогда
		Возврат ВозратПриОшибке;	
	КонецЕсли;
	
	
	текКодЦвета = СокрЛП(КодЦвета); 
	
	Если НРег(СокрЛП(ВидЦвета)) = "абсолютный" Тогда
		Если НЕ СтрДлина(текКодЦвета) = 9 Тогда
			Возврат ВозратПриОшибке;	
		КонецЕсли;
		Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(текКодЦвета) Тогда
			Возврат ВозратПриОшибке;	
		КонецЕсли;
		
		Возврат Новый Цвет(Лев(КодЦвета,3),Сред(КодЦвета,4,3),Прав(КодЦвета,3));
	КонецЕсли;
	
	Попытка
		Возврат омЦвет.ЗначениеЦветаВСтроку(КодЦвета);
	Исключение
		Возврат ВозратПриОшибке;	
	КонецПопытки;
КонецФункции // ПолучитьЦветИзСтроки() 

&НаСервере
Функция ПолучитьЦветИзСтрокиСПрефиксом(КодЦвета, ЦветПоУмолчаниюБелый = Истина) Экспорт
	Префикс = НРег(Лев(КодЦвета, 1));
	
	КодЦветаБезПрефикса = Сред(КодЦвета, 2);
	
	Если Префикс = "a" Тогда
		текВидЦвета = "абсолютный";
	Иначе
		текВидЦвета = "web";
	КонецЕсли;
	
	Возврат ПолучитьЦветИзСтроки(КодЦветаБезПрефикса, текВидЦвета, ЦветПоУмолчаниюБелый);
КонецФункции // ПолучитьЦветИзСтрокиСПрефиксом() 

&НаСервере
Функция ЗначениеЦветаВСтроку(КодЦвета) Экспорт

	Возврат ЗначениеИзСтрокиВнутр(КодЦвета);	

КонецФункции // ЗначениеЦветаВСтроку()

Функция ПолучитьСтроковоеПредставлениеЦвета(Цвет) Экспорт

	Если Цвет.Вид = ВидЦвета.Абсолютный Тогда
		Возврат "a" + Формат(Цвет.Красный,	"ЧЦ=3; ЧН=000; ЧВН=") 
					+ Формат(Цвет.Зеленый,	"ЧЦ=3; ЧН=000; ЧВН=") 
					+ Формат(Цвет.Синий,	"ЧЦ=3; ЧН=000; ЧВН=");
	Иначе
		Возврат "w" + ЗначениевСтрокуВнутр(Цвет);
	КонецЕсли;

КонецФункции // ПолучитьСтроковоепредставлениеЦвета()

Функция ПолучитьОбъектыДляЦвета() Экспорт

	стОбъектыЦвета = Новый Структура;
	
	мПрефиксыГанта = омГантНастройкаСервер.ПолучитьПрефиксыГанта();
	
	Для каждого х Из омГантНастройкаСервер.НеобходимоеЗначения() Цикл
		ЗаполнитьОбъектЦвета(стОбъектыЦвета, мПрефиксыГанта, х);
	КонецЦикла;
	
    Возврат стОбъектыЦвета; 
	
КонецФункции // ПолучитьОбъектыДляЦвета() 

Процедура ЗаполнитьОбъектЦвета(стОбъектыЦвета, мПрефиксыГанта, НаименованиеОбъекта)
	
	КоличествоПрефиксов = мПрефиксыГанта.Количество();
	мКлючиОбъекта = Новый Массив(КоличествоПрефиксов); 
	
	Для х = 0 По КоличествоПрефиксов - 1 Цикл
		мКлючиОбъекта[х] = мПрефиксыГанта[х] + "%" + НаименованиеОбъекта;
	КонецЦикла;
	
	стОбъектыЦвета.Вставить(НаименованиеОбъекта, мКлючиОбъекта);

КонецПроцедуры // ЗаполнитьОбъектЦвета()

Функция ПолучитьВебПредставленияЦвета(Цвет, ЦветПоУмолчаниюБелый = Истина) Экспорт

	Если ЦветПоУмолчаниюБелый Тогда
		ВозратПриОшибке = "rgb(255, 255, 255)";
	Иначе
		ВозратПриОшибке = "rgb(0, 0, 0)";
	КонецЕсли;
	
	Попытка
		
		Если Тип("Строка") = ТипЗнч(Цвет) Тогда
			
			ЗначениеЦвета = ПолучитьЦветИзСтрокиСПрефиксом(Цвет, ЦветПоУмолчаниюБелый).ПолучитьАбсолютный();	
			
		Иначе
			
			ЗначениеЦвета = Цвет;
			
		КонецЕсли;
		
	Исключение
		ЗначениеЦвета = ВозратПриОшибке;	
	КонецПопытки;
	
	ШаблонСтроки = "rgb(%1, %2, %3)";
	
	Возврат СтрШаблон(ШаблонСтроки, ЗначениеЦвета.Красный, ЗначениеЦвета.Зеленый, ЗначениеЦвета.Синий);
	
КонецФункции // ПолучитьВебПредставленияЦвета()



