
Функция СоздатьДлительноеДействие(ОбъектДействия, НаименованиеДействия) Экспорт

	УИДДействия = Новый УникальныйИдентификатор();
	
	МенеджерЗаписи = РегистрыСведений.ДлительныеДействия.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОбъектДействия 		= ОбъектДействия;
	МенеджерЗаписи.УИДДействия 			= УИДДействия;
	МенеджерЗаписи.АвторДействия 		= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Дата 				= ТекущаяДата();
	МенеджерЗаписи.НаименованиеДействия = НаименованиеДействия;
	
	МенеджерЗаписи.Записать();
	
	Возврат УИДДействия;

КонецФункции // СоздатьДействие()
