
&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	мУдалениеСтрок = Новый Массив;

	тзВременная = Объект.Комплекты.Выгрузить();
	тзДатыПроекта 	= омГантНаСервере.ПолучитьДатыПроекта(Объект.Проект);
	
	Для каждого СтрокаВременная Из тзВременная Цикл
		
		НайденаяСтрока = тзДатыПроекта.Найти(СтрокаВременная.Комплект, "Комплект");
		
		Если НайденаяСтрока = Неопределено Тогда
			мУдалениеСтрок.Добавить(СтрокаВременная);	
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого х Из мУдалениеСтрок Цикл
		тзВременная.Удалить(х);		
	КонецЦикла;
	
	мДобавлениеКомплектов = Новый Массив;

	Для каждого СтрокаДанных Из тзДатыПроекта Цикл
		
		НайденаяСтрока = тзВременная.Найти(СтрокаДанных.Комплект, "Комплект");
		
		Если НайденаяСтрока = Неопределено Тогда
			
			мДобавлениеКомплектов.Добавить(СтрокаДанных.Комплект);

		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаДанных Из мДобавлениеКомплектов Цикл
		
		НС = тзВременная.Добавить();
		НС.Комплект = СтрокаДанных;
		
	КонецЦикла;
			
	
	тзВременная.Сортировать("Комплект"); 
	
	Объект.Комплекты.Загрузить(тзВременная);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ВидимостьЭлементов()
	Элементы.КомплектыЗаполнить.Доступность = ЗначениеЗаполнено(Объект.Проект);	
КонецПроцедуры // ВидимостьЭлементов()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьЭлементов();
КонецПроцедуры


&НаКлиенте
Процедура ПодписьВедущийКонструкторПриИзменении(Элемент)
	
	
	
	Для каждого х Из Объект.Комплекты Цикл
	
	
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПодписатьВедущийКонструктор(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПодписатьМенеджер(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПодписатьНачальникПроизводства(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПодписатьНачальникМонтажа(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
	Если РольДоступна("ПолныеПрава") Тогда
	
		Элементы.ПодписатьВедущийКонструктор.Доступность 	= Истина;	
		Элементы.ПодписатьМенеджер.Доступность 				= Истина;	
		Элементы.ПодписатьНачальникПроизводства.Доступность = Истина;	
		Элементы.ПодписатьНачальникМонтажа.Доступность 		= Истина;
		
		Элементы.КомплектыПродолжительностьТЗ.ТолькоПросмотр				= Ложь;
		Элементы.КомплектыПродолжительностьПроектирования.ТолькоПросмотр	= Ложь;
		Элементы.КомплектыПродолжительностьСогласования.ТолькоПросмотр		= Ложь;
		Элементы.КомплектыПродолжительностьРКД.ТолькоПросмотр				= Ложь;
		Элементы.КомплектыПродолжительностьПроизводства.ТолькоПросмотр		= Ложь;
		Элементы.КомплектыПродолжительностьМонтажа.ТолькоПросмотр			= Ложь;
		
	Иначе
		
		Если РольДоступна("ГлавныйКонструктор") Тогда
			
			Элементы.ПодписатьВедущийКонструктор.Доступность 	= Истина;	
			
			Элементы.КомплектыПродолжительностьТЗ.ТолькоПросмотр				= Ложь;
			Элементы.КомплектыПродолжительностьПроектирования.ТолькоПросмотр	= Ложь;
			Элементы.КомплектыПродолжительностьРКД.ТолькоПросмотр				= Ложь;
			
		КонецЕсли;
	
		Если РольДоступна("Менеджер") Тогда
			
			Элементы.ПодписатьМенеджер.Доступность 				= Истина;
			
			Элементы.КомплектыПродолжительностьСогласования.ТолькоПросмотр		= Ложь;
			
		КонецЕсли;
	
		Если РольДоступна("НачальникПроизводства") Тогда
			
			Элементы.ПодписатьНачальникПроизводства.Доступность = Истина;	

			Элементы.КомплектыПродолжительностьПроизводства.ТолькоПросмотр		= Ложь;
			
		КонецЕсли;
	
		Если РольДоступна("НачальникМонтажа") Тогда
			
			Элементы.ПодписатьНачальникМонтажа.Доступность 		= Истина;	

			Элементы.КомплектыПродолжительностьМонтажа.ТолькоПросмотр			= Ложь;
			
		КонецЕсли;
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПроекта()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",				Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",		Ложь);
	ПараметрыФормы.Вставить("НеПоказыватьСделки",		Истина);
	ПараметрыФормы.Вставить("МассивПроектовПоказывать",	ПолучитьМассивПроектовОжидания());

	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыборкаПроекта", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Проекты.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ОткрытьФормуВыбораПроекта()

&НаКлиенте
Процедура ПослеВыборкаПроекта(Значение, ДополнительныйПараметр) Экспорт

    Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        Возврат;
	КонецЕсли;
	
	Объект.Проект = Значение;
	Объект.Комплекты.Очистить();
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьМассивПроектовОжидания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Проект
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДлительностьЭтаповДляВнешнегоПользователя КАК ДлительностьЭтаповДляВнешнегоПользователя
		|		ПО (ДлительностьЭтаповДляВнешнегоПользователя.Проект = Проекты.Ссылка)
		|ГДЕ
		|	НЕ Проекты.ПометкаУдаления
		|	И ДлительностьЭтаповДляВнешнегоПользователя.Ссылка ЕСТЬ NULL";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Проект");
	

КонецФункции // ПолучитьМассивПроектовОжидания()




&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Комплекты.Количество() = 0 Тогда 
		ОткрытьФормуВыбораПроекта();
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОСменеПроекта",ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения,"При смене Проекта будет очищена табличная часть. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 
	
КонецПроцедуры 


&НаКлиенте
Процедура ПослеВопросаОСменеПроекта(Результат, ДополнительныйПараметр) Экспорт
	
	Если Результат = КодВозвратаДиалога.ДА Тогда
        ОткрытьФормуВыбораПроекта();
	КонецЕсли;
	
КонецПроцедуры 
