
&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	мУдалениеСтрок = Новый Массив;

	тзВременная = Объект.Комплекты.Выгрузить();
	тзДатыПроекта 	= омГантНаСервере.ПолучитьДатыПроекта(Объект.Проект);
	
	Для каждого СтрокаВременная Из тзВременная Цикл
		
		НайденаяСтрока = тзДатыПроекта.Найти(СтрокаВременная.Комплект, "Комплект");
		
		Если НайденаяСтрока = Неопределено Тогда
			мУдалениеСтрок.Добавить(СтрокаВременная);	
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого х Из мУдалениеСтрок Цикл
		тзВременная.Удалить(х);		
	КонецЦикла;
	
	мДобавлениеКомплектов = Новый Массив;

	Для каждого СтрокаДанных Из тзДатыПроекта Цикл
		
		НайденаяСтрока = тзВременная.Найти(СтрокаДанных.Комплект, "Комплект");
		
		Если НайденаяСтрока = Неопределено Тогда
			
			мДобавлениеКомплектов.Добавить(СтрокаДанных.Комплект);

		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаДанных Из мДобавлениеКомплектов Цикл
		
		НС = тзВременная.Добавить();
		НС.Комплект = СтрокаДанных;
		
	КонецЦикла;
			
	
	тзВременная.Сортировать("Комплект"); 
	
	Объект.Комплекты.Загрузить(тзВременная);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ВидимостьЭлементов()
	Элементы.КомплектыЗаполнить.Доступность = ЗначениеЗаполнено(Объект.Проект);	
КонецПроцедуры // ВидимостьЭлементов()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьЭлементов();
КонецПроцедуры


&НаКлиенте
Процедура ПодписьВедущийКонструкторПриИзменении(Элемент)
	
	
	
	Для каждого х Из Объект.Комплекты Цикл
	
	
	КонецЦикла;
	
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		
		Если ЗначениеЗаполнено(Объект.ПодписьМенеджер) Тогда 
			
			ЭтаФорма.ТолькоПросмотр = Истина;
			
		Иначе	
			
			Если НЕ РольДоступна("ГлавныйКонструктор") Тогда
				
				Элементы.ПодписатьВедущийКонструктор.Доступность 	= Ложь;	
				
				Элементы.КомплектыПродолжительностьПроектирования.ТолькоПросмотр	= Истина;
				Элементы.КомплектыПродолжительностьРКД.ТолькоПросмотр				= Истина;
				
			КонецЕсли;
			
			Если НЕ РольДоступна("Менеджер") Тогда
				
				Элементы.ПодписатьМенеджер.Доступность 	= Ложь;	
				
				Элементы.КомплектыПродолжительностьСогласования.ТолькоПросмотр	= Истина;
				
			КонецЕсли;
			
			Если НЕ РольДоступна("НачальникПроизводства") Тогда
				
				Элементы.ПодписатьНачальникПроизводства.Доступность = Ложь;	
				
				Элементы.КомплектыПродолжительностьПроизводства.ТолькоПросмотр	= Истина;
				
			КонецЕсли;
			
			Если НЕ РольДоступна("НачальникМонтажа") Тогда
				
				Элементы.ПодписатьНачальникМонтажа.Доступность = Ложь;	
				
				Элементы.КомплектыПродолжительностьМонтажа.ТолькоПросмотр	= Истина;
				
			КонецЕсли;
			
			Если НЕ РольДоступна("Дизайнер") Тогда
				
				Элементы.ПодписатьДизайнера.Доступность = Ложь;	
				
				Элементы.КомплектыПродолжительностьТЗ.ТолькоПросмотр	= Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПроекта()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",				Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",		Ложь);
	ПараметрыФормы.Вставить("НеПоказыватьСделки",		Истина);
	ПараметрыФормы.Вставить("МассивПроектовПоказывать",	ПолучитьМассивПроектовОжидания());

	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыборкаПроекта", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Проекты.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ОткрытьФормуВыбораПроекта()

&НаКлиенте
Процедура ПослеВыборкаПроекта(Значение, ДополнительныйПараметр) Экспорт

    Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        Возврат;
	КонецЕсли;
	
	Объект.Проект = Значение;
	Объект.Комплекты.Очистить();
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьМассивПроектовОжидания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Проект
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДлительностьЭтаповДляВнешнегоПользователя КАК ДлительностьЭтаповДляВнешнегоПользователя
		|		ПО (ДлительностьЭтаповДляВнешнегоПользователя.Проект = Проекты.Ссылка)
		|ГДЕ
		|	НЕ Проекты.ПометкаУдаления
		|	И ДлительностьЭтаповДляВнешнегоПользователя.Ссылка ЕСТЬ NULL";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Проект");
	

КонецФункции // ПолучитьМассивПроектовОжидания()

&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Комплекты.Количество() = 0 Тогда 
		ОткрытьФормуВыбораПроекта();
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОСменеПроекта",ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения,"При смене Проекта будет очищена табличная часть. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВопросаОСменеПроекта(Результат, ДополнительныйПараметр) Экспорт
	
	Если Результат = КодВозвратаДиалога.ДА Тогда
        ОткрытьФормуВыбораПроекта();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПодписатьДизайнера(Команда)
	
	Объект.ДатаПодписьДизайнер 	= ТекущаяДата();
	Объект.ПодписьДизанер 		= ПолучитьТекущегоПользователя();
	
КонецПроцедуры


&НаКлиенте
Процедура ПодписатьВедущийКонструктор(Команда)
	
	Объект.ДатаПодписьВедущийКонструктор 	= ТекущаяДата();
	Объект.ПодписьВедущийКонструктор 		= ПолучитьТекущегоПользователя();
	
КонецПроцедуры


&НаКлиенте
Процедура ПодписатьМенеджер(Команда)
	
	Объект.ДатаПодписьМенеджер 	= ТекущаяДата();
	Объект.ПодписьМенеджер 		= ПолучитьТекущегоПользователя();
	
КонецПроцедуры


&НаКлиенте
Процедура ПодписатьНачальникПроизводства(Команда)
	
	Объект.ДатаПодписьНачальникаПроизводства 	= ТекущаяДата();
	Объект.ПодписьНачальникаПроизводства 		= ПолучитьТекущегоПользователя();
	
КонецПроцедуры


&НаКлиенте
Процедура ПодписатьНачальникМонтажа(Команда)
	
	Объект.ДатаПодписьНачальникаМонтажа 	= ТекущаяДата();
	Объект.ПодписьНачальникаМонтажа 		= ПолучитьТекущегоПользователя();
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()

	Возврат ПараметрыСеанса.ТекущийПользователь;	

КонецФункции // ПолучитьТекущегоПользователя()

