
Функция ПодписьПроекта(Проект) Экспорт

	стВозврата = Новый Структура("АвторПодписи, ДатаПодписи",Справочники.Пользователи.ПустаяСсылка(),Дата(1,1,1));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВЫБОР
		|		КОГДА ЗапускВРаботу.ДизайнерДатаПодписи > ЗапускВРаботу.ВедущийКонструкторДатаПодписи
		|			ТОГДА ЗапускВРаботу.ВедущийКонструкторДатаПодписи
		|		ИНАЧЕ ЗапускВРаботу.ДизайнерДатаПодписи
		|	КОНЕЦ КАК ДатаПодписи,
		|	ВЫБОР
		|		КОГДА ЗапускВРаботу.ДизайнерДатаПодписи > ЗапускВРаботу.ВедущийКонструкторДатаПодписи
		|			ТОГДА ЗапускВРаботу.ДизайнерПодписьАвтор
		|		ИНАЧЕ ЗапускВРаботу.ВедущийКонструкторПодписьАвтор
		|	КОНЕЦ КАК АвторПодписи
		|ИЗ
		|	Документ.ЗапускВРаботу КАК ЗапускВРаботу
		|ГДЕ
		|	ЗапускВРаботу.Проект = &Проект
		|	И НЕ ЗапускВРаботу.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПодписи";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата, Выборка);
	КонецЦикла;
	
	Возврат стВозврата;
	
КонецФункции // ПодписьСделки()

Процедура УстановитьКодПДМДляПроекта(ПараметрПроекта, КодВПДМ) Экспорт

	
	Если ТипЗнч(ПараметрПроекта) = Тип("Строка") Тогда
		Проект = Справочники.Проекты.НайтиПоКоду(ПараметрПроекта);
	Иначе
		Проект = ПараметрПроекта;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Проект) Тогда
	
		МенеджерЗаписей 		= РегистрыСведений.ДанныеПроекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.Проект 	= Проект;
		
		МенеджерЗаписей.Прочитать();
		
		Если ЗначениеЗаполнено(МенеджерЗаписей.Проект) Тогда
			
			Если НЕ МенеджерЗаписей.Код_в_PDM = КодВПДМ Тогда
				
				МенеджерЗаписей.Код_в_PDM = КодВПДМ;
				
				МенеджерЗаписей.Записать();
				
			КонецЕсли;
			
		Иначе
			
			МенеджерЗаписей.Проект 		= Проект;
			МенеджерЗаписей.Код_в_PDM 	= КодВПДМ;
			
			МенеджерЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // УстановитьКодПДМДляСделки()

Функция ПолучитАктивныеПроекты() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Ссылка,
		|	Проекты.Наименование КАК Наименование,
		|	Проекты.Номер КАК Номер,
		|	Проекты.Префикс КАК Префикс
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.НеВыводитьНаДиаграмму = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокПроектов = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		СписокПроектов.Добавить(Выборка.Ссылка, Строка(Выборка.Номер) + " " + Выборка.Наименование + " (" + Выборка.Префикс + ")");
	КонецЦикла;
	
	Возврат СписокПроектов;
	
КонецФункции // ПолучитАктивныеПроекты()

