
Функция ПодписьСделки(Сделка) Экспорт

	стВозврата = Новый Структура("АвторПодписи,ДатаПодписи",Справочники.Пользователи.ПустаяСсылка(),Дата(1,1,1));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВЫБОР
		|		КОГДА ЗапускВРаботу.ДизайнерДатаПодписи > ЗапускВРаботу.ВедущийКонструкторДатаПодписи
		|			ТОГДА ЗапускВРаботу.ВедущийКонструкторДатаПодписи
		|		ИНАЧЕ ЗапускВРаботу.ДизайнерДатаПодписи
		|	КОНЕЦ КАК ДатаПодписи,
		|	ВЫБОР
		|		КОГДА ЗапускВРаботу.ДизайнерДатаПодписи > ЗапускВРаботу.ВедущийКонструкторДатаПодписи
		|			ТОГДА ЗапускВРаботу.ДизайнерПодписьАвтор
		|		ИНАЧЕ ЗапускВРаботу.ВедущийКонструкторПодписьАвтор
		|	КОНЕЦ КАК АвторПодписи
		|ИЗ
		|	Документ.ЗапускВРаботу КАК ЗапускВРаботу
		|ГДЕ
		|	ЗапускВРаботу.Проект = &Проект
		|	И НЕ ЗапускВРаботу.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПодписи";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата, Выборка);
	КонецЦикла;
	
	Возврат стВозврата;
	
КонецФункции // ПодписьСделки()

Процедура УстановитьКодПДМДляСделки(ПараметрСделка, КодВПДМ) Экспорт

	
	Если ТипЗнч(ПараметрСделка) = Тип("Строка") Тогда
		Сделка = Справочники.Проекты.НайтиПоКоду(ПараметрСделка);
	Иначе
		Сделка = ПараметрСделка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сделка) Тогда
	
		МенеджерЗаписей 		= РегистрыСведений.ДанныеПроекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.Проект 	= Сделка;
		
		МенеджерЗаписей.Прочитать();
		
		Если ЗначениеЗаполнено(МенеджерЗаписей.Проект) Тогда
			
			Если НЕ МенеджерЗаписей.Код_в_PDM = КодВПДМ Тогда
				
				МенеджерЗаписей.Код_в_PDM = КодВПДМ;
				МенеджерЗаписей.Записать();
				
			КонецЕсли;
			
		Иначе
			
			МенеджерЗаписей.Проект 	= Сделка;
			МенеджерЗаписей.Код_в_PDM = КодВПДМ;
			
			МенеджерЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // УстановитьКодПДМДляСделки()

