
Функция ПодписьПроекта(Проект) Экспорт

	стВозврата = Новый Структура("АвторПодписи, ДатаПодписи",Справочники.Пользователи.ПустаяСсылка(),Дата(1,1,1));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВЫБОР
		|		КОГДА ЗапускВРаботу.ДизайнерДатаПодписи > ЗапускВРаботу.ВедущийКонструкторДатаПодписи
		|			ТОГДА ЗапускВРаботу.ВедущийКонструкторДатаПодписи
		|		ИНАЧЕ ЗапускВРаботу.ДизайнерДатаПодписи
		|	КОНЕЦ КАК ДатаПодписи,
		|	ВЫБОР
		|		КОГДА ЗапускВРаботу.ДизайнерДатаПодписи > ЗапускВРаботу.ВедущийКонструкторДатаПодписи
		|			ТОГДА ЗапускВРаботу.ДизайнерПодписьАвтор
		|		ИНАЧЕ ЗапускВРаботу.ВедущийКонструкторПодписьАвтор
		|	КОНЕЦ КАК АвторПодписи
		|ИЗ
		|	Документ.ЗапускВРаботу КАК ЗапускВРаботу
		|ГДЕ
		|	ЗапускВРаботу.Проект = &Проект
		|	И НЕ ЗапускВРаботу.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПодписи";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата, Выборка);
	КонецЦикла;
	
	Возврат стВозврата;
	
КонецФункции // ПодписьСделки()

Процедура УстановитьКодПДМДляПроекта(ПараметрПроекта, КодВПДМ) Экспорт

	
	Если ТипЗнч(ПараметрПроекта) = Тип("Строка") Тогда
		Проект = Справочники.Проекты.НайтиПоКоду(ПараметрПроекта);
	Иначе
		Проект = ПараметрПроекта;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Проект) Тогда
	
		МенеджерЗаписей 		= РегистрыСведений.ДанныеПроекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.Проект 	= Проект;
		
		МенеджерЗаписей.Прочитать();
		
		Если ЗначениеЗаполнено(МенеджерЗаписей.Проект) Тогда
			
			Если НЕ МенеджерЗаписей.Код_в_PDM = КодВПДМ Тогда
				
				МенеджерЗаписей.Код_в_PDM = КодВПДМ;
				
				МенеджерЗаписей.Записать();
				
			КонецЕсли;
			
		Иначе
			
			МенеджерЗаписей.Проект 		= Проект;
			МенеджерЗаписей.Код_в_PDM 	= КодВПДМ;
			
			МенеджерЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // УстановитьКодПДМДляСделки()

Функция ПолучитАктивныеПроекты() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Ссылка,
		|	Проекты.Наименование КАК Наименование,
		|	Проекты.Номер КАК Номер,
		|	Проекты.Префикс КАК Префикс
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.НеВыводитьНаДиаграмму = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокПроектов = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		СписокПроектов.Добавить(Выборка.Ссылка, Строка(Выборка.Номер) + " " + Выборка.Наименование + " (" + Выборка.Префикс + ")");
	КонецЦикла;
	
	Возврат СписокПроектов;
	
КонецФункции // ПолучитАктивныеПроекты()
                                                                       
Функция ПолучитьПользователейПроекта(Проект, ВозвращатьПользователей = Истина) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Если ВозвращатьПользователей Тогда
	
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Пользователи.Ссылка КАК ВедущийКонструктор,
			|	Пользователи1.Ссылка КАК Дизайнер,
			|	Пользователи2.Ссылка КАК Замерщик,
			|	Пользователи3.Ссылка КАК Менеджер
			|ИЗ
			|	Справочник.Проекты КАК Проекты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО Проекты.ВедущийКонструктор = Пользователи.Сотрудник
			|			И (НЕ Проекты.ВедущийКонструктор = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи1
			|		ПО Проекты.Дизайнер = Пользователи1.Сотрудник
			|			И (НЕ Проекты.Дизайнер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи2
			|		ПО Проекты.Замерщик = Пользователи2.Сотрудник
			|			И (НЕ Проекты.Замерщик = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи3
			|		ПО Проекты.Менеджер = Пользователи3.Сотрудник
			|			И (НЕ Проекты.Менеджер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
			|ГДЕ
			|	Проекты.Ссылка = &Проект";
	
	Иначе
	
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Проекты.ВедущийКонструктор КАК ВедущийКонструктор,
			|	Проекты.Дизайнер КАК Дизайнер,
			|	Проекты.Замерщик КАК Замерщик,
			|	Проекты.Менеджер КАК Менеджер
			|ИЗ
			|	Справочник.Проекты КАК Проекты
			|ГДЕ
			|	Проекты.Ссылка = &Проект";
	
	КонецЕсли;
	
	ПустойСотрудник = ?(ВозвращатьПользователей, Справочники.Пользователи.ПустаяСсылка(), Справочники.Сотрудники.ПустаяСсылка());
	
	стСотрудники = Новый Структура("Конструктор, Менеджер, ВедущийКонструктор, Дизайнер, Замерщик"
		, ПустойСотрудник, ПустойСотрудник, ПустойСотрудник, ПустойСотрудник, ПустойСотрудник);
		
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стСотрудники, Выборка);
	КонецЦикла;
	
	Возврат стСотрудники;
		
КонецФункции // Получить()
