&НаКлиенте
Перем ЧастичноПередан;

&НаКлиенте
Процедура КомплектыДляПередачиПриАктивизацииСтроки(Элемент)
	ТД = Элементы.КомплектыДляПередачи.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		ВыбранныйКомплект 							= ПредопределенноеЗначение("Справочник.ИзделияКомплект.ПустаяСсылка");
		ЧастичноПередан 							= Ложь;
		Элементы.ГруппаКнопкиПереноса.Доступность 	= Ложь;
	Иначе
	   	ВыбранныйКомплект 							= ТД.Комплекты;
		ЧастичноПередан 							= ТД.ЧастичноПередан;
		Элементы.ГруппаКнопкиПереноса.Доступность 	= Истина;
	КонецЕсли;
	
	Элементы.ИнформацияОПередаче.Доступность = ЧастичноПередан;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыДляПередачиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыДляПередачиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОПередачи(Команда)
	Элементы.ГруппаИнформацияОПередаче.Видимость = Истина; 
	ТД = Элементы.КомплектыДляПередачи.ТекущиеДанные;
	ПолучитьДанныеОПередаче(ТД.Комплекты);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОПередаче(Комплект)

	

КонецФункции // ПолучитьДанныеОПередаче()


&НаКлиенте
Процедура ЗаполнитьКомплекты(Команда)
	КомплектыДляПередачи.Очистить();
	ЗаполнитьКомплектыНаСервере();
КонецПроцедуры 

Процедура ЗаполнитьКомплектыНаСервере()

	ОбъектОтчета 			= Отчеты.ОбщиеНастройки.Создать();
	ИмяДоскиПроизводства 	= омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
    УИДКудаКолонка			= омКанбанДоскиНаСервереПовтор.ПолучитьУИДКолонки(ИмяДоскиПроизводства, ОбъектОтчета.НаименованиеКолонкиДляПроизводствоВМонтаж());
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКарточки.Ресурс.Ссылка КАК Комплекты,
		|	ВЫБОР
		|		КОГДА СУММА(ВЫБОР
		|					КОГДА ЕСТЬNULL(ПартииГотовойПродукции.ЧастичноПередан, ИСТИНА)
		|						ТОГДА 0
		|					ИНАЧЕ 1
		|				КОНЕЦ) = 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЧастичноПередан
		|ИЗ
		|	РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииГотовойПродукции КАК ПартииГотовойПродукции
		|			ПО КанбанКарточки.Ресурс = ПартииГотовойПродукции.ИзделиеКомплект
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДКарточка = КанбанКарточки.УИД
		|ГДЕ
		|	КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = &УИДКудаКолонка
		|
		|СГРУППИРОВАТЬ ПО
		|	КанбанКарточки.Ресурс.Ссылка";
	
	Запрос.УстановитьПараметр("УИДКудаКолонка", УИДКудаКолонка);
	
	КомплектыДляПередачи.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыДляПередачиПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТД = Элементы.КомплектыДляПередачи.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
    	Возврат;
	КонецЕсли; 
	
	ПоказатьЗначение(, ТД.Комплекты); 	

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаИнформацияОПередаче.Видимость = Ложь;
	ЧастичноПередан = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьИнформации(Команда)
	Элементы.ГруппаИнформацияОПередаче.Видимость = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура КомплектыВДокументПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиКомплект(Команда)
	
	УжеПеренесен = Ложь;
	
	Для каждого х Из КомплектыВДокумент Цикл
	
		Если х.Комплекты = ВыбранныйКомплект И НЕ х.ЧастичноПередан Тогда
			УжеПеренесен = Истина;
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	Если НЕ УжеПеренесен Тогда
		
		НС = КомплектыВДокумент.Добавить();
		НС.Комплекты = ВыбранныйКомплект;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиЧастьКомплекта(Команда)
	НС = КомплектыВДокумент.Добавить();
	НС.Комплекты 		= ВыбранныйКомплект;
	НС.ЧастичноПередан 	= Истина;
КонецПроцедуры


&НаСервере
Процедура СоздатьДокументПередачиНаСкладНаСервере()
	
	СтатусНаСкладе = омНастройкаПовтор.ПолучитьСтадиюНаСкладе();
	
	МассивПартий = СоздатьПартииТовара();
	
	ДокументПередачи = Документы.ПередачаГотовойПродукцииНаСклад.СоздатьДокумент();
	ДокументПередачи.Дата = ТекущаяДата();
	ДокументПередачи.Автор = ПараметрыСеанса.ТекущийПользователь;
	ДокументПередачи.МестоХранения = МестоХранения;
	
	Для каждого х Из МассивПартий Цикл
		
		НС = ДокументПередачи.ПартииГотовойПродукции.Добавить();
		НС.ПартияГотовойПродукции = х.СправочникПартия;
		
	КонецЦикла;
	
	стПараметры = Новый Структура("Комплект, ТекущаяСтадия", , СтатусНаСкладе);
	
	ДокументПередачи.Записать(РежимЗаписиДокумента.Проведение);
	
	Комментарий = Строка(ДокументПередачи.Ссылка);
	УИДДоски 	= омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
	Для каждого х Из МассивПартий Цикл
		
		Если х.ЧастичноПередан Тогда
			Продолжить;
		КонецЕсли;
		
		омКанбанДоскиНаСервере.ПеревестиКарточкуВВыполнено(УИДДоски, х.ИзделиеКомплект, Комментарий);
		
		стПараметры.Комплект = х.ИзделиеКомплект;
		РегистрыСведений.ДанныеКомплекта.ИзменитьДанныеКомплекта(стПараметры);
		
	КонецЦикла;

КонецПроцедуры

Функция СоздатьПартииТовара()

	МассивПартий = Новый Массив;
	
	Для каждого ТекущийКомплект Из КомплектыВДокумент Цикл
	
		СправочникПартия = Справочники.ПартииГотовойПродукции.СоздатьЭлемент();
		СправочникПартия.Наименование 		= ТекущийКомплект.Комплекты;
		СправочникПартия.ИзделиеКомплект 	= ТекущийКомплект.Комплекты;
		СправочникПартия.Комментарий 		= ТекущийКомплект.Комментарий;
		СправочникПартия.ЧастичноПередан	= ТекущийКомплект.ЧастичноПередан;
		
		СправочникПартия.Записать();
		
		МассивПартий.Добавить(Новый Структура("СправочникПартия, ИзделиеКомплект, ЧастичноПередан"
												, СправочникПартия.Ссылка
												, ТекущийКомплект.Комплекты
												, ТекущийКомплект.ЧастичноПередан));
	
	КонецЦикла;
	
	Возврат МассивПартий;

КонецФункции // СоздатьПартииТовара()



&НаКлиенте
Процедура СоздатьДокументПередачиНаСклад(Команда)
	
	Если ЗначениеЗаполнено(МестоХранения) Тогда
	
		СоздатьДокументПередачиНаСкладНаСервере(); 
		
		Закрыть();
	
	КонецЕсли;
	
КонецПроцедуры

