
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("НеЗакрывать", 	НеЗакрывать); 
	Параметры.Свойство("Задача", 		Задача);
	
	
	Если Параметры.Свойство("мКомплектыДляАналогичногоДействия") Тогда 
		Для каждого х Из Параметры.мКомплектыДляАналогичногоДействия Цикл
			СписокКомплектыДляАналогичногоДействия.Добавить(х);
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Задача) Тогда
		Комплект = Задача.ОбъектТЗ;
	Иначе
		Параметры.Свойство("Комплект", Комплект);
	КонецЕсли;
	
	Элементы.Задача.Видимость = ЗначениеЗаполнено(Задача);
	
	Отказ = Не ЗначениеЗаполнено(Комплект);
	
	Если НЕ Отказ Тогда
		СоздатьФоновуюЗадачу();	
	КонецЕсли;
	
КонецПроцедуры


Процедура СоздатьФоновуюЗадачу(ВозвращатьПослеПервойОшибки = Истина)
	
	АдресРезультата = ПоместитьВоВременноеХранилище("", УникальныйИдентификатор);
	
	
	ТипКомплекта = ТипЗнч(Комплект);
	
	Если ТипКомплекта = Тип("СправочникСсылка.ИзделияКомплект") Тогда
		
		ПараметрыФункции 	= Новый Массив(2);
		ПараметрыФункции[0] = Комплект;	
		ПараметрыФункции[1] = АдресРезультата;
		Задание = ФоновыеЗадания.Выполнить("омФайлыPDM.ИнформацияОЗаблокированныхPDM", ПараметрыФункции, , "ИнформацияОЗаблокированныхPDM")
		
	ИначеЕсли ТипКомплекта = Тип("СправочникСсылка.Композиции") Тогда
		
		ПараметрыФункции 	= Новый Массив(3);
		ПараметрыФункции[0] = Комплект;	
		ПараметрыФункции[1] = ВозвращатьПослеПервойОшибки;
		ПараметрыФункции[2] = АдресРезультата;
		Задание = ФоновыеЗадания.Выполнить("омФайлыPDM.ИнформацияОЗаблокированныхКомпозицииPDM", ПараметрыФункции, , "ИнформацияОЗаблокированныхPDMУомпозиции");
		
	Иначе
		
		Элементы.ДекорацияОшибка.Видимость 	= Истина; 
		Элементы.ДекорацияНадпись.Видимость = Истина;
		
	КонецЕсли;
	
	Если НЕ Элементы.ДекорацияОшибка.Видимость Тогда
		ЗаданиеУникальныйИдентификатор = Задание.УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры
