
&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТипНоменклатуры") Тогда
		ТипНоменклатуры = Параметры.ТипНоменклатуры; 
		Элементы.ТипНоменклатуры.ТолькоПросмотр = Истина;
		УстановитьОтбор();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура УстановитьОтбор()

	Список.Параметры.УстановитьЗначениеПараметра("ТипНоменклатуры",ТипНоменклатуры);	

КонецПроцедуры // УстановитьОтбор()
