Функция ПолучитьРазрешенныеПереходы(УИДДоски) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КанбанРазрешенныеПереходы.УИДКуда КАК УИДКуда,
	|	КанбанРазрешенныеПереходы.УИДОткуда КАК УИДОткуда,
	|	КанбанРазрешенныеПереходы.ЗаголовокДаты КАК ЗаголовокДаты,
	|	КанбанРазрешенныеПереходы.ЗаголовокКомментария КАК ЗаголовокКомментария,
	|	КанбанРазрешенныеПереходы.ТребуетсяДата КАК ТребуетсяДата,
	|	КанбанРазрешенныеПереходы.ТребуетсяКомментарий КАК ТребуетсяКомментарий
	|ИЗ
	|	РегистрСведений.КанбанРазрешенныеПереходы КАК КанбанРазрешенныеПереходы
	|ГДЕ
	|	КанбанРазрешенныеПереходы.Доска = &УИДДоски";
	
	Запрос.УстановитьПараметр("УИДДоски", УИДДоски);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции // ПолучитьРазрешенныеПереходы()

Функция ПолучитьУИДКолонки(УИДДоски = "", ИмяКолонки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Если ИмяКолонки = "_Возврат_ТЗ" Тогда
		НастройкаИмя = ОбъектОтчета.НаименованиеКолонкиДляВозвратаТЗ();
	ИначеЕсли ИмяКолонки = "_Ожидание_ТЗ" Тогда
		НастройкаИмя = ОбъектОтчета.НаименованиеКолонкиДляОжиданияТЗ();
	ИначеЕсли ИмяКолонки = "_Ожидание_Производства" Тогда
		НастройкаИмя = ОбъектОтчета.НаименованиеКолонкиОжиданиеПроизводства();
		Если ПустаяСтрока(УИДДоски) Тогда
			УИДДоски = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
		КонецЕсли;
	ИначеЕсли ИмяКолонки = "_Приостановка_Производства" Тогда
		НастройкаИмя = ОбъектОтчета.НаименованиеКолонкиПриостановкаПроизводства();
	Иначе
		НастройкаИмя = ИмяКолонки;
	КонецЕсли;
	
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(НастройкиПроекта.Значение КАК СТРОКА(200)) КАК Значение
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
	|ГДЕ
	|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки
	|	И НастройкиПроекта.НомерНастройки = 0
	|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КанбанКолонки.УИД КАК УИД
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКолонки КАК КанбанКолонки
	|		ПО вт.Значение = КанбанКолонки.Наименование
	|ГДЕ
	|	КанбанКолонки.Доска = &УИДДоски";
	
	Запрос.УстановитьПараметр("ИмяНастройки", 	НастройкаИмя);
	Запрос.УстановитьПараметр("УИДДоски", 		УИДДоски);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.УИД; 
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции // ПолучитьУИДКолонки()

Функция ПолучитьИмяДоски(ИмяДоски) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Если ИмяДоски = "НаименованиеДоскиДляТЗ" Тогда
		НастройкаИмяДоски = ОбъектОтчета.НаименованиеДоскиДляТЗ();
	ИначеЕсли ИмяДоски = "НаименованиеДоскиПроизводство" Тогда
		НастройкаИмяДоски = ОбъектОтчета.НаименованиеДоскиДляПроизводства();
	Иначе
		Возврат "";
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПроекта.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
	|ГДЕ
	|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки
	|	И НастройкиПроекта.НомерНастройки = 0
	|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", НастройкаИмяДоски);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Значение; 
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции // ПолучитьУИДДоски()

Функция ПолучитьУИДДоски(ИмяДоски) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Если ИмяДоски = "УИДДоскиДляТЗ" Тогда
		НастройкаИмяДоски = ОбъектОтчета.НаименованиеДоскиДляТЗ();
	ИначеЕсли ИмяДоски = "УИДДоскиПроизводство" Тогда
		НастройкаИмяДоски = ОбъектОтчета.НаименованиеДоскиДляПроизводства();
	Иначе	
		Возврат "";
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КанбанДоски.УИД КАК УИД
	|ИЗ
	|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанДоски КАК КанбанДоски
	|		ПО ((ВЫРАЗИТЬ(НастройкиПроекта.Значение КАК СТРОКА(200))) = КанбанДоски.Наименование)
	|ГДЕ
	|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки
	|	И НастройкиПроекта.НомерНастройки = 0
	|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", НастройкаИмяДоски);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.УИД; 
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции // ПолучитьУИДДоски()

Функция ПолучитьУИДДорожки(УИДДоски, ИмяДорожки = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Если ИмяДорожки = "" Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МИНИМУМ(КанбанДорожки.НомерПоПорядку) КАК НомерПоПорядку,
			|	КанбанДорожки.Доска КАК Доска
			|ПОМЕСТИТЬ вт
			|ИЗ
			|	РегистрСведений.КанбанДорожки КАК КанбанДорожки
			|ГДЕ
			|	КанбанДорожки.Доска = &УИДДоски
			|
			|СГРУППИРОВАТЬ ПО
			|	КанбанДорожки.Доска
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КанбанДорожки.УИД КАК УИД
			|ИЗ
			|	вт КАК вт
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанДорожки КАК КанбанДорожки
			|		ПО вт.НомерПоПорядку = КанбанДорожки.НомерПоПорядку
			|			И вт.Доска = КанбанДорожки.Доска";
		
		Запрос.УстановитьПараметр("УИДДоски", УИДДоски);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.УИД;
		КонецЦикла;
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КанбанДорожки.УИД КАК УИД
			|ИЗ
			|	РегистрСведений.КанбанДорожки КАК КанбанДорожки
			|ГДЕ
			|	КанбанДорожки.Доска = &УИДДоски
			|	И КанбанДорожки.Наименование = &ИмяДорожки";
		
		Запрос.УстановитьПараметр("ИмяДорожки", ИмяДорожки);

	КонецЕсли;	
	
	Запрос.УстановитьПараметр("УИДДоски", УИДДоски);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.УИД;
	КонецЦикла;
		
	Возврат "";
	
КонецФункции // ПолучитьУИДДорожки()

Функция ПолучитьУИДКолонокДоски(УИДДоски, ДобавитьСлужебныеКолонки = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКолонки.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|ГДЕ
		|	КанбанКолонки.Доска = &Доска";
	
	Запрос.УстановитьПараметр("Доска", УИДДоски);
	
	МассивУИДов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УИД");
	
	Если ДобавитьСлужебныеКолонки Тогда
		Для каждого х Из ПолучитьМассивСлужебныхКолонок() Цикл
			МассивУИДов.Добавить(х);	
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивУИДов;
	
КонецФункции // ПолучитьКолонкиДоски() 

Функция ПолучитьМассивСлужебныхКолонок() Экспорт
	
	МассивУИДов = Новый Массив(3);
	МассивУИДов[0] = "1";		//выполнена
	МассивУИДов[1] = "100";     //корзина
	МассивУИДов[2] = "200";     //стоп
	
	Возврат МассивУИДов;

КонецФункции // ПолучитьМассивСлужебныхКолонок()

Функция ПолучитьСписокСлужебныхКолонок() Экспорт
	
	СписокСлужебных = Новый СписокЗначений;
	СписокСлужебных.Добавить("1", 	"Выполнена");
	СписокСлужебных.Добавить("100", "В корзине");
	СписокСлужебных.Добавить("200", "На стопе");
	
	Возврат СписокСлужебных;
	
КонецФункции // ПолучитьМассивСлужебныхКолонок()


