&НаКлиенте
Функция ПоказатьФайл(ПутьКФайлу, РеквизитПолеВывода) Экспорт
	
	СтруктураВорзврата = Новый Структура("Ошибка", "");
	
	Файл = Новый Файл(ПутьКФайлу);
	
	Если НЕ Файл.Существует() Тогда
	
		СтруктураВорзврата.Ошибка = СтрШаблон("Не найден файл %1.", ПутьКФайлу);	
		Возврат СтруктураВорзврата;
		
	КонецЕсли;
	
	Попытка
		
		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ПутьКФайлу);
		
		Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
		РеквизитПолеВывода.Прочитать(Поток);
		
	Исключение
		СтруктураВорзврата.Ошибка = ОписаниеОшибки();	
	КонецПопытки;
	
	Возврат СтруктураВорзврата;

КонецФункции


&НаКлиенте
Функция СоздатьФайлКомментарияPDF(ПараметрыКомментария) Экспорт

	СтруктураВорзврата = Новый Структура("Ошибка, АдресВХранилище", "", "");
	
	ПолеВывода = омPDF_Сервер.ПолучитьПолеВыводаКомментария(ПараметрыКомментария); 
	
	Попытка
	
		ПолеВывода.Записать(ПараметрыКомментария.ПутьКФайлу, ТипФайлаДокументаPDF.PDF);	
	
	Исключение
		
		СтруктураВорзврата.Ошибка = ОписаниеОшибки();
		
	КонецПопытки;
	
	Возврат СтруктураВорзврата;

КонецФункции // СоздатьФайлКомментарияPDF()

&НаКлиенте
Функция ПолучитьСтруктуруПараметровФайлаКомментария() Экспорт

	ПараметрыКомментария = Новый Структура("ТекстЗаголовка",	"");
	ПараметрыКомментария.Вставить("ТекстКомментария", 			"");
	ПараметрыКомментария.Вставить("ТекстПодвал", 				ЗаполнитьПодвал());
	ПараметрыКомментария.Вставить("ПутьКФайлу", 				"");
	ПараметрыКомментария.Вставить("СохранитьВХранилище", 		Ложь);
	ПараметрыКомментария.Вставить("ВыводитьЗаголовок", 			Истина);
	ПараметрыКомментария.Вставить("ВыводитьКомментарий", 		Истина);
	ПараметрыКомментария.Вставить("ВыводитьПодвал", 			Истина);
	
	Возврат ПараметрыКомментария;

КонецФункции // ПолучитьСтруктуруПараметровФайлаКомментария()

&НаКлиенте
Функция ЗаполнитьПодвал()

	Возврат Формат(ТекущаяДата(), "ДЛФ=DDT") + "        " + омСотрудники.ПолучитьТекущегоПользователя(Истина);	

КонецФункции // ЗаполнитьПодвал()


