&НаСервере
Функция ПолучитьКонструкторов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияСрезПоследних.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.Подразделения.СрезПоследних(, ) КАК ПодразделенияСрезПоследних
		|ГДЕ
		|	НЕ ПодразделенияСрезПоследних.НеАктивное
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодразделенияСрезПоследних.Сотрудник.Наименование";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Подразделение");
	
КонецФункции // ПолучитьКонструкторов()

&НаСервере
Функция ПолучитьПодразделения(Сотрудник, ТолькоСсылки = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияСрезПоследних.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ПодразделенияСрезПоследних.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.Подразделения.СрезПоследних(, Сотрудник = &Сотрудник) КАК ПодразделенияСрезПоследних
		|ГДЕ
		|	НЕ ПодразделенияСрезПоследних.НеАктивное
		|";
	
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	
	Если ТолькоСсылки Тогда
		Запрос.Текст = 	Запрос.Текст + "УПОРЯДОЧИТЬ ПО
		|	ПодразделенияСрезПоследних.Сотрудник.Наименование";
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Подразделение");
	КонецЕсли;
	
	Запрос.Текст = 	Запрос.Текст + "УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиТаблицы";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьКонструкторов()



