Процедура ЗаписатьДатуСогласования(Комплект, ДатаСогласованияАрхитектором = Неопределено) Экспорт

    МенеджерЗаписи = РегистрыСведений.ДатыСогласования.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Комплект = Комплект;
	
	МенеджерЗаписи.Прочитать();
	
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Комплект = Комплект;
	КонецЕсли;      
	
	МенеджерЗаписи.ДатаСогласованияДизайнером = ТекущаяДата();
	
	Если НЕ ДатаСогласованияАрхитектором = Неопределено Тогда
		МенеджерЗаписи.ДатаСогласованияАрхитектором = ДатаСогласованияАрхитектором;
	КонецЕсли;
	
	МенеджерЗаписи.Записать()
	
КонецПроцедуры
