
&НаКлиенте
Процедура РасценкиРасценкаПриИзменении(Элемент)
	ПересчитатьОкончательнуюЦену();
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьДанныеРасценки(Расценка)
	
	стДанные = Новый Структура("СтатьяЗатрат,ЕдиницыВидРаботы,ЦенаРаботы", );
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементныеРасценки.ЕдиницыВидРаботы КАК ЕдиницыВидРаботы,
		|	ЭлементныеРасценки.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ЭлементныеРасценки.ЦенаРаботы КАК ЦенаРаботы
		|ИЗ
		|	Справочник.ЭлементныеРасценки КАК ЭлементныеРасценки
		|ГДЕ
		|	ЭлементныеРасценки.Ссылка = &Расценка";
	
	Запрос.УстановитьПараметр("Расценка", Расценка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стДанные,Выборка);
	КонецЦикла;
	
    Возврат стДанные;
КонецФункции // ПолучитьДанныеРасценки()


#Область Цены
	
&НаКлиенте
Процедура ВидимостьЭлементов()
	
	Элементы.ГруппаФиксированнаяЦена.Видимость 	= Объект.ПоказательРассчетаЦены > 1;
	Элементы.Расценки.Видимость					= НЕ Элементы.ГруппаФиксированнаяЦена.Видимость;
	Элементы.ПоказательЦены.Видимость 			= Объект.ПоказательРассчетаЦены > 0;
	Элементы.ПоказательЦены.Заголовок 			= ?(Объект.ПоказательРассчетаЦены = 1, "Процент","Сумма");
	
	ПересчитатьОкончательнуюЦену();
	
КонецПроцедуры // ВидимостьЭлементов()

&НаКлиенте
Процедура ПересчитатьОкончательнуюЦену()
	
	Если Объект.ПоказательРассчетаЦены = 0 Тогда //Расчет
		мРасценки = Новый Массив;
		
		Для каждого х Из Объект.Расценки Цикл
			мРасценки.Добавить(х.Расценка);
		КонецЦикла;
		
		ЭтаФорма.ОкончательнаяЦена = ПолучитьТекстовоеПредставлениеЦены(мРасценки);	
		
	ИначеЕсли Объект.ПоказательРассчетаЦены = 1 Тогда //Процен
		мРасценки = Новый Массив;
		
		Для каждого х Из Объект.Расценки Цикл
			мРасценки.Добавить(х.Расценка);
		КонецЦикла;
		
		ЭтаФорма.ОкончательнаяЦена = ПолучитьТекстовоеПредставлениеЦены(мРасценки, Объект.ПоказательЦены);	
	Иначе
		
		ЭтаФорма.ОкончательнаяЦена = ПолучитьТекстовоеПредставлениеФиксированнойЦены(Объект.ЕдиницыВидРаботы) + Объект.ПоказательЦены + " руб.";	
	КонецЕсли;	
	
КонецПроцедуры // ПересчитатьИтог()

&НаСервереБезКонтекста
Функция ПолучитьТекстовоеПредставлениеЦены(мРасценки, Процент = 0)

	Возврат Справочники.ВидыРабот.ПолучитьТекстовоеПредставлениеЦены(Справочники.ВидыРабот.ПолучитьЦенуВидаРабот(мРасценки,,Процент));	

КонецФункции // ПолучитьТекстовоеПредставлениеЦены()

&НаСервереБезКонтекста
Функция ПолучитьТекстовоеПредставлениеФиксированнойЦены(ЕдиницыВидРаботы)

	Возврат Справочники.ВидыРабот.ПолучитьПредставлениеВидаЕдиницы(ЕдиницыВидРаботы);	

КонецФункции // ПолучитьТекстовоеПредставлениеЦены()


#КонецОбласти  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьЭлементов();
	ПересчитатьОкончательнуюЦену();
КонецПроцедуры

&НаКлиенте
Процедура ПоказательРассчетаЦеныПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПоказательЦеныПриИзменении(Элемент)
	ПересчитатьОкончательнуюЦену();
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницыВидРаботыПриИзменении(Элемент)
	ПересчитатьОкончательнуюЦену();
КонецПроцедуры


                                                                