#Область ПрограммныйИнтерфейс
//Код процедур и функций
#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланПроектовСрезПоследних.Комплект КАК Комплект,
		|	ПланПроектовСрезПоследних.ПродолжительностьВДнях КАК ПродолжительностьВДнях,
		|	ПланПроектовСрезПоследних.ПродолжительностьМонтажа КАК ПродолжительностьМонтажа,
		|	ПланПроектовСрезПоследних.ПродолжительностьПроектирования КАК ПродолжительностьПроектирования,
		|	ПланПроектовСрезПоследних.ПродолжительностьПроизводства КАК ПродолжительностьПроизводства,
		|	ПланПроектовСрезПоследних.ПродолжительностьРКД КАК ПродолжительностьРКД,
		|	ПланПроектовСрезПоследних.ПродолжительностьСогласования КАК ПродолжительностьСогласования,
		|	ПланПроектовСрезПоследних.ПродолжительностьТЗ КАК ПродолжительностьТЗ,
		|	ЛОЖЬ КАК Обработан
		|ИЗ
		|	РегистрСведений.ПланПроектов.СрезПоследних КАК ПланПроектовСрезПоследних
		|ГДЕ
		|	ПланПроектовСрезПоследних.РегистраторРегистра = &РегистраторРегистра";
	
	Запрос.УстановитьПараметр("РегистраторРегистра", Ссылка);
	
	тзРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого х Из Комплекты Цикл
	
		НайденаяСтрока = тзРезультатЗапроса.Найти(х.Комплект, "Комплект");
		
		Если НЕ НайденаяСтрока = Неопределено Тогда
			
			х.Обработан = Истина;
			
			Если ПродолжительностьВДнях = НайденаяСтрока.ПродолжительностьВДнях И х.ПродолжительностьПроектирования = НайденаяСтрока.ПродолжительностьПроектирования Тогда
				Если х.ПродолжительностьМонтажа = НайденаяСтрока.ПродолжительностьМонтажа  И х.ПродолжительностьПроизводства = НайденаяСтрока.ПродолжительностьПроизводства Тогда
					Если х.ПродолжительностьРКД = НайденаяСтрока.ПродолжительностьРКД  И х.ПродолжительностьСогласования = НайденаяСтрока.ПродолжительностьСогласования Тогда
						Если х.ПродолжительностьТЗ = НайденаяСтрока.ПродолжительностьТЗ Тогда
							Продолжить;	
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
			
			
		КонецЕсли;
		
		СоздатьЗаписьВРегистреПланПроектов(х);
	КонецЦикла;
	
	Отбор = Новый Структура("Обработан", Ложь);
	
	Для каждого х Из тзРезультатЗапроса.НайтиСтроки(Отбор) Цикл
		МенеджерЗаписи = РегистрыСведений.ПланПроектов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период 	= Дата; 
		МенеджерЗаписи.Комплект = х.Комплект;
		МенеджерЗаписи.Удалить();
	КонецЦикла;
	
	
КонецПроцедуры 

Процедура СоздатьЗаписьВРегистреПланПроектов(СтрокаДанных)

	МенеджерЗаписи = РегистрыСведений.ПланПроектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период 				= Дата;
	МенеджерЗаписи.РегистраторРегистра 	= Ссылка;
	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаДанных);
	
	МенеджерЗаписи.Записать();

КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НаборЗаписей = РегистрыСведений.ПланПроектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РегистраторРегистра.Установить(Ссылка);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти


