
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	//СекундВСутках = 3600 * 24;
	//РазрывВСекундах	= ДлинаРазрываДляГанта * СекундВСутках;
	//НеделяСекундах	= 7 * СекундВСутках;
	//
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ДанныеКомплектаСрезПоследних.Комплект КАК Комплект,
	//	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоМонтажа КАК ВнешняяДатаНачалоМонтажа,
	//	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоПроектирования КАК ВнешняяДатаНачалоПроектирования,
	//	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоПроектирования КАК ВнешняяДатаНачалоПроектирования1,
	//	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоРКД КАК ВнешняяДатаНачалоРКД,
	//	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоСогласования КАК ВнешняяДатаНачалоСогласования,
	//	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоТЗ КАК ВнешняяДатаНачалоТЗ,
	//	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеМонтажа КАК ВнешняяДатаОкончаниеМонтажа,
	//	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеПроектирования КАК ВнешняяДатаОкончаниеПроектирования,
	//	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеПроизводства КАК ВнешняяДатаОкончаниеПроизводства,
	//	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеРКД КАК ВнешняяДатаОкончаниеРКД,
	//	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеСогласования КАК ВнешняяДатаОкончаниеСогласования,
	//	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеТЗ КАК ВнешняяДатаОкончаниеТЗ,
	//	|	ДанныеКомплектаСрезПоследних.ВнешняяПродолжительностьПроизводства КАК ВнешняяПродолжительностьПроизводства
	//	|ИЗ
	//	|	РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
	//	|ГДЕ
	//	|	ДанныеКомплектаСрезПоследних.Комплект В(&Комплект)";
	//
	//Запрос.УстановитьПараметр("Комплект", Комплект);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	//
	//	стДанныеДляЗаписи.ВнешняяДатаНачалоТЗ 					= ПолучитьНачалоНедели(Начало, СекундВСутках); 
	//	стДанныеДляЗаписи.ВнешняяДатаОкончаниеТЗ 				= ПолучитьКонецНедели(стДанныеДляЗаписи.ВнешняяДатаНачалоТЗ + ДлинаТЗ, СекундВСутках)  - РазрывВСекундах; 
	//	стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования 		= ПолучитьНачалоНедели(стДанныеДляЗаписи.ВнешняяДатаОкончаниеТЗ + НеделяСекундах, СекундВСутках); 
	//	стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроектирования 	= ПолучитьКонецНедели(стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования  + ДлинаКонструирования, СекундВСутках) - РазрывВСекундах; 
	//	стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования 		= ПолучитьНачалоНедели(стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроектирования + НеделяСекундах, СекундВСутках);
	//	стДанныеДляЗаписи.ВнешняяДатаОкончаниеСогласования 		= ПолучитьКонецНедели(стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования  		+ ДлинаСогласования, СекундВСутках) - РазрывВСекундах;
	//	


	//
	//// Вставить содержимое обработчика.
КонецПроцедуры
