&НаКлиенте
Перем ИзмененыСлужебныеНастройки, ПутьКФайлуПДМ;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Элементы.СтадияКомплекта.Видимость = Ложь;

	Иначе

		стДанные = РегистрыСведений.ТаймингЗадач.ПолучитьСостояниеЗадачи(Объект.Ссылка);
		ТекущиеСостояние 		= стДанные.Состояние;
		КрайРКД					= ПолучитьКрайРКД();
		
		Если Объект.Выполнена Тогда
			СтадияКомплекта = "Задача выполнена";
		Иначе
			СтадияКомплекта = омСтадииКомплекта.ПолучитьСтадиюКомплекта(Объект.ОбъектТЗ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.Выполнена Тогда
		
		ТолькоПросмотр 										= Истина;
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;
		
	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором 
		ИЛИ Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.Разработка Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Истина;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		
	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Истина;
		
	КонецЕсли;
		
	Элементы.ОбновитьИсполнителя.Видимость = Элементы.ГруппаКнопкаКонструктора.Видимость;
	
	Состояние = ТекущиеСостояние;
	
	мТипыЗадачДяКонструктора = омЗадачиПКДПовтор.ТипыЗадачКонструктора();
	Если НЕ мТипыЗадачДяКонструктора.Найти(Объект.ТипЗадачи) = Неопределено Тогда
		Элементы.Исполнитель.ТолькоПросмотр = Истина;	
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПутьКФайлуПДМ = омФайлы.ПолучитьПутьКФайлуПДМ(Объект.ОбъектТЗ);
	ИзмененыСлужебныеНастройки = Ложь;
	Элементы.ГруппаИстория.Видимость = Ложь;
	ВидимостьКнопок();
	
КонецПроцедуры

Функция ПолучитьКрайРКД()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.КрайРКД КАК КрайРКД
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Объект.ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КрайРКД; 
	КонецЦикла; 
	
	Возврат Дата(1, 1, 1);
	
КонецФункции // ПолучитьКрайПКД()

#Область Команды

#Область  КомандыКонструктора

&НаКлиенте
Процедура НачатьВыполнение(Команда)
	
	КонструкторОбъекта = КонтрольСоответствияКонструкторов(Объект.ОбъектТЗ, Объект.Исполнитель);
	
	Если НЕ КонструкторОбъекта = Объект.Исполнитель Тогда
			
		ПоказатьПредупреждение(, "Конструктор в объекте " + КонструкторОбъекта + " не соответствует исполнителю");
		Возврат;
		
	КонецЕсли;
	
	стДанные = ДействияНаСервере("НачатьВыполнение", Объект.Ссылка, Объект.Исполнитель);
	ТекущиеСостояние 		= стДанные.Состояние;
	ВидимостьКнопок();
	
	стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Объект.Ссылка, "РаздатьПрава");

	Если НЕ ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
		
		ПоказатьПредупреждение(,стВозврата.ОписаниеОшибки);
		
	КонецЕсли;

	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыполнение(Команда)
	
	Если Модифицированность Тогда
		
		ПоказатьПредупреждение(, "Не обходимо сохранить задачу.");
		Возврат;
		
	КонецЕсли;
	
	стДанные = ДействияНаСервере("ЗавершениеРаботы", Объект.Ссылка, Объект.ОбъектТЗ);
	
	стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Объект.Ссылка, "ЗабратьПрава");
	
	Если НЕ ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
		
		ПоказатьПредупреждение(,стВозврата.ОписаниеОшибки);
		
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Приостановить(Команда)
	
	стДанные = ДействияНаСервере("Приостановить", Объект.Ссылка, Объект.Исполнитель);
	ТекущиеСостояние 		= стДанные.Состояние;
	ВидимостьКнопок();
	
КонецПроцедуры
#КонецОбласти

#Область КомандыВедущегоКонструктороа

&НаКлиенте
Процедура ДоработкаВедущийКонструктор(Команда)
	
	стДанные = ДействияНаСервере("ДоработкаВедущийКонструктор", Объект.Ссылка, Объект.Исполнитель);
	Закрыть();
	
КонецПроцедуры 


&НаКлиенте
Процедура Завершение(Команда)

	стДанные = ДействияНаСервере("Завершение", Объект.Ссылка, Объект.Исполнитель);
	Закрыть();
	
КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура История(Команда)
	
	История = ДействияНаСервере("История", Объект.Ссылка);
	Элементы.ГруппаИстория.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИсторию(Команда)
	Элементы.ГруппаИстория.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти  

&НаСервереБезКонтекста
Функция КонтрольСоответствияКонструкторов(ОбъектТЗ, КонструкторПользователь)

	Возврат омКонструктор.ПолучитьДанныеОбъекта(ОбъектТЗ, КонструкторПользователь).КонструкторПользователь;		

КонецФункции // КонтрольСоответствияКонструкторов()

&НаСервереБезКонтекста
Функция ДействияНаСервере(Действие, Задача, Параметр = Неопределено)
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;

	Если Действие = "История" Тогда
		Возврат МенеджерРегистра.ПолучитьИсториюЗадачи(Задача);
	КонецЕсли;
	
	стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(,,Перечисления.СтатусыЗадач.РКД);
	
	Если Действие = "НачатьВыполнение" Тогда 
		стДанные.Состояние 		= Перечисления.СостоянияЗадач.ВРаботеКонструктора;
		стДанные.Исполнитель	= омСотрудники.ПолучитьКонструктораРазработки(Задача);
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
	ИначеЕсли Действие = "Приостановить" Тогда
		стДанные.Состояние 	= Перечисления.СостоянияЗадач.ПриостановкаКонструктором;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
	ИначеЕсли Действие = "ЗавершениеРаботы" Тогда
		
		ВедущийКонструктор = омСотрудники.СотрудникиОбъекта(Параметр).ВедущийКонструктор;
		
		ОбъектЗадача 				= Задача.ПолучитьОбъект();
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + ".РКД.Проверка";
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором;
		ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.РКД;
		ОбъектЗадача.Исполнитель 	= ВедущийКонструктор;
		ОбъектЗадача.Записать();
		
		стДанные.Состояние 		= Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором;
		стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
		стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
		
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
		
	ИначеЕсли Действие = "ДоработкаВедущийКонструктор" Тогда
		
		Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);
		
		ОбъектЗадача 				= Задача.ПолучитьОбъект(); 
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + ".РКД.Доработка";
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.РКД;
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором;
		ОбъектЗадача.Исполнитель 	= Конструктор;
		
		ОбъектЗадача.Записать();
		
		стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
		стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
		стДанные.Состояние 		= Перечисления.СостоянияЗадач.ОжиданиеКонструктором;
		
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
		
	ИначеЕсли Действие = "Завершение" Тогда
		
		
		ОбъектЗадача 				= Задача.ПолучитьОбъект();
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + ".РКД.Завершена";
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.РКД;
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Завершение;
		ОбъектЗадача.Выполнена      = Истина;
		
		ОбъектЗадача.Записать(); 
		
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
		
	КонецЕсли;
	
	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);

	
	Возврат РегистрыСведений.ТаймингЗадач.ПолучитьСостояниеЗадачи(Задача);
	
КонецФункции // ДействияНаСервере()  

&НаКлиенте
Процедура ВидимостьКнопок()
	
	Если ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ЗавершенаКонструктором") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Ложь;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ВРаботеКонструктора") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Ложь;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Истина;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Истина;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Истина;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ОжиданиеКонструктором") Тогда
		
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Истина;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ПриостановкаКонструктором") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Истина;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		
	КонецЕсли;
	
	
КонецПроцедуры // ВидимостьКнопок()

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	ИзмененыСлужебныеНастройки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если ИзмененыСлужебныеНастройки Тогда
		ИзменитьСостоянияНаСервере(Объект.Ссылка, Объект.ОбъектТЗ, Объект.ТипЗадачи, Объект.СтатусЗадачи, Состояние);		
	Иначе
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Объект.Ссылка);
	КонецЕсли;
	
	Оповестить("ИзменениеРКД", Объект.ОбъектТЗ);
	
КонецПроцедуры  

&НаСервереБезКонтекста
Процедура ИзменитьСостоянияНаСервере(Задача, ОбъектТЗ, ТипЗадачи, СтатусЗадачи, Состояние)
	
	Исполнитель = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаймингЗадачСрезПоследних.Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Исполнитель = Выборка.Исполнитель			
	КонецЦикла;
	
	МЗ = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	МЗ.Период =  ТекущаяДата();
	МЗ.Автор = ПараметрыСеанса.ТекущийПользователь;
	МЗ.Задача = Задача;
	МЗ.Исполнитель = Исполнитель;
	МЗ.Состояние = Состояние;
	МЗ.Статус = СтатусЗадачи;
	МЗ.ТипЗадачи = ТипЗадачи;
	
	МЗ.Записать();
	
	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
	
КонецПроцедуры // ИзменитьСостоянияНаСервере()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Вставить содержимое обработчика
КонецПроцедуры

 &НаСервереБезКонтекста
Процедура СнятьСВыполненияНаСервере(Ссылка)
	Об = Ссылка.ПолучитьОбъект();
	об.Выполнена = Ложь;
	Об.Записать();
КонецПроцедуры

&НаКлиенте
Процедура СнятьСВыполнения(Команда)
	СнятьСВыполненияНаСервере(Объект.Ссылка);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ИзменениеРКД", Объект.ОбъектТЗ);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлПДМ(Команда)
	
	Если ПустаяСтрока(ПутьКФайлуПДМ) Тогда
		ПоказатьПредупреждение(,"Не удалось построить путь к файлу");
	Иначе
		
		Файл = Новый Файл(ПутьКФайлуПДМ);
		
		Если Файл.Существует() Тогда
			ФайловаяСистемаКлиент.ОткрытьПроводник(ПутьКФайлуПДМ);
		Иначе
			ПоказатьПредупреждение(,"Не существует файла " + ПутьКФайлуПДМ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ОбновитьИсполнителяНаСервере(ОбъектТЗ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Конструктор
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ДанныеКомплектаСрезПоследних.Конструктор = Пользователи.Сотрудник
		|ГДЕ
		|	ДанныеКомплектаСрезПоследних.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Конструктор;
	КонецЦикла;
	
КонецФункции


&НаКлиенте
Процедура ОбновитьИсполнителя(Команда)
	Объект.Исполнитель = ОбновитьИсполнителяНаСервере(Объект.ОбъектТЗ);
КонецПроцедуры


