&НаКлиенте
Перем ИзмененыСлужебныеНастройки, ПутьКФайлуПДМ;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Элементы.СтадияКомплекта.Видимость = Ложь;

	Иначе

		стДанные = РегистрыСведений.ТаймингЗадач.ПолучитьСостояниеЗадачи(Объект.Ссылка);
		ТекущиеСостояние 		= стДанные.Состояние;
		КрайРКД					= ПолучитьКрайРКД();
		
		Если Объект.Выполнена Тогда
			СтадияКомплекта = "Задача выполнена";
		Иначе
			СтадияКомплекта = омСтадииКомплекта.ПолучитьСтадиюКомплекта(Объект.ОбъектТЗ).ПолноеНаименование;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.Выполнена Тогда
		
		ТолькоПросмотр 										= Истина;
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;
		
	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором 
		ИЛИ Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.Разработка Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Истина;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		
	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Истина;
		
	КонецЕсли;
		
	Элементы.ОбновитьИсполнителя.Видимость = Элементы.ГруппаКнопкаКонструктора.Видимость;
	
	Состояние = ТекущиеСостояние; 
	
	ИнфрмацияГЧ();
	
	мТипыЗадачДяКонструктора = омЗадачиПКДПовтор.ТипыЗадачКонструктора();
	Если НЕ мТипыЗадачДяКонструктора.Найти(Объект.ТипЗадачи) = Неопределено Тогда
		Элементы.Исполнитель.ТолькоПросмотр = Истина;	
	КонецЕсли;
	
КонецПроцедуры 

Процедура ИнфрмацияГЧ()
	
	Дата_статуса_ГЧ 	= Дата(1, 1, 1);
	ДатаНачалаРаботы	= Дата_статуса_ГЧ;
	ОбъектИзмененияГЧ 	= Неопределено;
	СтатусЗамера 		= Перечисления.СтатусыЗамера.ПустаяСсылка();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(СостояниеЗамера.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК Дата_статуса_ГЧ,
		|	ЕСТЬNULL(СостояниеЗамера.ОбъектИзменения, НЕОПРЕДЕЛЕНО) КАК ОбъектИзмененияГЧ,
		|	ЕСТЬNULL(СостояниеЗамера.СтатусЗамера, НЕОПРЕДЕЛЕНО) КАК СтатусЗамера,
		|	ЕСТЬNULL(ДатыКомплекта.БезГабаритногоЧертежа, ЛОЖЬ) КАК БезГабаритногоЧертежа,
		|	ИзделияКомплект.ГабаритныйЧертеж КАК ГабаритныйЧертеж
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеЗамера КАК СостояниеЗамера
		|		ПО ИзделияКомплект.ГабаритныйЧертеж = СостояниеЗамера.ОбъектЗамера
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ПО (ДатыКомплекта.Комплект = ИзделияКомплект.Ссылка)
		|ГДЕ
		|	ИзделияКомплект.Ссылка = &Комплект
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(СостояниеЗамера.ОбъектИзменения, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(СостояниеЗамера.СтатусЗамера, НЕОПРЕДЕЛЕНО),
		|	ИзделияКомплект.ГабаритныйЧертеж,
		|	ЕСТЬNULL(ДатыКомплекта.БезГабаритногоЧертежа, ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ТаймингЗадачСрезПоследних.Период) КАК ДатаНачалаРаботы
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадачСрезПоследних
		|ГДЕ
		|	ТаймингЗадачСрезПоследних.Состояние = &Состояние
		|	И ТаймингЗадачСрезПоследних.ТипЗадачи В(&ТипЗадачи)
		|	И ТаймингЗадачСрезПоследних.Задача = &Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ТаймингЗадачСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ПустаяСсылка)) КАК СтатусЗадачи
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", 	Объект.ОбъектТЗ);
	Запрос.УстановитьПараметр("Задача", 	Объект.Ссылка);
	Запрос.УстановитьПараметр("ТипЗадачи", 	омЗадачиПКДПовтор.ТипыЗадачКонструктора());
	Запрос.УстановитьПараметр("Состояние", 	Перечисления.СостоянияЗадач.ВРаботеКонструктора);
	
	Результат 	= Запрос.ВыполнитьПакет();
	
	Выборка 	= Результат[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Дата_статуса_ГЧ > ЭтаФорма.Дата_статуса_ГЧ Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
		КонецЕсли;
	КонецЦикла;
	
	Выборка 	= Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);	
	КонецЦикла; 
	
	Выборка 	= Результат[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Элементы.Декорация1.Видимость 	= Выборка.СтатусЗадачи = Перечисления.СтатусыЗадач.ОжиданиеГЧ;
		ТолькоПросмотр 					= Элементы.Декорация1.Видимость;
		
	КонецЦикла; 
	
	Элементы.БезГабаритногоЧертежа.Видимость 	= БезГабаритногоЧертежа;
	Элементы.ГруппаЗамеры.Видимость 			= НЕ БезГабаритногоЧертежа;
	Элементы.Группа9.Видимость 					= НЕ Элементы.Декорация1.Видимость;
	//Элементы.ФормаЗаписать.Доступность			= НЕ Элементы.Декорация1.Видимость;
	
КонецПроцедуры  


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПутьКФайлуПДМ = омФайлы.ПолучитьПутьКФайлуПДМ(Объект.ОбъектТЗ);
	ИзмененыСлужебныеНастройки = Ложь;
	Элементы.ГруппаИстория.Видимость = Ложь;
	ВидимостьКнопок();
	Заголовок = Объект.Наименование;
	
КонецПроцедуры

Функция ПолучитьКрайРКД()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.КрайРКД КАК КрайРКД
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Объект.ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КрайРКД; 
	КонецЦикла; 
	
	Возврат Дата(1, 1, 1);
	
КонецФункции // ПолучитьКрайПКД()

#Область Команды

#Область  КомандыКонструктора

&НаКлиенте
Процедура НачатьВыполнение(Команда)
	
	КонструкторОбъекта = КонтрольСоответствияКонструкторов(Объект.ОбъектТЗ, Объект.Исполнитель);
	
	Если НЕ КонструкторОбъекта = Объект.Исполнитель Тогда
			
		ПоказатьПредупреждение(, "Конструктор в объекте " + КонструкторОбъекта + " не соответствует исполнителю");
		Возврат;
		
	КонецЕсли;
	
	НуженЗапускСкрипта = НЕ ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ПриостановкаКонструктором");

	стДанные = ДействияНаСервере("НачатьВыполнение", Объект.Ссылка, Объект.Исполнитель);
	ТекущиеСостояние 		= стДанные.Состояние;
	ВидимостьКнопок();
	
	Если НуженЗапускСкрипта Тогда
		
		стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Объект.Ссылка, "РаздатьПрава");
		
		Если ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
			Закрыть();
		Иначе
			ПоказатьПредупреждение(,стВозврата.ОписаниеОшибки);
		КонецЕсли;
		
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыполнение(Команда)
	
	Если Модифицированность Тогда
		
		ПоказатьПредупреждение(, "Не обходимо сохранить задачу.");
		Возврат;
		
	КонецЕсли;
	
	стДанные = ДействияНаСервере("ЗавершениеРаботы", Объект.Ссылка, Объект.ОбъектТЗ);
	
	стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Объект.Ссылка, "ЗабратьПрава");
	
	Если НЕ ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
		
		ПоказатьПредупреждение(,стВозврата.ОписаниеОшибки);
		
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Приостановить(Команда)
	
	стДанные = ДействияНаСервере("Приостановить", Объект.Ссылка, Объект.Исполнитель);
	ТекущиеСостояние 		= стДанные.Состояние;
	ВидимостьКнопок();
	
КонецПроцедуры
#КонецОбласти

#Область КомандыВедущегоКонструктороа

&НаКлиенте
Процедура ДоработкаВедущийКонструктор(Команда)
	
	стДанные = ДействияНаСервере("ДоработкаВедущийКонструктор", Объект.Ссылка, Объект.Исполнитель);
	Закрыть();
	
КонецПроцедуры 


&НаКлиенте
Процедура Утвердить(Команда)
	
	Ожидание = Ложь;
	СообщениеОЗавершении = ВозможноЗавершение(Ожидание);
	
	Если ПустаяСтрока(СообщениеОЗавершении) Тогда 
		
		стДанные = ДействияНаСервере("Завершение", Объект.Ссылка, Объект.Исполнитель);
		Закрыть();
		
	Иначе
		
		Если Модифицированность Тогда
			Записать();
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыводаПредупреждения", ЭтаФорма, Новый Структура("Ожидание", Ожидание));
		ПоказатьПредупреждение(Оповещение, СообщениеОЗавершении);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыводаПредупреждения(ДополнительныеПараметры) Экспорт

    Если ДополнительныеПараметры.Свойство("Ожидание") Тогда
	
		Если ДополнительныеПараметры.Ожидание = 1 Тогда
		
			стДанные = ДействияНаСервере("ОжиданиеГЧ", Объект.Ссылка);
		
		ИначеЕсли ДополнительныеПараметры.Ожидание = 0 Тогда
			
			Объект.Комментарий = Объект.Комментарий + Символы.ВК + "Перевод ГЧ в статус Рабочий был выполнен после начала конструирования. Требуется проверка.";
			Записать();
			стДанные = ДействияНаСервере("ДоработкаВедущийКонструктор", Объект.Ссылка, Объект.Исполнитель);
			
		ИначеЕсли ДополнительныеПараметры.Ожидание = 2  Тогда
			Объект.Комментарий = Объект.Комментарий + Символы.ВК + "Ожидается согласование.";
			Записать();
			стДанные = ДействияНаСервере("ОжиданиеСогласования", Объект.Ссылка, Объект.Исполнитель);
		КонецЕсли;	
		
		Закрыть();
		
	КонецЕсли;
	

КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура История(Команда)
	
	История = ДействияНаСервере("История", Объект.Ссылка);
	Элементы.ГруппаИстория.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИсторию(Команда)
	Элементы.ГруппаИстория.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Функция ВозможноЗавершение(Ожидание)

	Если БезГабаритногоЧертежа Тогда
		Ожидание = 0;
		Возврат "";	
	КонецЕсли;
	
	Если НЕ ЕстьУтверждение(Объект.ОбъектТЗ) Тогда
	
		Ожидание = 2;
		
		Возврат Строка(Объект.ОбъектТЗ) + " не согласован.";
	
	ИначеЕсли ЗначениеЗаполнено(ГабаритныйЧертеж) Тогда
		
		Если СтатусЗамера = ПредопределенноеЗначение("Перечисление.СтатусыЗамера.Рабочий") Тогда
			Если ДатаНачалаРаботы < Дата_статуса_ГЧ Тогда
				Ожидание = 0;
				Возврат "Работа над задачей началась раньше, чем перевод ГЧ в статус Рабочий.";
			КонецЕсли;
		Иначе	
			Ожидание = 1;
			Возврат "Статус габаритного чертежа " + СтатусЗамера + " для перевода в производства необходим статус Рабочий.";
		КонецЕсли;
	
	Иначе
		Ожидание = 1;
		Возврат "Незаполнен габаритный чертеж.";
	КонецЕсли; 
	
		Ожидание = 0;
	Возврат "";

КонецФункции // ВозможноЗавершение()

&НаСервереБезКонтекста
Функция ЕстьУтверждение(ОбъектТЗ)


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ДатыКомплекта.РКД_отдельно_от_композиции, ЛОЖЬ) КАК РКД_отдельно_от_композиции
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &ОбъектТЗ";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат НЕ Выборка.РКД_отдельно_от_композиции;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ЕстьУтверждение()



&НаСервереБезКонтекста
Функция КонтрольСоответствияКонструкторов(ОбъектТЗ, КонструкторПользователь)

	Возврат омКонструктор.ПолучитьДанныеОбъекта(ОбъектТЗ, КонструкторПользователь).КонструкторПользователь;		

КонецФункции // КонтрольСоответствияКонструкторов()

&НаСервереБезКонтекста
Функция ДействияНаСервере(Действие, Задача, Параметр = Неопределено)
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;

	Если Действие = "История" Тогда
		Возврат МенеджерРегистра.ПолучитьИсториюЗадачи(Задача);
	КонецЕсли;
	
	стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(,,Перечисления.СтатусыЗадач.РКД);
	ОбъектЗадача 				= Задача.ПолучитьОбъект();
	
	Если Действие = "НачатьВыполнение" Тогда 
		стДанные.Состояние 		= Перечисления.СостоянияЗадач.ВРаботеКонструктора;
		стДанные.Исполнитель	= омСотрудники.ПолучитьКонструктораРазработки(Задача);
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + ".РКД." + ОбъектЗадача.ТипЗадачи;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
	ИначеЕсли Действие = "Приостановить" Тогда
		стДанные.Состояние 	= Перечисления.СостоянияЗадач.ПриостановкаКонструктором;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
	ИначеЕсли Действие = "ЗавершениеРаботы" Тогда
		
		ВедущийКонструктор = омСотрудники.СотрудникиОбъекта(Параметр).ВедущийКонструктор;
		
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + ".РКД.Утверждение";
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором;
		ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.РКД;
		ОбъектЗадача.Исполнитель 	= ВедущийКонструктор;
		ОбъектЗадача.Записать();
		
		стДанные.Состояние 		= Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором;
		стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
		стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
		
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
	ИначеЕсли Действие = "ДоработкаВедущийКонструктор" Тогда
		
		омЗадачиРКДНаСервере.ПеревестиЗадачуВОжидание(Задача, , стДанные);
		
	ИначеЕсли Действие = "ОжиданиеСогласования" Тогда
		омЗадачиРКДНаСервере.ПеревестиЗадачуВОжиданиеСогласования(Задача);
		
	ИначеЕсли Действие = "Завершение" Тогда
		омЗадачиРКДНаСервере.ЗавершениеЗадачиРКД(Задача, стДанные);	
	ИначеЕсли Действие = "ОжиданиеГЧ" Тогда
		
		Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);

		ОбъектЗадача 				= Задача.ПолучитьОбъект();
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + ".РКД.ОжиданиеГЧ";
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.ОжиданиеГЧ;
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ГЧОжидание;
		ОбъектЗадача.Исполнитель 	= Конструктор;
		
		ОбъектЗадача.Записать(); 
		
		стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
		стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
		стДанные.Состояние 		= Перечисления.СостоянияЗадач.ПустаяСсылка();
		стДанные.Статус 		= ОбъектЗадача.СтатусЗадачи;
		
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);

		
	КонецЕсли;
	
	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);

	
	Возврат РегистрыСведений.ТаймингЗадач.ПолучитьСостояниеЗадачи(Задача);
	
КонецФункции // ДействияНаСервере()  

&НаКлиенте
Процедура ВидимостьКнопок()
	
	Если ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ЗавершенаКонструктором") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Ложь;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ВРаботеКонструктора") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Ложь;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Истина;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Истина;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Истина;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ОжиданиеКонструктором") Тогда
		
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Истина;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ПриостановкаКонструктором") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Истина;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		
	КонецЕсли;
	
	Если Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость Тогда
		
		 ВозвможностьПеревести = омЗадачиПКДСервер.ВозвможностьПеревестиЗадачуВРаботу(Объект.Исполнитель);
		 
		 Если ВозвможностьПеревести.ЕстьВозможность Тогда
		 
			 Элементы.ДекорацияНетВозможностиЗапустить.Видимость = Ложь;
			 
		 Иначе
			 
			 Элементы.ДекорацияНетВозможностиЗапустить.Видимость 	= Истина;
			 Элементы.ДекорацияНетВозможностиЗапустить.Заголовок 	= ВозвможностьПеревести.Описание;
			 Элементы.КнопкаНачатьВыполнениеКонструктор.Доступность = Ложь;
		 
		 КонецЕсли; 
		 
	 Иначе
		 
		 Элементы.ДекорацияНетВозможностиЗапустить.Видимость = Ложь;
		 
	 КонецЕсли;
	

	
	
КонецПроцедуры // ВидимостьКнопок()

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	ИзмененыСлужебныеНастройки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если ИзмененыСлужебныеНастройки Тогда
		ИзменитьСостоянияНаСервере(Объект.Ссылка, Объект.ОбъектТЗ, Объект.ТипЗадачи, Объект.СтатусЗадачи, Состояние);		
	Иначе
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Объект.Ссылка);
	КонецЕсли;
	
	Оповестить("ИзменениеРКД", Объект.ОбъектТЗ);
	
КонецПроцедуры  

&НаСервереБезКонтекста
Процедура ИзменитьСостоянияНаСервере(Задача, ОбъектТЗ, ТипЗадачи, СтатусЗадачи, Состояние)
	
	Исполнитель = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаймингЗадачСрезПоследних.Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Исполнитель = Выборка.Исполнитель			
	КонецЦикла;
	
	МЗ = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	МЗ.Период =  ТекущаяДата();
	МЗ.Автор = ПараметрыСеанса.ТекущийПользователь;
	МЗ.Задача = Задача;
	МЗ.Исполнитель = Исполнитель;
	МЗ.Состояние = Состояние;
	МЗ.Статус = СтатусЗадачи;
	МЗ.ТипЗадачи = ТипЗадачи;
	
	МЗ.Записать();
	
	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
	
КонецПроцедуры // ИзменитьСостоянияНаСервере()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Вставить содержимое обработчика
КонецПроцедуры

 &НаСервереБезКонтекста
Процедура СнятьСВыполненияНаСервере(Ссылка)
	Об = Ссылка.ПолучитьОбъект();
	об.Выполнена = Ложь;
	Об.Записать();
КонецПроцедуры

&НаКлиенте
Процедура СнятьСВыполнения(Команда)
	СнятьСВыполненияНаСервере(Объект.Ссылка);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ИзменениеРКД", Объект.ОбъектТЗ);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлПДМ(Команда)
	
	Если ПустаяСтрока(ПутьКФайлуПДМ) Тогда
		ПоказатьПредупреждение(,"Не удалось построить путь к файлу");
	Иначе
		
		Файл = Новый Файл(ПутьКФайлуПДМ);
		
		Если Файл.Существует() Тогда
			ФайловаяСистемаКлиент.ОткрытьПроводник(ПутьКФайлуПДМ);
		Иначе
			ПоказатьПредупреждение(,"Не существует файла " + ПутьКФайлуПДМ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ОбновитьИсполнителяНаСервере(ОбъектТЗ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Конструктор
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ДанныеКомплектаСрезПоследних.Конструктор = Пользователи.Сотрудник
		|ГДЕ
		|	ДанныеКомплектаСрезПоследних.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Конструктор;
	КонецЦикла;
	
КонецФункции


&НаКлиенте
Процедура ОбновитьИсполнителя(Команда)
	Объект.Исполнитель = ОбновитьИсполнителяНаСервере(Объект.ОбъектТЗ);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГЧ(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


