
&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.РасширениеВБезопасномРежиме() Тогда
		ПоказатьПредупреждение(, "Расширение модуля в безопасном режиме. Продолжение невозможно",10);
		Возврат;
	КонецЕсли;
	
	КоличествоНастроек = ПолучитьКоличествоНастроекПодключения();
	Если КоличествоНастроек > 1 Тогда
		
		ВыбЗнач 	= Неопределено;
		
		Массив 		= Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Б24_К_НастройкиПодключения"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Ответ = Ждать ВвестиЗначениеАсинх(ВыбЗнач, "Укажите настройку подключения", ОписаниеТипов);
		Если Ответ = Неопределено Тогда
			Возврат;
		КонецЕсли;          
		
		НастройкаПодключения = Ответ;
		
	Иначе   
		НастройкаПодключения = ПолучитьНастройкуПодключенияПоУмолчанию(); 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкаПодключения) Тогда

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НастройкаПодключения"	, НастройкаПодключения);
		ПараметрыФормы.Вставить("ПолнаяВыгрузка"		, Ложь);
		
		ОткрытьФорму("РегистрСведений.Б24_СУ_Настройки.Форма.ФормаВыполнениеВыгрузки", ПараметрыФормы, , ВыбЗнач);

	КонецЕсли;
	
КонецПроцедуры   


&НаСервере 
Функция ПолучитьКоличествоНастроекПодключения()
	Возврат РегистрыСведений.Б24_СУ_Настройки.ПолучитьКоличествоНастроекПодключения();
КонецФункции

&НаСервере 
Функция ПолучитьНастройкуПодключенияПоУмолчанию()
	Возврат РегистрыСведений.Б24_СУ_Настройки.ПолучитьНастройкуПодключенияПоУмолчанию();
КонецФункции

