
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
КонецПроцедуры


&НаСервереБезКонтекста
Функция ЗаполнитьПоПодрядчикуНаСервере(Дата, Подрядчик, мВыбранныеКомплекты)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомплектыУПодрядчикаОстатки.ИзделиеКомплект КАК ИзделиеКомплект
		|ИЗ
		|	РегистрНакопления.КомплектыУПодрядчика.Остатки(&Дата, Подрядчик = &Подрядчик) КАК КомплектыУПодрядчикаОстатки
		|ГДЕ
		|	КомплектыУПодрядчикаОстатки.КоличествоОстаток > 0
		|	И НЕ КомплектыУПодрядчикаОстатки.ИзделиеКомплект В (&мВыбранныеКомплекты)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КомплектыУПодрядчикаОстатки.ИзделиеКомплект.Наименование";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("Подрядчик", Подрядчик);
	Запрос.УстановитьПараметр("мВыбранныеКомплекты", мВыбранныеКомплекты);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИзделиеКомплект");
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоПодрядчику(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Подрядчик) Тогда
		ПоказатьПредупреждение(, "Не заполнен подрядчик");
		Возврат;
	КонецЕсли;
	
	мВыбранныеКомплекты = Новый Массив;
	
	Для каждого х Из Объект.ИзделияКомплекты Цикл
		мВыбранныеКомплекты.Добавить(х.ИзделиеКомплект);	
	КонецЦикла;
	
	Для каждого х Из ЗаполнитьПоПодрядчикуНаСервере(Объект.Дата, Объект.Подрядчик, мВыбранныеКомплекты) Цикл
		НС = Объект.ИзделияКомплекты.Добавить();
		НС.ИзделиеКомплект = х;
	КонецЦикла;
	
КонецПроцедуры

