Функция ПолучитьСтадиюКомплекта(Комплект) Экспорт
	
	СтруктураВозврата = Новый Структура("ТекущаяСтадия, ПолноеНаименование, ОсновнойЭтап, Статус, ТипЗадачи, Состояние", 
										Справочники.СтадииКомплекта.ПустаяСсылка()
										, ""
										, Перечисления.СтатусыЗадач.ПустаяСсылка()
										, Перечисления.ТипыЗадачКонструирования.ПустаяСсылка()
										, Перечисления.СостоянияЗадач.ПустаяСсылка());	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплекта.ТекущаяСтадия КАК ТекущаяСтадия,
		|	ДанныеКомплекта.ТекущаяСтадия.ПолноеНаименование КАК ПолноеНаименование,
		|	ДанныеКомплекта.ТекущаяСтадия.ОсновнойЭтап КАК ОсновнойЭтап,
		|	ЕСТЬNULL(СтадииКомплектаРеквизитыСтадии.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ПустаяСсылка)) КАК Статус,
		|	ЕСТЬNULL(СтадииКомплектаРеквизитыСтадии.ТипЗадачи, ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.ПустаяСсылка)) КАК ТипЗадачи,
		|	ЕСТЬNULL(СтадииКомплектаРеквизитыСтадии.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПустаяСсылка)) КАК Состояние
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплекта
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|		ПО ДанныеКомплекта.ТекущаяСтадия = СтадииКомплектаРеквизитыСтадии.Ссылка
		|			И (СтадииКомплектаРеквизитыСтадии.НомерСтроки = 1)";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЦикла; 
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьСтадиюКомплекта()

Функция УстановитьСтатусСУчетомГлобальныхНастроек(ОбъектЗадача) Экспорт

	ГлобальнаяПриостановкаРаботы = Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГлабольныеСостояниеКомплектаСрезПоследних.ГлобальныйСтатус КАК ГлобальныйСтатус
		|ИЗ
		|	РегистрСведений.ГлабольныеСостояниеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ГлабольныеСостояниеКомплектаСрезПоследних
		|ГДЕ
		|	ГлабольныеСостояниеКомплектаСрезПоследних.ГлобальныйСтатус = &ГлобальныйСтатус";
	
	Запрос.УстановитьПараметр("ГлобальныйСтатус", 	ГлобальнаяПриостановкаРаботы);
	Запрос.УстановитьПараметр("Комплект", 			ОбъектЗадача.ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		
		МенеджерРегистра = РегистрыСведений.ТаймингЗадач;
		
		ВедущийКонструктор = омСотрудники.СотрудникиОбъекта(ОбъектЗадача.ОбъектТЗ).ВедущийКонструктор;
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором;
		ОбъектЗадача.Исполнитель 	= ВедущийКонструктор;
		ОбъектЗадача.Записать();
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором, ВедущийКонструктор, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ОбъектЗадача.Ссылка, стДанные);
		
	Иначе
		
		УстановитьГлобальныйСтатус(ОбъектЗадача.ОбъектТЗ, ГлобальнаяПриостановкаРаботы, , , , ОбъектЗадача.Ссылка);
		
	КонецЕсли;
	

КонецФункции // УстановитьСтатусСУчетомГлобальныхНастроек()

Функция УстановитьГлобальныйСтатусСУчетомРаботыКонструктора(Комплект, ГлобальныйСтатус, ДатаСтатуса = Неопределено, Автор  = Неопределено, Комментарий = "") Экспорт

	СтруктураДанных = омЗадачиОбщие.ПолучитьЗадачуПоОбъекту(Комплект);
	
	Если СтруктураДанных = Неопределено Тогда
		СтадияКомплекта = омЗадачиПКДСервер.ПолучитьСтруктуруСтадий(Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы);
		НоваяСтадия = омЗадачиПКДСервер.ПолучитьСтадиюКомплеткаНаОснованииПараметров(СтадияКомплекта);
		Если ЗначениеЗаполнено(НоваяСтадия) Тогда
			стПараметры = Новый Структура("Комплект, ТекущаяСтадия", Комплект, НоваяСтадия);
			РегистрыСведений.ДанныеКомплекта.ИзменитьДанныеКомплекта(стПараметры);
		КонецЕсли;                                 
	Иначе
		Если НЕ СтруктураДанных.РаботаКонструктора Тогда
			УстановитьГлобальныйСтатус(Комплект, ГлобальныйСтатус, ДатаСтатуса, Автор, Комментарий, СтруктураДанных.Задача);
		КонецЕсли;
	КонецЕсли;                                 
КонецФункции // УстановитьГлобальныйСтатусСУчетомРаботыКонструктора()

Функция УстановитьГлобальныйСтатус(Комплект, ГлобальныйСтатус, ДатаСтатуса = Неопределено, Автор  = Неопределено, Комментарий = "", ТекущаяЗадача = Неопределено) Экспорт
	
	Если ТекущаяЗадача = Неопределено Тогда
		СтруктураДанных = омЗадачиОбщие.ПолучитьЗадачуПоОбъекту(Комплект);
		Если СтруктураДанных = Неопределено Тогда
			Возврат Неопределено;
		Иначе
			Задача = СтруктураДанных.Задача;
		КонецЕсли;
	Иначе
		Задача = ТекущаяЗадача;
	КонецЕсли;
	
	МенеждерЗаписи = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	МенеждерЗаписи.Задача 		= Задача;
	МенеждерЗаписи.Период 		= ?(ДатаСтатуса = Неопределено, ТекущаяДата(), 							ДатаСтатуса);
	МенеждерЗаписи.Автор		= ?(Автор = Неопределено, 		ПараметрыСеанса.ТекущийПользователь, 	Автор);
	МенеждерЗаписи.Исполнитель	= Справочники.Организации.ПолучитьФиндиректораОрганизации();
	МенеждерЗаписи.Статус		= ГлобальныйСтатус;
	МенеждерЗаписи.ТипЗадачи	= Перечисления.ТипыЗадачКонструирования.ПустаяСсылка();
	МенеждерЗаписи.Состояние	= Перечисления.СостоянияЗадач.ПустаяСсылка();
	
	Если НЕ ПустаяСтрока(Комментарий) Тогда
		
		УИД = Новый УникальныйИдентификатор();
		МенеждерЗаписи.УИД = УИД;
		
		МенеджерКомментария = РегистрыСведений.ТаймингЗадачКомментарии.СоздатьМенеджерЗаписи();
		МенеджерКомментария.Комментарий	= Комментарий;
		МенеджерКомментария.УИД			= УИД;
		МенеджерКомментария.Записать();
		
	КонецЕсли;
	
	МенеждерЗаписи.Записать();
	
	СтадияКомплекта = омЗадачиПКДСервер.ПолучитьСтруктуруСтадий(Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы);
	
	НоваяСтадия = омЗадачиПКДСервер.ПолучитьСтадиюКомплеткаНаОснованииПараметров(СтадияКомплекта);
	
	Если ЗначениеЗаполнено(НоваяСтадия) Тогда
		
		стПараметры = Новый Структура("Комплект, ТекущаяСтадия", Комплект, НоваяСтадия);
		РегистрыСведений.ДанныеКомплекта.ИзменитьДанныеКомплекта(стПараметры);
		
		Если ТипЗнч(Комплект) = Тип("СправочникСсылка.Композиции") Тогда
			
			МассивКомплектов = омКомпозицииСервер.ПолучитьКомелектыКомпозицииБезСогласованных(Комплект);
			
			Для каждого ТекущийКомплект Из МассивКомплектов Цикл
				стПараметры = Новый Структура("Комплект, ТекущаяСтадия", ТекущийКомплект, НоваяСтадия);
				РегистрыСведений.ДанныеКомплекта.ИзменитьДанныеКомплекта(стПараметры);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции // УстановитьГлобалтныйСтатус()

Функция ПолучитьСтадииПоСтатусу(Статус) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплектаРеквизитыСтадии.Ссылка КАК Стадия
		|ИЗ
		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|ГДЕ
		|	СтадииКомплектаРеквизитыСтадии.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Статус);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Стадия");
	
	
КонецФункции // ПолучитьСтадииПоСтатусу()
