Функция ПолучитьСтадиюКомплекта(Комплект) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплекта.ТекущаяСтадия КАК ТекущаяСтадия
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплекта";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ТекущаяСтадия;
	КонецЦикла; 
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка();
	
КонецФункции // ПолучитьСтадиюКомплекта()
