Функция ПолучитьСтадиюКомплекта(Комплект) Экспорт
	
	СтруктураВозврата = Новый Структура("ТекущаяСтадия, ПолноеНаименование", Справочники.СтадииКомплекта.ПустаяСсылка(), "");	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплекта.ТекущаяСтадия КАК ТекущаяСтадия,
		|	ДанныеКомплекта.ТекущаяСтадия.ПолноеНаименование КАК ПолноеНаименование
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплекта";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
		Возврат СтруктураВозврата;
	КонецЦикла; 
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьСтадиюКомплекта()
