Функция ПолучитьСтадиюКомплекта(Комплект) Экспорт
	
	СтруктураВозврата = Новый Структура("ТекущаяСтадия, ПолноеНаименование", Справочники.СтадииКомплекта.ПустаяСсылка(), "");	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплекта.ТекущаяСтадия КАК ТекущаяСтадия,
		|	ДанныеКомплекта.ТекущаяСтадия.ПолноеНаименование КАК ПолноеНаименование
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплекта";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
		Возврат СтруктураВозврата;
	КонецЦикла; 
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьСтадиюКомплекта()

Функция УстановитьГлобальныйСтатус(Комплект, ГлобальныйСтатус, ДатаСтатуса = Неопределено, Автор  = Неопределено, Комментарий = "") Экспорт

	Задача = омЗадачиОбщие.ПолучитьЗадачуПоОбъекту(Комплект);
	
	Если ЗначениеЗаполнено(Задача) Тогда
	
		МенеждерЗаписи = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
		МенеждерЗаписи.Задача 		= Задача;
		МенеждерЗаписи.Период 		= ?(ДатаСтатуса = Неопределено, ТекущаяДата(), 							ДатаСтатуса);
		МенеждерЗаписи.Автор		= ?(Автор = Неопределено, 		ПараметрыСеанса.ТекущийПользователь, 	Автор);
		МенеждерЗаписи.Исполнитель	= Справочники.Пользователи.ПустаяСсылка();
		МенеждерЗаписи.Состояние	= Перечисления.СостоянияЗадач.ПустаяСсылка();
		МенеждерЗаписи.Статус		= ГлобальныйСтатус;
		МенеждерЗаписи.ТипЗадачи	= Перечисления.ТипыЗадачКонструирования.ПустаяСсылка();
		
		Если НЕ ПустаяСтрока(Комментарий) Тогда
		
			УИД = Новый УникальныйИдентификатор();
			МенеждерЗаписи.УИД = УИД;
			
			МенеджерКомментария = РегистрыСведений.ТаймингЗадачКомментарии.СоздатьМенеджерЗаписи();
			МенеджерКомментария.Комментарий	= Комментарий;
			МенеджерКомментария.УИД			= УИД;
			МенеджерКомментария.Записать();
			
		КонецЕсли;
		
		МенеждерЗаписи.Записать();
		
	КонецЕсли;                                 
	
	СтадияКомплекта = омЗадачиПКДСервер.ПолучитьСтруктуруСтадий(Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы);
	
	НоваяСтадия = омЗадачиПКДСервер.ПолучитьСтадиюКомплеткаНаОснованииПараметров(СтадияКомплекта);
	
	Если ЗначениеЗаполнено(НоваяСтадия) Тогда
		
		стПараметры = Новый Структура("Комплект, ТекущаяСтадия", Комплект, НоваяСтадия);
		РегистрыСведений.ДанныеКомплекта.ИзменитьДанныеКомплекта(стПараметры);
		
		Если ТипЗнч(Комплект) = Тип("СправочникСсылка.Композиции") Тогда
			
			МассивКомплектов = омКомпозицииСервер.ПолучитьКомелектыКомпозицииБезСогласованных(Комплект);
			
			Для каждого ТекущийКомплект Из МассивКомплектов Цикл
				стПараметры = Новый Структура("Комплект, ТекущаяСтадия", ТекущийКомплект, НоваяСтадия);
				РегистрыСведений.ДанныеКомплекта.ИзменитьДанныеКомплекта(стПараметры);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

КонецФункции // УстановитьГлобалтныйСтатус()
