&НаКлиенте
Перем МассивАдресовКартинок, ВсегоКартинокОбразца, НомерКартинкиОбразца, ИзменилисьФайлы, МассивДанных;

&НаКлиенте
Процедура ИнформацияОКартинках(ТекущийНомерКартинки = 0)

	ВсегоКартинок = омКартинкиНаСервере.ПолучитьИнформациюОКартинках(Объект.Ссылка, Истина);
	НомерКартинки = ТекущийНомерКартинки;

КонецПроцедуры // ИнформацияОКартинках()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);

	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата 									= ТекущаяДата();
		Объект.СтатусЗаявки								= Перечисления.СтатусыЗаявкиНаОбразец.ВРаботе;
	КонецЕсли;
	
	омКомментарииНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКомментарий, Ложь); 
	ДополнительныеПараметры 				= Неопределено;
	Этаформа.Комментарий_авто 				= омКомментарииНаСервере.Получить_HTML_комментарий(Объект.Комментарии, , , ДополнительныеПараметры);
	Элементы.ГруппаКомментарий.Заголовок 	= омКомментарийКлиентСервер.ПолучитьЗаголовокСтраницы(ДополнительныеПараметры);
	Элементы.ГруппаКомментарий.Видимость 	= Ложь; 
	
	Элементы.Производство.Доступность 	= РольДоступна("ПолныеПрава") ИЛИ РольДоступна("НачальникПроизводства");
	Элементы.ФормаПринятие.Доступность 	= Объект.Проведен;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Объект.Файлы.Очистить();
	
	Для каждого х Из МассивДанных Цикл
	
		ЗаполнитьЗначенияСвойств(Объект.Файлы.Добавить(), х);	
	
	КонецЦикла;
	
	Если ИзменилисьФайлы Тогда
		
		ИзменилисьФайлы = Ложь;

		МаксимальныйИндекс = Объект.Файлы.Количество() - 1;
		
		ИзменилсяНомерПоПорядку = Новый Массив;
		ПредыдущиеЗначения 		= Новый Массив;
		НовыеКартинки			= Новый Массив;
		
		Для х = 0 по МаксимальныйИндекс Цикл
			
			ТекущаяСтрока = Объект.Файлы[х];
			
			Если ТекущаяСтрока.НовыйФайл Тогда
				НовыеКартинки.Добавить(Новый Структура("Картинка, Расширение, ИмяФайла, ТекущийИндекс"
				, ТекущаяСтрока.Картинка, ТекущаяСтрока.Расширение, ТекущаяСтрока.ИмяФайла, ТекущаяСтрока.НомерСтроки));
				ТекущаяСтрока.НовыйФайл = Ложь;
			Иначе
				
				Если ТекущаяСтрока.НачальныйИндексСтроки = ТекущаяСтрока.НомерСтроки Тогда
					ПредыдущиеЗначения.Добавить(ТекущаяСтрока.НомерСтроки); 
				Иначе
					ИзменилсяНомерПоПорядку.Добавить(Новый Структура("НачальныйИндекс, ТекущийИндекс", ТекущаяСтрока.НачальныйИндексСтроки, ТекущаяСтрока.НомерСтроки));	
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	
		ЗаписатьФайлыНаСервере(Объект.Ссылка, ИзменилсяНомерПоПорядку, ПредыдущиеЗначения, НовыеКартинки);
		
		НачальныйИндексСтроки = 1;
		Для каждого х Из Объект.Файлы Цикл
			
			х.НачальныйИндексСтроки = НачальныйИндексСтроки;
			НачальныйИндексСтроки = НачальныйИндексСтроки + 1;
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьФайлыНаСервере(ОбъектТЗ, ИзменилсяНомерПоПорядку, ПредыдущиеЗначения, НовыеКартинки)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартинкиОбъектов.НомерПоПорядку КАК НомерПоПорядку,
		|	ЛОЖЬ КАК Обработан
		|ИЗ
		|	РегистрСведений.КартинкиОбъектов КАК КартинкиОбъектов
		|ГДЕ
		|	КартинкиОбъектов.ОбъектТЗ = &ОбъектТЗ";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	ТекущиеЗначение = Запрос.Выполнить().Выгрузить();
	
	Для каждого х Из ИзменилсяНомерПоПорядку Цикл
	
		МенеджерЗаписи = РегистрыСведений.КартинкиОбъектов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ОбъектТЗ = ОбъектТЗ;
		МенеджерЗаписи.НомерПоПорядку = х.НачальныйИндекс;
		МенеджерЗаписи.Прочитать();
		
	    МенеджерЗаписи.НомерПоПорядку = х.ТекущийИндекс;
		
		НайденаяСтрока = ТекущиеЗначение.Найти(х.ТекущийИндекс, "НомерПоПорядку");
		
		Если НЕ НайденаяСтрока = Неопределено Тогда
			НайденаяСтрока.Обработан = Истина;
		КонецЕсли;
		
	КонецЦикла;	
	
	Для каждого х Из ПредыдущиеЗначения Цикл
	
		НайденаяСтрока = ТекущиеЗначение.Найти(х, "НомерПоПорядку");
		
		Если НЕ НайденаяСтрока = Неопределено Тогда
			НайденаяСтрока.Обработан = Истина;
		КонецЕсли;
	
	КонецЦикла;
	
	Для каждого х Из НовыеКартинки Цикл
		
		МенеджерЗаписи = РегистрыСведений.КартинкиОбъектов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ОбъектТЗ 		= ОбъектТЗ;
		МенеджерЗаписи.НомерПоПорядку 	= х.ТекущийИндекс;
		МенеджерЗаписи.Расширение 		= х.Расширение;
		МенеджерЗаписи.ИмяФайла 		= х.ИмяФайла;
		МенеджерЗаписи.Картинка 		= Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(х.Картинка));
		
		НайденаяСтрока = ТекущиеЗначение.Найти(х, "НомерПоПорядку");
		
		Если НЕ НайденаяСтрока = Неопределено Тогда
			НайденаяСтрока.Обработан = Истина;
		КонецЕсли;
		
		МенеджерЗаписи.Записать();

	КонецЦикла; 
	
	Для каждого х Из ТекущиеЗначение Цикл
	
		Если НЕ х.Обработан Тогда
		
			МенеджерЗаписи = РегистрыСведений.КартинкиОбъектов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ОбъектТЗ = ОбъектТЗ;
			МенеджерЗаписи.НомерПоПорядку 	= х.НомерПоПорядку; 
			
			МенеджерЗаписи.Удалить();
		
		КонецЕсли;	
	
	КонецЦикла;
		
КонецПроцедуры // ЗаписатьФайлыНаСервере(ИзменилсяНомерПоПорядку, ПредыдущиеЗначения, НовыеКартинки)
 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МассивАдресовКартинок = Новый Массив;
	
	ВсегоКартинокОбразца = 0;
	НомерКартинкиОбразца = 0; 
	
	ИзменилисьФайлы 	= Ложь;
	
	НачальныйИндексСтроки = 1;
	Для каждого х Из Объект.Файлы Цикл
		
		х.НачальныйИндексСтроки = НачальныйИндексСтроки;
		НачальныйИндексСтроки = НачальныйИндексСтроки + 1;
		
	КонецЦикла;

КонецПроцедуры 

&НаКлиенте
Процедура ОбщаяКомандаКомментарий(Команда)
	омКомментарииНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяКомандаВсеКомментарии(Команда)
	омКомментарииНаКлиенте.ВсеКомментарий(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры

&НаКлиенте
Процедура ИзделиеЗаказчикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Возврат;
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		
		ДополнительныеПараметры = Новый Структура("Отказ, ТолькоНеИспользованые, НомерПоПорядку" ,Ложь ,Ложь ,0);
		омИзделиеЗаказчикаКлиент.ОткрытьПодборИзделияЗаказчика(Объект, ЭтаФорма, Неопределено, СтандартнаяОбработка, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзделияЗаказчика(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;                         
	
	Объект.ИзделиеЗаказчика = Результат;	
	
КонецПроцедуры // ПослеВыбораИзделияЗаказчика()

&НаКлиенте
Процедура КартинкаВЛево(Команда)
	НомерКартинкиОбразца = НомерКартинкиОбразца - 1;
	ВывестиКартинкуПослеСмещения();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаВПраво(Команда)
	НомерКартинкиОбразца = НомерКартинкиОбразца + 1;
	ВывестиКартинкуПослеСмещения();
КонецПроцедуры

&НаКлиенте
Процедура ВывестиКартинкуПослеСмещения()
	ТД = Элементы.Образцы.ТекущиеДанные;

	Если ТД = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТД.Образец) Тогда
		
		ВывестиКартинкиОбразца(ТД.Образец);
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОбразцыПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.Образцы.ТекущиеДанные;
	
	КартинкаОбразца 		= Неопределено;
	ВсегоКартинокОбразца 	= 0;
	НомерКартинкиОбразца 	= 0;
	ОписаниеНомерКартинки 	= "";
	
	Если ТД = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТД.Образец) Тогда
		
		ВывестиКартинкиОбразца(ТД.Образец);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВывестиКартинкиОбразца(Образец)

	ОбразецНайден = Ложь;
	
	Для каждого КартинкиОбразца Из МассивАдресовКартинок Цикл
		
		Если КартинкиОбразца.Образец = Образец Тогда
			ОбразецНайден = Истина;
			ВывестиКартинкуОбразца(КартинкиОбразца, НомерКартинкиОбразца);
		КонецЕсли;	
		
	КонецЦикла;
	
	Если НЕ ОбразецНайден Тогда
		
		КартинкиОбразца = ПолучитьДанныеКартинки(Образец, ЭтаФорма.УникальныйИдентификатор);
		МассивАдресовКартинок.Добавить(КартинкиОбразца);
		ВывестиКартинкуОбразца(КартинкиОбразца, НомерКартинкиОбразца);
		
	КонецЕсли;


КонецПроцедуры 

&НаКлиенте
Процедура ВывестиКартинкуОбразца(КартинкиОбразца, НомерКартинкиОбразца)
	
	Если КартинкиОбразца = Неопределено Тогда
		
		КартинкаОбразца = Неопределено;
		ВсегоКартинокОбразца = 0;
		НомерКартинкиОбразца = 0;
		
	Иначе
		
		ВсегоКартинокОбразца = КартинкиОбразца.МассивАдресов.Количество();
		
		Если ВсегоКартинокОбразца = 0 Тогда
			Элементы.КартинкаВлево.Доступность 	= Ложь;
			Элементы.КартинкаВправо.Доступность = Ложь;
		Иначе	
			Элементы.КартинкаВлево.Доступность 	= НомерКартинкиОбразца > 0;
			Элементы.КартинкаВправо.Доступность = НомерКартинкиОбразца < ВсегоКартинокОбразца - 1;
			
			КартинкаОбразца 		= КартинкиОбразца.МассивАдресов[НомерКартинкиОбразца].Картинка;
			ОписаниеНомерКартинки 	= КартинкиОбразца.МассивАдресов[НомерКартинкиОбразца].Описание + " (" + (НомерКартинкиОбразца + 1) + "/" + ВсегоКартинокОбразца + ")";
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьДанныеКартинки(Образец, УникальныйИдентификатор)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартинкиОбъектов.Картинка КАК Картинка,
		|	КартинкиОбъектов.Описание КАК Описание
		|ИЗ
		|	РегистрСведений.КартинкиОбъектов КАК КартинкиОбъектов
		|ГДЕ
		|	КартинкиОбъектов.ОбъектТЗ = &ОбъектТЗ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КартинкиОбъектов.НомерПоПорядку";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", Образец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КартинкиОбразца = Новый Структура("Образец, МассивАдресов", Образец, Новый Массив);
	
	Пока Выборка.Следующий() Цикл
		СтруктураДанных = Новый Структура("Описание", Выборка.Описание);
		СтруктураДанных.Вставить("Картинка", (ПоместитьВоВременноеХранилище(Выборка.Картинка.Получить(), УникальныйИдентификатор)));
		КартинкиОбразца.МассивАдресов.Добавить(СтруктураДанных);
	КонецЦикла;
	
	Возврат КартинкиОбразца;
	
КонецФункции // ПолучитьДанныеКартинки()

&НаКлиенте
Процедура ОбразцыПриИзменении(Элемент)
	ОбразцыПриАктивизацииСтроки(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриложитьФайл(Команда)
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбора.Фильтр = омКартинкиНаСервереКлиенте.ПолучитьСтрокуДляВыбораКартинок();
	ДиалогВыбора.Фильтр = ДиалогВыбора.Фильтр  + "|Файлы pdf (*.pdf)|*.pdf";
	ДиалогВыбора.Заголовок 						= "Выберите файл";
	ДиалогВыбора.ПредварительныйПросмотр 		= Истина;
	ДиалогВыбора.ПроверятьСуществованиеФайла 	= Истина;
	ДиалогВыбора.ИндексФильтра 					= 0; 
	ДиалогВыбора.МножественныйВыбор				= Ложь;
	
	Если ДиалогВыбора.Выбрать() Тогда
		
		ИмяФайла = ДиалогВыбора.ПолноеИмяФайла;
		
		Файл = Новый Файл(ИмяФайла);
		
		НС = Объект.Файлы.Добавить();
		НС.Расширение 	= Файл.Расширение;
		НС.НовыйФайл 	= Истина;
		НС.ИмяФайла 	= Файл.ИмяБезРасширения;
		НС.Загружен 	= Истина;
		НС.Картинка 	= омКартинкиНаКлиенте.ПолучитьАдресКартинкиИзФайла(ИмяФайла, ЭтаФорма.УникальныйИдентификатор);
		
		ИзменилисьФайлы = Истина;

		Модифицированность = Истина;
	КонецЕсли;     
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись)); 
КонецПроцедуры

&НаКлиенте
Процедура Производство(Команда)
	Объект.СтатусЗаявки	= ПредопределенноеЗначение("Перечисление.СтатусыЗаявкиНаОбразец.Контроль");
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)); 
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда)
	Объект.СтатусЗаявки	= ПредопределенноеЗначение("Перечисление.СтатусыЗаявкиНаОбразец.Завершена");
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись)); 
КонецПроцедуры

&НаКлиенте
Процедура Дополнение(Команда)
	Объект.СтатусЗаявки	= ПредопределенноеЗначение("Перечисление.СтатусыЗаявкиНаОбразец.ВПроизводстве");
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись)); 
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.Файлы.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
	
		Элементы.КартинкаФайла.Видимость 	= Ложь;	
		Элементы.ПолеPDF.Видимость 			= Ложь;	
	
	ИначеЕсли ТД.Загружен Тогда
	
		ВывестиКартинкуНаФорму(ТД);
		
	Иначе
		
		ДанныеКартинки 	= омКартинкиНаСервере.ПолучитьКартинкуСтрокой(Объект.Ссылка, ЭтаФорма.УникальныйИдентификатор, ТД.НомерСтроки);
		Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
			
			ТД.Картинка 	= ДанныеКартинки.КартинкаСтрокой;
			ТД.Расширение 	= ДанныеКартинки.Расширение;
			
		Иначе
			
			ТД.Картинка 	= "";
			ТД.Расширение 	= "";
			
		КонецЕсли;
		
		ТД.Загружен 	= Истина;
		ВывестиКартинкуНаФорму(ТД);
	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайл(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ВывестиКартинкуНаФорму(ТД)

	Если ПустаяСтрока(ТД.Картинка) Тогда
	
		Элементы.КартинкаФайла.Видимость 	= Ложь;	
		Элементы.ПолеPDF.Видимость 			= Ложь;	
		
		Возврат;
	
	КонецЕсли;
	
	ТипФайла = омКартинкиНаСервереКлиенте.ПолучитьТипФайлаПоРасширению(ТД.Расширение);
	
	Если ТипФайла = "picture" Тогда
		
		Элементы.КартинкаФайла.Видимость 	= Истина;	
		Элементы.ПолеPDF.Видимость 			= Ложь;
		КартинкаФайла 						= ТД.Картинка;
		
	ИначеЕсли ТипФайла = "pdf" Тогда
		
		Элементы.КартинкаФайла.Видимость 	= Ложь;	
		Элементы.ПолеPDF.Видимость 			= Истина;
		ИмяВременногоФайла = омPDF_Клиент.ПоказатьФайлПоАдресуХранилища(ТД.Картинка, ПолеPDF);	
		
	ИначеЕсли ТипФайла = "xls" Тогда
		

	Иначе	         
		Элементы.КартинкаФайла.Видимость 	= Ложь;	
		Элементы.ПолеPDF.Видимость 			= Ложь;	
	КонецЕсли;
	

КонецПроцедуры // ВывестиКартинку(ТД)

&НаКлиенте
Процедура ФайлыПриИзменении(Элемент)
	ИзменилисьФайлы = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	МассивДанных = Новый Массив;
	
	Для каждого х Из Объект.Файлы Цикл
	
		Данные = Новый Структура();
		Данные.Вставить("НомерСтроки", 				х.НомерСтроки);
		Данные.Вставить("ИмяФайла", 				х.ИмяФайла);
		Данные.Вставить("Картинка", 				х.Картинка);
		Данные.Вставить("НовыйФайл", 				х.НовыйФайл);
		Данные.Вставить("Загружен", 				х.Загружен);
		Данные.Вставить("Расширение", 				х.Расширение);
		Данные.Вставить("НачальныйИндексСтроки", 	х.НачальныйИндексСтроки);
		
		МассивДанных.Добавить(Данные);
	КонецЦикла;
КонецПроцедуры






