
#Область Картинки
&НаКлиенте
Перем  ВсегоКартинок Экспорт;
&НаКлиенте
Перем НомерКартинки Экспорт;

&НаКлиенте
Процедура ОбщаяКомандаКартинка(Команда)
	омКартинкиНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент, НомерКартинки);
КонецПроцедуры 

&НаКлиенте
Процедура ИнформацияОКартинках(ТекущийНомерКартинки = 0)

	ВсегоКартинок = омКартинкиНаСервере.ПолучитьИнформациюОКартинках(Объект.Ссылка, Истина);
	НомерКартинки = ТекущийНомерКартинки;

КонецПроцедуры // ИнформацияОКартинках()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);

	Если Параметры.Ключ.Пустая() Тогда
		Элементы.ГруппаКартинки.Видимость = Ложь;
	КонецЕсли;
	
	омКартинкиНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКартинки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиКартинку()

	ИнформацияОКартинках();
	Если ВсегоКартинок > 0 Тогда
		омКартинкиНаКлиенте.ВывестиКартинку(Объект.Ссылка, НомерКартинки, ЭтаФорма, ВсегоКартинок);
	КонецЕсли;

КонецПроцедуры // ВывестиКартинку()

#КонецОбласти 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменилииКартинкиОбъектТЗ" И Параметр.ОбъектТЗ = Объект.Ссылка Тогда
		
		ВывестиКартинку();
		
	Иначе
	
		
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Элементы.ГруппаКартинки.Видимость = Истина;
КонецПроцедуры



