
#Область Картинки
&НаКлиенте
Перем МассивИменВременныхФайлов;
&НаКлиенте
Перем  ВсегоКартинок Экспорт;
&НаКлиенте
Перем НомерКартинки Экспорт;

&НаКлиенте
Процедура ОбщаяКомандаКартинка(Команда)
	омКартинкиНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент, НомерКартинки, Истина, МассивИменВременныхФайлов);
КонецПроцедуры 

&НаКлиенте
Процедура ИнформацияОКартинках(ТекущийНомерКартинки = 0)

	ВсегоКартинок = омКартинкиНаСервере.ПолучитьИнформациюОКартинках(Объект.Ссылка, Истина);
	НомерКартинки = ТекущийНомерКартинки;

КонецПроцедуры // ИнформацияОКартинках()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);

	Если Параметры.Ключ.Пустая() Тогда
		Элементы.ГруппаКартинки.Видимость 				= Ложь;
		Элементы.ДекорацияНеобходимоЗаписать.Видимость 	= Истина;
	Иначе
		Элементы.ДекорацияНеобходимоЗаписать.Видимость 	= Ложь;
	КонецЕсли;
	
	омКартинкиНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКартинки, Истина);
	
	Элементы.ЗаявкаВыполнена.Доступность = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("НачальникПроизводства");
	
	омКомментарииНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКомментарий, Ложь); 
	ДополнительныеПараметры = Неопределено;
	Этаформа.Комментарий_авто = омКомментарииНаСервере.Получить_HTML_комментарий(Объект.Комментарии, , , ДополнительныеПараметры);
	Элементы.ГруппаКомментарий.Заголовок = омКомментарийКлиентСервер.ПолучитьЗаголовокСтраницы(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиКартинку()

	ИнформацияОКартинках();
	омКартинкиНаКлиенте.ВывестиКартинку(Объект.Ссылка, НомерКартинки, ЭтаФорма, ВсегоКартинок);
	
КонецПроцедуры // ВывестиКартинку()

#КонецОбласти 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменилииКартинкиОбъектТЗ" И Параметр.ОбъектТЗ = Объект.Ссылка Тогда
		#Область Картинки
		ВывестиКартинку();
		#КонецОбласти
	Иначе
	
		
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Элементы.ГруппаКартинки.Видимость 				= Истина;
	Элементы.ДекорацияНеобходимоЗаписать.Видимость 	= Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

#Область Картинки
 	МассивИменВременныхФайлов = Новый Массив;
	ВывестиКартинку();
#КонецОбласти

КонецПроцедуры 

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	#Область Картинки
	омКартинкиНаКлиенте.УдалитьВременныеФайлы(МассивИменВременныхФайлов);
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяКомандаКомментарий(Команда)
	омКомментарииНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяКомандаВсеКомментарии(Команда)
	омКомментарииНаКлиенте.ВсеКомментарий(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры

&НаКлиенте
Процедура ИзделиеЗаказчикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		
		ДополнительныеПараметры = Новый Структура("Отказ, ТолькоНеИспользованые, НомерПоПорядку" ,Ложь ,Ложь ,0);
		омИзделиеЗаказчикаКлиент.ОткрытьПодборИзделияЗаказчика(Объект, ЭтаФорма, Неопределено, СтандартнаяОбработка, ДополнительныеПараметры);
		
	Иначе
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, "Не заполнен проект");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзделияЗаказчика(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;                         
	
	Объект.ИзделиеЗаказчика = Результат;	
	
КонецПроцедуры // ПослеВыбораИзделияЗаказчика()




