
#Область Картинки
&НаКлиенте
Перем МассивИменВременныхФайлов;
&НаКлиенте
Перем  ВсегоКартинок Экспорт;
&НаКлиенте
Перем НомерКартинки Экспорт;

&НаКлиенте
Процедура ОбщаяКомандаКартинка(Команда)
	омКартинкиНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент, НомерКартинки, Истина, МассивИменВременныхФайлов);
КонецПроцедуры 

&НаКлиенте
Процедура ИнформацияОКартинках(ТекущийНомерКартинки = 0)

	ВсегоКартинок = омКартинкиНаСервере.ПолучитьИнформациюОКартинках(Объект.Ссылка, Истина);
	НомерКартинки = ТекущийНомерКартинки;

КонецПроцедуры // ИнформацияОКартинках()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);

	Если Параметры.Ключ.Пустая() Тогда
		Элементы.ГруппаКартинки.Видимость = Ложь;
	КонецЕсли;
	
	омКартинкиНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКартинки, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиКартинку()

	ИнформацияОКартинках();
	Если ВсегоКартинок = 0 Тогда
		Элементы.КартинкуВлево.Доступность 	= Ложь;	
		Элементы.КартинкуВправо.Доступность = Ложь;	
	Иначе
		омКартинкиНаКлиенте.ВывестиКартинку(Объект.Ссылка, НомерКартинки, ЭтаФорма, ВсегоКартинок);
	КонецЕсли;
	
КонецПроцедуры // ВывестиКартинку()

#КонецОбласти 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменилииКартинкиОбъектТЗ" И Параметр.ОбъектТЗ = Объект.Ссылка Тогда
		#Область Картинки
		ВывестиКартинку();
		#КонецОбласти
	Иначе
	
		
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Элементы.ГруппаКартинки.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

#Область Картинки
 	МассивИменВременныхФайлов = Новый Массив;
	ВывестиКартинку();
#КонецОбласти

КонецПроцедуры 

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	#Область Картинки
	омКартинкиНаКлиенте.УдалитьВременныеФайлы(МассивИменВременныхФайлов);
	#КонецОбласти
	
КонецПроцедуры





