&НаКлиенте
&НаКлиенте
Перем МассивАдресовКартинок, ВсегоКартинокОбразца, НомерКартинкиОбразца;
#Область Картинки
&НаКлиенте
Перем МассивИменВременныхФайлов;
&НаКлиенте
Перем  ВсегоКартинок Экспорт;
&НаКлиенте
Перем НомерКартинки Экспорт;

&НаКлиенте
Процедура ОбщаяКомандаКартинка(Команда)
	омКартинкиНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент, НомерКартинки, Истина, МассивИменВременныхФайлов);
КонецПроцедуры 

&НаКлиенте
Процедура ИнформацияОКартинках(ТекущийНомерКартинки = 0)

	ВсегоКартинок = омКартинкиНаСервере.ПолучитьИнформациюОКартинках(Объект.Ссылка, Истина);
	НомерКартинки = ТекущийНомерКартинки;

КонецПроцедуры // ИнформацияОКартинках()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);

	Если Параметры.Ключ.Пустая() Тогда
		Элементы.ГруппаКартинки.Видимость 				= Ложь;
		Элементы.ДекорацияНеобходимоЗаписать.Видимость 	= Истина; 
		Объект.Дата 									= ТекущаяДата();
		Объект.СтатусЗаявки								= Перечисления.СтатусыЗаявкиНаОбразец.ВРаботе;
	Иначе
		Элементы.ДекорацияНеобходимоЗаписать.Видимость 	= Ложь;
	КонецЕсли;
	
	//омКартинкиНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКартинки, Истина);
	
	омКомментарииНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКомментарий, Ложь); 
	ДополнительныеПараметры = Неопределено;
	Этаформа.Комментарий_авто = омКомментарииНаСервере.Получить_HTML_комментарий(Объект.Комментарии, , , ДополнительныеПараметры);
	Элементы.ГруппаКомментарий.Заголовок = омКомментарийКлиентСервер.ПолучитьЗаголовокСтраницы(ДополнительныеПараметры);
	Элементы.ГруппаКомментарий.Видимость = Ложь; 
	
	Элементы.Производство.Доступность 	= РольДоступна("ПолныеПрава") ИЛИ РольДоступна("НачальникПроизводства");
	Элементы.ФормаПринятие.Доступность 	= Объект.Проведен;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиКартинку()

	//ИнформацияОКартинках();
	//омКартинкиНаКлиенте.ВывестиКартинку(Объект.Ссылка, НомерКартинки, ЭтаФорма, ВсегоКартинок);
	
КонецПроцедуры // ВывестиКартинку()

#КонецОбласти 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменилииКартинкиОбъектТЗ" И Параметр.ОбъектТЗ = Объект.Ссылка Тогда
		#Область Картинки
		//ВывестиКартинку();
		#КонецОбласти
	Иначе
	
		
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Элементы.ГруппаКартинки.Видимость 				= Истина;
	Элементы.ДекорацияНеобходимоЗаписать.Видимость 	= Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МассивАдресовКартинок = Новый Массив;
	
	ВсегоКартинокОбразца = 0;
	НомерКартинкиОбразца = 0;
	
#Область Картинки
	// МассивИменВременныхФайлов = Новый Массив;
	//НомерКартинки = 0;;
	//ВывестиКартинку();
#КонецОбласти

	НачальныйИндексСтроки = 0;
	Для каждого х Из Объект.Файлы Цикл
		
		х.НачальныйИндексСтроки = НачальныйИндексСтроки;
		НачальныйИндексСтроки = НачальныйИндексСтроки + 1;
		
	КонецЦикла;

КонецПроцедуры 

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	#Область Картинки
	омКартинкиНаКлиенте.УдалитьВременныеФайлы(МассивИменВременныхФайлов);
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяКомандаКомментарий(Команда)
	омКомментарииНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяКомандаВсеКомментарии(Команда)
	омКомментарииНаКлиенте.ВсеКомментарий(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры

&НаКлиенте
Процедура ИзделиеЗаказчикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Возврат;
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		
		ДополнительныеПараметры = Новый Структура("Отказ, ТолькоНеИспользованые, НомерПоПорядку" ,Ложь ,Ложь ,0);
		омИзделиеЗаказчикаКлиент.ОткрытьПодборИзделияЗаказчика(Объект, ЭтаФорма, Неопределено, СтандартнаяОбработка, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзделияЗаказчика(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;                         
	
	Объект.ИзделиеЗаказчика = Результат;	
	
КонецПроцедуры // ПослеВыбораИзделияЗаказчика()

&НаКлиенте
Процедура КартинкаВЛево(Команда)
	НомерКартинкиОбразца = НомерКартинкиОбразца - 1;
	ВывестиКартинкуПослеСмещения();
КонецПроцедуры

&НаКлиенте
Процедура КартинкаВПраво(Команда)
	НомерКартинкиОбразца = НомерКартинкиОбразца + 1;
	ВывестиКартинкуПослеСмещения();
КонецПроцедуры

&НаКлиенте
Процедура ВывестиКартинкуПослеСмещения()
	ТД = Элементы.Образцы.ТекущиеДанные;

	Если ТД = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТД.Образец) Тогда
		
		ВывестиКартинкиОбразца(ТД.Образец);
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОбразцыПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.Образцы.ТекущиеДанные;
	
	КартинкаОбразца 		= Неопределено;
	ВсегоКартинокОбразца 	= 0;
	НомерКартинкиОбразца 	= 0;
	ОписаниеНомерКартинки 	= "";
	
	Если ТД = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТД.Образец) Тогда
		
		ВывестиКартинкиОбразца(ТД.Образец);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВывестиКартинкиОбразца(Образец)

	ОбразецНайден = Ложь;
	
	Для каждого КартинкиОбразца Из МассивАдресовКартинок Цикл
		
		Если КартинкиОбразца.Образец = Образец Тогда
			ОбразецНайден = Истина;
			ВывестиКартинкуОбразца(КартинкиОбразца, НомерКартинкиОбразца);
		КонецЕсли;	
		
	КонецЦикла;
	
	Если НЕ ОбразецНайден Тогда
		
		КартинкиОбразца = ПолучитьДанныеКартинки(Образец, ЭтаФорма.УникальныйИдентификатор);
		МассивАдресовКартинок.Добавить(КартинкиОбразца);
		ВывестиКартинкуОбразца(КартинкиОбразца, НомерКартинкиОбразца);
		
	КонецЕсли;


КонецПроцедуры 

&НаКлиенте
Процедура ВывестиКартинкуОбразца(КартинкиОбразца, НомерКартинкиОбразца)
	
	Если КартинкиОбразца = Неопределено Тогда
		
		КартинкаОбразца = Неопределено;
		ВсегоКартинокОбразца = 0;
		НомерКартинкиОбразца = 0;
		
	Иначе
		
		ВсегоКартинокОбразца = КартинкиОбразца.МассивАдресов.Количество();
		
		Если ВсегоКартинокОбразца = 0 Тогда
			Элементы.КартинкаВлево.Доступность 	= Ложь;
			Элементы.КартинкаВправо.Доступность = Ложь;
		Иначе	
			Элементы.КартинкаВлево.Доступность 	= НомерКартинкиОбразца > 0;
			Элементы.КартинкаВправо.Доступность = НомерКартинкиОбразца < ВсегоКартинокОбразца - 1;
			
			КартинкаОбразца 		= КартинкиОбразца.МассивАдресов[НомерКартинкиОбразца].Картинка;
			ОписаниеНомерКартинки 	= КартинкиОбразца.МассивАдресов[НомерКартинкиОбразца].Описание + " (" + (НомерКартинкиОбразца + 1) + "/" + ВсегоКартинокОбразца + ")";
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьДанныеКартинки(Образец, УникальныйИдентификатор)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартинкиОбъектов.Картинка КАК Картинка,
		|	КартинкиОбъектов.Описание КАК Описание
		|ИЗ
		|	РегистрСведений.КартинкиОбъектов КАК КартинкиОбъектов
		|ГДЕ
		|	КартинкиОбъектов.ОбъектТЗ = &ОбъектТЗ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КартинкиОбъектов.НомерПоПорядку";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", Образец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КартинкиОбразца = Новый Структура("Образец, МассивАдресов", Образец, Новый Массив);
	
	Пока Выборка.Следующий() Цикл
		СтруктураДанных = Новый Структура("Описание", Выборка.Описание);
		СтруктураДанных.Вставить("Картинка", (ПоместитьВоВременноеХранилище(Выборка.Картинка.Получить(), УникальныйИдентификатор)));
		КартинкиОбразца.МассивАдресов.Добавить(СтруктураДанных);
	КонецЦикла;
	
	Возврат КартинкиОбразца;
	
КонецФункции // ПолучитьДанныеКартинки()

&НаКлиенте
Процедура ОбразцыПриИзменении(Элемент)
	ОбразцыПриАктивизацииСтроки(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриложитьФайл(Команда)
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбора.Фильтр = омКартинкиНаСервереКлиенте.ПолучитьСтрокуДляВыбораКартинок();
	ДиалогВыбора.Фильтр = ДиалогВыбора.Фильтр  + "|Файлы pdf (*.pdf)|*.pdf";
	ДиалогВыбора.Заголовок 						= "Выберите файл";
	ДиалогВыбора.ПредварительныйПросмотр 		= Истина;
	ДиалогВыбора.ПроверятьСуществованиеФайла 	= Истина;
	ДиалогВыбора.ИндексФильтра 					= 0; 
	ДиалогВыбора.МножественныйВыбор				= Ложь;
	
	Если ДиалогВыбора.Выбрать() Тогда
		ИмяФайла = ДиалогВыбора.ПолноеИмяФайла;
		
		Файл = Новый Файл(ИмяФайла);
		НС = Объект.Файлы.Добавить();
		НС.Расширение 	= Файл.Расширение;
		НС.НовыйФайл 	= Истина;
		НС.ИмяФайла 	= Файл.ИмяБезРасширения;
		НС.Загружен 	= Истина;
		НС.Картинка 	= омКартинкиНаКлиенте.ПолучитьАдресКартинкиИзФайла(ИмяФайла, ЭтаФорма.УникальныйИдентификатор);
		
	КонецЕсли;     
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

&НаКлиенте
Процедура Производство(Команда)
	Объект.СтатусЗаявки	= ПредопределенноеЗначение("Перечисление.СтатусыЗаявкиНаОбразец.Контроль");
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)); 
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда)
	Объект.СтатусЗаявки	= ПредопределенноеЗначение("Перечисление.СтатусыЗаявкиНаОбразец.Завершена");
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись)); 
КонецПроцедуры

&НаКлиенте
Процедура Дополнение(Команда)
	Объект.СтатусЗаявки	= ПредопределенноеЗначение("Перечисление.СтатусыЗаявкиНаОбразец.ВПроизводстве");
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись)); 
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.Файлы.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
	
		Элементы.КартинкаФайла.Видимость 	= Ложь;	
		Элементы.ПолеPDF.Видимость 			= Ложь;	
	
	ИначеЕсли ТД.Загружен Тогда
	
		ВывестиКартинкуНаФорму(ТД);
		
	Иначе
		
		ДанныеКартинки 	= омКартинкиНаСервере.ПолучитьКартинкуСтрокой(Объект.Ссылка, ЭтаФорма.УникальныйИдентификатор, ТД.НомерСтроки);
		ТД.Картинка 	= ДанныеКартинки.Картинка;
		ТД.Расширение 	= ДанныеКартинки.Расширение;
		ТД.Загружен 	= Истина;
	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайл(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ВывестиКартинкуНаФорму(ТД)

	Если ПустаяСтрока(ТД.Картинка) Тогда
	
		Элементы.КартинкаФайла.Видимость 	= Ложь;	
		Элементы.ПолеPDF.Видимость 			= Ложь;	
		
		Возврат;
	
	КонецЕсли;
	
	ТипФайла = омКартинкиНаСервереКлиенте.ПолучитьТипФайлаПоРасширению(ТД.Расширение);
	
	Если ТипФайла = "picture" Тогда
		
		Элементы.КартинкаФайла.Видимость 	= Истина;	
		Элементы.ПолеPDF.Видимость 			= Ложь;
		КартинкаФайла 						= ТД.Картинка;
		
	ИначеЕсли ТипФайла = "pdf" Тогда
		
		Элементы.КартинкаФайла.Видимость 	= Ложь;	
		Элементы.ПолеPDF.Видимость 			= Истина;
		ИмяВременногоФайла = омPDF_Клиент.ПоказатьФайлПоАдресуХранилища(ТД.Картинка, ПолеPDF);	
		
	ИначеЕсли ТипФайла = "xls" Тогда
		

	Иначе	         
		Элементы.КартинкаФайла.Видимость 	= Ложь;	
		Элементы.ПолеPDF.Видимость 			= Ложь;	
	КонецЕсли;
	

КонецПроцедуры // ВывестиКартинку(ТД)






