Функция ПолучитНаименованиеЭтапов(СокращенныйеНаименование = Ложь) Экспорт

	мЭтапыКонструктора = Новый Массив;
	мЭтапыКонструктора.Добавить("ТЗ");
	мЭтапыКонструктора.Добавить("ПКД");
	мЭтапыКонструктора.Добавить("РКД");
	
	мЭтапыПроизводства = Новый Массив;
	//мЭтапыПроизводства.Добавить("Столярка");
	//мЭтапыПроизводства.Добавить("Малярка");
	//мЭтапыПроизводства.Добавить("Подрядчик");
	мЭтапыПроизводства.Добавить("Производство");
	
	мЭтапыМонтаж = Новый Массив;
	мЭтапыМонтаж.Добавить("Монтаж");

	Возврат Новый Структура("мЭтапыКонструктора,мЭтапыПроизводства,мЭтапыМонтаж", мЭтапыКонструктора,мЭтапыПроизводства,мЭтапыМонтаж);
	

КонецФункции // ПолучитНаименованиеЭтапов()
