Процедура ОбновитьОтчетНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧастичныйПодрядСрезПоследних.ДатаВозврата КАК ДатаВозврата,
		|	ЧастичныйПодрядСрезПоследних.ИзделиеКомплект КАК ИзделиеКомплект,
		|	ЧастичныйПодрядСрезПоследних.Комментарий КАК Комментарий,
		|	ЧастичныйПодрядСрезПоследних.Подрядчик КАК Подрядчик,
		|	ЧастичныйПодрядСрезПоследних.Проект КАК Проект,
		|	ЧастичныйПодрядСрезПоследних.Автор КАК Автор
		|ИЗ
		|	РегистрСведений.ЧастичныйПодряд.СрезПоследних КАК ЧастичныйПодрядСрезПоследних
		|ГДЕ
		|	НЕ ЧастичныйПодрядСрезПоследних.Завершен
		|	И ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЧастичныйПодрядСрезПоследних.Проект = &Проект
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Подрядчик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЧастичныйПодрядСрезПоследних.Подрядчик = &Подрядчик
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВозврата";
	
	Запрос.УстановитьПараметр("Проект", 		Проект);
	Запрос.УстановитьПараметр("Подрядчик", 	Подрядчик);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = Отчеты.КомплектыВЧастичномПодряде.ПолучитьМакет("Макет");
	ПолеВывода.Очистить();
	
	ПолеВывода.Вывести(Макет.ПолучитьОбласть("Шапка"));
	Область = Макет.ПолучитьОбласть("Строка");
	
	Пока Выборка.Следующий() Цикл
		Область.Параметры.Заполнить(Выборка);
		ПолеВывода.Вывести(Область);
	КонецЦикла;
	
КонецПроцедуры



&НаКлиенте
Процедура ПодрядчикПриИзменении(Элемент)
	ОбновитьОтчетНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ОбновитьОтчетНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодрядчикНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Элементы.Подрядчик.СписокВыбора.ЗагрузитьЗначения(ПолучитьПодрядчиков());
КонецПроцедуры

Функция ПолучитьПодрядчиков()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧастичныйПодрядСрезПоследних.Подрядчик КАК Подрядчик
		|ИЗ
		|	РегистрСведений.ЧастичныйПодряд.СрезПоследних КАК ЧастичныйПодрядСрезПоследних
		|ГДЕ
		|	НЕ ЧастичныйПодрядСрезПоследних.Завершен
		|
		|СГРУППИРОВАТЬ ПО
		|	ЧастичныйПодрядСрезПоследних.Подрядчик
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЧастичныйПодрядСрезПоследних.Подрядчик.Наименование";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Подрядчик");
	
КонецФункции // ПолучитьПодрядчиков()

&НаКлиенте
Процедура ПодрядчикНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Элементы.Подрядчик.СписокВыбора.ЗагрузитьЗначения(ПолучитьПодрядчиков());
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьОтчетНаСервере();
КонецПроцедуры
