
Функция ПолучитьСтруктуруДанных(Состояние = Неопределено, Исполнитель = Неопределено, Статус = Неопределено, ТипЗадачи = Неопределено, НормаВремени = Неопределено) Экспорт
	
	Возврат Новый Структура("Состояние, Исполнитель, Статус, ТипЗадачи, НормаВремени, ПереходИзменения, ПереходПредставление, ПереходРедакция, ПереходРекламация, ПереходДоработка"
	, Состояние, Исполнитель, Статус, ТипЗадачи, НормаВремени, Ложь, Ложь, Ложь, Ложь, Ложь); 
	
КонецФункции // ПолучитьСтруктуруДанных()

Процедура УстановитьСостояниеИсполнительЗадачи(Задача, стДанные, Комментарий = "") Экспорт
	
	Если стДанные.Состояние = Неопределено И стДанные.Исполнитель = Неопределено И стДанные.Статус = Неопределено И стДанные.ТипЗадачи = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаймингЗадачСрезПоследних.Исполнитель КАК Исполнитель,
	|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние,
	|	ТаймингЗадачСрезПоследних.Статус КАК Статус,
	|	ТаймингЗадачСрезПоследних.ТипЗадачи КАК ТипЗадачи,
	|	ТаймингЗадачСрезПоследних.НормаВремени КАК НормаВремени,
	|	ТаймингЗадачСрезПоследних.ПереходИзменения КАК ПереходИзменения,
	|	ТаймингЗадачСрезПоследних.ПереходПредставление КАК ПереходПредставление,
	|	ТаймингЗадачСрезПоследних.ПереходРедакция КАК ПереходРедакция,
	|	ТаймингЗадачСрезПоследних.ПереходРекламация КАК ПереходРекламация,
	|	ТаймингЗадачСрезПоследних.ПереходДоработка КАК ПереходДоработка
	|ИЗ
	|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	текСостояние 			= Неопределено;
	текИсполнитель 			= Неопределено;
	текСтатус 				= Неопределено;
	текТипЗадачи 			= Неопределено;
	текНормаВремени			= Неопределено;
	
	ТекущиеДанныеПерехода 	= Новый Структура("ПереходИзменения, ПереходРедакция, ПереходРекламация, ПереходДоработка"
												, 0
												, 0
												, 0
												, 0);
	
	Пока Выборка.Следующий() Цикл
		
		текСостояние 		= Выборка.Состояние;
		текИсполнитель 		= Выборка.Исполнитель;
		текСтатус 			= Выборка.Статус;
		текТипЗадачи 		= Выборка.ТипЗадачи;
		текНормаВремени 	= Выборка.НормаВремени;
		
		ЗаполнитьЗначенияСвойств(ТекущиеДанныеПерехода, Выборка);
		
	КонецЦикла;
	
	Если текСостояние = стДанные.Состояние И текИсполнитель = стДанные.Исполнитель 
		И текСтатус = стДанные.Статус И текТипЗадачи = стДанные.ТипЗадачи И текНормаВремени = стДанные.НормаВремени 
		И НЕ (стДанные.ПереходИзменения	ИЛИ стДанные.ПереходРедакция ИЛИ стДанные.ПереходРекламация ИЛИ стДанные.ПереходДоработка) Тогда
		Возврат;
	КонецЕсли;
	
	текИсполнитель 	= ?(стДанные.Исполнитель 	= Неопределено, текИсполнитель, 	стДанные.Исполнитель); 
	текСостояние 	= ?(стДанные.Состояние 		= Неопределено, текСостояние, 		стДанные.Состояние); 
	текСтатус 		= ?(стДанные.Статус 		= Неопределено, текСтатус, 			стДанные.Статус); 
	текТипЗадачи 	= ?(стДанные.ТипЗадачи 		= Неопределено, текТипЗадачи, 		стДанные.ТипЗадачи); 
	текНормаВремени	= ?(стДанные.НормаВремени 	= Неопределено, текНормаВремени, 	стДанные.НормаВремени); 
	
	ПереходИзменения 	= ?(стДанные.ПереходИзменения, 	ТекущиеДанныеПерехода.ПереходИзменения 	+ 1, ТекущиеДанныеПерехода.ПереходИзменения);
	ПереходРедакция 	= ?(стДанные.ПереходРедакция, 	ТекущиеДанныеПерехода.ПереходРедакция 	+ 1, ТекущиеДанныеПерехода.ПереходРедакция);
	ПереходРекламация 	= ?(стДанные.ПереходРекламация, ТекущиеДанныеПерехода.ПереходРекламация + 1, ТекущиеДанныеПерехода.ПереходРекламация);
	ПереходДоработка 	= ?(стДанные.ПереходДоработка, 	ТекущиеДанныеПерехода.ПереходДоработка	+ 1, ТекущиеДанныеПерехода.ПереходДоработка);
	
	ПереходПредставление = ?(ПереходДоработка = 0, "", Строка(ПереходДоработка))+ "."
		+ ?(ПереходИзменения 	= 0, "", ПереходИзменения)+ "."
		+ ?(ПереходРедакция 	= 0, "", ПереходРедакция)+ "."
		+ ?(ПереходРекламация = 0, "", ПереходРекламация);
			
	УИД = Новый УникальныйИдентификатор();
	
	МенеджерЗаписи = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УИД 					= УИД;
	МенеджерЗаписи.Период 				= ТекущаяДата();
	МенеджерЗаписи.Задача 				= Задача;
	МенеджерЗаписи.Исполнитель			= текИсполнитель;
	МенеджерЗаписи.Состояние			= текСостояние;
	МенеджерЗаписи.ТипЗадачи			= текТипЗадачи;
	МенеджерЗаписи.НормаВремени			= текНормаВремени;
	МенеджерЗаписи.Статус				= текСтатус;
	МенеджерЗаписи.ПереходИзменения		= ПереходИзменения;
	МенеджерЗаписи.ПереходПредставление	= ПереходПредставление;
	МенеджерЗаписи.ПереходРедакция		= ПереходРедакция;
	МенеджерЗаписи.ПереходРекламация	= ПереходРекламация;
	МенеджерЗаписи.ПереходДоработка		= ПереходДоработка;
	МенеджерЗаписи.Автор				= ПараметрыСеанса.ТекущийПользователь;
	
	МенеджерЗаписи .Записать();
	
	Если НЕ ПустаяСтрока(Комментарий) Тогда
		
		МенеджерЗаписи = РегистрыСведений.ТаймингЗадачКомментарии.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.УИД 		= УИД;
		МенеджерЗаписи.Комментарий	= Комментарий; 
		
		МенеджерЗаписи .Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСостояниеЗадачи(Задача) Экспорт
	
	стДанные = Новый Структура("Представление, Исполнитель, Состояние, Конструктор", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние,
	|	ТаймингЗадачСрезПоследних.Исполнитель КАК Исполнитель,
	|	ТаймингЗадачСрезПоследних.Исполнитель.Наименование КАК ИсполнительНаименование,
	|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор
	|ИЗ
	|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних,
	|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &ОбъектТЗ) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.УстановитьПараметр("ОбъектТЗ", Задача.ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стДанные, Выборка);
		ИсполнительНаименование = Выборка.ИсполнительНаименование;
	КонецЦикла;
	
	Представление = "";
	
	Если ЗначениеЗаполнено(стДанные.Состояние) Тогда
		Представление = Строка(стДанные.Состояние);
	Иначе	
		Представление = "Ожидание";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(стДанные.Исполнитель) Тогда
		Представление = Представление + " " + ИсполнительНаименование;
	КонецЕсли;
	
	стДанные.Представление = Представление;
	
	Возврат стДанные;
	
КонецФункции // ПолучитьСостояниеЗадачи(Задача)

Функция ПолучитьИсториюЗадачи(Задача, ТипВозврата = "HTML") Экспорт
	
	тзДанные = ПолучитьДанныеИсториии(Задача);
	
	Если ТипВозврата = "HTML" Тогда
		Возврат	ИсторияЗадачиHTML(Задача, тзДанные);
	ИначеЕсли ТипВозврата = "строка" Тогда
		Возврат	ИсторияЗадачиСтрокой(тзДанные);
	КонецЕсли;
	
	Возврат тзДанные;
	
КонецФункции // ПолучитьИсториюЗадачи(Задача) 

Функция ИсторияЗадачиHTML(Задача, тзДанные)
	
	стрВозврата = омHTML.ПолучитьЗаголовокHTML();
	
	стрВозврата = стрВозврата + омHTML.ПолучитьHeadHTML("История " + Задача, 1);
	
	стрВозврата = стрВозврата + "<table>";
	стрВозврата = стрВозврата + "<tr><td>Дата</td><td>Исполнитель</td><td>Состояние</td><td>Автор</td><td>Комментарий</td></tr>";
	
	ШаблонСтроки = "<tr><td>%1</td><td>%2</td><td>%3</td><td>%4</td><td>%5</td></tr>";
	
	Для каждого СтрокаТаблицы Из тзДанные Цикл
		стрВозврата = стрВозврата + СтрШаблон(ШаблонСтроки, СтрокаТаблицы.Период, СтрокаТаблицы.Исполнитель, СтрокаТаблицы.Состояние, СтрокаТаблицы.Автор, СтрокаТаблицы.Комментарий);	
	КонецЦикла;
	
	стрВозврата = стрВозврата + "</table>";
	
	стрВозврата = стрВозврата + омHTML.ПолучитьХвостHTML();
	
	Возврат стрВозврата;
	
КонецФункции // ИсторияЗадачиHTML(тзДанные)

Функция ИсторияЗадачиСтрокой(тзДанные)
	
	
	
КонецФункции // ИсторияЗадачиHTML(тзДанные)

Функция ПолучитьДанныеИсториии(Задача)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаймингЗадач.Период КАК Период,
	|	ТаймингЗадач.Автор КАК Автор,
	|	ЕСТЬNULL(ТаймингЗадачКомментарии.Комментарий, """") КАК Комментарий,
	|	ТаймингЗадач.Исполнитель КАК Исполнитель,
	|	ЕСТЬNULL(СтадииКомплектаРеквизитыСтадии.Ссылка.ПолноеНаименование, """") КАК Состояние
	|ИЗ
	|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадачКомментарии КАК ТаймингЗадачКомментарии
	|		ПО ТаймингЗадач.УИД = ТаймингЗадачКомментарии.УИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
	|		ПО ТаймингЗадач.Состояние = СтадииКомплектаРеквизитыСтадии.Состояние
	|			И ТаймингЗадач.Статус = СтадииКомплектаРеквизитыСтадии.Статус
	|			И ТаймингЗадач.ТипЗадачи = СтадииКомплектаРеквизитыСтадии.ТипЗадачи
	|ГДЕ
	|	ТаймингЗадач.Задача = &Задача
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции // ПолучитьДанныеИсториии(Задача)

Функция ПолучитьТаймингиЗадачКонструктор(Период, Исполнитель) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадач.Задача КАК Задача
		|ПОМЕСТИТЬ втЗадачиКонструктора
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|ГДЕ
		|	ТаймингЗадач.Исполнитель = &Исполнитель
		|	И ТаймингЗадач.Период <= &ДатаОкончания
		|	И ТаймингЗадач.Период >= ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, -3)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаймингЗадач.Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаймингЗадач.Задача КАК Задача
		|ПОМЕСТИТЬ втЗадачи
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачиКонструктора КАК втЗадачиКонструктора
		|		ПО ТаймингЗадач.Задача = втЗадачиКонструктора.Задача
		|ГДЕ
		|	ТаймингЗадач.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТаймингЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаймингЗадач.Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаймингЗадач.Период КАК ДатаНачала,
		|	ТаймингЗадач.Задача КАК Задача,
		|	втЗадачи.Задача.Наименование КАК ЗадачаНаименование,
		|	ТаймингЗадач.Автор КАК Автор,
		|	ТаймингЗадач.Исполнитель КАК Исполнитель,
		|	ТаймингЗадач.Состояние КАК Состояние,
		|	ТаймингЗадач.Статус КАК Статус,
		|	ТаймингЗадач.ТипЗадачи КАК ТипЗадачи,
		|	ТаймингЗадач.НормаВремени КАК НормаВремени,
		|	ТаймингЗадач.Задача.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование,
		|	ТаймингЗадач.Задача.ОбъектТЗ КАК ОбъектТЗ,
		|	ТаймингЗадач.Задача.ОбъектТЗ.Проект КАК Проект,
		|	ЕСТЬNULL(ТаймингЗадачКомментарии.Комментарий, """") КАК Комментарий,
		|	ТаймингЗадач.Исполнитель.Сотрудник КАК Сотрудник,
		|	ТаймингЗадач.Исполнитель.Сотрудник.НачалаРабочегоДня КАК НачалаРабочегоДня,
		|	ТаймингЗадач.Исполнитель.Сотрудник.ОкончаниеРабочегоДня КАК ОкончаниеРабочегоДня,
		|	ЗНАЧЕНИЕ(Справочник.СтадииКомплекта.ПустаяСсылка) КАК Стадия,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(14)) КАК ДатаСтрокой,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК СтадияНаименование,
		|	ЛОЖЬ КАК Ожидание,
		|	ЛОЖЬ КАК Доработка,
		|	0 КАК ПлановоеЗначение
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадачКомментарии КАК ТаймингЗадачКомментарии
		|		ПО ТаймингЗадач.УИД = ТаймингЗадачКомментарии.УИД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ТаймингЗадач.Задача = втЗадачи.Задача
		|ГДЕ
		|	(ТаймингЗадач.Исполнитель = &Исполнитель
		|			ИЛИ ТаймингЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектТЗНаименование,
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("Исполнитель", 	Исполнитель);
	Запрос.УстановитьПараметр("ДатаНачала", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	Период.ДатаОкончания);
	
	СтруктураВозврата = Новый Структура("ТайминЗадач, ПлановоеЗначение", );
	СтруктураВозврата.ТайминЗадач = Запрос.Выполнить().Выгрузить();
	СтруктураВозврата.ТайминЗадач.Индексы.добавить("Задача");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановоеЗначениеПроектирования.Период КАК Период,
		|	ПлановоеЗначениеПроектирования.Задача КАК Задача,
		|	ПлановоеЗначениеПроектирования.Автор КАК Автор,
		|	ПлановоеЗначениеПроектирования.ДатаНачала КАК ДатаНачала,
		|	ПлановоеЗначениеПроектирования.ПланРазработкиВДнях КАК ПланРазработкиВДнях,
		|	ПлановоеЗначениеПроектирования.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.ПлановоеЗначениеПроектирования КАК ПлановоеЗначениеПроектирования
		|ГДЕ
		|	ПлановоеЗначениеПроектирования.Задача В(&Задача)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Задача", СтруктураВозврата.ТайминЗадач.Выгрузитьколонку("Задача"));

	ЗаполнитьПлановоеВремя(СтруктураВозврата.ТайминЗадач, Запрос.Выполнить().Выбрать());
	
	ЗаполнитьСтадииЗадачи(СтруктураВозврата.ТайминЗадач);
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьТаймингиЗадач()  

Процедура ЗаполнитьСтадииЗадачи(ТайминЗадач)

	КэшСтадий = Новый ТаблицаЗначений;
	КэшСтадий.Колонки.Добавить("Стадия", 			Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	КэшСтадий.Колонки.Добавить("ТекущиеСостояние",	Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЗадач"));
	КэшСтадий.Колонки.Добавить("ТекущийСтатус", 	Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	КэшСтадий.Колонки.Добавить("ТекущийТипЗадачи", 	Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадачКонструирования")); 
	
	Отбор = Новый Структура("ТекущиеСостояние, ТекущийСтатус, ТекущийТипЗадачи", );
	
	МассивСтадий = Новый Массив;
	
	Для каждого СтрокаТайминга Из ТайминЗадач Цикл
		
		Отбор.ТекущиеСостояние 	= СтрокаТайминга.Состояние;
		Отбор.ТекущийТипЗадачи 	= СтрокаТайминга.ТипЗадачи;
		Отбор.ТекущийСтатус 	= СтрокаТайминга.Статус;
		
		НайденыеСтроки = КэшСтадий.НайтиСтроки(Отбор);
		Если НайденыеСтроки.Количество() = 0 Тогда
		
			СтрокаТайминга.Стадия = омЗадачиПКДСервер.ПолучитьСтадиюКомплеткаНаОснованииПараметров(Отбор);		
			
			НС = КэшСтадий.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Отбор);
			НС.Стадия = СтрокаТайминга.Стадия; 
			
			МассивСтадий.Добавить(НС.Стадия);
		
		Иначе
		
			СтрокаТайминга.Стадия = НайденыеСтроки[0].Стадия;		
		
		КонецЕсли;
		
		СтрокаТайминга.ДатаСтрокой = Формат(СтрокаТайминга.ДатаНачала, "ДФ=dd.MM.yy") 
										+ " " + Формат(СтрокаТайминга.ДатаНачала, "ДФ=HH:mm");
		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплекта.Ссылка КАК Стадия,
		|	СтадииКомплекта.Ожидание КАК Ожидание,
		|	СтадииКомплекта.Доработка КАК Доработка,
		|	СтадииКомплекта.ПолноеНаименование КАК СтадияНаименование
		|ИЗ
		|	Справочник.СтадииКомплекта КАК СтадииКомплекта
		|ГДЕ
		|	СтадииКомплекта.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивСтадий);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Отбор = Новый Структура("Стадия", );
	
	Пока Выборка.Следующий() Цикл
		Отбор.Стадия = Выборка.Стадия;
		
		Для каждого х Из ТайминЗадач.НайтиСтроки(Отбор) Цикл
		
			ЗаполнитьЗначенияСвойств(х, Выборка);	
		
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПлановоеВремя(ТайминЗадач, Выборка)
	
	Отбор = Новый Структура("Задача", );
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПланРазработкиВДнях = 0 Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		Отбор.Задача = Выборка.Задача;
		
		НайденыеСтроки = ТайминЗадач.НайтиСтроки(Отбор);
		
		Для х = 0 По НайденыеСтроки.Количество() - 1 Цикл
			
			СтрокаТайминга = ТайминЗадач[х];
			
			Если СтрокаТайминга.ДатаНачала < Выборка.Период Тогда
				
				СтрокаТайминга.ПлановоеЗначение = Выборка.ПланРазработкиВДнях;
				Прервать;
				
			КонецЕсли;
			
			Если х > 0 Тогда
				
				СтрокаТаймингаПредыдущая = ТайминЗадач[х - 1];
				
				Если СтрокаТаймингаПредыдущая.ДатаНачала >= Выборка.Период И СтрокаТайминга.ДатаНачала < Выборка.Период Тогда
					
					СтрокаТайминга.ПлановоеЗначение = Выборка.ПланРазработкиВДнях;
					Прервать;
					
				КонецЕсли;
			
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

//РабочееВремя это структура с полями: НачалаПерерыва, НачалаРабочегоДня, ОкончаниеПерерыва, ОкончаниеРабочегоДня
Функция КоличествоРабочихЧасовСотрудника(РабочееВремя, ОкруглятьДо = 1) Экспорт
	
	ПустаяДата = Дата(1, 1, 1);
	
	Если РабочееВремя.НачалаРабочегоДня = ПустаяДата ИЛИ  РабочееВремя.ОкончаниеРабочегоДня = ПустаяДата Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	КоличествоЧасов = (РабочееВремя.ОкончаниеРабочегоДня - РабочееВремя.НачалаРабочегоДня - (РабочееВремя.ОкончаниеПерерыва - РабочееВремя.НачалаПерерыва)) / 3600;
	
	Если ОкруглятьДо = Неопределено Тогда
		Возврат КоличествоЧасов;	
	КонецЕсли;
	
	Возврат Окр(КоличествоЧасов, ОкруглятьДо);
	
КонецФункции // КоличествоРабочихЧасов()

//ИнформацияОДата структура с полями: КоличестивоРабочихЧасовВДне, ВыходныеДни, РабочееВремя
Функция РабочихЧасовВИнтервале(Период, ИнформацияОДата) Экспорт
	
	КоличествоЧасов 	= 0;
	СекундВСутках 	= 3600 * 24;
	
    ПериодНачалаРасчета = Период.ДатаНачала;        
	
	Если КонецДня(ПериодНачалаРасчета) >= Период.ДатаОкончания Тогда
		Возврат КоличествоРабочегоВремениВИнтервалеДня(ПериодНачалаРасчета, Период.ДатаОкончания, ИнформацияОДата);		
	КонецЕсли;
	
	Пока ПериодНачалаРасчета <= Период.ДатаОкончания Цикл
	
		Если НачалоДня(ПериодНачалаРасчета) = НачалоДня(Период.ДатаОкончания) Тогда
			ПериодОкончаниеРасчета = Период.ДатаОкончания;
		Иначе
			ПериодОкончаниеРасчета = КонецДня(ПериодНачалаРасчета);
		КонецЕсли;
		
		КоличествоЧасов = КоличествоЧасов + КоличествоРабочегоВремениВИнтервалеДня(ПериодНачалаРасчета, ПериодОкончаниеРасчета, ИнформацияОДата);
		ПериодНачалаРасчета = НачалоДня(ПериодНачалаРасчета + СекундВСутках); 
		
	КонецЦикла;
	
	Возврат КоличествоЧасов;

КонецФункции // РабочихЧасовВИнтервале(Период, ИнформацияОДата) 

//ИнформацияОДата структура с полями: КоличестивоРабочихЧасовВДне, ВыходныеДни, РабочееВремя
//РабочееВремя это структура с полями: НачалаПерерыва, НачалаРабочегоДня, ОкончаниеПерерыва, ОкончаниеРабочегоДня
Функция КоличествоРабочегоВремениВИнтервалеДня(НачалоИнтервала, ОкончаниеИнтервала, ИнформацияОДата) Экспорт

	Если НЕ ИнформацияОДата.ВыходныеДни.Найти(НачалоДня(НачалоИнтервала)) = Неопределено Тогда
	 	Возврат 0;
	КонецЕсли;
	
	ПустаяДата 			= Дата(1, 1, 1); 
	НачалоДняРасчета 	= НачалоДня(НачалоИнтервала);
	
	ВремяНачала = Макс(ПустаяДата + (НачалоИнтервала - НачалоДняРасчета), ИнформацияОДата.РабочееВремя.НачалаРабочегоДня); 
	ВремяОкончания = Неопределено;
	
	Если ИнформацияОДата.РабочееВремя.НачалаПерерыва > ПустаяДата И ИнформацияОДата.РабочееВремя.ОкончаниеПерерыва > ПустаяДата Тогда
		
		Если ВремяНачала > ИнформацияОДата.РабочееВремя.НачалаПерерыва 
				И ВремяНачала < ИнформацияОДата.РабочееВремя.ОкончаниеПерерыва Тогда
		
			ВремяНачала = ИнформацияОДата.РабочееВремя.ОкончаниеПерерыва;	
		
		КонецЕсли;
		
		ВремяОкончания = Мин(ПустаяДата + (ОкончаниеИнтервала - НачалоДняРасчета), ИнформацияОДата.РабочееВремя.ОкончаниеРабочегоДня);
		Если ВремяОкончания > ИнформацияОДата.РабочееВремя.НачалаПерерыва 
				И ВремяОкончания < ИнформацияОДата.РабочееВремя.ОкончаниеПерерыва Тогда
		
			ВремяОкончания = ИнформацияОДата.РабочееВремя.НачалаПерерыва;	
		
		КонецЕсли;
		
		Если ИнформацияОДата.РабочееВремя.НачалаПерерыва >= ВремяНачала И ИнформацияОДата.РабочееВремя.ОкончаниеПерерыва <= ВремяОкончания Тогда
			ПерерывВСекундах = (ИнформацияОДата.РабочееВремя.ОкончаниеПерерыва - ИнформацияОДата.РабочееВремя.НачалаПерерыва);
		Иначе
			ПерерывВСекундах = 0;
		КонецЕсли; 
		
	Иначе
		ПерерывВСекундах = 0;
	КонецЕсли;
	
	Если ВремяОкончания = Неопределено Тогда
		ВремяОкончания = Мин(ПустаяДата + (ОкончаниеИнтервала - НачалоДняРасчета), ИнформацияОДата.РабочееВремя.ОкончаниеРабочегоДня);
	КонецЕсли;
	
	КоличествоЧасов = (ВремяОкончания - ВремяНачала - ПерерывВСекундах) / 3600;
	
	Возврат ?(КоличествоЧасов < 0, 0, КоличествоЧасов);	

КонецФункции // КоличествоРабочегоВремениВИнтервале()


Функция ПолучитьКоличествоПереходов(Задача) Экспорт

	стПереходы = Новый Структура("ПереходДоработка, ПереходИзменения, ПереходПредставление, ПереходРедакция, ПереходРекламация, Проект, КомплектНаименование"
		, 0, 0, 0, 0, 0, Справочники.Проекты.ПустаяСсылка(), "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадачСрезПоследних.НормаВремени КАК НормаВремени,
		|	ТаймингЗадачСрезПоследних.ПереходДоработка КАК ПереходДоработка,
		|	ТаймингЗадачСрезПоследних.ПереходИзменения КАК ПереходИзменения,
		|	ТаймингЗадачСрезПоследних.ПереходПредставление КАК ПереходПредставление,
		|	ТаймингЗадачСрезПоследних.Задача.Проект КАК Проект,
		|	ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ.Наименование КАК КомплектНаименование
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
    	ЗаполнитьЗначенияСвойств(стПереходы, Выборка);
	КонецЦикла;
	
	Возврат стПереходы;
	
КонецФункции // ПолучитьКоличествоПереходов()  

Функция ПолучитьТаймингиЗадач(МассивЗадач, Исполнитель = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадач.Период КАК ДатаНачала,
		|	ТаймингЗадач.Задача КАК Задача,
		|	ТаймингЗадач.Автор КАК Автор,
		|	ТаймингЗадач.Исполнитель КАК Исполнитель,
		|	ТаймингЗадач.Состояние КАК Состояние,
		|	ТаймингЗадач.Статус КАК Статус,
		|	ТаймингЗадач.ТипЗадачи КАК ТипЗадачи,
		|	ТаймингЗадач.НормаВремени КАК НормаВремени,
		|	ТаймингЗадач.Задача.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование,
		|	ТаймингЗадач.Задача.ОбъектТЗ КАК ОбъектТЗ,
		|	ТаймингЗадач.Задача.ОбъектТЗ.Проект КАК Проект,
		|	ЕСТЬNULL(ТаймингЗадачКомментарии.Комментарий, """") КАК Комментарий,
		|	ТаймингЗадач.Исполнитель.Сотрудник КАК Сотрудник,
		|	ТаймингЗадач.Исполнитель.Сотрудник.НачалаРабочегоДня КАК НачалаРабочегоДня,
		|	ТаймингЗадач.Исполнитель.Сотрудник.ОкончаниеРабочегоДня КАК ОкончаниеРабочегоДня,
		|	СтадииКомплектаРеквизитыСтадии.Ссылка КАК Стадия,
		|	СтадииКомплектаРеквизитыСтадии.Ссылка.ОсновнойЭтап КАК ОсновнойЭтап,
		|	СтадииКомплектаРеквизитыСтадии.Ссылка.Доработка КАК Доработка,
		|	СтадииКомплектаРеквизитыСтадии.Ссылка.ПолноеНаименование КАК СтадияНаименование,
		|	ЕСТЬNULL(СтадииКомплектаРеквизитыСтадии.Ссылка.Ожидание, ИСТИНА) КАК Ожидание,
		|	ЕСТЬNULL(СтадииКомплектаРеквизитыСтадии.Ссылка.НормаВремени, 0) КАК НормаВремениПоУмолчанию,
		|	ЕСТЬNULL(ДатыКомплекта.НормаВремени_ПКД, 0) КАК НормаВремени_ПКД,
		|	ЕСТЬNULL(ДатыКомплекта.НормаВремени_РКД, 0) КАК НормаВремени_РКД,
		|	0 КАК ПлановоеЗначение,
		|	0 КАК Продолжительность,
		|	0 КАК ПродолжительностьВЧасах
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадачКомментарии КАК ТаймингЗадачКомментарии
		|		ПО ТаймингЗадач.УИД = ТаймингЗадачКомментарии.УИД
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|		ПО (ТаймингЗадач.Состояние = СтадииКомплектаРеквизитыСтадии.Состояние
		|				ИЛИ СтадииКомплектаРеквизитыСтадии.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПустаяСсылка))
		|			И ТаймингЗадач.Статус = СтадииКомплектаРеквизитыСтадии.Статус
		|			И (ТаймингЗадач.ТипЗадачи = СтадииКомплектаРеквизитыСтадии.ТипЗадачи
		|				ИЛИ СтадииКомплектаРеквизитыСтадии.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.ПустаяСсылка)
		|					И СтадииКомплектаРеквизитыСтадии.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ПО ТаймингЗадач.Задача.ОбъектТЗ = ДатыКомплекта.Комплект
		|ГДЕ
		|	ТаймингЗадач.Задача В(&Задача)
		|	И ВЫБОР
		|			КОГДА &Исполнитель = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТаймингЗадач.Исполнитель = &Исполнитель
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановоеЗначениеПроектирования.Период КАК Период,
		|	ПлановоеЗначениеПроектирования.Задача КАК Задача,
		|	ПлановоеЗначениеПроектирования.Автор КАК Автор,
		|	ПлановоеЗначениеПроектирования.ДатаНачала КАК ДатаНачала,
		|	ПлановоеЗначениеПроектирования.ПланРазработкиВДнях КАК ПланРазработкиВДнях,
		|	ПлановоеЗначениеПроектирования.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.ПлановоеЗначениеПроектирования КАК ПлановоеЗначениеПроектирования
		|ГДЕ
		|	ПлановоеЗначениеПроектирования.Задача В(&Задача)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Исполнитель", 	Исполнитель);
	Запрос.УстановитьПараметр("Задача", 		МассивЗадач);
	
	Результат = Запрос.ВыполнитьПакет();
	
	СтруктураВозврата = Новый Структура("ТайминЗадач, ПлановоеЗначение", );
	
	СтруктураВозврата.ТайминЗадач 		= Результат[0].Выгрузить();
	//СтруктураВозврата.ПлановоеЗначение 	= Результат[1].Выгрузить(); 
	СтруктураВозврата.ТайминЗадач.Индексы.Добавить("Задача");
	
	ЗаполнитьПлановоеВремя(СтруктураВозврата.ТайминЗадач, Результат[1].Выбрать());
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьТаймингиЗадач()

