
Функция ПолучитьСтруктуруДанных(Состояние = Неопределено, Исполнитель = Неопределено, Статус = Неопределено, ТипЗадачи = Неопределено, НормаВремени = Неопределено) Экспорт
	
	Возврат Новый Структура("Состояние, Исполнитель, Статус, ТипЗадачи, НормаВремени", Состояние, Исполнитель, Статус, ТипЗадачи, НормаВремени); 
	
КонецФункции // ПолучитьСтруктуруДанных()

Процедура УстановитьСостояниеИсполнительЗадачи(Задача, стДанные, Комментарий = "") Экспорт
	
	Если стДанные.Состояние = Неопределено И стДанные.Исполнитель = Неопределено И стДанные.Статус = Неопределено И стДанные.ТипЗадачи = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаймингЗадачСрезПоследних.Исполнитель КАК Исполнитель,
	|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние,
	|	ТаймингЗадачСрезПоследних.Статус КАК Статус,
	|	ТаймингЗадачСрезПоследних.ТипЗадачи КАК ТипЗадачи,
	|	ТаймингЗадачСрезПоследних.НормаВремени КАК НормаВремени
	|ИЗ
	|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	текСостояние 		= Неопределено;
	текИсполнитель 	= Неопределено;
	текСтатус 			= Неопределено;
	текТипЗадачи 		= Неопределено;
	текНормаВремени	= Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		текСостояние 		= Выборка.Состояние;
		текИсполнитель 	= Выборка.Исполнитель;
		текСтатус 			= Выборка.Статус;
		текТипЗадачи 		= Выборка.ТипЗадачи;
		текНормаВремени 	= Выборка.НормаВремени;
		
	КонецЦикла;
	
	Если текСостояние = стДанные.Состояние И текИсполнитель = стДанные.Исполнитель 
		И текСтатус = стДанные.Статус И текТипЗадачи = стДанные.ТипЗадачи И текНормаВремени = стДанные.НормаВремени Тогда
		Возврат;
	КонецЕсли;
	
	текИсполнитель 	= ?(стДанные.Исполнитель 	= Неопределено, текИсполнитель, 	стДанные.Исполнитель); 
	текСостояние 		= ?(стДанные.Состояние 		= Неопределено, текСостояние, 		стДанные.Состояние); 
	текСтатус 			= ?(стДанные.Статус 		= Неопределено, текСтатус, 			стДанные.Статус); 
	текТипЗадачи 		= ?(стДанные.ТипЗадачи 		= Неопределено, текТипЗадачи, 		стДанные.ТипЗадачи); 
	текНормаВремени	= ?(стДанные.НормаВремени 	= Неопределено, текНормаВремени, 	стДанные.НормаВремени); 
	
	
	УИД = Новый УникальныйИдентификатор();
	
	МенеджерЗаписи = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УИД 			= УИД;
	МенеджерЗаписи.Период 			= ТекущаяДата();
	МенеджерЗаписи.Задача 			= Задача;
	МенеджерЗаписи.Исполнитель		= текИсполнитель;
	МенеджерЗаписи.Состояние		= текСостояние;
	МенеджерЗаписи.ТипЗадачи		= текТипЗадачи;
	МенеджерЗаписи.НормаВремени	= текНормаВремени;
	МенеджерЗаписи.Статус			= текСтатус;
	МенеджерЗаписи.Автор			= ПараметрыСеанса.ТекущийПользователь;
	
	МенеджерЗаписи .Записать();
	
	Если НЕ ПустаяСтрока(Комментарий) Тогда
		
		МенеджерЗаписи = РегистрыСведений.ТаймингЗадачКомментарии.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.УИД 		= УИД;
		МенеджерЗаписи.Комментарий	= Комментарий; 
		
		МенеджерЗаписи .Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСостояниеЗадачи(Задача) Экспорт
	
	стДанные = Новый Структура("Представление, Исполнитель, Состояние, Конструктор", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние,
	|	ТаймингЗадачСрезПоследних.Исполнитель КАК Исполнитель,
	|	ТаймингЗадачСрезПоследних.Исполнитель.Наименование КАК ИсполнительНаименование,
	|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор
	|ИЗ
	|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних,
	|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &ОбъектТЗ) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.УстановитьПараметр("ОбъектТЗ", Задача.ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стДанные, Выборка);
		ИсполнительНаименование = Выборка.ИсполнительНаименование;
	КонецЦикла;
	
	Представление = "";
	
	Если ЗначениеЗаполнено(стДанные.Состояние) Тогда
		Представление = Строка(стДанные.Состояние);
	Иначе	
		Представление = "Ожидание";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(стДанные.Исполнитель) Тогда
		Представление = Представление + " " + ИсполнительНаименование;
	КонецЕсли;
	
	стДанные.Представление = Представление;
	
	Возврат стДанные;
	
КонецФункции // ПолучитьСостояниеЗадачи(Задача)

Функция ПолучитьИсториюЗадачи(Задача, ТипВозврата = "HTML") Экспорт
	
	тзДанные = ПолучитьДанныеИсториии(Задача);
	
	Если ТипВозврата = "HTML" Тогда
		Возврат	ИсторияЗадачиHTML(Задача, тзДанные);
	ИначеЕсли ТипВозврата = "строка" Тогда
		Возврат	ИсторияЗадачиСтрокой(тзДанные);
	КонецЕсли;
	
	Возврат тзДанные;
	
КонецФункции // ПолучитьИсториюЗадачи(Задача) 

Функция ИсторияЗадачиHTML(Задача, тзДанные)
	
	стрВозврата = омHTML.ПолучитьЗаголовокHTML();
	
	стрВозврата = стрВозврата + омHTML.ПолучитьHeadHTML("История " + Задача, 1);
	
	стрВозврата = стрВозврата + "<table>";
	стрВозврата = стрВозврата + "<tr><td>Дата</td><td>Исполнитель</td><td>Состояние</td><td>Автор</td><td>Комментарий</td></tr>";
	
	ШаблонСтроки = "<tr><td>%1</td><td>%2</td><td>%3</td><td>%4</td><td>%5</td></tr>";
	
	Для каждого СтрокаТаблицы Из тзДанные Цикл
		стрВозврата = стрВозврата + СтрШаблон(ШаблонСтроки, СтрокаТаблицы.Период, СтрокаТаблицы.Исполнитель, СтрокаТаблицы.Состояние, СтрокаТаблицы.Автор, СтрокаТаблицы.Комментарий);	
	КонецЦикла;
	
	стрВозврата = стрВозврата + "</table>";
	
	стрВозврата = стрВозврата + омHTML.ПолучитьХвостHTML();
	
	Возврат стрВозврата;
	
КонецФункции // ИсторияЗадачиHTML(тзДанные)

Функция ИсторияЗадачиСтрокой(тзДанные)
	
	
	
КонецФункции // ИсторияЗадачиHTML(тзДанные)

Функция ПолучитьДанныеИсториии(Задача)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаймингЗадач.Период КАК Период,
	|	ТаймингЗадач.Автор КАК Автор,
	|	ЕСТЬNULL(ТаймингЗадачКомментарии.Комментарий, """") КАК Комментарий,
	|	ТаймингЗадач.Исполнитель КАК Исполнитель,
	|	ЕСТЬNULL(СтадииКомплектаРеквизитыСтадии.Ссылка.ПолноеНаименование, """") КАК Состояние
	|ИЗ
	|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадачКомментарии КАК ТаймингЗадачКомментарии
	|		ПО ТаймингЗадач.УИД = ТаймингЗадачКомментарии.УИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
	|		ПО ТаймингЗадач.Состояние = СтадииКомплектаРеквизитыСтадии.Состояние
	|			И ТаймингЗадач.Статус = СтадииКомплектаРеквизитыСтадии.Статус
	|			И ТаймингЗадач.ТипЗадачи = СтадииКомплектаРеквизитыСтадии.ТипЗадачи
	|ГДЕ
	|	ТаймингЗадач.Задача = &Задача
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции // ПолучитьДанныеИсториии(Задача)

Функция ПолучитьТаймингиЗадачКонструктор(Период, Исполнитель) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадач.Задача КАК Задача,
		|	ТаймингЗадач.Период КАК Период
		|ПОМЕСТИТЬ втЗадачи
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|ГДЕ
		|	ТаймингЗадач.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТаймингЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаймингЗадач.Период КАК ДатаНачала,
		|	ТаймингЗадач.Задача КАК Задача,
		|	втЗадачи.Задача.Наименование КАК ЗадачаНаименование,
		|	ТаймингЗадач.Автор КАК Автор,
		|	ТаймингЗадач.Исполнитель КАК Исполнитель,
		|	ТаймингЗадач.Состояние КАК Состояние,
		|	ТаймингЗадач.Статус КАК Статус,
		|	ТаймингЗадач.ТипЗадачи КАК ТипЗадачи,
		|	ТаймингЗадач.НормаВремени КАК НормаВремени,
		|	ТаймингЗадач.Задача.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование,
		|	ТаймингЗадач.Задача.ОбъектТЗ КАК ОбъектТЗ,
		|	ТаймингЗадач.Задача.ОбъектТЗ.Проект КАК Проект,
		|	ЕСТЬNULL(ТаймингЗадачКомментарии.Комментарий, """") КАК Комментарий,
		|	ТаймингЗадач.Исполнитель.Сотрудник КАК Сотрудник,
		|	ТаймингЗадач.Исполнитель.Сотрудник.НачалаРабочегоДня КАК НачалаРабочегоДня,
		|	ТаймингЗадач.Исполнитель.Сотрудник.ОкончаниеРабочегоДня КАК ОкончаниеРабочегоДня,
		|	втЗадачи.Период КАК Окончание,
		|	ЕСТЬNULL(ДатыКомплекта.НормаВремени_ПКД, 0) КАК НормаВремени_ПКД,
		|	ЕСТЬNULL(ДатыКомплекта.НормаВремени_РКД, 0) КАК НормаВремени_РКД,
		|	ЗНАЧЕНИЕ(Справочник.СтадииКомплекта.ПустаяСсылка) КАК Стадия,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК СтадияНаименование,
		|	ЛОЖЬ КАК Ожидание,
		|	ЛОЖЬ КАК Доработка,
		|	0 КАК ПлановоеЗначение
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадачКомментарии КАК ТаймингЗадачКомментарии
		|		ПО ТаймингЗадач.УИД = ТаймингЗадачКомментарии.УИД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ПО ТаймингЗадач.Задача.ОбъектТЗ = ДатыКомплекта.Комплект
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ТаймингЗадач.Задача = втЗадачи.Задача
		|ГДЕ
		|	ТаймингЗадач.Исполнитель = &Исполнитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектТЗНаименование,
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("Исполнитель", 	Исполнитель);
	Запрос.УстановитьПараметр("ДатаНачала", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	Период.ДатаОкончания);
	
	СтруктураВозврата = Новый Структура("ТайминЗадач, ПлановоеЗначение", );
	СтруктураВозврата.ТайминЗадач = Запрос.Выполнить().Выгрузить();
	СтруктураВозврата.ТайминЗадач.Индексы.добавить("Задача");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановоеЗначениеПроектирования.Период КАК Период,
		|	ПлановоеЗначениеПроектирования.Задача КАК Задача,
		|	ПлановоеЗначениеПроектирования.Автор КАК Автор,
		|	ПлановоеЗначениеПроектирования.ДатаНачала КАК ДатаНачала,
		|	ПлановоеЗначениеПроектирования.ПланРазработкиВДнях КАК ПланРазработкиВДнях,
		|	ПлановоеЗначениеПроектирования.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.ПлановоеЗначениеПроектирования КАК ПлановоеЗначениеПроектирования
		|ГДЕ
		|	ПлановоеЗначениеПроектирования.Задача В(&Задача)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Задача", СтруктураВозврата.ТайминЗадач.Выгрузитьколонку("Задача"));

	ЗаполнитьПлановоеВремя(СтруктураВозврата.ТайминЗадач, Запрос.Выполнить().Выбрать());
	
	ЗаполнитьСтадииЗадачи(СтруктураВозврата.ТайминЗадач);
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьТаймингиЗадач()  

Процедура ЗаполнитьСтадииЗадачи(ТайминЗадач)

	КэшСтадий = Новый ТаблицаЗначений;
	КэшСтадий.Колонки.Добавить("Стадия", 			Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	КэшСтадий.Колонки.Добавить("ТекущиеСостояние",	Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЗадач"));
	КэшСтадий.Колонки.Добавить("ТекущийСтатус", 	Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	КэшСтадий.Колонки.Добавить("ТекущийТипЗадачи", 	Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадачКонструирования")); 
	
	Отбор = Новый Структура("ТекущиеСостояние, ТекущийСтатус, ТекущийТипЗадачи", );
	
	МассивСтадий = Новый Массив;
	
	Для каждого СтрокаТайминга Из ТайминЗадач Цикл
		
		Отбор.ТекущиеСостояние 	= СтрокаТайминга.Состояние;
		Отбор.ТекущийТипЗадачи 	= СтрокаТайминга.ТипЗадачи;
		Отбор.ТекущийСтатус 	= СтрокаТайминга.Статус;
		
		НайденыеСтроки = КэшСтадий.НайтиСтроки(Отбор);
		Если НайденыеСтроки.Количество() = 0 Тогда
		
			СтрокаТайминга.Стадия = омЗадачиПКДСервер.ПолучитьСтадиюКомплеткаНаОснованииПараметров(Отбор);		
			
			НС = КэшСтадий.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Отбор);
			НС.Стадия = СтрокаТайминга.Стадия; 
			
			МассивСтадий.Добавить(НС.Стадия);
		
		Иначе
		
			СтрокаТайминга.Стадия = НайденыеСтроки[0].Стадия;		
		
		КонецЕсли;
		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплекта.Ссылка КАК Стадия,
		|	СтадииКомплекта.Ожидание КАК Ожидание,
		|	СтадииКомплекта.Доработка КАК Доработка,
		|	СтадииКомплекта.ПолноеНаименование КАК СтадияНаименование
		|ИЗ
		|	Справочник.СтадииКомплекта КАК СтадииКомплекта
		|ГДЕ
		|	СтадииКомплекта.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивСтадий);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Отбор = Новый Структура("Стадия", );
	
	Пока Выборка.Следующий() Цикл
		Отбор.Стадия = Выборка.Стадия;
		
		Для каждого х Из ТайминЗадач.НайтиСтроки(Отбор) Цикл
		
			ЗаполнитьЗначенияСвойств(х, Выборка);	
		
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПлановоеВремя(ТайминЗадач, Выборка)
	
	Отбор = Новый Структура("Задача", );
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПланРазработкиВДнях = 0 Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		Отбор.Задача = Выборка.Задача;
		
		НайденыеСтроки = ТайминЗадач.НайтиСтроки(Отбор);
		
		Для х = 0 По НайденыеСтроки.Количество() - 1 Цикл
			
			СтрокаТайминга = ТайминЗадач[х];
			
			Если СтрокаТайминга.ДатаНачала < Выборка.Период Тогда
				
				СтрокаТайминга.ПлановоеЗначение = Выборка.ПланРазработкиВДнях;
				Прервать;
				
			КонецЕсли;
			
			Если х > 0 Тогда
				
				СтрокаТаймингаПредыдущая = ТайминЗадач[х - 1];
				
				Если СтрокаТаймингаПредыдущая.ДатаНачала >= Выборка.Период И СтрокаТайминга.ДатаНачала < Выборка.Период Тогда
					
					СтрокаТайминга.ПлановоеЗначение = Выборка.ПланРазработкиВДнях;
					Прервать;
					
				КонецЕсли;
			
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
