
#Область ТаблицаОбщихЗадач


&НаКлиенте
Процедура ОбщиеЗадачиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеЗадачиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеЗадачиПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТД = Элементы.ТаблицаОбщихЗадач.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТД.Задача);
КонецПроцедуры

Процедура ЗаполнитьТаблицуОбщихЗадач()

	СтруктураПараметров = омЗадачаОбщаяНаСервере.ПолучитьСтруктуруПараметровДляТаблицыОбщихЗадач();
	СтруктураПараметров.НеВыполненые 	= Истина;
	СтруктураПараметров.МоиЗадачи 		= Элементы.ТаблицаОбщихЗадачОбщиеМоиЗадачи.Пометка;
	СтруктураПараметров.ДляМеня 		= Элементы.ТаблицаОбщихЗадачОбщиеДляМеня.Пометка;
	СтруктураПараметров.Наблюдатель 	= Элементы.ТаблицаОбщихЗадачОбщиеНаблюдатель.Пометка;
	СтруктураПараметров.НеВыполненые 	= Истина;
	СтруктураПараметров.Исполнитель 	= ПараметрыСеанса.ТекущийПользователь;
	СтруктураПараметров.Автор 			= СтруктураПараметров.Исполнитель;
	
	ТаблицаОбщихЗадач.Загрузить(омЗадачаОбщаяНаСервере.СформироватьТаблицуОбщихЗадач(СтруктураПараметров));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбщуюЗадачу(Команда)
	ОткрытьФорму("Задача.ЗадачиОбщие.Форма.ФормаЗадачи");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбщиеЗадачи(Команда)
	ЗаполнитьТаблицуОбщихЗадач();	
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеДляМеня(Команда)
	Элементы.ТаблицаОбщихЗадачОбщиеДляМеня.Пометка = НЕ Элементы.ТаблицаОбщихЗадачОбщиеДляМеня.Пометка;
	ЗаполнитьТаблицуОбщихЗадач();
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеМоиЗадачи(Команда)
	Элементы.ТаблицаОбщихЗадачОбщиеМоиЗадачи.Пометка = НЕ Элементы.ТаблицаОбщихЗадачОбщиеМоиЗадачи.Пометка;
	ЗаполнитьТаблицуОбщихЗадач();
КонецПроцедуры


#КонецОбласти

