
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаПодключения 	= Параметры.НастройкаПодключения;
	ВидСинхронизации 		= Параметры.ВидСинхронизации;
	ПолнаяСинхронизация 	= Параметры.ПолнаяСинхронизация;
	
	ВыполнятьЗагрузку 		= Истина;
	ВыполнятьВыгрузку 		= Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Если НЕ Б24_К_СлужебныйВызовСервера.МодульСинхронизацииДоступен(НастройкаПодключения) Тогда
	//	Б24_К_СлужебныйКлиент.ОповеститьОбНедоступностиФункционалаСинхронизацииПоТарифномуПлану();
	//	Закрыть();	
	//КонецЕсли;
	
	ПодключитьОбработчикОжидания("ЗапуститьВыполнениеОбмена", 0.1, Истина);
	
	ПодключитьОбработчикОжидания("ОбновлениеИнформацииОСинхронизации", 1);

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьВыполнениеОбмена()
	
	ДобавитьЕдиничнуюЗаписьВПротокол("Начало синхронизации");
	
	ПараметрыСинхронизации = Новый Структура;
	ПараметрыСинхронизации.Вставить("НастройкаПодключения"	, НастройкаПодключения);
	ПараметрыСинхронизации.Вставить("ВидСинхронизации"		, ВидСинхронизации);
	ПараметрыСинхронизации.Вставить("ПолнаяСинхронизация"	, ПолнаяСинхронизация);
	ПараметрыСинхронизации.Вставить("ВыполнятьЗагрузку"		, ВыполнятьЗагрузку);
	ПараметрыСинхронизации.Вставить("ВыполнятьВыгрузку"		, ВыполнятьВыгрузку);
	
	ДлительнаяОперация = ВыполнитьСинхронизациюСБитрикс24НаСервере(ПараметрыСинхронизации);
	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииОперацииЗагрузки", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеИнформацииОСинхронизации()
	
	ОбновлениеИнформацииОСинхронизацииСервер();	
	
	ДлинаПротокола = СтрДлина(Протокол);
	
	Если ДлинаПротокола > 0 Тогда     
		Элементы.Протокол.ТекущаяОбласть  = ТабличныйПротокол.Области.Найти("Информация");
	КонецЕсли;
	
	Если ЗавершенаСинхронизация Тогда
		ДобавитьЕдиничнуюЗаписьВПротокол("Завершение синхронизации");
		ОтключитьОбработчикОжидания("ОбновлениеИнформацииОСинхронизации");
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ОбновлениеИнформацииОСинхронизацииСервер(Сообщения = Неопределено)
	
	Макет = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("МакетЛога");
	
	Если Сообщения = Неопределено Тогда
		
		Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("УникальныйИдентификатор", ИдентификаторЗадания));
		
		Если Задания.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Задание = Задания[0];
		
		Сообщения = Задание.ПолучитьСообщенияПользователю(Истина);
		
	КонецЕсли;
	
	Для Каждого текСообщение Из Сообщения Цикл
		
		Если Лев(текСообщение.Текст, 26)= "Тело запроса HTTP запроса:" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Лев(текСообщение.Текст, 16)= "Ответ с портала:" Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстСообщения = текСообщение.Поле + ?(ЗначениеЗаполнено(текСообщение.Поле), " -- ", "") + текСообщение.Текст;
		
		Протокол = Протокол + ТекстСообщения + Символы.ПС; 
		
		Если (текСообщение.ПутьКДанным = "КритическаяОшибка" ИЛИ текСообщение.ПутьКДанным = "Критическая ошибка")
			И ЗначениеЗаполнено(текСообщение.КлючДанных) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("КритическаяОшибкаСсылка");                                                                                                                                                                                                                                                                                                                                                
		ИначеЕсли (текСообщение.ПутьКДанным = "КритическаяОшибка" ИЛИ текСообщение.ПутьКДанным = "Критическая ошибка")
			И НЕ ЗначениеЗаполнено(текСообщение.КлючДанных) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("КритическаяОшибка");                                                                                                                                                                                                                                                                                                                                               
			
		ИначеЕсли текСообщение.ПутьКДанным = "Ошибка" И ЗначениеЗаполнено(текСообщение.КлючДанных) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ОшибкаСсылка");                                                                                                                                                                                                                                                                                                                                                
		ИначеЕсли текСообщение.ПутьКДанным = "Ошибка" И НЕ ЗначениеЗаполнено(текСообщение.КлючДанных) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Ошибка");  
			
		ИначеЕсли текСообщение.ПутьКДанным = "Информация" И ЗначениеЗаполнено(текСообщение.КлючДанных) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ИнформацияСсылка");                                                                                                                                                                                                                                                                                                                                                
		ИначеЕсли текСообщение.ПутьКДанным = "Информация" И НЕ ЗначениеЗаполнено(текСообщение.КлючДанных) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Информация"); 
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("Информация");                                                                                                                                                                                                                                                                                                                                                
		КонецЕсли;
		
		ОбластьМакета.Параметры.ТекстСообщения = ТекстСообщения; 
		ОбластьМакета.Параметры.СсылкаНаОбъект = текСообщение.КлючДанных; 
		ТабличныйПротокол.Вывести(ОбластьМакета);
	
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ДобавитьЕдиничнуюЗаписьВПротокол(текСообщение)
	
	Макет = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМакет("МакетЛога");
	
	ТекстСообщения = Формат(ТекущаяДатаСеанса(),"ДЛФ=T") + " -- " + текСообщение;
	
	Протокол = Протокол + ТекстСообщения + Символы.ПС; 
	
	ОбластьМакета= Макет.ПолучитьОбласть("Информация");                                                                                                                                                                                                                                                                                                                                                
	ОбластьМакета.Параметры.ТекстСообщения = ТекстСообщения; 
	ТабличныйПротокол.Вывести(ОбластьМакета);
	
КонецПроцедуры	


&НаКлиенте
Процедура ПриЗавершенииОперацииЗагрузки(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.ГруппаКнопки.Видимость 	= Истина;
	Элементы.КнопкаЗакрыть.Видимость 	= Истина;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;      
	
	Если Результат.Свойство("Сообщения") Тогда
		ОбновлениеИнформацииОСинхронизацииСервер(Результат.Сообщения);	
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(Результат.ПодробноеПредставлениеОшибки) Тогда
		ОписаниеОшибки 										= Результат.ПодробноеПредставлениеОшибки; 
		Элементы.СтраницыФормы.ТекущаяСтраница 				= Элементы.СтраницаОшибка;
		Элементы.НаписатьВТехподдержку.Видимость 			= Истина;
		Элементы.НаписатьВТехподдержку.КнопкаПоУмолчанию 	= Истина;
	Иначе
		
		ПоказатьОповещениеПользователя(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 ""%2""'"),
		Формат(Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТекущуюДатуСеанса(), "ДЛФ=DT"),
		НастройкаПодключения) 
		,,
		НСтр("ru = 'Синхронизация с Битрикс24 завершена'"),
		БиблиотекаКартинок.Информация32);
		
		Элементы.НадписьВыполняетсяОбмен.Заголовок 	= "Синхронизация завершена";
		Элементы.КартинкаВыполняетсяОбмен.Видимость = Ложь;
		Элементы.КнопкаЗакрыть.КнопкаПоУмолчанию 	= Истина;
		
	КонецЕсли;
	
	ОбновлениеИнформацииОСинхронизации();
	
	ЗавершенаСинхронизация = Истина;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьСинхронизациюСБитрикс24НаСервере(ПараметрыСинхронизации)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение синхронизации с Битрикс24'");
	
	Результат = ДлительныеОперации.ВыполнитьВФоне("Б24_КС_ОбщегоНазначенияВызовСервера.ВыполнитьСинхронизациюПоФоновомуЗаданию", ПараметрыСинхронизации, ПараметрыВыполнения);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НаписатьВТехподдержку(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОписаниеОшибки", ОписаниеОшибки);	
	ПараметрыФормы.Вставить("Протокол"		, Протокол);	
	ОткрытьФорму("Обработка.Б24_К_Администрирование.Форма.НаписатьТикетВТехподдержку", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокНеотправленныхПакетов(Команда)
	ОткрытьФорму("РегистрСведений.Б24_КС_ПакетыВыгрузки.ФормаСписка");
КонецПроцедуры

