
&НаКлиенте
Процедура Перенести(Команда)
	Закрыть(Новый Структура("ДатаОбещания, Комментарий", ДатаОбещания, Комментарий));
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Наименование КАК ИзделияКомплектНаименование
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Ссылка В(&Ссылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзделияКомплектНаименование";
	
	Запрос.УстановитьПараметр("Ссылка", Параметры.мИзделияКомплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИзделияКомплект = "";
	Пока Выборка.Следующий() Цикл
		Если НЕ ПустаяСтрока(ИзделияКомплект) Тогда
			ИзделияКомплект = ИзделияКомплект + "; ";
		КонецЕсли;
		
		ИзделияКомплект = ИзделияКомплект + Выборка.ИзделияКомплектНаименование;
	КонецЦикла;

КонецПроцедуры


