
Функция ПолучитьНаименованиеГЧ(Проект, ОсновноеПомещение, НаименованиеБезКода, НомерВПомещении) Экспорт 
	
	
	КодСделки 		= "";
	КодПомещения 	= "";
	
	Если ЗначениеЗаполнено(Проект) Тогда
		КодСделки = Формат(Проект.Номер, "ЧЦ=2; ЧВН=");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОсновноеПомещение) Тогда
		КодПомещения = ОсновноеПомещение.НомерПомещения;
	КонецЕсли;

	Возврат Новый Структура("Наименование, ОсновноеПомещение", 
											КодСделки + "." + КодПомещения + ?(НомерВПомещении = 0, "", "-" + НомерВПомещении) + "." + НаименованиеБезКода,
											ОсновноеПомещение);
	
КонецФункции // СформироватьНаименованиеГЧ(ГабаритныйЧертежОбъект)

Функция ПолучитьГабаритныеЧертежиПоПомещениям(МассивПомещений, Проект = Неопределено) Экспорт

	Если Проект = Неопределено Тогда
		
		Если МассивПомещений.Количество() = 0 Тогда
			Возврат Новый Массив;
		КонецЕсли;
		
		СделкаПомещений = МассивПомещений[0].Проект;

	Иначе	
		СделкаПомещений = Проект;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежиПомещения.Ссылка КАК ГабаритныйЧертеж
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.ГабаритныеЧертежи.Помещения КАК ГабаритныеЧертежиПомещения
		|ГДЕ
		|	ГабаритныеЧертежиПомещения.Ссылка.Проект = &Проект
		|	И НЕ ГабаритныеЧертежиПомещения.Помещение В (&МассивПомещений)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГабаритныеЧертежиПомещения.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГабаритныеЧертежи.Ссылка КАК ГабаритныйЧертеж
		|ИЗ
		|	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО (вт.ГабаритныйЧертеж = ГабаритныеЧертежи.Ссылка)
		|ГДЕ
		|	вт.ГабаритныйЧертеж ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("МассивПомещений", МассивПомещений);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГабаритныйЧертеж");
	
КонецФункции // ПолучитьГабаритныеЧертежиПоПомещениям()

Функция ПолучитьРодительГабаритногоЧертежа(Проект) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
		|ГДЕ
		|	ГабаритныеЧертежи.Проект = &Проект
		|	И ГабаритныеЧертежи.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
    Возврат Справочники.ГабаритныеЧертежи.ПустаяСсылка();
	
КонецФункции // ПолучитьРодительКопозиции()

Процедура УстановитьКодПДМДляГабаритныйЧертеж(ПараметрГабаритныйЧертеж, КодВПДМ) Экспорт

	
	Если ТипЗнч(ПараметрГабаритныйЧертеж) = Тип("Строка") Тогда
		ГабаритныйЧертеж = Справочники.ГабаритныеЧертежи.НайтиПоКоду(ПараметрГабаритныйЧертеж);
	Иначе
		ГабаритныйЧертеж = ПараметрГабаритныйЧертеж;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГабаритныйЧертеж) Тогда
	
		МенеджерЗаписей 					= РегистрыСведений.ДанныеГабаритныйЧертеж.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.ГабаритныйЧертеж 	= ГабаритныйЧертеж;
		
		МенеджерЗаписей.Прочитать();
		
		Если ЗначениеЗаполнено(МенеджерЗаписей.ГабаритныйЧертеж) Тогда
			
			Если НЕ МенеджерЗаписей.Код_в_PDM = КодВПДМ Тогда
				
				МенеджерЗаписей.Код_в_PDM = КодВПДМ;
				МенеджерЗаписей.Записать();
				
			КонецЕсли;
			
		Иначе
			
			МенеджерЗаписей.ГабаритныйЧертеж 	= ГабаритныйЧертеж;
			МенеджерЗаписей.Код_в_PDM 			= КодВПДМ;
			
			МенеджерЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // УстановитьКодПДМДляСделки()

Функция ПолучитьПлановуюДатуГотовностиГабаритногоЧертежа(ГабаритныйЧертеж) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановаяГотовностьГабаритныхЧертежей.ДатаГотовности КАК ДатаГотовности
		|ИЗ
		|	РегистрСведений.ПлановаяГотовностьГабаритныхЧертежей КАК ПлановаяГотовностьГабаритныхЧертежей
		|ГДЕ
		|	ПлановаяГотовностьГабаритныхЧертежей.ГабаритныйЧертеж = &ГабаритныйЧертеж";
	
	Запрос.УстановитьПараметр("ГабаритныйЧертеж", ГабаритныйЧертеж);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ДатаГотовности;	
	КонецЦикла;
	
	Возврат Дата(1, 1, 1);	

КонецФункции // ПолучитьПлановуюДатуГотовностиГабаритногоЧертежа(ГабаритныйЧертеж)

Функция ПолучитьГЧКомплекта(Комплект) Экспорт		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
		|	ИзделияКомплект.Родитель.ГабаритныйЧертеж КАК РодительГабаритныйЧертеж
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Ссылка = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ГабаритныйЧертеж) Тогда
		
			Возврат Выборка.ГабаритныйЧертеж;	
		
		ИначеЕсли ЗначениеЗаполнено(Выборка.РодительГабаритныйЧертеж) Тогда
		
			Возврат Выборка.РодительГабаритныйЧертеж;	
		
		КонецЕсли;
	КонецЦикла;
	
	Возврат Справочники.ГабаритныеЧертежи.ПустаяСсылка();
	
КонецФункции // ПолучитьГЧКомплекта()

Функция ПолучитьСтатусГЧ(ГЧ) Экспорт


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеЗамераСрезПоследних.СтатусЗамера КАК СтатусЗамера
		|ИЗ
		|	РегистрСведений.СостояниеЗамера.СрезПоследних(, ОбъектЗамера = &ГЧ) КАК СостояниеЗамераСрезПоследних";
	
	Запрос.УстановитьПараметр("ГЧ", ГЧ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СтатусЗамера;
	КонецЦикла;
	
	Возврат Перечисления.СтатусыЗамера.ПустаяСсылка();
	
КонецФункции // ПолучитьСтатусГЧ()

Функция Получить_путь_PDM(ГабаритныйЧертеж) Экспорт

	

КонецФункции // Получить_путь_PDM()
