
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Комплект", Комплект);
	Отказ = Не ЗначениеЗаполнено(Комплект);
	
	Если НЕ Отказ Тогда
	
		ЗаполнитьДанные();	
	
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗаполнитьДанные()

	ТаблицаДанных = омКанбанОбщие.ПолучитьТайминКарточки(Комплект);
	
	ТаймингКомплекта.Загрузить(ТаблицаДанных);
	МаксимальныйИндекс = ТаймингКомплекта.Количество() - 1;
	СекундВДне = 24 * 3600;
	
	Для х = 0 по МаксимальныйИндекс Цикл
		
		ТекущаяСтрока = ТаймингКомплекта[х];
		
		ИндексСледующейСтроки = х + 1;
		Если ИндексСледующейСтроки > МаксимальныйИндекс Тогда
		
			Если ТекущаяСтрока.ВРаботе Тогда
			
				ТекущаяСтрока.Продолжительность = (ТекущаяДата() - ТекущаяСтрока.ДатаНачала) / СекундВДне;	
			Иначе
				
			    ТекущаяСтрока.Продолжительность = 0;
			КонецЕсли;
			
		Иначе
			
			ТекущаяСтрока.Продолжительность = (ТаймингКомплекта[х + 1].ДатаНачала - ТекущаяСтрока.ДатаНачала) / СекундВДне;	
			
			
		КонецЕсли;
	
	КонецЦикла;
	

КонецПроцедуры
