
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Комплект", Комплект);
	Отказ = Не ЗначениеЗаполнено(Комплект);
	
	Если НЕ Отказ Тогда
	
		ЗаполнитьДанные();	
	
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗаполнитьДанные()

	Данные = омКанбанОбщие.ПолучитьТайминКарточки(Комплект);
	УИДКарточка 	= Данные.УИДКарточка;
	ТаблицаДанных 	= Данные.ТаблицаДанных;
	
	МаксимальныйИндекс = ТаблицаДанных.Количество() - 1;
	Для х = 0 по МаксимальныйИндекс  Цикл
		ТекущаяСтрока = ТаблицаДанных[х];
		
		Если х = 0 Тогда
			ЗаполнитьЗначенияСвойств(ТаймингКомплекта.Добавить(), ТекущаяСтрока);
		Иначе
			ПредыдущаяСтрока = ТаблицаДанных[х - 1];
			
			Если НЕ ТекущаяСтрока.Стадия = ПредыдущаяСтрока.Стадия Тогда
				
				ЗаполнитьЗначенияСвойств(ТаймингКомплекта.Добавить(), ТекущаяСтрока);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	МаксимальныйИндекс = ТаймингКомплекта.Количество() - 1;
	СекундВДне = 24 * 3600; 
	Для х = 0 по МаксимальныйИндекс Цикл
		
		ТекущаяСтрока = ТаймингКомплекта[х];
		
		ИндексСледующейСтроки = х + 1;
		Если ИндексСледующейСтроки > МаксимальныйИндекс Тогда
			
		
			Если ТекущаяСтрока.ВРаботе Тогда
			
				ТекущаяСтрока.Продолжительность = (ТекущаяДата() - ТекущаяСтрока.ДатаНачала) / СекундВДне;	
			Иначе
				
			    ТекущаяСтрока.Продолжительность = 0;
			КонецЕсли;
			
		Иначе
			
			ТекущаяСтрока.Продолжительность = (ТаймингКомплекта[х + 1].ДатаНачала - ТекущаяСтрока.ДатаНачала) / СекундВДне;	
			
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаймингКомплектаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаймингКомплектаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаймингКомплектаПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТД = Элементы.ТаймингКомплекта.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОПереносеКарточки", ЭтаФорма, Новый Структура("УИДКудаКолонка", ТД.УИДКудаКолонка));
	
	ПоказатьВопрос(Оповещение, "Вы точно хотите перенести " + Комплект + " в стадию " + ТД.СтадияПолноеНаименование + "?", РежимДиалогаВопрос.ДаНет, , , "Перенос комплекта");	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВопросаОПереносеКарточки(Результат, Параметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;

    омКанбанПроизводство.ПереместитьРеквизитВПереопределенное(УИДКарточка, Параметры.УИДКудаКолонка); 
    Закрыть();

КонецПроцедуры
