Процедура СформироватьПолноеНаименование(ОбъектИзделиеКомплект) Экспорт
	ОсновноеИзделие = Неопределено;
	
	Для каждого строкаИзделие Из ОбъектИзделиеКомплект.ИзделияЭлемент Цикл
		Если строкаИзделие.Основное Тогда
			ОсновноеИзделие = строкаИзделие.ИзделиеЭлемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	
	Если ЗначениеЗаполнено(ОсновноеИзделие) ИЛИ ЗначениеЗаполнено(ОбъектИзделиеКомплект.Проект) Тогда
		стДанныеДляКода = омИзделиеКомплект.ПолучитьДанныеДляКода(ОсновноеИзделие, ОбъектИзделиеКомплект.Проект);	
		
	    ОбъектИзделиеКомплект.Наименование = Формат(стДанныеДляКода.НомерПроекта,"ЧЦ=2; ЧВН=") + "." 
			+ стДанныеДляКода.НомерПомещения + "." + Формат(стДанныеДляКода.НомерИзделия,"ЧЦ=3; ЧВН=") 
			+ "." + омСтроки.ПолучитьРазрешенноеИмяРеквизитаПоСтроке(ОбъектИзделиеКомплект.НаименованиеКомплекта);
			
		ОбъектИзделиеКомплект.ОсновноеПомещение = ?(ЗначениеЗаполнено(ОсновноеИзделие)
													,омИзделиеЭлемент.ПолучитьПомещениеИзделия(ОсновноеИзделие)
													,ПредопределенноеЗначение("Справочник.Помещения.ПустаяСсылка"));
	Иначе
	   	ОбъектИзделиеКомплект.Наименование 		= ОбъектИзделиеКомплект.НаименованиеКомплекта;
		ОбъектИзделиеКомплект.ОсновноеПомещение = ПредопределенноеЗначение("Справочник.Помещения.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры // СформировитьПолноеНаименование()

