
Функция ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель = Неопределено) Экспорт
	
	МенеджерРегистра = РегистрыСведений.ТаймингЗадач;

	ОбъектЗадача 				= Задача.ПолучитьОбъект();
	ОбъектЗадача.Дата 			= ТекущаяДата();
	ОбъектЗадача.СтатусЗадачи   = Перечисления.СтатусыЗадач.Замер;
	ОбъектЗадача.Исполнитель 	= Исполнитель;
	
	Если Действие = "История" Тогда
		Возврат МенеджерРегистра.ПолучитьОбщиеЗадачи(Задача);
	ИначеЕсли Действие = "НачатьВыполнение" Тогда
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ЗамерИзменение;
		
		омФайлыPDM.Перевести_ГЧ_в_изменение_статус(ОбъектЗадача.ОбъектТЗ);

	ИначеЕсли Действие = "КорректировкаНеНужна" Тогда
		
		ОбъектЗадача.Выполнена					= Истина;
		ОбъектЗадача.ВыполненаБезКорректировки 	= Истина;
		ОбъектЗадача.ТипЗадачи 					= Перечисления.ТипыЗадачКонструирования.Завершение;
		ОбъектЗадача.ДатаПроверки				= ТекущаяДата();
		ОбъектЗадача.АвторКорректировки			= ПараметрыСеанса.ТекущийПользователь;
		
	ИначеЕсли Действие = "ЗавершитьВыполнение" Тогда
		
		ОбъектЗадача.Выполнена				= Истина;
		ОбъектЗадача.ТипЗадачи 				= Перечисления.ТипыЗадачКонструирования.Завершение;
		ОбъектЗадача.ДатаПроверки			= ТекущаяДата();
		ОбъектЗадача.АвторКорректировки		= ПараметрыСеанса.ТекущийПользователь;
		
		омФайлыPDM.Перевести_ГЧ_в_проектный_статус(ОбъектЗадача.ОбъектТЗ);
		
	ИначеЕсли Действие = "Сброс" Тогда
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ЗамерПроектный;
		
		омФайлыPDM.Перевести_ГЧ_в_проектный_статус(ОбъектЗадача.ОбъектТЗ);

	КонецЕсли;
	
	ОбъектЗадача.Записать();
		
	стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ПустаяСсылка(), Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
	МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
	СсылкаНаЗадачу = ОбъектЗадача.Ссылка;
	
	
	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(СсылкаНаЗадачу);

КонецФункции // ДействияНаСервере()

Функция КоличествоЗапущеныхЗадач(Исполнитель, ТолькоКоличество = Истина) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоздатьМодельГабаритногоЧертежа.Ссылка КАК Ссылка,
		|	СоздатьМодельГабаритногоЧертежа.Наименование КАК Наименование
		|ИЗ
		|	Задача.СоздатьМодельГабаритногоЧертежа КАК СоздатьМодельГабаритногоЧертежа
		|ГДЕ
		|	НЕ СоздатьМодельГабаритногоЧертежа.Выполнена
		|	И СоздатьМодельГабаритногоЧертежа.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.ЗамерИзменение)
		|	И СоздатьМодельГабаритногоЧертежа.Исполнитель = &Исполнитель
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПроверитьГабаритныеЧертежи.Ссылка,
		|	ПроверитьГабаритныеЧертежи.Наименование
		|ИЗ
		|	Задача.ПроверитьГабаритныеЧертежи КАК ПроверитьГабаритныеЧертежи
		|ГДЕ
		|	НЕ ПроверитьГабаритныеЧертежи.Выполнена
		|	И ПроверитьГабаритныеЧертежи.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.ЗамерИзменение)
		|	И ПроверитьГабаритныеЧертежи.Исполнитель = &Исполнитель";
	
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	
	Выборка = Запрос.Выполнить();
	
    Если ТолькоКоличество Тогда
		Возврат Выборка.Выбрать().Количество();
	КонецЕсли;
	
	Возврат Выборка.Выгрузить();
	
КонецФункции // КоличествоЗапущеныхЗадач()
