
Процедура ПриВыполнении(Отказ)
	
	ИзменитьСтатусГЧ = ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.АктПриемкиГабаритныхЧертежей");
	ТД = ТекущаяДата();
	
	Если БылаКорректировка = 1 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК ИзделиеКомплект
		|ПОМЕСТИТЬ втКомплекты
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ВыполнитьКорректировкуИзделияКомплект КАК ВыполнитьКорректировкуИзделияКомплект
		|		ПО (ВыполнитьКорректировкуИзделияКомплект.ИзделиеКомплект = ИзделияКомплект.Ссылка)
		|			И (ВыполнитьКорректировкуИзделияКомплект.ЗадачаПроверкиГабаритногоЧертежа = &ЗадачаПроверкиГабаритногоЧертежа)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.ПроверитьГабаритныеЧертежи КАК ПроверитьГабаритныеЧертежи
		|		ПО ИзделияКомплект.ГабаритныйЧертеж = ПроверитьГабаритныеЧертежи.ГабаритныйЧертеж
		|ГДЕ
		|	ПроверитьГабаритныеЧертежи.Ссылка = &ЗадачаПроверкиГабаритногоЧертежа
		|	И ВыполнитьКорректировкуИзделияКомплект.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеКомплекта.Конструктор КАК Исполнитель,
		|	втКомплекты.ИзделиеКомплект КАК ИзделиеКомплект,
		|	втКомплекты.ИзделиеКомплект.Наименование КАК Наименование,
		|	втКомплекты.ИзделиеКомплект.Проект КАК Проект
		|ИЗ
		|	втКомплекты КАК втКомплекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|		ПО втКомплекты.ИзделиеКомплект = ДанныеКомплекта.Комплект";
		
		Запрос.УстановитьПараметр("ЗадачаПроверкиГабаритногоЧертежа", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		Пока Выборка.Следующий() Цикл
			
			ЗадачаПроверки = Задачи.ВыполнитьКорректировкуИзделияКомплект.СоздатьЗадачу();
			ЗадачаПроверки.Дата 									= ТекущаяДата();
			ЗадачаПроверки.ЗадачаПроверкиГабаритногоЧертежа 		= Ссылка;
			ЗадачаПроверки.ИзделиеКомплект 							= Выборка.ИзделиеКомплект;
			ЗадачаПроверки.Исполнитель 								= Выборка.Исполнитель;
			ЗадачаПроверки.Наименование								= Выборка.Наименование + "Комплект.Проверить";	
			ЗадачаПроверки.Проект									= Выборка.Проект;	
			ЗадачаПроверки.КрайняяДатаИсполнения					= ЗадачаПроверки.Дата + 7 * 24 * 3600;	
			
			ЗадачаПроверки.Записать();
			
		КонецЦикла; 
		
		
	ИначеЕсли БылаКорректировка = 3 Тогда
		
		ИсполнительЗадачи 	= Справочники.Пользователи.ПустаяСсылка();
		Наименование 	= "";
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПроверитьГабаритныеЧертежи.Основание.Автор КАК Исполнитель,
			|	ПроверитьГабаритныеЧертежи.ГабаритныйЧертеж.Наименование КАК ГабаритныйЧертежНаименование
			|ИЗ
			|	Задача.ПроверитьГабаритныеЧертежи КАК ПроверитьГабаритныеЧертежи
			|ГДЕ
			|	ПроверитьГабаритныеЧертежи.Ссылка = &Ссылка";
			
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ИсполнительЗадачи 	= Выборка.Исполнитель;
			Наименование 		= Выборка.ГабаритныйЧертежНаименование;
		КонецЦикла;
		
		ИзменитьСтатусГЧ = Ложь;
		
		ЗадачаПроверки = Задачи.НетДанныхДляИзмененияСтатусаГЧ.СоздатьЗадачу();
		ЗадачаПроверки.Дата 									= ТД;
		ЗадачаПроверки.ЗадачаПроверкиГабаритногоЧертежа 		= Ссылка;
		ЗадачаПроверки.ГабаритныйЧертеж 						= ГабаритныйЧертеж;
		ЗадачаПроверки.Исполнитель 								= ИсполнительЗадачи;
		ЗадачаПроверки.Наименование								= Выборка.ГабаритныйЧертежНаименование + ".Перезамер";	
		ЗадачаПроверки.Проект									= Проект;	
		ЗадачаПроверки.КрайняяДатаИсполнения					= ЗадачаПроверки.Дата + 7 * 24 * 3600;	
		
		ЗадачаПроверки.Записать();
		
	КонецЕсли;
	
	Если ИзменитьСтатусГЧ Тогда
		
		ИсполнительЗадачи = омЗадачи.ПолучитьИсполнителя(Перечисления.ОбъектыЗадач.РуководительЗамера);
		
		ЗадачаИзменение = Задачи.ИзменениеСтатусаГЧ.СоздатьЗадачу();
		ЗадачаИзменение.Дата 									= ТД;
		ЗадачаИзменение.Основание 								= Ссылка;
		ЗадачаИзменение.ГабаритныйЧертеж 						= ГабаритныйЧертеж;
		ЗадачаИзменение.Исполнитель 							= ИсполнительЗадачи;
		ЗадачаИзменение.Наименование							= Строка(ГабаритныйЧертеж) + ".ИзменитьСтатус";	
		ЗадачаИзменение.Проект									= Проект;	
		ЗадачаИзменение.НовыйСтатус								= НовыйСтатус;	
		ЗадачаИзменение.КрайняяДатаИсполнения					= ЗадачаИзменение.Дата + 7 * 24 * 3600;	
		
		ЗадачаИзменение.Записать();
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередВыполнением(Отказ)

	ДатаПроверки 		= ТекущаяДата();
	АвторКорректировки 	= ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры

Процедура ПередИнтерактивнымВыполнением(Отказ)
	ПередВыполнением(Отказ);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	РегистрыСведений.СтатусыЗадач.НазначитьСтатусЗадачи(Ссылка);
КонецПроцедуры
