
Процедура ПриВыполнении(Отказ)
	
	ТД = ТекущаяДата();
	
	Если НЕ ВыполненаБезКорректировки Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК ИзделиеКомплект
		|ПОМЕСТИТЬ втКомплекты
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ВыполнитьКорректировкуИзделияКомплект КАК ВыполнитьКорректировкуИзделияКомплект
		|		ПО (ВыполнитьКорректировкуИзделияКомплект.ИзделиеКомплект = ИзделияКомплект.Ссылка)
		|			И (ВыполнитьКорректировкуИзделияКомплект.ЗадачаПроверкиГабаритногоЧертежа = &ЗадачаПроверкиГабаритногоЧертежа)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.ПроверитьГабаритныеЧертежи КАК ПроверитьГабаритныеЧертежи
		|		ПО ИзделияКомплект.ГабаритныйЧертеж = ПроверитьГабаритныеЧертежи.ОбъектТЗ
		|ГДЕ
		|	ПроверитьГабаритныеЧертежи.Ссылка = &ЗадачаПроверкиГабаритногоЧертежа
		|	И ВыполнитьКорректировкуИзделияКомплект.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеКомплекта.Конструктор КАК Исполнитель,
		|	втКомплекты.ИзделиеКомплект КАК ИзделиеКомплект,
		|	втКомплекты.ИзделиеКомплект.Наименование КАК Наименование,
		|	втКомплекты.ИзделиеКомплект.Проект КАК Проект
		|ИЗ
		|	втКомплекты КАК втКомплекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплекта
		|		ПО втКомплекты.ИзделиеКомплект = ДанныеКомплекта.Комплект";
		
		Запрос.УстановитьПараметр("ЗадачаПроверкиГабаритногоЧертежа", Ссылка);
		                                                  	Выборка = Запрос.Выполнить().Выбрать(); 
		
		Пока Выборка.Следующий() Цикл
			
			ЗадачаПроверки = Задачи.ВыполнитьКорректировкуИзделияКомплект.СоздатьЗадачу();
			ЗадачаПроверки.Дата 									= ТД;
			ЗадачаПроверки.ЗадачаПроверкиГабаритногоЧертежа 		= Ссылка;
			ЗадачаПроверки.ИзделиеКомплект 							= Выборка.ИзделиеКомплект;
			ЗадачаПроверки.Исполнитель 								= Выборка.Исполнитель;
			ЗадачаПроверки.Наименование								= Выборка.Наименование + "Комплект.Проверить";	
			ЗадачаПроверки.Проект									= Выборка.Проект;	
			ЗадачаПроверки.КрайняяДатаИсполнения					= омДаты.ДобавитьДниСУчетомВыходных(ЗадачаПроверки.Дата, 7);	
			
			ЗадачаПроверки.Записать();
			
		КонецЦикла; 
		
	КонецЕсли;
	
	ИзменитьСтатусГЧ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж КАК ГабаритныйЧертеж
		|ИЗ
		|	Документ.АктПриемкиГабаритныхЧертежей.ГабаритныеЧертежи КАК АктПриемкиГабаритныхЧертежейГабаритныеЧертежи
		|ГДЕ
		|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж = &ОбъектТЗ
		|	И АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ИзменитьСтатусГЧ = Истина;
	КонецЦикла;
	
	Если ИзменитьСтатусГЧ Тогда

		ЗадачаИзменение = Задачи.ИзменениеСтатусаГЧ.СоздатьЗадачу();
		ЗадачаИзменение.Дата 									= ТД;
		ЗадачаИзменение.Основание 								= Ссылка;
		ЗадачаИзменение.ГабаритныйЧертеж 						= ОбъектТЗ;
		ЗадачаИзменение.Исполнитель 							= омЗадачи.ПолучитьИсполнителя(Перечисления.ОбъектыЗадач.РуководительЗамера);
		ЗадачаИзменение.Наименование							= Строка(ОбъектТЗ) + ".ИзменитьСтатус";	
		ЗадачаИзменение.Проект									= Проект;	
		ЗадачаИзменение.НовыйСтатус								= Перечисления.СтатусыЗамера.Рабочий;	
		ЗадачаИзменение.КрайняяДатаИсполнения					= омДаты.ДобавитьДниСУчетомВыходных(ЗадачаИзменение.Дата, 7);	
		
		ЗадачаИзменение.Записать();
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередВыполнением(Отказ)

	ДатаПроверки 		= ТекущаяДата();
	АвторКорректировки 	= ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры

Процедура ПередИнтерактивнымВыполнением(Отказ)
	ПередВыполнением(Отказ);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	РегистрыСведений.СтатусыЗадач.НазначитьСтатусЗадачи(Ссылка);
КонецПроцедуры
