&НаКлиенте
Процедура ОбщееДействие(ТекущаяФорма, НажатаяКнопка) Экспорт
	
	ШифрКоманды = СтрЗаменить(НажатаяКнопка.Имя,"Кнопка", "");
	
	Если ШифрКоманды = "ПоказатьДлительныеДействия" Тогда
		ТекущаяФорма.Элементы.ДлительныеДействия_авто.Видимость = НЕ ТекущаяФорма.Элементы.ДлительныеДействия_авто.Видимость;
		
		Если ТекущаяФорма.Элементы.КнопкаПоказатьДлительныеДействия.Заголовок = "Показать действия" Тогда
			ТекущаяФорма.Элементы.КнопкаПоказатьДлительныеДействия.Заголовок = "Скрыть действия";
			ТекущаяФорма.ДлительныеДействия_авто = омДлительныеОперцииНаСервере.Получить_HTML_длительное_действие(ТекущаяФорма.Объект.Ссылка);
		Иначе	
			ТекущаяФорма.Элементы.КнопкаПоказатьДлительныеДействия.Заголовок = "Показать действия";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗапускДлительногоДействия(ЗадачаСсылка, НаименованиеДействия) Экспорт

	СруктураПараметров = Новый Структура("ЗадачаСсылка, НаименованиеДействия, ИмяДействияДляФайла", ЗадачаСсылка, НаименованиеДействия, "");
	УИДДействия = омФайлыPDM.СоздатьДействие(НаименованиеДействия, СруктураПараметров);

	ПараметрыФункции 	= Новый Массив(3);
	ПараметрыФункции[0] = УИДДействия;	
	ПараметрыФункции[1] = ЗадачаСсылка;
	ПараметрыФункции[2] = НаименованиеДействия;
	омФайлыPDM.ЗапуститьФоновыеЗадания("омДлительныеОперцииНаСервере.ДлительноеДействие", ПараметрыФункции, НаименованиеДействия);
	
КонецПроцедуры // ЗапускДлительногоLействия()

&НаКлиенте
Функция ВывестиДлителноеДействиеНаФорму(ТекущаяФорма) Экспорт
	
	ТекущаяФорма.Элементы.ДлительныеДействия_авто.Видимость = Истина;
	ТекущаяФорма.Элементы.КнопкаПоказатьДлительныеДействия.Заголовок = "Скрыть действия";
	ТекущаяФорма.ДлительныеДействия_авто = омДлительныеОперцииНаСервере.Получить_HTML_длительное_действие(ТекущаяФорма.Объект.Ссылка);
	
КонецФункции // ВывестиДлителноеДействиеНаФорму()


