Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТридцатьДней = 30 * 24 * 3600;
	
	Интервал.ДатаНачала 	= НачалоДня(ТекущаяДата() - ТридцатьДней);
	Интервал.ДатаОкончания	= КонецДня(Интервал.ДатаНачала + 3 * ТридцатьДней);
	
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ОбновитьНаСервере();
	
КонецПроцедуры 

Процедура ОбновитьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыездНаЗамерГабаритныеЧертежи.Помещение КАК Помещение,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.ДатаВыездаПлан КАК ДатаВыездаПлан,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.ДатаВыездаФакт КАК ДатаВыездаФакт,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.Исполнитель КАК Исполнитель,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.СокращенноеНазвание КАК СокращенноеНазвание,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка КАК Документ,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.Проект КАК Проект,
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Документ.ВыездНаЗамер.ГабаритныеЧертежи КАК ВыездНаЗамерГабаритныеЧертежи
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВыездНаЗамерГабаритныеЧертежи.Ссылка.Проект = &Проект
		|		КОНЕЦ
		|	И ВыездНаЗамерГабаритныеЧертежи.Ссылка.ДатаВыездаПлан МЕЖДУ &ДатаН И &ДатаК
		|	И ВыездНаЗамерГабаритныеЧертежи.Ссылка.Проведен
		|	И ВЫБОР
		|			КОГДА ВыездНаЗамерГабаритныеЧертежи.Ссылка.ДатаВыездаФакт > ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ВыездНаЗамерГабаритныеЧертежи.ЗамерПроизведен
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаявкаНаЗамерПомещения.Помещение,
		|	ЗаявкаНаЗамерПомещения.Ссылка.ДатаВыездаПлан,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
		|	ЗаявкаНаЗамерПомещения.Ссылка.СокращенноеНазвание,
		|	ЗаявкаНаЗамерПомещения.Ссылка,
		|	ЗаявкаНаЗамерПомещения.Ссылка.Проект,
		|	ЗаявкаНаЗамерПомещения.Ссылка.Комментарий
		|ИЗ
		|	Документ.ЗаявкаНаЗамер.Помещения КАК ЗаявкаНаЗамерПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыездНаЗамер КАК ВыездНаЗамер
		|		ПО ЗаявкаНаЗамерПомещения.Ссылка = ВыездНаЗамер.Основание
		|			И (ВыездНаЗамер.Проведен)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЗаявкаНаЗамерПомещения.Ссылка.Проект = &Проект
		|		КОНЕЦ
		|	И ЗаявкаНаЗамерПомещения.Ссылка.ДатаВыездаПлан МЕЖДУ &ДатаН И &ДатаК
		|	И ЗаявкаНаЗамерПомещения.Ссылка.Проведен
		|	И ВыездНаЗамер.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОзнакомительныйВыездПомещения.Помещение,
		|	ОзнакомительныйВыездПомещения.Ссылка.ДатаВыездаПлан,
		|	ОзнакомительныйВыездПомещения.Ссылка.ДатаВыездаФакт,
		|	ОзнакомительныйВыездПомещения.Ссылка.Исполнитель,
		|	ОзнакомительныйВыездПомещения.Ссылка.СокращенноеНазвание,
		|	ОзнакомительныйВыездПомещения.Ссылка,
		|	ОзнакомительныйВыездПомещения.Ссылка.Проект,
		|	ОзнакомительныйВыездПомещения.Ссылка.Комментарий
		|ИЗ
		|	Документ.ОзнакомительныйВыезд.Помещения КАК ОзнакомительныйВыездПомещения
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ОзнакомительныйВыездПомещения.Ссылка.Проект = &Проект
		|		КОНЕЦ
		|	И ОзнакомительныйВыездПомещения.Ссылка.ДатаВыездаПлан МЕЖДУ &ДатаН И &ДатаК
		|	И ОзнакомительныйВыездПомещения.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.ДатаВыездаПлан КАК ДатаВыездаПлан,
		|	вт.ДатаВыездаФакт КАК ДатаВыездаФакт,
		|	вт.Исполнитель КАК Исполнитель,
		|	вт.СокращенноеНазвание КАК СокращенноеНазвание,
		|	вт.Документ КАК Документ,
		|	вт.Проект КАК Проект,
		|	вт.Помещение.Наименование КАК ПомещениеНаименование,
		|	вт.Документ.Автор КАК Постановщик,
		|	вт.Комментарий КАК Комментарий
		|ИЗ
		|	вт КАК вт
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВыездаПлан,
		|	СокращенноеНазвание,
		|	вт.Помещение.Наименование
		|ИТОГИ ПО
		|	Документ,
		|	Проект,
		|	СокращенноеНазвание,
		|	Исполнитель,
		|	ДатаВыездаФакт,
		|	ДатаВыездаПлан";
	
	Запрос.УстановитьПараметр("ДатаК", Интервал.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаН", Интервал.ДатаНачала);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокумент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Макет = Отчеты.ГрафикЗамеров.ПолучитьМакет("Макет");
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Проект = Проект;
	
	ПолеВывода.Очистить();
	
	ПолеВывода.Вывести(Область);
	Область 	= Макет.ПолучитьОбласть("Строка");
	ОбластьВ 	= Макет.ПолучитьОбласть("Строка1");
	ОбластьО 	= Макет.ПолучитьОбласть("Строка2"); 
	
	ПустаяДата 	= Дата(1, 1, 1);
	ТД			= ТекущаяДата();
	
	Пока ВыборкаДокумент.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДокумент
	
		ВыборкаПроект = ВыборкаДокумент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаПроект.Следующий() Цикл
			// Вставить обработку выборки ВыборкаПроект
	
			ВыборкаСокращенноеНазвание = ВыборкаПроект.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
			Пока ВыборкаСокращенноеНазвание.Следующий() Цикл
				// Вставить обработку выборки ВыборкаСокращенноеНазвание
	
				ВыборкаДата = ВыборкаСокращенноеНазвание.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
				Пока ВыборкаДата.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДата
	
					ВыборкаИсполнитель = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
					Пока ВыборкаИсполнитель.Следующий() Цикл
						// Вставить обработку выборки ВыборкаИсполнитель
	
						ВыборкаДатаВыездаФакт = ВыборкаИсполнитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
						Пока ВыборкаДатаВыездаФакт.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДатаВыездаФакт
							
							ВыборкаДатаВыездаПлан = ВыборкаДатаВыездаФакт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Пока ВыборкаДатаВыездаПлан.Следующий() Цикл
								// Вставить обработку выборки ВыборкаДатаВыездаПлан
								Если ВыборкаДатаВыездаПлан.ДатаВыездаФакт > ПустаяДата Тогда
									
									текОбласть = ОбластьВ;	
									
								ИначеЕсли ВыборкаДатаВыездаПлан.ДатаВыездаПлан < ТД Тогда
									
									текОбласть = ОбластьО;	
									
								Иначе
									
									текОбласть = Область;	
									
								КонецЕсли;
								
								текОбласть.Параметры.Заполнить(ВыборкаДатаВыездаПлан);
								ВыборкаДетальныеЗаписи = ВыборкаДатаВыездаПлан.Выбрать();
								СтрокаПомещения = "";
								Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
									текОбласть.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
									СтрокаПомещения = СтрокаПомещения + ВыборкаДетальныеЗаписи.ПомещениеНаименование + "; ";
								КонецЦикла;
								Если ВыборкаДатаВыездаПлан.ДатаВыездаФакт = Дата(1, 1, 1) Тогда
								
									текОбласть.Параметры.Дата = ВыборкаДатаВыездаПлан.ДатаВыездаПлан;	
								
								Иначе
								
									текОбласть.Параметры.Дата = ВыборкаДатаВыездаПлан.ДатаВыездаФакт;	
								
								КонецЕсли;
								текОбласть.Параметры.Помещения = СтрокаПомещения;
								
								ПолеВывода.Вывести(текОбласть);
								
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры



