
Процедура ОбработкаПроведения(Отказ, Режим)

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ИзделияУПодрядчикаОстатки.ИзделиеЗаказчика КАК ИзделиеЗаказчика,
	//	|	ИзделияУПодрядчикаОстатки.Подрядчик КАК Подрядчик
	//	|ИЗ
	//	|	РегистрНакопления.ИзделияУПодрядчика.Остатки(&МоментВремени, ИзделиеЗаказчика В (&ИзделияЗаказчика)) КАК ИзделияУПодрядчикаОстатки
	//	|ГДЕ
	//	|	ИзделияУПодрядчикаОстатки.КоличествоОстаток > 0";
	//
	//Запрос.УстановитьПараметр("ИзделияЗаказчика", ИзделияЗаказчика.ВыгрузитьКолонку("ИзделиеЗаказчика"));
	//Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(),ВидГраницы.Исключая));
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
	//	Отказ = Истина;
	//	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
	//		стрОшибка = "Изделие "; 
	//	Иначе
	//		стрОшибка = "Изделия: "; 
	//	КонецЕсли;
	//	
	//	флПервоеИзделие = Истина;
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		Если флПервоеИзделие Тогда
	//			флПервоеИзделие = НЕ флПервоеИзделие;
	//		Иначе
	//		    стрОшибка = стрОшибка + ", ";
	//		КонецЕсли;
	//		стрОшибка = стрОшибка + """" +ВыборкаДетальныеЗаписи.ИзделиеЗаказчика + """ у подрядчика " + ВыборкаДетальныеЗаписи.Подрядчик;
	//	КонецЦикла;
	//	Сообщить(стрОшибка,СтатусСообщения.Важное);
	//	Возврат;
	//КонецЕсли; 
	
	// регистр ИзделияУПодрядчика Приход
	Движения.ИзделияУПодрядчика.Записывать = Истина;
	Для Каждого ТекСтрокаИзделияЗаказчика Из ИзделияЭлемент Цикл
		Движение = Движения.ИзделияУПодрядчика.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Подрядчик = Подрядчик;
		Движение.ИзделиеЭлемент = ТекСтрокаИзделияЗаказчика.ИзделиеЭлемент;
		Движение.Количество = 1;
	КонецЦикла;

	// регистр РасходыНаПодряд 
	Движения.РасходыНаПодряд.Записывать = Истина;
	Для Каждого ТекСтрокаИзделияЗаказчика Из ИзделияЭлемент Цикл
		Движение = Движения.РасходыНаПодряд.Добавить();
		Движение.Период = Дата;
		Движение.Подрядчик = Подрядчик;
		Движение.Объект = ТекСтрокаИзделияЗаказчика.ИзделиеЭлемент.Проект;
		Движение.РасходыНаПодряд = ТекСтрокаИзделияЗаказчика.РасходыНаПодряд;
	КонецЦикла;

	
	
	// регистр ИзделияУПодрядчикаПлан 
	Движения.ИзделияУПодрядчикаПлан.Записывать = Истина;
	Для Каждого ТекСтрокаИзделияЗаказчика Из ИзделияЭлемент Цикл
		Движение = Движения.ИзделияУПодрядчикаПлан.Добавить();
		Движение.Подрядчик = Подрядчик;
		Движение.ИзделиеЭлемент = ТекСтрокаИзделияЗаказчика.ИзделиеЭлемент;
		Движение.ДатаПередачи = Дата;
		Движение.ДатаВозвратаПлан = ТекСтрокаИзделияЗаказчика.ОжидаемаяДатаВозврата;
		
	КонецЦикла;

КонецПроцедуры
