
Процедура ОбработкаПроведения(Отказ, Режим)

	НаборЗаписей = РегистрыСведений.ВнешнееПроизводство.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РегистраторДвижения.Установить(Ссылка);
	
	Для Каждого ТекСтрокаКомплекты Из Комплекты Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Период					= Дата;
		НоваяЗапись.Комплект 				= ТекСтрокаКомплекты.Комплект;
		НоваяЗапись.РегистраторДвижения 	= Ссылка;
		НоваяЗапись.Отмена 					= Истина;
		
	КонецЦикла; 
	
	НаборЗаписей.Записать();

КонецПроцедуры   

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НаборЗаписей = РегистрыСведений.ВнешнееПроизводство.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РегистраторДвижения.Установить(Ссылка);

	НаборЗаписей.Записать();

КонецПроцедуры


