Функция ДействияНаСервере(Действие, Задача, Параметр = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	стДанные 			= Неопределено;
	ОбъектЗадачаИзменен = Ложь;
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;

	Если Действие = "История" Тогда
		Возврат МенеджерРегистра.ПолучитьИсториюЗадачи(Задача);
	КонецЕсли;
	
	ОбъектЗадача 				= Задача.ПолучитьОбъект(); 
	Если НЕ ЗначениеЗаполнено(ОбъектЗадача.СтатусЗадачи) Тогда
		
		ОбъектЗадача.СтатусЗадачи = Перечисления.СтатусыЗадач.РазработкаРКД;	
		
	КонецЕсли;
	
	Если Действие = "НачатьВыполнение" Тогда 
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных();
		стДанные.Состояние 			= Перечисления.СостоянияЗадач.ВРаботеКонструктора;
		стДанные.Исполнитель		= омСотрудники.ПолучитьКонструктораРазработки(Задача);
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
	ИначеЕсли Действие = "СбросДизайнеромКорректировкаДизайнера" ИЛИ Действие = "СбросДизайнеромИзменениеЗаказчиком" Тогда
		
		СтатусыДействия = омЗадачиПКДСервер.ПолучитьСтатусЗадачиПоДействию(Действие);
		
		ОбъектЗадача.Исполнитель 		= омСотрудники.ПолучитьКонструктораРазработки(Задача);
		ОбъектЗадача.СтатусЗадачи		= СтатусыДействия.Статус;		
		ОбъектЗадача.ТипЗадачи			= СтатусыДействия.Тип;
		ОбъектЗадача.НеИзменяетСтадию	= Ложь;
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, ОбъектЗадача.Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
		Если омКанбанПроизводство.РесурсВПроизводстве(ОбъектЗадача.ОбъектТЗ) Тогда
			
			УИДКарточка = "";
			омКанбанПроизводство.ПеревестиКарточкуВПриостановку(ОбъектЗадача.ОбъектТЗ, , УИДКарточка);
			омКанбанДоскиНаСервере.ЗаписатьТег(Справочники.Теги.Пересогласование, УИДКарточка);
			
		КонецЕсли;
		
	ИначеЕсли Действие = "ПереносВ_ПКД_ДизайнеромКорректировкаДизайнера" ИЛИ Действие = "ПереносВ_ПКД_ДизайнеромИзменениеЗаказчиком" Тогда    

		
		КомпозицияКомплекта = омИзделиеКомплект.КомплектЧастьКомпозиции(ОбъектЗадача.ОбъектТЗ);
		
		Если ЗначениеЗаполнено(КомпозицияКомплекта) Тогда
		
			Задачи.ПересогласованиеКомпозиции.СоздатьЗадачуПересоглосования(КомпозицияКомплекта, Действие);		
		
		Иначе
			
			СтатусыДействия = омЗадачиПКДСервер.ПолучитьСтатусЗадачиПоДействию(Действие);
			
			ОбъектТЗ = омЗадачиРКДНаСервере.ЗакрытьЗадачуРКД(Задача, стДанные, "Закрыта на пересогласование");
			
			стПараметры = омЗадачиПКДСервер.ПолучитьСтркутуркДляСозданияПКД(ОбъектТЗ, ОбъектЗадача.Проект); 
			
			стПараметры.Вставить("Статус", 		СтатусыДействия.Статус);
			стПараметры.Вставить("Состояние", 	Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
			стПараметры.Вставить("ТипЗадачи", 	СтатусыДействия.Тип);
			
			СсылкаНаЗадачу 	= омЗадачиПКДСервер.СоздатьЗадачуПКД(ОбъектТЗ, ОбъектЗадача.Исполнитель, стПараметры);
			
		КонецЕсли;
		
	ИначеЕсли Действие = "СбросКонструктором" Тогда
		
		ОбъектЗадача.Исполнитель = омСотрудники.ПолучитьКонструктораРазработки(Задача);
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, ОбъектЗадача.Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
	ИначеЕсли Действие = "Приостановить" Тогда
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ПриостановкаКонструктором);
	ИначеЕсли Действие = "ЗавершениеРаботы" Тогда
		
		ВедущийКонструктор = омСотрудники.СотрудникиОбъекта(Параметр).ВедущийКонструктор;
		
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ) +  "." + ОбъектЗадача.СтатусЗадачи	+ ".Утверждение";
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ВедущийКонструктор;
		ОбъектЗадача.Исполнитель 	= ВедущийКонструктор;
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором);
		стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
		стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
		
	ИначеЕсли Действие = "ДоработкаВедущийКонструктор" Тогда
		//стДанные.Статус =Перечисления.СтатусыЗадач.ДоработкаРКД;
		омЗадачиРКДНаСервере.ПеревестиЗадачуВОжидание(Задача, , стДанные);
		ОбъектЗадачаИзменен = Истина;
	ИначеЕсли Действие = "ОжиданиеСогласования" Тогда
		омЗадачиРКДНаСервере.ПеревестиЗадачуВОжиданиеСогласования(Задача);
		ОбъектЗадачаИзменен = Истина;
	ИначеЕсли Действие = "Утверждение" Тогда
		омЗадачиРКДНаСервере.ЗавершениеЗадачиРКД(Задача, стДанные);	
		ОбъектЗадачаИзменен = Истина;
	ИначеЕсли Действие = "ОжиданиеГЧ" Тогда
		
		Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);
		
		ОбъектЗадача 				= Задача.ПолучитьОбъект();
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.ОжиданиеГЧ;
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ГЧОжидание;
		ОбъектЗадача.Исполнитель 	= Конструктор;
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ПустаяСсылка());
		стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
		стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
		стДанные.Статус 		= ОбъектЗадача.СтатусЗадачи;
		
	КонецЕсли;
	
	НаименованиеПараметра 	= "";
	МодульСчетчиков 		= Обработки.НастройкаДействий;
	ОбъектЗадачаИзменен 	= МодульСчетчиков.ИзменитьСчетчикСобытий(Задача, Действие, "РКД", НаименованиеПараметра, Ложь); 
	
	НовоеСостояние 	= Неопределено;
	НовыйТип 		= Неопределено;
	НовыЙСтатус 		= Неопределено;

	Если стДанные = Неопределено Тогда
		НовыйТип 	= ОбъектЗадача.ТипЗадачи;
		НовыЙСтатус 	= ОбъектЗадача.СтатусЗадачи;
	Иначе
		
		ЗначениеИзменениеСчетчика = 0;
		
		Если НаименованиеПараметра = "НомерДоработка" Тогда
			ЗначениеИзменениеСчетчика = ЗначениеИзменениеСчетчика + 1;
		ИначеЕсли НаименованиеПараметра = "НомерКорректировка" Тогда
			ЗначениеИзменениеСчетчика = ЗначениеИзменениеСчетчика + 2;
		ИначеЕсли НаименованиеПараметра = "НомерИзменение" Тогда
			ЗначениеИзменениеСчетчика = ЗначениеИзменениеСчетчика + 4;
		КонецЕсли;
		
		стДанные.УвеличениеСчетчика = ЗначениеИзменениеСчетчика; 
		
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные); 
		НовоеСостояние 	= стДанные.Состояние;
		НовыйТип 		= стДанные.ТипЗадачи;
		НовыЙСтатус 		= стДанные.Статус;
		
	КонецЕсли;
	
	Если НЕ ОбъектЗадачаИзменен Тогда
		
		ОбъектЗадача.Наименование = омЗадачиОбщие.ПолучитьНаименованиеЗадачи(Задача, НовыЙСтатус, НовыйТип, НовоеСостояние);
		ОбъектЗадача.Записать();
		
	КонецЕсли;
	
	Если НЕ ОбъектЗадача.НеИзменяетСтадию Тогда
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
	КонецЕсли;
	
	Возврат РегистрыСведений.ТаймингЗадач.ПолучитьСостояниеЗадачи(Задача);
	
КонецФункции // ДействияНаСервере()  




