Функция ДействияНаСервере(Действие, Задача, Параметр = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;

	Если Действие = "История" Тогда
		Возврат МенеджерРегистра.ПолучитьИсториюЗадачи(Задача);
	КонецЕсли;
	
	стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(,,Перечисления.СтатусыЗадач.РКД);
	ОбъектЗадача 				= Задача.ПолучитьОбъект();
	
	Если Действие = "НачатьВыполнение" Тогда 
		
		стДанные.Состояние 			= Перечисления.СостоянияЗадач.ВРаботеКонструктора;
		стДанные.Исполнитель		= омСотрудники.ПолучитьКонструктораРазработки(Задача);
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + "." + ОбъектЗадача.СтатусЗадачи	+ "." + ОбъектЗадача.ТипЗадачи;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
	ИначеЕсли Действие = "СбросДизайнеромКорректировкаДизайнера" ИЛИ Действие = "СбросДизайнеромИзменениеЗаказчиком" Тогда
		
		СтатусыДействия = омЗадачиПКДСервер.ПолучитьСтатусЗадачиПоДействию(Действие);
		
		ОбъектЗадача.Исполнитель 		= омСотрудники.ПолучитьКонструктораРазработки(Задача);
		ОбъектЗадача.СтатусЗадачи		= СтатусыДействия.Статус;		
		ОбъектЗадача.ТипЗадачи			= СтатусыДействия.Тип;
		ОбъектЗадача.НеИзменяетСтадию	= Ложь;
		ОбъектЗадача.Записать();
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, ОбъектЗадача.Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
		Если омКанбанПроизводство.РесурсВПроизводстве(ОбъектЗадача.ОбъектТЗ) Тогда
			
			УИДКарточка = "";
			омКанбанПроизводство.ПеревестиКарточкуВПриостановку(ОбъектЗадача.ОбъектТЗ, , УИДКарточка);
			омКанбанДоскиНаСервере.ЗаписатьТег(Справочники.Теги.Пересогласование, УИДКарточка);
			
		КонецЕсли;
		
		
	ИначеЕсли Действие = "ПереносВ_ПКД_ДизайнеромКорректировкаДизайнера" ИЛИ Действие = "ПереносВ_ПКД_ДизайнеромИзменениеЗаказчиком" Тогда    

		
		КомпозицияКомплекта = омИзделиеКомплект.КомплектЧастьКомпозиции(ОбъектЗадача.ОбъектТЗ);
		
		Если ЗначениеЗаполнено(КомпозицияКомплекта) Тогда
		
			Задачи.ПересогласованиеКомпозиции.СоздатьЗадачуПересоглосования(КомпозицияКомплекта, Действие);		
		
		Иначе
			
			СтатусыДействия = омЗадачиПКДСервер.ПолучитьСтатусЗадачиПоДействию(Действие);
			
			ОбъектТЗ = омЗадачиРКДНаСервере.ЗакрытьЗадачуРКД(Задача, стДанные, "Закрыта на пересогласование");
			
			стПараметры = омЗадачиПКДСервер.ПолучитьСтркутуркДляСозданияПКД(ОбъектТЗ, ОбъектЗадача.Проект); 
			
			стПараметры.Вставить("Статус", 		СтатусыДействия.Статус);
			стПараметры.Вставить("Состояние", 	Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
			стПараметры.Вставить("ТипЗадачи", 	СтатусыДействия.Тип);
			
			СсылкаНаЗадачу 	= омЗадачиПКДСервер.СоздатьЗадачуПКД(ОбъектТЗ, ОбъектЗадача.Исполнитель, стПараметры);
			
		КонецЕсли;
		
	ИначеЕсли Действие = "СбросКонструктором" Тогда
		
		ОбъектЗадача.Прочитать();
		
		ОбъектЗадача.Исполнитель 	= омСотрудники.ПолучитьКонструктораРазработки(Задача);
		
		ОбъектЗадача.Записать();
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, ОбъектЗадача.Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
	ИначеЕсли Действие = "Приостановить" Тогда
		стДанные.Состояние 	= Перечисления.СостоянияЗадач.ПриостановкаКонструктором;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
	ИначеЕсли Действие = "ЗавершениеРаботы" Тогда
		
		ВедущийКонструктор = омСотрудники.СотрудникиОбъекта(Параметр).ВедущийКонструктор;
		
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ) +  "." + ОбъектЗадача.СтатусЗадачи	+ ".Утверждение";
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ВедущийКонструктор;
		ОбъектЗадача.Исполнитель 	= ВедущийКонструктор;
		ОбъектЗадача.Записать();
		
		стДанные.Состояние 		= Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором;
		стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
		стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
		
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
	ИначеЕсли Действие = "ДоработкаВедущийКонструктор" Тогда
		
		омЗадачиРКДНаСервере.ПеревестиЗадачуВОжидание(Задача, , стДанные);
		
	ИначеЕсли Действие = "ОжиданиеСогласования" Тогда
		омЗадачиРКДНаСервере.ПеревестиЗадачуВОжиданиеСогласования(Задача);
		
	ИначеЕсли Действие = "Утверждение" Тогда
		омЗадачиРКДНаСервере.ЗавершениеЗадачиРКД(Задача, стДанные);	
	ИначеЕсли Действие = "ОжиданиеГЧ" Тогда
		
		Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);

		ОбъектЗадача 				= Задача.ПолучитьОбъект();
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + ".РКД.ОжиданиеГЧ";
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.ОжиданиеГЧ;
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ГЧОжидание;
		ОбъектЗадача.Исполнитель 	= Конструктор;
		
		ОбъектЗадача.Записать(); 
		
		стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
		стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
		стДанные.Состояние 		= Перечисления.СостоянияЗадач.ПустаяСсылка();
		стДанные.Статус 		= ОбъектЗадача.СтатусЗадачи;
		
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);

	КонецЕсли;
	
	Если НЕ ОбъектЗадача.НеИзменяетСтадию Тогда
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
	КонецЕсли;
	
	
	Возврат РегистрыСведений.ТаймингЗадач.ПолучитьСостояниеЗадачи(Задача);
	
КонецФункции // ДействияНаСервере()  




