Функция ДействияНаСервере(Действие, Задача, Параметр = Неопределено, НеИзменяетСтадию) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;

	Если Действие = "История" Тогда
		Возврат МенеджерРегистра.ПолучитьИсториюЗадачи(Задача);
	КонецЕсли;
	
	стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(,,Перечисления.СтатусыЗадач.РКД);
	ОбъектЗадача 				= Задача.ПолучитьОбъект();
	
	Если Действие = "НачатьВыполнение" Тогда 
		
		стДанные.Состояние 		= Перечисления.СостоянияЗадач.ВРаботеКонструктора;
		стДанные.Исполнитель	= омСотрудники.ПолучитьКонструктораРазработки(Задача);
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + "." + ОбъектЗадача.СтатусЗадачи	+ "." + ОбъектЗадача.ТипЗадачи;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
	ИначеЕсли Действие = "СбросКонструктором" Тогда

		ОбъектЗадача.Исполнитель 	= омСотрудники.ПолучитьКонструктораРазработки(Задача);
		
		ОбъектЗадача.Записать();
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, ОбъектЗадача.Исполнитель, , ОбъектЗадача.ТипЗадачи);
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);			
		
	ИначеЕсли Действие = "ИзменениеКонструктора" Тогда

		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Разработка;
		
		ОбъектЗадача.Записать();
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, ОбъектЗадача.Исполнитель, , ОбъектЗадача.ТипЗадачи);
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);			
		
	ИначеЕсли Действие = "Приостановить" Тогда
		стДанные.Состояние 	= Перечисления.СостоянияЗадач.ПриостановкаКонструктором;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
	ИначеЕсли Действие = "ЗавершениеРаботы" Тогда
		
		ВедущийКонструктор = омСотрудники.СотрудникиОбъекта(Параметр).ВедущийКонструктор;
		
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ) +  "." + ОбъектЗадача.СтатусЗадачи	+ ".Утверждение";
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором;
		ОбъектЗадача.Исполнитель 	= ВедущийКонструктор;
		ОбъектЗадача.Записать();
		
		стДанные.Состояние 		= Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором;
		стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
		стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
		
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
	ИначеЕсли Действие = "ДоработкаВедущийКонструктор" Тогда
		
		омЗадачиРКДНаСервере.ПеревестиЗадачуВОжидание(Задача, , стДанные);
		
	ИначеЕсли Действие = "ОжиданиеСогласования" Тогда
		омЗадачиРКДНаСервере.ПеревестиЗадачуВОжиданиеСогласования(Задача);
		
	ИначеЕсли Действие = "Завершение" Тогда
		омЗадачиРКДНаСервере.ЗавершениеЗадачиРКД(Задача, стДанные, НеИзменяетСтадию);	
	ИначеЕсли Действие = "ОжиданиеГЧ" Тогда
		
		Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);

		ОбъектЗадача 				= Задача.ПолучитьОбъект();
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + ".РКД.ОжиданиеГЧ";
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.ОжиданиеГЧ;
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ГЧОжидание;
		ОбъектЗадача.Исполнитель 	= Конструктор;
		
		ОбъектЗадача.Записать(); 
		
		стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
		стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
		стДанные.Состояние 		= Перечисления.СостоянияЗадач.ПустаяСсылка();
		стДанные.Статус 		= ОбъектЗадача.СтатусЗадачи;
		
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);

	КонецЕсли;
	
	Если НЕ НеИзменяетСтадию Тогда
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
	КонецЕсли;
	
	
	Возврат РегистрыСведений.ТаймингЗадач.ПолучитьСостояниеЗадачи(Задача);
	
КонецФункции // ДействияНаСервере()  




