
Процедура ПередЗаписью(Отказ)
	Наименование= ПолучитьЗаголовок();
КонецПроцедуры

Функция ПолучитьЗаголовок() Экспорт 
	
	Возврат Строка(ОбъектТЗ) + ".РКД";	
	
КонецФункции // ПолучитьЗаголовок()

Процедура ПриЗаписи(Отказ)
	
	Если Выполнена Тогда
		
		омПриоритет.СнятьПриоритет(ОбъектТЗ);
		
	Иначе
		
		ПроверитьГантКонструктора();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьГантКонструктора()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.ГантКонструктораНачалоРКД КАК ГантКонструктораНачалоРКД,
		|	ДатыКомплекта.ДнейРКД КАК ДнейРКД
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПустаяДата 	= Дата(1, 1, 1);
	ДнейРКД		= 1;
	ГантКонструктораНачалоПКД = ПустаяДата;
	
	Пока Выборка.Следующий() Цикл
		ДнейРКД 					= Выборка.ДнейРКД;
		ГантКонструктораНачалоРКД 	= Выборка.ГантКонструктораНачалоРКД;
	КонецЦикла;
	
	Если ГантКонструктораНачалоРКД = ПустаяДата Тогда
	
		МенеджерЗаписи = РегистрыСведений.ДатыКомплекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Комплект = ОбъектТЗ;
		МенеджерЗаписи.Проект 	= Проект; 
		МенеджерЗаписи.Прочитать();
	
		МенеджерЗаписи.Комплект 					= ОбъектТЗ;
		МенеджерЗаписи.Проект 						= Проект; 
        МенеджерЗаписи.ГантКонструктораНачалоРКД 	= Дата;
		МенеджерЗаписи.ГантКонструктораОкончаниеРКД = омДаты.ДобавитьДниСУчетомВыходных(Дата, ДнейРКД);
		
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

