Функция КомплектВСрокахСделки(ИзделиеКомплект) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СрокиСделкиКомплекты.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗапускВРаботу.Комплекты КАК СрокиСделкиКомплекты
		|ГДЕ
		|	СрокиСделкиКомплекты.Комплект = &ИзделиеКомплект
		|	И СрокиСделкиКомплекты.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	СрокиСделкиКомплекты.Ссылка.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрокиСделкиМонтажКомплекты.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СрокиПроектаМонтаж.Комплекты КАК СрокиСделкиМонтажКомплекты
		|ГДЕ
		|	СрокиСделкиМонтажКомплекты.Комплект = &ИзделиеКомплект
		|	И СрокиСделкиМонтажКомплекты.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	СрокиСделкиМонтажКомплекты.Ссылка.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрокиСделкиПроизводствоКомплекты.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СрокиПроектаПроизводство.Комплекты КАК СрокиСделкиПроизводствоКомплекты
		|ГДЕ
		|	СрокиСделкиПроизводствоКомплекты.Комплект = &ИзделиеКомплект
		|	И СрокиСделкиПроизводствоКомплекты.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	СрокиСделкиПроизводствоКомплекты.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ИзделиеКомплект", ИзделиеКомплект);
	
	мВыборка = Запрос.ВыполнитьПакет();

	Выборка = мВыборка[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Документы.ЗапускВРаботу.ПустаяСсылка();
	
КонецФункции // КомплектВСрокахСделки()
