
Процедура ПриЗаписи(Отказ)
	Если ЗначениеЗаполнено(Основание) Тогда
	
		Если ТипЗнч(Основание) = Тип("ЗадачаСсылка.ПодготовкаПроекта") Тогда
		
			Если НЕ Основание.Выполнена Тогда
			
				ПодготовкаПроекта = Основание.ПолучитьОбъект();
				ПодготовкаПроекта.Выполнена = Истина;
				ПодготовкаПроекта.Записать();
			
			КонецЕсли;	
		
		КонецЕсли;	
	
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		Префикс = Проект.Префикс + "-";
		УстановитьНовыйНомер(Префикс); 
	КонецЕсли;
КонецПроцедуры
