
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОбещаниеПодрядчика
	Движения.ОбещаниеПодрядчика.Записывать = Истина;
	Для Каждого ТекСтрокаИзделияКомплекты Из ИзделияКомплекты Цикл
		Движение = Движения.ОбещаниеПодрядчика.Добавить();
		Движение.Период = Дата;
		Движение.Подрядчик = Подрядчик;
		Движение.ИзделиеКомплект = ТекСтрокаИзделияКомплекты.ИзделиеКомплект;
		Движение.ДатаОбещания = ТекСтрокаИзделияКомплекты.ДатаВозвратаКомплекта;
		Движение.ВозвратНаСклад = ТекСтрокаИзделияКомплекты.ВозвратНаСклад;
	КонецЦикла;

КонецПроцедуры
