&Наклиенте
Функция ПодключитьБиблиотекуPDM(ТекстСообщения = "Проба. Это такое пробное сообщение") Экспорт
	
	Попытка
		
		МойОбъект = Новый COMОбъект("PDM_1C_COM.clPDM_1C_COM");
		МойОбъект.message(ТекстСообщения);
		
	Исключение
		Сообщить("Ошибка подключения компоненты. " + ОписаниеОшибки());	
	КонецПопытки;
	//КомпонентаДвоичныеДанные = ОбщийМакет.Получить();
	//
	//СсылкаВремХранилище = ПоместитьВоВременноеХранилище(КомпонентаДвоичныеДанные, Новый УникальныйИдентификатор);
	
	//МойОбъект = Новый COMОбъект("MyComFor1C.MyClass");
	//МойОбъект = Новый COMОбъект("1C_PDM_COM.cl1C_PDM_COM");
	
	//Сообщить(МойОбъект.Create_catalog(1 ,""));
	//Ответ = ПодключитьВнешнююКомпоненту("EPDM.Interop.epdm");
	//Ответ = Новый COMобъект("EPDM.Interop.epdm");
КонецФункции // ПодключитьБиблиотекуPDM()
