
Функция ПереместитьНаСервере(Этап, Вверх)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЭтапыПредприятия1.Ссылка, ЗНАЧЕНИЕ(Справочник.ЭтапыПредприятия.ПустаяСсылка)) КАК Этап,
		|	ЭтапыПредприятия1.НомерПоПорядку КАК НомерПоПорядку,
		|	ЭтапыПредприятия.НомерПоПорядку КАК НомерПоПорядкуТекущий
		|ИЗ
		|	Справочник.ЭтапыПредприятия КАК ЭтапыПредприятия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПредприятия КАК ЭтапыПредприятия1
		|		ПО ЭтапыПредприятия.Родитель = ЭтапыПредприятия1.Родитель
		|			И (ВЫБОР
		|				КОГДА &Вверх
		|					ТОГДА ЭтапыПредприятия1.НомерПоПорядку = ЭтапыПредприятия.НомерПоПорядку - 1
		|				ИНАЧЕ ЭтапыПредприятия1.НомерПоПорядку = ЭтапыПредприятия.НомерПоПорядку + 1
		|			КОНЕЦ)
		|ГДЕ
		|	ЭтапыПредприятия.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Этап);
	Запрос.УстановитьПараметр("Вверх", Вверх);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗначениеВозврата = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		
		Если ЗначениеЗаполнено(Выборка.Этап) Тогда
			
			НачатьТранзакцию();
			
			Спр = Этап.ПолучитьОбъект();
			Спр.НомерПоПорядку = Выборка.НомерПоПорядку;
			
			Спр.Записать();
			
			Спр = Выборка.Этап.ПолучитьОбъект();
			Спр.НомерПоПорядку = Выборка.НомерПоПорядкуТекущий;
			
			Спр.Записать();
			
			ЗафиксироватьТранзакцию();
			
			ЗначениеВозврата = Истина;
			
		КонецЕсли;
	КонецЦикла;
	
	
	Если ЗначениеВозврата Тогда
	
		ЗаполнитьЭлементыРодителя();
	
	КонецЕсли;
КонецФункции

Процедура НаУровеньВверхНаСервере()

	Если ЗначениеЗаполнено(ТекущийРодитель) Тогда
	
		ТекущийРодитель = ТекущийРодитель.Родитель;
		ЗаполнитьЭлементыРодителя();
	
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьЭлементыРодителя()

	Этапы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыПредприятия.Ссылка КАК Этап
		|ИЗ
		|	Справочник.ЭтапыПредприятия КАК ЭтапыПредприятия
		|ГДЕ
		|	ЭтапыПредприятия.Родитель = &Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтапыПредприятия.НомерПоПорядку";
	
	Запрос.УстановитьПараметр("Родитель", ТекущийРодитель);
	
	Этапы.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭтап(Команда)
	
	Форма = ПолучитьФорму("Справочник.ЭтапыПредприятия.ФормаОбъекта");
	ДанныеФормы = Форма.Объект; // Получаем объект формы в переменную
	
	ДанныеФормы.Родитель = ТекущийРодитель;
	
	//ЗаполнитьДокументНаСервере(ДанныеФормы); // Заполняем документ на сервере
	//КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); // копируем наш объект в объект формы и далее открываем ее
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	ТД = Элементы.Этапы.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
	
		Возврат;	
	
	КонецЕсли; 
	
	ПереместитьНаСервере(ТД.Этап, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	ТД = Элементы.Этапы.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
	
		Возврат;	
	
	КонецЕсли; 
	
	ПереместитьНаСервере(ТД.Этап, Ложь);
	
КонецПроцедуры 

&НаКлиенте
Процедура ТекущийРодительПриИзменении(Элемент)
	ЗаполнитьЭлементыРодителя();
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЭлементыРодителя();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменилсяЭтапПредприятия" Тогда 
		
		Если ТекущийРодитель = Параметр.Родитель Тогда
			
			ЗаполнитьЭлементыРодителя();
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ТекущийРодитель = Элементы.Этапы.ТекущиеДанные.Этап;
	ЗаполнитьЭлементыРодителя();
	
КонецПроцедуры

&НаКлиенте
Процедура НаУровеньВверх(Команда)
	НаУровеньВверхНаСервере();
КонецПроцедуры
