
&НаКлиенте
Процедура КомпозицияПриИзменении(Элемент)
	ЗаполнитьКомплекты();
КонецПроцедуры 

Процедура ЗаполнитьКомплекты()

	Комплекты.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.Композиция) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.Комплект КАК Комплект,
		|	ДатыКомплекта.РКД_отдельно_от_композиции КАК РКД_создано,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия.ОсновнойЭтап КАК ОсновнаяСтадия
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО ДатыКомплекта.Комплект = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	ДатыКомплекта.Комплект.Родитель.Композиция = &Композиция";
	
	Запрос.УстановитьПараметр("Композиция", Объект.Композиция);
	
	Комплекты.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для каждого х Из Комплекты Цикл
	
		х.РКД_отдельно_от_композиции = х.РКД_создано;	
	
	КонецЦикла;
	
КонецПроцедуры 


&НаКлиенте
Процедура КомплектыПередНачаломИзменения(Элемент, Отказ)
	
	ТД = Элементы.Комплекты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
	    Возврат;
	КонецЕсли;
	
	Если ТД.РКД_создано Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ТД.ОсновнаяСтадия = ПредопределенноеЗначение("Перечисление.ОсновныеЭтапы.ПКД") Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
	Если ЗначениеЗаполнено(Объект.Композиция) Тогда
	
		ЗаполнитьКомплекты();			
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		ТолькоПросмотр 						= Истина;
		Элементы.Комплекты.ТолькоПросмотр 	= Истина;
		Элементы.Композиция.ТолькоПросмотр 	= Истина;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	МассивИзменений = Новый Массив;
	                               
	Для каждого СтрокаКомплекта Из Комплекты Цикл
	
		Если СтрокаКомплекта.РКД_отдельно_от_композиции И НЕ СтрокаКомплекта.РКД_создано Тогда
		
			МассивИзменений.Добавить(СтрокаКомплекта.Комплект);	
		
		КонецЕсли;	
	
	КонецЦикла; 
	
	Если МассивИзменений.Количество() > 0 Тогда
	
		ЗаписатьНаСервере(МассивИзменений);	
	
	КонецЕсли;
	
КонецПроцедуры

 &НаСервереБезКонтекста
Процедура ЗаписатьНаСервере(МассивИзменений)
	
	ПроектСсылка = МассивИзменений[0].Проект; 

	Для каждого ИзделиеКомплект Из МассивИзменений Цикл
	
		МенеджерЗаписи = РегистрыСведений.ДатыКомплекта.СоздатьМенеджерЗаписи(); 
		
		МенеджерЗаписи.Проект 		= ПроектСсылка;
		МенеджерЗаписи.Комплект 	= ИзделиеКомплект;
		
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.Проект 						= ПроектСсылка;
		МенеджерЗаписи.Комплект 					= ИзделиеКомплект;
		МенеджерЗаписи.РКД_отдельно_от_композиции 	= Истина;
		
		МенеджерЗаписи.Записать();
	
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК ЗадачаПКД
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.ОбъектТЗ В(&ОбъектТЗ)";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", МассивИзменений);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Задачи.Задачи_ПКД.ДействиеСогласовано(Выборка.ЗадачаПКД);
	КонецЦикла;
	

КонецПроцедуры // ЗаписатьНаСервере(МассивИзменений)()

