
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьЭлементовОтВидаПереноса();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементовОтВидаПереноса()

	Элементы.ГруппаФайл.Видимость = ВидПереноса = 0;
	Элементы.ГруппаКомментарий.Видимость = НЕ Элементы.ГруппаФайл.Видимость;
	
КонецПроцедуры // ВидимостьЭлементовОтВидаПереноса()

&НаКлиенте
Процедура ВыбратьФайл(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Открытие; 
	ДиалогОткрытия 						= Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытия.Фильтр				= "Файл PDF (*.pdf;)|*.pdf;";
	ДиалогОткрытия.Каталог 				= "";
	ДиалогОткрытия.МножественныйВыбор 	= Ложь;
	ДиалогОткрытия.Заголовок 			= "Выберите файл";
	Оповещение = Новый ОписаниеОповещения("ВыборФайла_Завершение", ЭтаФорма);
	ДиалогОткрытия.Показать(Оповещение);

КонецПроцедуры 

&НаКлиенте
Процедура ВыборФайла_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.ПросмотрPDF.Видимость 		= Ложь;
	
	Элементы.ПеренестиФайлВPDM.Доступность 				= Ложь;
	Элементы.ПоказатьФайлPDFВОтдельномОкне.Доступность 	= Ложь;
	
	Если НЕ ТипЗнч(Результат) = Тип("Массив") Тогда
		Сообщить("Файл не выбран");
		Возврат;
	КонецЕсли;
	
	Если Результат.Количество() = 0 Тогда
		Сообщить("Файл не выбран");
		Возврат;
	КонецЕсли;
	
	Элементы.ПросмотрPDF.Видимость 		= Истина;

	Элементы.ПеренестиФайлВPDM.Доступность 				= Истина;
	Элементы.ПоказатьФайлPDFВОтдельномОкне.Доступность 	= Истина;
	
	ПутьКФайлу = Результат[0]; 
	
	омPDF_Клиент.ПоказатьФайл(ПутьКФайлу, ПросмотрPDF);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиФайлВPDM(Команда)
	
	
	СруктураПараметров = Новый Структура("ЗадачаСсылка, НаименованиеДействия, ИмяДействияДляФайла", ОбъектДействий, НаименованиеДействия, ИмяДействияДляФайла);
	УИДДействия = омФайлыPDM.СоздатьДействие(ДействиеПриОкончании, СруктураПараметров);
	
	УникальныйИдентификаторФайла = Новый УникальныйИдентификатор();
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификаторФайла);
	
	омФайлыPDMНаКлиенте.ПослеПеремещенияФайла(УИДДействия, 0, АдресВХранилище, "");
	
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ВидПереносаПриИзменении(Элемент)
	ВидимостьЭлементовОтВидаПереноса();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиКомментарий(Команда)
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла("pdf");
	
	СтруктуруПараметров = омPDF_Клиент.ПолучитьСтруктуруПараметровФайлаКомментария();
	СтруктуруПараметров.ТекстЗаголовка 		= "Комментарий";
	СтруктуруПараметров.ТекстКомментария 	= Комментарий;
	СтруктуруПараметров.ПутьКФайлу 			= ПутьКФайлу;
	
	СтруктураВорзврата = омPDF_Клиент.СоздатьФайлКомментарияPDF(СтруктуруПараметров);
	
	Если ПустаяСтрока(СтруктураВорзврата.Ошибка) Тогда
	
		ПеренестиФайлВPDM(Команда);	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФайлPDFВОтдельномОкне(Команда)
	
	ПараметрыОткрытия = Новый Структура("ПутьКФайлу", ПутьКФайлу);
	ОткрытьФорму("ОбщаяФорма.ФормаПросмотрPDF", ПараметрыОткрытия, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КоментарийИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элементы.ПеренестиКомментарий.Доступность = НЕ ПустаяСтрока(Текст);
КонецПроцедуры
                                                     

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("НаименованиеДействия", 	НаименованиеДействия);
	Параметры.Свойство("ИмяДействияДляФайла", 	ИмяДействияДляФайла);
	Параметры.Свойство("ДействиеПриОкончании", 	ДействиеПриОкончании);
	Параметры.Свойство("ОбъектДействий", 		ОбъектДействий);
КонецПроцедуры

                       