
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("НеЗакрывать", 	НеЗакрывать); 
	Параметры.Свойство("Задача", 		Задача); 
	
	Если ЗначениеЗаполнено(Задача) Тогда
		Комплект = Задача.ОбъектТЗ;
	Иначе
		Параметры.Свойство("Комплект", Комплект);
	КонецЕсли;
	
	Элементы.Задача.Видимость = ЗначениеЗаполнено(Задача);
	
	Отказ = Не ЗначениеЗаполнено(Комплект);
	
	Если НЕ Отказ Тогда
		
		АдресРезультата = ПоместитьВоВременноеХранилище("", УникальныйИдентификатор);
		
		ПараметрыФункции 	= Новый Массив(2);
		ПараметрыФункции[0] = Комплект;	
		ПараметрыФункции[1] = АдресРезультата;	
		Задание = ФоновыеЗадания.Выполнить("омФайлыPDM.ИнформацияОЗаблокированныхPDM", ПараметрыФункции, , "ИнформацияОЗаблокированныхPDM");
		ЗаданиеУникальныйИдентификатор = Задание.УникальныйИдентификатор;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПроверкаВыполненияФоновогоЗадания", 0.6, Истина);
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗавершитьЗадачу()
	
	ЗавершитьЗадачуНаСервере(Задача);
	стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Задача, "ЗабратьПрава");
	
	Если ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
		Закрыть();
	Иначе	
		ПоказатьПредупреждение(,стВозврата.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗавершитьЗадачуНаСервере(ЗадачаПКД) 
	мКомплектыДляАналогичногоДействия = Новый Массив;
	Задачи.Задачи_ПКД.ДействияНаСервере("ЗавершениеРаботы", мКомплектыДляАналогичногоДействия, ЗадачаПКД, ЗадачаПКД.ТипЗадачи, ЗадачаПКД.Исполнитель, ЗадачаПКД.ОбъектТЗ);	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаВыполненияФоновогоЗадания()

	ДанныеВыполнения = ПроверитьВыполнениеФоновогоЗаданияНаСервере(ЗаданиеУникальныйИдентификатор);
	
	Если ДанныеВыполнения.Активно Тогда
		ПодключитьОбработчикОжидания("ПроверкаВыполненияФоновогоЗадания", 0.3, Истина)
	Иначе
		
		
		СтрокаХМЛ = ПолучитьИзВременногоХранилища(АдресРезультата);
		
		Если ПустаяСтрока(СтрокаХМЛ) Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияОповещения", ЭтаФорма);
			ПоказатьПредупреждение(ОписаниеОповещения, "Не удалось получить данные");
			
		Иначе	
			
			ДобавитьСтрокиВТаблицу(СтрокаХМЛ);
			
			Если ТаблицаРазрегестрированных.Количество() = 0 И НЕ НеЗакрывать Тогда
				ЗавершитьЗадачу();
				Закрыть();	
			КонецЕсли;
			
			Элементы.ГруппаОжидание.Видимость 				= Ложь;
			Элементы.ГруппаРазрегестрированные.Видимость 	= Истина;
			
		КонецЕсли;
		
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПроверитьВыполнениеФоновогоЗаданияНаСервере(ЗаданиеУникальныйИдентификатор)
	
	ДанныеВыполнения = Новый Структура("Активно, Сообщение", Ложь ,"");
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ЗаданиеУникальныйИдентификатор);
	
	Если Задание = Неопределено Тогда
	
		Возврат ДанныеВыполнения;	
	
	КонецЕсли; 
	
	ДанныеВыполнения.Активно = Задание.Состояние = СостояниеФоновогоЗадания.Активно;
	
	Если НЕ ДанныеВыполнения.Активно Тогда
		
		Для Каждого Сообщение Из Задание.ПолучитьСообщенияПользователю(Истина) Цикл
			ДанныеВыполнения.Сообщение = Сообщение;
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат ДанныеВыполнения;
	
КонецФункции // ПроверитьВыполнениеФоновогоЗаданияНаСервере()


&НаКлиенте
Функция ДобавитьСтрокиВТаблицу(СтрокаХМЛ)

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаХМЛ);
	ИмяПоля = "";
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.Имя = "files_folders" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЧтениеXML.Имя = "file_folders" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			НоваяСтрока = ТаблицаРазрегестрированных.Добавить();
			
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ИмяПоля = ЧтениеXML.Имя;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст И Не ПустаяСтрока(ИмяПоля) Тогда
			Если ИмяПоля = "name" Тогда
				НоваяСтрока.ИмяФайла 			= ЧтениеXML.Значение;
			ИначеЕсли ИмяПоля = "local_path" Тогда
				НоваяСтрока.ПутьКФайлу 			= ЧтениеXML.Значение;
			ИначеЕсли ИмяПоля = "LockedByUserName" Тогда
				НоваяСтрока.КтоЗаблокировал 	= ЧтениеXML.Значение;
			ИначеЕсли ИмяПоля = "LockedOnComputer" Тогда
				НоваяСтрока.Компьютер 			= ЧтениеXML.Значение;
			КонецЕсли;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецФункции // ДобавитьСтрокиВДерево() 

&НаКлиенте
Процедура ТаблицаРазрегестрированныхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРазрегестрированныхПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРазрегестрированныхПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияОповещения(ДополнительныеПараметры) Экспорт

	Закрыть();	

КонецПроцедуры // ПослеЗакрытияОповещения()


