
&НаКлиенте
Процедура ЗадачиОжиданияГЧПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиОжиданияГЧПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВПроизводство(Команда)
	
	Параметр = Новый Структура("ЗадачаРКДДляЗапуска", ВыбраннаяЗадача);
	ОповещениеПослеЗакрытияДокумента = Новый ОписаниеОповещения("ПослеЗакрытияДокумента", ЭтаФорма);
	ОткрытьФорму("Документ.ДосрочныйЗапускВПроизводство.ФормаОбъекта", Параметр, ЭтаФорма, , , , ОповещениеПослеЗакрытияДокумента, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияДокумента(Результат, ДополнительныеПарамтеры) Экспорт
	ЗаполнитьОжидание();
КонецПроцедуры // ПослеЗакрытияДокумента()


Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьОжидание();
КонецПроцедуры

Процедура ЗаполнитьОжидание()
	ЗадачиОжиданияГЧ.Загрузить(Обработки.ОжиданиеГЧ.ЗадачиВОжиданииГЧ());
КонецПроцедуры


&НаКлиенте
Процедура ЗадачиОжиданияГЧПриАктивизацииСтроки(Элемент)
	ТД = Элементы.ЗадачиОжиданияГЧ.ТекущиеДанные;
	Если ТД = Неопределено Тогда
	
		ВыбраннаяЗадача = Неопределено;
		Элементы.ПередатьВПроизводство.Доступность = Ложь;
	
	Иначе
		
		Если ТД.ВПроизводстве Тогда
			
			ВыбраннаяЗадача = Неопределено;
			Элементы.ПередатьВПроизводство.Доступность = Ложь;
			
		Иначе
			
			ВыбраннаяЗадача = ТД.ЗадачаРКД;
			Элементы.ПередатьВПроизводство.Доступность = Истина;
			
		КонецЕсли;
		
		
	КонецЕсли;

КонецПроцедуры
