
&НаКлиенте
Процедура ЗадачиОжиданияГЧПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиОжиданияГЧПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВПроизводство(Команда)
	
	Параметр = Новый Структура("ЗадачаРКДДляЗапуска", ВыбраннаяЗадача);
	ОповещениеПослеЗакрытияДокумента = Новый ОписаниеОповещения("ПослеЗакрытияДокумента", ЭтаФорма);
	ОткрытьФорму("Документ.ДосрочныйЗапускВПроизводство.ФормаОбъекта", Параметр, ЭтаФорма, , , , ОповещениеПослеЗакрытияДокумента, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияДокумента(Результат, ДополнительныеПарамтеры) Экспорт
	ЗаполнитьОжидание();
КонецПроцедуры // ПослеЗакрытияДокумента()

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьОжидание();
КонецПроцедуры

Процедура ЗаполнитьОжидание()
	
	ЗадачиВПроизводствеГЧ.Очистить();
	ЗадачиМонтажГЧ.Очистить();
	ЗадачиОжиданияГЧ.Очистить();
	
	Для каждого х Из Обработки.ОжиданиеГЧ.ЗадачиВОжиданииГЧ() Цикл
	
		Если х.ВМонтаже Тогда
			НС = ЗадачиМонтажГЧ.Добавить();
		ИначеЕсли х.ВПроизводстве Тогда	
			НС = ЗадачиВПроизводствеГЧ.Добавить();
		Иначе
			НС 			= ЗадачиОжиданияГЧ.Добавить(); 
			НС.ВедКон 	= омСотрудники.СотрудникиОбъекта(х.ОбъектТЗ, Ложь).ВедущийКонструктор;
		КонецЕсли;	
		
		ЗаполнитьЗначенияСвойств(НС, х);
		
	КонецЦикла;

	КоличествоСтрок = ЗадачиОжиданияГЧ.Количество();
	Если КоличествоСтрок = 0 Тогда
		Элементы.ГруппаЗадачи.Заголовок = "Задачи";	
	Иначе
		Элементы.ГруппаЗадачи.Заголовок = "Задачи (" + КоличествоСтрок + ")";	
	КонецЕсли;

	КоличествоСтрок = ЗадачиВПроизводствеГЧ.Количество();
	Если КоличествоСтрок = 0 Тогда
		Элементы.ГруппаПроизводство.Видимость = Ложь;	
	Иначе
		Элементы.ГруппаПроизводство.Видимость = Истина;	
		Элементы.ГруппаПроизводство.Заголовок = "Производство (" + КоличествоСтрок + ")";	
	КонецЕсли;

	КоличествоСтрок = ЗадачиМонтажГЧ.Количество();
	Если КоличествоСтрок = 0 Тогда
		Элементы.ГруппаМонтаж.Видимость = Ложь;	
	Иначе
		Элементы.ГруппаМонтаж.Видимость = Истина;	
		Элементы.ГруппаМонтаж.Заголовок = "Монтаж (" + КоличествоСтрок + ")";	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗадачиОжиданияГЧПриАктивизацииСтроки(Элемент)
	ТД = Элементы.ЗадачиОжиданияГЧ.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		
		ВыбраннаяЗадача = Неопределено;
		Элементы.ПередатьВПроизводство.Доступность = Ложь;
		
	Иначе
		
		ВыбраннаяЗадача = ТД.ЗадачаРКД;
		Элементы.ПередатьВПроизводство.Доступность = Истина;
		
	КонецЕсли;

КонецПроцедуры
