
&НаКлиенте
Процедура ЗадачиОжиданияГЧПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиОжиданияГЧПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ПередатьВПроизводствоНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВПроизводство(Команда)
	ПередатьВПроизводствоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗадачиОжиданияГЧ.Загрузить(Обработки.ОжиданиеГЧ.ЗадачиВОжиданииГЧ());
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиОжиданияГЧПриАктивизацииСтроки(Элемент)
	ТД = Элементы.ЗадачиОжиданияГЧ.ТекущиеДанные;
	Если ТД = Неопределено Тогда
	
		ВыбраннаяЗадача = Неопределено;
		Элементы.ПередатьВПроизводство.Доступность = Ложь;
	
	Иначе
	
		ВыбраннаяЗадача = ТД.ЗадачаРКД;
		//Элементы.ПередатьВПроизводство.Доступность = Истина;
	
	КонецЕсли;

КонецПроцедуры
