&НаКлиенте
Перем СтруктураДанных;

#Область Команды
	
&НаКлиенте
Процедура Обновить(Команда)
	СтруктураДанных = ОбновитьГантНаСервере();
	Диаграмма.ОтображатьЛегенду = Ложь;
КонецПроцедуры

#КонецОбласти 

#Область Диаграмма
	
Функция ОбновитьГантНаСервере(Обновить = Ложь)
	
	Если НЕ Обновить Тогда
		Диаграмма.Очистить();
	КонецЕсли;
	
	Диаграмма.Обновление = Ложь;

	стПараметры = Новый Структура("Диаграмма, Проект, Конструктор, Подразделение, ВыводитьПроект, Обновить, Сортировка"
		, Диаграмма, Проект, Конструктор, Подразделение, ВыводитьПроект, Обновить, Сортировка);
		
	СтруктураДанных = омГантКонструкторовНаСервере.ОбновитьГантНаСервере(стПараметры);
	
	Диаграмма.Обновление = Истина;
	
	Возврат СтруктураДанных;
	
КонецФункции 

Процедура ОбновитьПроектНаСервере(ТекущийПроект, мДанныеГантаПроект)
	
	стПараметры = Новый Структура("Диаграмма, Проект, Конструктор, Подразделение, ВыводитьПроект, Обновить, Сортировка, тзДанныеГанта"
		, Диаграмма, ТекущийПроект, Конструктор, Подразделение, ВыводитьПроект, Истина, Сортировка, мДанныеГантаПроект);
	
	Диаграмма.Обновление = Ложь;
	омГантКонструкторовНаСервере.ВывестиПроект(стПараметры, ТекущийПроект);
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

Процедура ОбновитьИсполнителяНаСервере(ТекущийИсполнитель, ТекущийПроект, мДанныеГантаИсполнитель)
	
	
	стПараметры = Новый Структура("Диаграмма, Проект, Подразделение, ВыводитьПроект, Обновить, Сортировка, тзДанныеГанта"
		, Диаграмма, ТекущийПроект, Подразделение, ВыводитьПроект, Истина, Сортировка, мДанныеГантаИсполнитель);
	
	Диаграмма.Обновление = Ложь;
	омГантКонструкторовНаСервере.ВывестиИсполнитель(стПараметры, ТекущийИсполнитель);
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры


#КонецОбласти

#Область ИзменениеФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СтруктураДанных = ОбновитьГантНаСервере();
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Сотрудник") Тогда
		Если ТипЗнч(Параметры.Сотрудник) = Тип("СправочникСсылка.Пользователи") Тогда
			Конструктор 	= омСотрудники.ПолучитьСотруднткаПоПользователю(Параметры.Сотрудник);
		Иначе
			Конструктор 	= Параметры.Сотрудник;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Проект") Тогда
		Проект 		= Параметры.Проект;
	КонецЕсли;
	
	Если НЕ (РольДоступна("ГлавныйКонструктор") ИЛИ РольДоступна("ПолныеПрава")) Тогда
		
		Элементы.Подразделение.Видимость 	= Ложь;
		Элементы.Конструктор.ТолькоПросмотр = Истина;
		ЭтаФорма.ТолькоПросмотр 			= Истина;
		
	КонецЕсли;
	
	Диаграмма.ОтображатьЛегенду = Ложь;
	ВыводитьПроект 				= Истина;
	

КонецПроцедуры

#КонецОбласти 

#Область ИзменениеРеквизитов
	
&НаКлиенте
Процедура ВыводитьПроектПриИзменении(Элемент)
	СтруктураДанных = ОбновитьГантНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СортировкаПриИзменении(Элемент)
	СтруктураДанных = ОбновитьГантНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонструкторПриИзменении(Элемент)
	СтруктураДанных = ОбновитьГантНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	СтруктураДанных = ОбновитьГантНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	СтруктураДанных = ОбновитьГантНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаПриОкончанииРедактированияИнтервала(Элемент, Интервал, ОтменаРедактирования)
	
	Интервал.Начало = НачалоДня(Интервал.Начало);
	
	Если Интервал.Начало < НачалоДня(ТекущаяДата()) Тогда
		ОтменаРедактирования = Истина;		
		Возврат;
	КонецЕсли;
	
	Продолжительность = ?(Интервал.Расшифровка.Продолжительность = 0, 1, Интервал.Расшифровка.Продолжительность);
	Интервал.Конец 	= омДаты.ДобавитьДниСУчетомВыходных(Интервал.Начало, Продолжительность);
	
	Если Интервал.Расшифровка.Свойство("Задача") Тогда
		омГантКонструкторовНаСервере.ЗаписатьИзменениеВРегистр(Интервал.Начало, Интервал.Расшифровка.Задача, Продолжительность);
		
		мДанныеГантаПроект 		= Новый Массив;
		мДанныеГантаИсполнитель = Новый Массив;
		Для каждого х Из СтруктураДанных.тзДанныеГанта Цикл
			
			Если х.Проект = Интервал.Расшифровка.Проект Тогда
				
				мДанныеГантаПроект.Добавить(х);	
				
				Если х.Исполнитель = Интервал.Расшифровка.Исполнитель Тогда
					
					мДанныеГантаИсполнитель.Добавить(х);	
					
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЦикла;
		
		Для каждого х Из СтруктураДанных.тзДанныеГанта Цикл
			Если Интервал.Расшифровка.Задача = х.Задача И Интервал.Расшифровка.Этап = х.Этап Тогда
				х.ДатаНачала = Интервал.Начало;
				
				ОбновитьПроектНаСервере(Интервал.Расшифровка.Проект, мДанныеГантаПроект);
				ОбновитьИсполнителяНаСервере(Интервал.Расшифровка.Исполнитель, Интервал.Расшифровка.Проект, мДанныеГантаИсполнитель);

			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ДиаграммаОбработкаРасшифровки(Элемент, Расшифровки, СтандартнаяОбработка, Дата)
	
	СтандартнаяОбработка = Ложь;
	омГантКонструкторовНаКлиенте.ОбработкаРасшифровки(Расшифровки);
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаВыбор(Элемент, Значения, СтандартнаяОбработка, Дата) 
	омГантКонструкторовНаКлиенте.ДиаграммаВыбор(Значения, СтандартнаяОбработка);
КонецПроцедуры


