
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Проект") Тогда 
		Проект = Параметры.Проект;
		Если ЭтаФорма.Параметры.Свойство("ТолькоНеИспользованые") Тогда
			Если ЭтаФорма.Параметры.ТолькоНеИспользованые Тогда
				Список.ТекстЗапроса = "ВЫБРАТЬ
				                      |	спрИзделияЭлемента.Ссылка КАК Ссылка,
				                      |	ВЫРАЗИТЬ(спрИзделияЭлемента.Комментарий КАК СТРОКА(150)) КАК Комментарий,
				                      |	спрИзделияЭлемента.Помещения КАК Помещения,
				                      |	спрИзделияЭлемента.Наименование КАК Наименование,
				                      |	спрИзделияЭлемента.Код КАК Код,
				                      |	спрИзделияЭлемента.НомерПоПорядку КАК НомерПоПорядку,
				                      |	ВЫБОР
				                      |		КОГДА АктуальныеИзделияКомплектыЭлементы.ИзделиеКомплектЭлемент ЕСТЬ NULL
				                      |			ТОГДА ЛОЖЬ
				                      |		ИНАЧЕ ИСТИНА
				                      |	КОНЕЦ КАК Актуальность
				                      |ИЗ
				                      |	Справочник.ИзделияЭлемент КАК спрИзделияЭлемента
				                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.?ИзделияКомплект?.ИзделияЭлемент КАК тчКомплектИзделияЗаказчика
				                      |		ПО (тчКомплектИзделияЗаказчика.ИзделиеЭлемент = спрИзделияЭлемента.Ссылка)
				                      |			И (НЕ тчКомплектИзделияЗаказчика.Ссылка = &СсылкаРодитель)
				                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеИзделияКомплектыЭлементы КАК АктуальныеИзделияКомплектыЭлементы
				                      |		ПО спрИзделияЭлемента.Ссылка = АктуальныеИзделияКомплектыЭлементы.ИзделиеКомплектЭлемент
				                      |ГДЕ
				                      |	спрИзделияЭлемента.Проект = &Проект
				                      |	И тчКомплектИзделияЗаказчика.Ссылка ЕСТЬ NULL
				                      |	И спрИзделияЭлемента.ЭтоГруппа = ЛОЖЬ
				                      |	И НЕ спрИзделияЭлемента.Ссылка В (&ТекущиеИзделияЗаказчика)
				                      |
				                      |СГРУППИРОВАТЬ ПО
				                      |	спрИзделияЭлемента.Ссылка,
				                      |	ВЫБОР
				                      |		КОГДА АктуальныеИзделияКомплектыЭлементы.ИзделиеКомплектЭлемент ЕСТЬ NULL
				                      |			ТОГДА ЛОЖЬ
				                      |		ИНАЧЕ ИСТИНА
				                      |	КОНЕЦ,
				                      |	спрИзделияЭлемента.Помещения,
				                      |	спрИзделияЭлемента.Наименование,
				                      |	спрИзделияЭлемента.Код,
				                      |	спрИзделияЭлемента.НомерПоПорядку,
				                      |	ВЫРАЗИТЬ(спрИзделияЭлемента.Комментарий КАК СТРОКА(150))";
				
									  
				Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,"?ИзделияКомплект?",	Параметры.СсылкаРодитель.Метаданные().Имя);
				Список.Параметры.УстановитьЗначениеПараметра("ТекущиеИзделияЗаказчика",		Параметры.ТекущиеИзделияЗаказчика);
				Список.Параметры.УстановитьЗначениеПараметра("СсылкаРодитель",				Параметры.СсылкаРодитель); 
				Список.ОсновнаяТаблица = "Справочник.ИзделияЭлемент";
			КонецЕсли;
		КонецЕсли;
		Список.Параметры.УстановитьЗначениеПараметра("Проект", Параметры.Проект);
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Проект",Справочники.Проекты.ПустаяСсылка());
		Элементы.Список.Отображение = ОтображениеТаблицы.Дерево; 
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры
