Функция ЗадачиВОжиданииГЧ(ТолькоКоличество = Ложь, Проект = Неопределено, ВедущийКонструктор = Неопределено) Экспорт

	Запрос = Новый Запрос;
	
	ИспользоватьВедущегоКонструктора = ЗначениеЗаполнено(ВедущийКонструктор);
	
	
	Если ТолькоКоличество И НЕ ИспользоватьВедущегоКонструктора Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Задачи_РКД.Ссылка) КАК Количество
			|ИЗ
			|	Задача.Задачи_РКД КАК Задачи_РКД
			|ГДЕ
			|	НЕ Задачи_РКД.Выполнена
			|	И Задачи_РКД.СтатусЗадачи = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ОжиданиеГЧ)
			|	И ВЫБОР
			|			КОГДА &Проект = НЕОПРЕДЕЛЕНО
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ Задачи_РКД.Проект = &Проект
			|		КОНЕЦ";
		
		Запрос.УстановитьПараметр("Проект", ?(ЗначениеЗаполнено(Проект), Проект, Неопределено));
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Количество;
		
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК ЗадачаРКД,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	ЕСТЬNULL(НЕ КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = """", ЛОЖЬ) КАК ВПроизводстве,
		|	ЕСТЬNULL(КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = ""1"", ЛОЖЬ) КАК ВМонтаже,
		|	Задачи_РКД.ОбъектТЗ КАК ОбъектТЗ,
		|	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК ВедКон,
		|	Задачи_РКД.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование,
		|	Задачи_РКД.Проект КАК Проект,
		|	Задачи_РКД.Проект.Наименование КАК ПроектНаименование,
		|	Задачи_РКД.Проект.Номер КАК ПроектНомер,
		|	Задачи_РКД.Проект.Префикс КАК ПроектПрефикс
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО Задачи_РКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
		|			ПО КанбанКарточки.УИД = КанбанПереходКарточкиСрезПоследних.УИДКарточка
		|				И (КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка В (&УИДКолонокПроизводства))
		|		ПО Задачи_РКД.ОбъектТЗ = КанбанКарточки.Ресурс
		|ГДЕ
		|	НЕ Задачи_РКД.Выполнена
		|	И Задачи_РКД.СтатусЗадачи = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ОжиданиеГЧ)
		|	И ВЫБОР
		|			КОГДА &Проект = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Задачи_РКД.Проект = &Проект
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Задачи_РКД.ОбъектТЗ.Наименование";
	
	
	мКолонки = Новый Массив;
	
	Для каждого х из омКанбанОбщие.ПолучитьСтруктураКанбана("НаименованиеДоскиПроизводство").мКолонки Цикл
		мКолонки.Добавить(х.УИД);	
	КонецЦикла;	
		
	Запрос.УстановитьПараметр("Проект", ?(ЗначениеЗаполнено(Проект), Проект, Неопределено));
	Запрос.УстановитьПараметр("УИДКолонокПроизводства", мКолонки);
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если НЕ ИспользоватьВедущегоКонструктора Тогда
		
		Для каждого х Из ТаблицаЗапроса Цикл
			
			Если НЕ х.ВПроизводстве Тогда
				х.ВедКон = омСотрудники.СотрудникиОбъекта(х.ОбъектТЗ).ВедущийКонструктор;
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат ТаблицаЗапроса;
		
	КонецЕсли;
	
	ТаблицаДанных = ТаблицаЗапроса.СкопироватьКолонки();
	
	Для каждого х Из ТаблицаЗапроса Цикл
		
		ВедКон = омСотрудники.СотрудникиОбъекта(х.ОбъектТЗ).ВедущийКонструктор;
		
		Если НЕ ВедКон = ВедущийКонструктор Тогда
			Продолжить;	
		Иначе
			
			НС = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НС, х);
			НС.ВедКон = ВедКон;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ?(ТолькоКоличество, ТаблицаДанных.Количество(), ТаблицаДанных);
	
КонецФункции // ЗадачиВОжиданииГЧ()
