Функция ЗадачиВОжиданииГЧ(ТолькоКоличество = Ложь) Экспорт

	Запрос = Новый Запрос;
	
	
	Если ТолькоКоличество Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Задачи_РКД.Ссылка) КАК Количество
			|ИЗ
			|	Задача.Задачи_РКД КАК Задачи_РКД
			|ГДЕ
			|	НЕ Задачи_РКД.Выполнена
			|	И Задачи_РКД.СтатусЗадачи = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ОжиданиеГЧ)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Количество;
		
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК ЗадачаРКД,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	ЕСТЬNULL(НЕ КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = """", ЛОЖЬ) КАК ВПроизводстве,
		|	ЕСТЬNULL(КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = ""1"", ЛОЖЬ) КАК ВМонтаже
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО Задачи_РКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
		|			ПО КанбанКарточки.УИД = КанбанПереходКарточкиСрезПоследних.УИДКарточка
		|		ПО Задачи_РКД.ОбъектТЗ = КанбанКарточки.Ресурс
		|ГДЕ
		|	НЕ Задачи_РКД.Выполнена
		|	И Задачи_РКД.СтатусЗадачи = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ОжиданиеГЧ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВПроизводстве,
		|	Задачи_РКД.ОбъектТЗ.Наименование";
	
	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ЗадачиВОжиданииГЧ()
