Функция ПолучитьДанныеОбразца(Образец) Экспорт
	
	ДанныеОбразца = Новый Структура("Материалы, Наименование, Обработка, Код, ШК", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Образец.Наименование КАК Наименование,
		|	Образец.Обработка КАК Обработка,
		|	Образец.Код КАК Код
		|ИЗ
		|	Справочник.Образец КАК Образец
		|ГДЕ
		|	Образец.Ссылка = &Образец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбразецМатериалы.Количество КАК Количество,
		|	ОбразецМатериалы.Примечание КАК Примечание,
		|	ОбразецМатериалы.Номенклатура.Представление КАК Номенклатура,
		|	ОбразецМатериалы.Единица.Представление КАК Единица
		|ИЗ
		|	Справочник.Образец.Материалы КАК ОбразецМатериалы
		|ГДЕ
		|	ОбразецМатериалы.Ссылка = &Образец";
	
	Запрос.УстановитьПараметр("Образец", Образец);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеОбразца, Выборка);
		ДанныеОбразца.ШК = омШрихкодыНаСереверКлиенте.ПолучитьПрефиксШтрихкодаПоТипу(Образец) + Формат(Выборка.Код, "ЧЦ=9; ЧВН=; ЧГ=0");
		
		ДанныеОбразца.Наименование = СтрЗаменить(ДанныеОбразца.Наименование, Символы.ВК, "");
		ДанныеОбразца.Наименование = СтрЗаменить(ДанныеОбразца.Наименование, Символы.ПС, "");
		ДанныеОбразца.Наименование = "Образец № " + Формат(ДанныеОбразца.Код ,"ЧГ=0") + " " + ДанныеОбразца.Наименование;
		
		ДанныеОбразца.Обработка = СтрЗаменить(ДанныеОбразца.Обработка, Символы.ВК, ""); 
		ДанныеОбразца.Обработка = СтрЗаменить(ДанныеОбразца.Обработка, Символы.ПС, "");
		
	КонецЦикла;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДаныеМатериала = Новый Структура("Номенклатура, Единица, Примечание, Количество", );
		ЗаполнитьЗначенияСвойств(СтруктураДаныеМатериала, Выборка);
		ДанныеОбразца.Материалы.Добавить(СтруктураДаныеМатериала);
		
	КонецЦикла;
	
    Возврат ДанныеОбразца;
КонецФункции // ПолучитьДанныеОбразца()

Функция ПолучитьСтркутуруНастроекПечати() Экспорт

	СтруктураНастроекПечати = Новый Структура();
	
	СтруктураНастроекПечати.Вставить("РазмерШрифтаНаименования", 	12);
	СтруктураНастроекПечати.Вставить("ПолужирныйНаименование", 		Истина);
	СтруктураНастроекПечати.Вставить("", );
	СтруктураНастроекПечати.Вставить("", );
	СтруктураНастроекПечати.Вставить("", );
	СтруктураНастроекПечати.Вставить("", );
	СтруктураНастроекПечати.Вставить("", );
	СтруктураНастроекПечати.Вставить("", );
	СтруктураНастроекПечати.Вставить("", );
	
	
	Возврат СтруктураНастроекПечати;

КонецФункции // ПолучитьСтркутураНстроекПечати()


Функция СформироватьТаблицуНаСервере(Образец, СтркутураНстроекПечати, ДанныеОбразца = Неопределено) Экспорт
	
	Если ДанныеОбразца = Неопределено Тогда
		ДанныеОбразца = ПолучитьДанныеОбразца(Образец);	
	КонецЕсли;
	
	Пример.Очистить();
 	СтруктрураОбъеденненыхЯчеек = Новый Структура("Наименование, Обработка, Материалы, МаксимальнаяШирина", 2, 2, 2, 5);

	мШиринаКолонок = Новый Массив(?(Метериалы, 5, 2));
	мШиринаКолонок[0] = 1;
	мШиринаКолонок[1] = 20;
	
	Если Метериалы Тогда
		мШиринаКолонок[2] = 6;
		мШиринаКолонок[3] = 6;
		мШиринаКолонок[4] = 30;
	КонецЕсли;
	
	стПараметровОбласти = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров(Истина);
	стПараметровОбласти.НомерСтроки 			= 2;
	стПараметровОбласти.НомерКолонки 			= 2;
	стПараметровОбласти.ДлинаОбласти 			= СтруктрураОбъеденненыхЯчеек.Наименование;
	стПараметровОбласти.ВысотаОбласти 			= 1;
	стПараметровОбласти.РазмерШрифта 			= СтруктураНастроекПечати.РазмерШрифтаНаименования; 
	стПараметровОбласти.Полужирный     			= СтруктураНастроекПечати.ПолужирныйНаименование; 
	стПараметровОбласти.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	стПараметровОбласти.РазмещениеТекста 		= ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	Если Наименование Тогда
		Пример.Вывести(ПолучитьТаблицуНаименовнаия(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок));
	КонецЕсли;
	
	Если ВыводитьШК Тогда
		Пример.Вывести(ПолучитьШК(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти));
	КонецЕсли;
	
	Если Обработка Тогда
		стПараметровОбласти.РазмерШрифта 		= РазмерШрифтаОбработка; 
		стПараметровОбласти.Полужирный     		= ПолужирныйОбработка; 
		Пример.Вывести(ПолучитьТаблицуОбработка(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок));
	КонецЕсли;
	
	Если Метериалы Тогда
		стПараметровОбласти.РазмерШрифта 		= РазмерШрифтаМатериалы; 
		стПараметровОбласти.Полужирный     		= ПолужирныйМатериалы;
		стПараметровОбласти.РазмещениеТекста	= ТипРазмещенияТекстаТабличногоДокумента.Обрезать;
		Пример.Вывести(ПолучитьТаблицуМатериалы(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок));
	КонецЕсли;
	
	Если ВыводитьРамку Тогда
		омТабличныйДокументКлиентСервер.ОбвестиОбласть(Пример);	
	КонецЕсли;
	
Конецфункции

