&НаСервере
Процедура ПриУдаленииПриложенияКДоговоруПодписка(Источник, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеИзделияЗаказчика.ИзделиеЗаказчика КАК ИзделиеЗаказчика,
		|	ДанныеИзделияЗаказчика.ИзделиеЗаказчика.Проект КАК Проект
		|ИЗ
		|	РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
		|ГДЕ
		|	ДанныеИзделияЗаказчика.ПриложениеКДоговору = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ДанныеИзделияЗаказчика.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИзделиеЗаказчика = Выборка.ИзделиеЗаказчика;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.Актуальность 		= Ложь; 
		МенеджерЗаписи.НомерПоПорядку		= 0;
		МенеджерЗаписи.Артикул				= Справочники.ИзделияЗаказчика.ПолучитьАртикулОбъекта(Выборка.ИзделиеЗаказчика,Выборка.Сделка,"",0);
		МенеджерЗаписи.ПриложениеКДоговору	= Справочники.ПриложенияКДоговорам.ПустаяСсылка();
		
		МенеджерЗаписи.Записать(); 
		
	КонецЦикла;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОконачаниеДоговораСрезПоследних.ИзделияКомплект КАК ИзделияКомплект,
		|	ОконачаниеДоговораСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ОконачаниеДоговора.СрезПоследних(, ПриложениеКДоговору = &ПриложениеКДоговору) КАК ОконачаниеДоговораСрезПоследних";
	
	Запрос.УстановитьПараметр("ПриложениеКДоговору", Источник.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ОконачаниеДоговора.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИзделияКомплект.Установить(Выборка.ИзделияКомплект);
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		
		НаборЗаписей.Записать();
	КонецЦикла;
	
	
	НаборЗаписей = РегистрыСведений.АктуальныеИзделияКомплектыЭлементы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПриложениеКДоговору.Установить(Источник.Ссылка);
	
    НаборЗаписей.Записать();
	
	
КонецПроцедуры // ПриЗаписиОбъектаПодписка()


Процедура ПослеПроведенияПлановойГотовностиПомещения(ДокументОбъект, Отказ, ВидПроведения) Экспорт

	РегистрыСведений.ПлановаяГотовностьГабаритныхЧертежей.РасчитатьПлановыеДатыГабаритныхЧерчежей(ДокументОбъект.Проект);

КонецПроцедуры

Процедура ПриУдаленииПроведенияПлановойГотовностиПомещения(Источник, Отказ) Экспорт   

	РегистрыСведений.ПлановаяГотовностьГабаритныхЧертежей.РасчитатьПлановыеДатыГабаритныхЧерчежей(Источник.Проект);

КонецПроцедуры