Процедура УстановитьПриоритет(Комплект, Приоритет) Экспорт

	КомплектМассив = ТипЗнч(Комплект) = Тип("Массив");
	
	Если КомплектМассив Тогда
		МассивКомплектов = ОбщегоНазначения.СкопироватьРекурсивно(Комплект);
	КонецЕсли;
	
	ТекущийПриоритет 	= Справочники.Приоритеты.ПустаяСсылка();
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	ТД 					= ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект В(&Комплект)) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос1 = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект В(&Комплект)) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	НачатьТранзакцию();
		
	Попытка

		БлокировкаДанных = Новый БлокировкаДанных;
		
		Если КомплектМассив Тогда
		
			Для каждого ТекущийКомплект Из Комплект Цикл
			
				ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ДанныеКомплекта");
				ЭлементБлокировкиДанных.УстановитьЗначение("Комплект", ТекущийКомплект);
				ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
			
			КонецЦикла;	
		
		Иначе
			
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ДанныеКомплекта");
			ЭлементБлокировкиДанных.УстановитьЗначение("Комплект", Комплект);
			ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
			
		КонецЕсли;
		  
		БлокировкаДанных.Заблокировать();
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если КомплектМассив Тогда
				МассивКомплектов.Удалить(МассивКомплектов.Найти(Выборка.Комплект));
			КонецЕсли;
			
			ТекущийПриоритет = Выборка.Приоритет;
			
			Если ТекущийПриоритет = Приоритет Тогда
				Продолжить;	
			КонецЕсли;  
			
			МенеджерЗаписи = РегистрыСведений.ДанныеКомплекта.СоздатьМенеджерЗаписи();
			
			Если Выборка.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			КонецЕсли; 
			
			МенеджерЗаписи.Период 		= ТД;
			МенеджерЗаписи.Автор 		= ТекущийПользователь;
			МенеджерЗаписи.Приоритет 	= Приоритет;
			
			МенеджерЗаписи.Записать();
			
		КонецЦикла; 
		
		Если КомплектМассив Тогда
			
			Для каждого ТекущийКомплект Из МассивКомплектов Цикл
				
				Запрос1.УстановитьПараметр("Комплект", ТекущийКомплект);
				Выборка = Запрос.Выполнить().Выбрать();
				
				МенеджерЗаписи 				= РегистрыСведений.ДанныеКомплекта.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
				МенеджерЗаписи.Период 		= ТД;
				МенеджерЗаписи.Комплект 	= Комплект;
				МенеджерЗаписи.Приоритет 	= Приоритет;
				МенеджерЗаписи.Автор 		= ТекущийПользователь;
				
				МенеджерЗаписи.Записать();
				
			КонецЦикла;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Заметки'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
КонецПроцедуры

Процедура СнятьПриоритет(Комплект) Экспорт

	УстановитьПриоритет(Комплект, Справочники.Приоритеты.ПустаяСсылка());	

КонецПроцедуры

Функция ВозможностьУстановитьПриоритет(Комплект, Приоритет) Экспорт

	стВозврат = Новый Структура("Возможность, Описание", Истина, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Приоритеты.Ссылка.КоличествоЗадачУИсполнителя КАК КоличествоЗадачУИсполнителя,
		|	Приоритеты.Ссылка.ВсегоЗадач КАК ВсегоЗадач
		|ИЗ
		|	Справочник.Приоритеты КАК Приоритеты
		|ГДЕ
		|	Приоритеты.Ссылка = &Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	ДанныеКомплектаСрезПоследних.Комплект КАК Комплект
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|ГДЕ
		|	ДанныеКомплектаСрезПоследних.Приоритет = &Приоритет";
	
	Запрос.УстановитьПараметр("Приоритет", Приоритет);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[0].Выбрать();
	Если Выборка.Количество() = 0 Тогда
		стВозврат.Описание = "Нет данных по приоритету";
		Возврат стВозврат; 
	КонецЕсли; 
	
	Выборка.Следующий();
	
	КоличествоЗадачУИсполнителя = Выборка.КоличествоЗадачУИсполнителя;
	ВсегоЗадач 					= Выборка.ВсегоЗадач;
	
	Если ВсегоЗадач = 0 Тогда
		стВозврат.Описание = "Количество задач не ограничено";
		Возврат стВозврат; 
	КонецЕсли;
	
	тзСтадииКомплекта	= Результат[1].Выгрузить(); 
	
	Если тзСтадииКомплекта.Найти("Комплект", Комплект) = Неопределено Тогда
		стВозврат.Описание = "Комплект уже имеет приоритет " + Приоритет;
		Возврат стВозврат; 
	КонецЕсли;
	
	
	Если тзСтадииКомплекта. Количество() >= ВсегоЗадач Тогда
		стВозврат.Возможность 	= Ложь;
		стВозврат.Описание 		= "Возможное количество задач для приоритета " + Приоритет 
				+ " " + ВсегоЗадач + " находиться в приоритете " + тзСтадииКомплекта. Количество();
		Возврат стВозврат; 
	КонецЕсли;
	
	
	Возврат стВозврат; 	
	

КонецФункции //ВозможностьУстановитьПриоритет(Комплект, Приоритет)
