
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент;
	НаименованиеТабличногоДокумента = Печать(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать(НаименованиеТабличногоДокумента);
КонецПроцедуры

&НаСервере
Функция Печать(ТабДок, ПараметрКоманды)
	Справочники.ПриложенияКДоговорам.ПечатьРасширенный(ТабДок, ПараметрКоманды);
	Возврат Справочники.ПриложенияКДоговорам.ПолучитНаименованиеТабличногоДокумента(ПараметрКоманды);
КонецФункции
