
#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НастройкаПодключения") Тогда
		
		НастройкаПодключения = Параметры.НастройкаПодключения; 
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("НастройкаПодключения");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение 	= Параметры.НастройкаПодключения;
		
		ЭлементОтбора = СписокНеотправленныеПакеты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("НастройкаПодключения");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение 	= Параметры.НастройкаПодключения;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеЗаписи(Команда)
	
	УдалитьВсе();
	Элементы.Список.Обновить();
	
	Элементы.СписокНеотправленныеПакеты.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВсе()
	
	НаборЗаписей = РегистрыСведений.Б24_СМ_ПакетыВыгрузки.СоздатьНаборЗаписей();
	
	Если ЗначениеЗаполнено(НастройкаПодключения) Тогда
		НаборЗаписей.Отбор.НастройкаПодключения.Установить(НастройкаПодключения);	
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаОбъектНаСервере(ТипСущности1С, Сущность1С, ИдентификаторОбъекта)
	
	Результат 	= Неопределено;
	ТипОбъекта 	= Неопределено;
	
	Если ТипСущности1С = "Справочник" Тогда
		ТипОбъекта = Тип("СправочникСсылка."+Сущность1С);
	ИначеЕсли ТипСущности1С = "Документ" Тогда
		ТипОбъекта = Тип("ДокументСсылка."+Сущность1С);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипОбъекта) Тогда
		Результат = XMLЗначение(ТипОбъекта, ИдентификаторОбъекта);	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	
	ТекущиеДанные = Неопределено;
	
	Если Элементы.ГруппаСтраница.ТекущаяСтраница = Элементы.СтраницаИзменения Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ИначеЕсли Элементы.ГруппаСтраница.ТекущаяСтраница = Элементы.СтраницаНеотправленныеПакеты Тогда
		ТекущиеДанные = Элементы.СписокНеотправленныеПакеты.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.свойство("ИдентификаторОбъекта") Тогда
		СсылкаНаОбъект = ПолучитьСсылкуНаОбъектНаСервере(ТекущиеДанные.ТипСущности1С, ТекущиеДанные.Сущность1С, ТекущиеДанные.ИдентификаторОбъекта);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ПоказатьЗначение(,СсылкаНаОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
