Функция ПолучитьНаименованияПроектов(СписокВыбора, ПоказатьВсе = Ложь, СписокСПараметрами = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланДатыСрезПоследних.Параметр КАК Параметр,
		|	ПланДатыСрезПоследних.НаименованиеПараметра КАК НаименованиеПараметра
		|ИЗ
		|	РегистрСведений.ПланДаты.СрезПоследних(, Комплект = НЕОПРЕДЕЛЕНО) КАК ПланДатыСрезПоследних
		|ГДЕ
		|	ПланДатыСрезПоследних.Параметр <> ""&&&&""
		|	И ПланДатыСрезПоследних.НаименованиеПараметра ПОДОБНО ""НП#%""
		|
		|УПОРЯДОЧИТЬ ПО
		|	Параметр";
	
	Если ПоказатьВсе Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПланДатыСрезПоследних.Параметр <> """"", "");	
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(?(ПоказатьВсе, Выборка.НаименованиеПараметра, Выборка.Параметр), СтрЗаменить(Выборка.Параметр, "_", " "));
		
		Если НЕ СписокСПараметрами = Неопределено Тогда
			СписокСПараметрами.Добавить(Выборка.НаименованиеПараметра, Выборка.Параметр);	
		КонецЕсли;
	КонецЦикла;
	
КонецФункции // ПолучитьНаименованияПроектов()


Функция ПолучитьНомерОтчетаПоНаименованиею(НаименованиеОтчета, СписокСПараметрами) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланДатыСрезПоследних.НаименованиеПараметра КАК НаименованиеПараметра,
		|	ПланДатыСрезПоследних.Параметр КАК Параметр
		|ИЗ
		|	РегистрСведений.ПланДаты.СрезПоследних(, Комплект = НЕОПРЕДЕЛЕНО) КАК ПланДатыСрезПоследних
		|ГДЕ
		|	ПланДатыСрезПоследних.Параметр = &НаименованиеОтчета
		|	И ПланДатыСрезПоследних.НаименованиеПараметра ПОДОБНО ""НП#%""";
	
	
	Запрос.УстановитьПараметр("НаименованиеОтчета", НаименованиеОтчета);
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерОтчета = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		НомерОтчета = СтрЗаменить(Выборка.НаименованиеПараметра, "НП#", "");
		СписокСПараметрами.Добавить(Выборка.НаименованиеПараметра, Выборка.Параметр);	
	КонецЦикла;
	
	Возврат НомерОтчета;
	
КонецФункции // ПолучитьНомерОтчетаПоНаименованиею() 

Функция ПреробразоватьПараметрКолонкиВСтруктуру(НаименованиеПараметра, СписокСПараметрамиИменаОтчетов) Экспорт
	
	МасиивДанных = СтрРазделить(НаименованиеПараметра, "#");
	
	Если НЕ МасиивДанных.Количество() = 3 Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ПараметрОтчета = "НП#" + МасиивДанных[1]; 
	
	НайденоеЗначение = СписокСПараметрамиИменаОтчетов.НайтиПоЗначению(ПараметрОтчета);
	
	Если НайденоеЗначение = Неопределено Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ДанныеКолонки = СтрРазделить(МасиивДанных[2], "?");
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("НаименованиеОтчета", НайденоеЗначение.Представление);
	СтруктураДанных.Вставить("НомерКолонки", Число(ДанныеКолонки[0]));
	СтруктураДанных.Вставить("ТипПараметра", ДанныеКолонки[1]);
	
	Возврат СтруктураДанных;
	
КонецФункции // ПреробразоватьПараметрКолонкиВСтруктуру()



Функция ПолучитьКолонкиОтчета(НаименованиеОтчета) Экспорт

	СписокСПараметрамиИменаОтчетов = Новый СписокЗначений;
	
	НомерОтчета = ПолучитьНомерОтчетаПоНаименованиею(НаименованиеОтчета, СписокСПараметрамиИменаОтчетов);
	
	Если НомерОтчета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
	КолонкиОтчета = Новый ТаблицаЗначений;
	КолонкиОтчета.Колонки.Добавить("НомерКолонки");	
	КолонкиОтчета.Колонки.Добавить("ТипРасчетногоЗначения");	
	КолонкиОтчета.Колонки.Добавить("НаименованиеКолонки");	
	КолонкиОтчета.Колонки.Добавить("ТипКолонки");	
	КолонкиОтчета.Колонки.Добавить("Сортировка");	
	КолонкиОтчета.Колонки.Добавить("ПоказыватьРучныеЗначения");	

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланДатыСрезПоследних.Параметр КАК Параметр,
		|	ПланДатыСрезПоследних.НаименованиеПараметра КАК НаименованиеПараметра,
		|	ПланДатыСрезПоследних.ТипКолонки КАК ТипКолонки,
		|	ПланДатыСрезПоследних.ТипРасчетныхЗначений КАК ТипРасчетныхЗначений,
		|	ПланДатыСрезПоследних.ТипРасчетныхЗначений.ТипКолонки КАК ТипРасчетныхЗначенийТипКолонки
		|ИЗ
		|	РегистрСведений.ПланДаты.СрезПоследних КАК ПланДатыСрезПоследних
		|ГДЕ
		|	ПланДатыСрезПоследних.Комплект = НЕОПРЕДЕЛЕНО
		|	И ПланДатыСрезПоследних.Параметр <> ""&&&&""
		|	И ПланДатыСрезПоследних.НаименованиеПараметра ПОДОБНО &ПрефиксКолонки";
		
	Запрос.УстановитьПараметр("ПрефиксКолонки", "НК#" + НомерОтчета + "#%");
	Выборка = Запрос.Выполнить().Выбрать();

	Отбор = Новый Структура("НомерКолонки", );
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = ПреробразоватьПараметрКолонкиВСтруктуру(Выборка.НаименованиеПараметра, СписокСПараметрамиИменаОтчетов);
		
		Если СтруктураДанных = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		Отбор.НомерКолонки = СтруктураДанных.НомерКолонки;
		НайденыеСтроки = КолонкиОтчета.НайтиСтроки(Отбор);
		
		Если НайденыеСтроки.Количество() = 0 Тогда
			НС = КолонкиОтчета.Добавить();
			НС.НомерКолонки = Отбор.НомерКолонки;
		Иначе
		   	НС = НайденыеСтроки[0];
		КонецЕсли;
		
		Если СтруктураДанных.ТипПараметра = "Н" Тогда
			НС.НаименованиеКолонки = Выборка.Параметр;
			НС.ТипКолонки = Выборка.ТипКолонки;
			НС.ТипРасчетногоЗначения = Выборка.ТипРасчетныхЗначений;
			НС.ТипКолонки = ?(ЗначениеЗаполнено(Выборка.ТипРасчетныхЗначений), Выборка.ТипРасчетныхЗначенийТипКолонки, Выборка.ТипКолонки);
		ИначеЕсли СтруктураДанных.ТипПараметра = "Сор" Тогда
			НС.Сортировка = Выборка.Параметр;
		ИначеЕсли СтруктураДанных.ТипПараметра = "РЗ" Тогда
			НС.ПоказыватьРучныеЗначения = Выборка.Параметр;
		КонецЕсли;
		
	КонецЦикла;

	Возврат КолонкиОтчета;	

КонецФункции // ПолучитьКолонкиОтчета()

