Функция ПолучитьНаименованияПроектов(СписокВыбора, ПоказатьВсе = Ложь, СписокСПараметрами = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланДатыСрезПоследних.Параметр КАК Параметр,
	|	ПланДатыСрезПоследних.НаименованиеПараметра КАК НаименованиеПараметра
	|ИЗ
	|	РегистрСведений.ПланДаты.СрезПоследних(, Комплект = НЕОПРЕДЕЛЕНО) КАК ПланДатыСрезПоследних
	|ГДЕ
	|	ПланДатыСрезПоследних.Параметр <> ""&&&&""
	|	И ПланДатыСрезПоследних.НаименованиеПараметра ПОДОБНО ""НП#%""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Параметр";
	
	Если ПоказатьВсе Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПланДатыСрезПоследних.Параметр <> """"", "");	
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(?(ПоказатьВсе, Выборка.НаименованиеПараметра, Выборка.Параметр), СтрЗаменить(Выборка.Параметр, "_", " "));
		
		Если НЕ СписокСПараметрами = Неопределено Тогда
			СписокСПараметрами.Добавить(Выборка.НаименованиеПараметра, Выборка.Параметр);	
		КонецЕсли;
	КонецЦикла;
	
КонецФункции // ПолучитьНаименованияПроектов()

Функция ПолучитьНомерОтчетаПоНаименованиею(НаименованиеОтчета, СписокСПараметрами) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланДатыСрезПоследних.НаименованиеПараметра КАК НаименованиеПараметра,
	|	ПланДатыСрезПоследних.Параметр КАК Параметр
	|ИЗ
	|	РегистрСведений.ПланДаты.СрезПоследних(, Комплект = НЕОПРЕДЕЛЕНО) КАК ПланДатыСрезПоследних
	|ГДЕ
	|	ПланДатыСрезПоследних.Параметр = &НаименованиеОтчета
	|	И ПланДатыСрезПоследних.НаименованиеПараметра ПОДОБНО ""НП#%""";
	
	
	Запрос.УстановитьПараметр("НаименованиеОтчета", НаименованиеОтчета);
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерОтчета = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		НомерОтчета = СтрЗаменить(Выборка.НаименованиеПараметра, "НП#", "");
		СписокСПараметрами.Добавить(Выборка.НаименованиеПараметра, Выборка.Параметр);	
	КонецЦикла;
	
	Возврат НомерОтчета;
	
КонецФункции // ПолучитьНомерОтчетаПоНаименованиею() 

Функция ПреробразоватьПараметрКолонкиВСтруктуру(НаименованиеПараметра, СписокСПараметрамиИменаОтчетов) Экспорт
	
	МасиивДанных = СтрРазделить(НаименованиеПараметра, "#");
	
	Если НЕ МасиивДанных.Количество() = 3 Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ПараметрОтчета = "НП#" + МасиивДанных[1]; 
	
	НайденоеЗначение = СписокСПараметрамиИменаОтчетов.НайтиПоЗначению(ПараметрОтчета);
	
	Если НайденоеЗначение = Неопределено Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ДанныеКолонки = СтрРазделить(МасиивДанных[2], "?");
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("НаименованиеОтчета", НайденоеЗначение.Представление);
	СтруктураДанных.Вставить("НомерКолонки", Число(ДанныеКолонки[0]));
	СтруктураДанных.Вставить("ТипПараметра", ДанныеКолонки[1]);
	
	Возврат СтруктураДанных;
	
КонецФункции // ПреробразоватьПараметрКолонкиВСтруктуру()

Функция ПолучитьКолонкиОтчета(НаименованиеОтчета) Экспорт
	
	СписокСПараметрамиИменаОтчетов = Новый СписокЗначений;
	
	НомерОтчета = ПолучитьНомерОтчетаПоНаименованиею(НаименованиеОтчета, СписокСПараметрамиИменаОтчетов);
	
	Если НомерОтчета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
	КолонкиОтчета = Новый ТаблицаЗначений;
	КолонкиОтчета.Колонки.Добавить("НомерКолонки");	
	КолонкиОтчета.Колонки.Добавить("ТипРасчетногоЗначения");	
	КолонкиОтчета.Колонки.Добавить("НаименованиеКолонки");	
	КолонкиОтчета.Колонки.Добавить("ТипКолонки");	
	КолонкиОтчета.Колонки.Добавить("Сортировка");	
	КолонкиОтчета.Колонки.Добавить("ПоказыватьРучныеЗначения");	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланДатыСрезПоследних.Параметр КАК Параметр,
	|	ПланДатыСрезПоследних.НаименованиеПараметра КАК НаименованиеПараметра,
	|	ПланДатыСрезПоследних.ТипКолонки КАК ТипКолонки,
	|	ПланДатыСрезПоследних.ТипРасчетныхЗначений КАК ТипРасчетныхЗначений,
	|	ПланДатыСрезПоследних.ТипРасчетныхЗначений.ТипКолонки КАК ТипРасчетныхЗначенийТипКолонки
	|ИЗ
	|	РегистрСведений.ПланДаты.СрезПоследних КАК ПланДатыСрезПоследних
	|ГДЕ
	|	ПланДатыСрезПоследних.Комплект = НЕОПРЕДЕЛЕНО
	|	И ПланДатыСрезПоследних.Параметр <> ""&&&&""
	|	И ПланДатыСрезПоследних.НаименованиеПараметра ПОДОБНО &ПрефиксКолонки";
	
	Запрос.УстановитьПараметр("ПрефиксКолонки", "НК#" + НомерОтчета + "#%");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Отбор = Новый Структура("НомерКолонки", );
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = ПреробразоватьПараметрКолонкиВСтруктуру(Выборка.НаименованиеПараметра, СписокСПараметрамиИменаОтчетов);
		
		Если СтруктураДанных = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		Отбор.НомерКолонки = СтруктураДанных.НомерКолонки;
		НайденыеСтроки = КолонкиОтчета.НайтиСтроки(Отбор);
		
		Если НайденыеСтроки.Количество() = 0 Тогда
			НС = КолонкиОтчета.Добавить();
			НС.НомерКолонки = Отбор.НомерКолонки;
		Иначе
			НС = НайденыеСтроки[0];
		КонецЕсли;
		
		Если СтруктураДанных.ТипПараметра = "Н" Тогда
			НС.НаименованиеКолонки = Выборка.Параметр;
			НС.ТипКолонки = Выборка.ТипКолонки;
			НС.ТипРасчетногоЗначения = Выборка.ТипРасчетныхЗначений;
			НС.ТипКолонки = ?(ЗначениеЗаполнено(Выборка.ТипРасчетныхЗначений), Выборка.ТипРасчетныхЗначенийТипКолонки, Выборка.ТипКолонки);
		ИначеЕсли СтруктураДанных.ТипПараметра = "Сор" Тогда
			НС.Сортировка = Выборка.Параметр;
		ИначеЕсли СтруктураДанных.ТипПараметра = "РЗ" Тогда
			НС.ПоказыватьРучныеЗначения = Выборка.Параметр;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КолонкиОтчета;	
	
КонецФункции // ПолучитьКолонкиОтчета()

Функция ПолучитьКомплектыПроекта(Проект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Комплект,
		|	ИзделияКомплект.Наименование КАК Наименование,
		|	ИзделияКомплект.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
		|	ИзделияКомплект.Родитель.Композиция КАК РодительКомпозиция,
		|	ИзделияКомплект.ОсновноеПомещение КАК ОсновноеПомещение,
		|	ИзделияКомплект.Родитель.Композиция.ОсновноеПомещение КАК РодительКомпозицияОсновноеПомещение,
		|	ИзделияКомплект.Родитель.Композиция.ГабаритныйЧертеж КАК РодительКомпозицияГабаритныйЧертеж,
		|	ИзделияКомплект.ОсновноеПомещение.НомерПомещения КАК ОсновноеПомещениеНомерПомещения,
		|	ИзделияКомплект.Родитель.ОсновноеПомещение.НомерПомещения КАК РодительОсновноеПомещениеНомерПомещения
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Возврат ПолучитьПродолжительностьПериодов(Запрос.Выполнить().Выгрузить());
	
КонецФункции // ПолучитьКомплектыПроекта()

Функция ПолучитьПродолжительностьПериодов(ТаблицаПроекты)
	
	ОписаниеЧисло = новый ОписаниеТипов("Число");
	
	ТаблицаПроекты.Колонки.Добавить("СрокМонтажаВНеделях", 		ОписаниеЧисло);				
	ТаблицаПроекты.Колонки.Добавить("СрокПроектированияВНеделях", 	ОписаниеЧисло);				
	ТаблицаПроекты.Колонки.Добавить("СрокПроизводстваВНеделях", 	ОписаниеЧисло);				
	ТаблицаПроекты.Индексы.Добавить("Комплект");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СрокиПоДоговору.СрокМонтажаВНеделях КАК СрокМонтажаВНеделях,
		|	СрокиПоДоговору.СрокПроектированияВНеделях КАК СрокПроектированияВНеделях,
		|	СрокиПоДоговору.СрокПроизводстваВНеделях КАК СрокПроизводстваВНеделях,
		|	СрокиПоДоговору.ИзделиеЗаказчика КАК ИзделиеЗаказчика,
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК Комплект
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.СрокиПоДоговору КАК СрокиПоДоговору
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|			ПО ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент = ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент
		|		ПО СрокиПоДоговору.ИзделиеЗаказчика = ИзделияЗаказчикаИзделияЭлемент.Ссылка
		|ГДЕ
		|	ИзделияКомплектИзделияЭлемент.Ссылка В(&Комплект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(вт.СрокМонтажаВНеделях) КАК СрокМонтажаВНеделях,
		|	МИНИМУМ(вт.СрокПроектированияВНеделях) КАК СрокПроектированияВНеделях,
		|	МИНИМУМ(вт.СрокПроизводстваВНеделях) КАК СрокПроизводстваВНеделях,
		|	вт.Комплект КАК Комплект
		|ИЗ
		|	вт КАК вт
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.Комплект";
	
	Запрос.УстановитьПараметр("Комплект", ТаблицаПроекты.ВыгрузитьКолонку("Комплект"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НайденаяСтрока = ТаблицаПроекты.Найти(Выборка.Комплект, "Комплект");	
		ЗаполнитьЗначенияСвойств(НайденаяСтрока, Выборка);
		
	КонецЦикла;
	
	Возврат ТаблицаПроекты;
	
КонецФункции
