
&НаКлиенте
Перем стНачальныеЗначения;

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменилосьПомещение",Новый Структура("Помещение,Проект",Объект.Ссылка,Объект.Проект),ЭтаФорма);
	
	ВыгружатьВБитрикс = Ложь;
	
	Если НЕ (стНачальныеЗначения.Проект = Объект.Проект И стНачальныеЗначения.Наименование = Объект.Наименование) Тогда
		Если ЗначениеЗаполнено(Объект.Проект) Тогда
			ПроверитьКаталогИзделия(Объект.Проект,Объект.Ссылка);	
		КонецЕсли;
		ВыгружатьВБитрикс = Истина;
	КонецЕсли;
	
	Если ВыгружатьВБитрикс Тогда
	
		ВыгрузитьНаСервереВБитрикс();		
	
	КонецЕсли;
КонецПроцедуры 

Процедура ВыгрузитьНаСервереВБитрикс()

	УстановитьПривилегированныйРежим(Истина);
	
	текОбъект = РеквизитФормыВЗначение("Объект");
	
	Отказ = Ложь;
	Б24_СМ_РегистрацияИзмененийСервер.ЗарегистрироватьИзменения(текОбъект, Ложь, Отказ);

КонецПроцедуры // ВыгрузитьНаСервереВБитрикс()

&НаСервереБезКонтекста
Процедура ПроверитьКаталогИзделия(ОбъектПомещение,СсылкаНаПомещения)

	Справочники.Помещения.ПроверитьКаталогИзделия(ОбъектПомещение,СсылкаНаПомещения);		

КонецПроцедуры // ПроверитьРасположениеОбъекта()
 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Объект") Тогда
		Объект.Объект = Параметры.Объект;
	КонецЕсли;
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		ПолучитьИзделиеКомплект();
		ПолучитьДатуПриемки();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование = ПолучитьНаименованиеПомещения(Объект.Проект, СокрЛП(Объект.НомерПомещения), СокрЛП(Объект.НаименованиеБезКода));
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьНаименованиеПомещения(Сделка, НомерПомещения, НаименованиеБезКода)

	Возврат Справочники.Помещения.ПолучитьНаименованиеПомещения(Сделка,,НомерПомещения,НаименованиеБезКода);	

КонецФункции // ПолучитьНомерСделки()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	стНачальныеЗначения = Новый Структура("Наименование,Проект"
										,Объект.Наименование
										,Объект.Проект);
КонецПроцедуры    
									

Функция ПолучитьДатуПриемки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеЗамера.ОбъектИзменения КАК Документ,
		|	СостояниеЗамера.Период КАК Дата,
		|	СостояниеЗамера.СтатусЗамера КАК Статус
		|ИЗ
		|	РегистрСведений.СостояниеЗамера КАК СостояниеЗамера
		|ГДЕ
		|	СостояниеЗамера.ОбъектЗамера = &Помещение
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Помещение", Объект.Ссылка);
	
	Замеры.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецФункции // ПолучитьИзделиеКомплект()
									
Функция ПолучитьИзделиеКомплект()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплектИзделияЭлемент.Основное КАК Основной,
		|	ИзделияКомплектИзделияЭлемент.Ссылка.НаименованиеКомплекта КАК ИзделиеКомплектНаименование,
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК ИзделиеКомплект,
		|	ИзделияКомплектИзделияЭлемент.Ссылка.ГабаритныйЧертеж КАК ГабаритныйЧертеж
		|ИЗ
		|	Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|ГДЕ
		|	ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент.Помещения = &Помещения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзделияКомплектИзделияЭлемент.Основное УБЫВ,
		|	ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент.Помещения.Наименование";
	
	Запрос.УстановитьПараметр("Помещения", Объект.Ссылка);
	
		ЭтаФорма.тзКомплекты.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецФункции // ПолучитьИзделиеКомплект()

&НаКлиенте
Процедура тзКомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
									
&НаКлиенте
Процедура тзКомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура тзКомплектыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТД = Элементы.тзКомплекты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.тзКомплекты.ТекущийЭлемент.Имя = "тзКомплектыГабаритныйЧертеж" Тогда
		ПоказатьЗначение(, ТД.ГабаритныйЧертеж);
	Иначе	
		ПоказатьЗначение(, ТД.ИзделиеКомплект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗамерыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗамерыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

									
									
