
&НаКлиенте
Процедура СтатусыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтатусыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтатусыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойЭтапПриИзменении(Элемент)
	Статусы.ЗагрузитьЗначения(ПолучитьСтатусыЭтапа(ОсновнойЭтап));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Комплект = Параметры.Комплект;
	
	Если ТипЗнч(Комплект) = Тип("СправочникСсылка.Композиции") Тогда
		Элементы.Комплект.Заголовок = "Композиция";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатусыЭтапа(ОсновнойЭтап)


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплекта.Ссылка КАК Статус,
		|	СтадииКомплекта.Родитель КАК Родитель
		|ИЗ
		|	Справочник.СтадииКомплекта КАК СтадииКомплекта
		|ГДЕ
		|	СтадииКомплекта.ОсновнойЭтап = &ОсновнойЭтап
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтадииКомплекта.НомерПоПорядку";
	
	Запрос.УстановитьПараметр("ОсновнойЭтап", ОсновнойЭтап);
	
	ТаблицаСтатусов = Запрос.Выполнить().Выгрузить();
	
	МассивСтатусовВозврата = Новый Массив;
	
	Для каждого ТекущийСтатус Из ТаблицаСтатусов Цикл
	
		НайденаяСтрока = ТаблицаСтатусов.Найти(ТекущийСтатус.Статус, "Родитель");
		
		Если НайденаяСтрока = Неопределено И МассивСтатусовВозврата.Найти(ТекущийСтатус.Статус) = Неопределено Тогда
		
			МассивСтатусовВозврата.Добавить(ТекущийСтатус.Статус);	
		
		КонецЕсли;
	
	КонецЦикла;
	
	
	Возврат МассивСтатусовВозврата;

КонецФункции // ПолучитьСтатусыЭтапа()

