
&НаКлиенте
Процедура СтатусыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтатусыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтатусыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		НовыйСтатус 				= Неопределено;
		НовыйСтатусПредставление 	= "";
		
		Элементы.ГруппаСтатусы.Видимость = Ложь;
		
	Иначе	
		НовыйСтатус 				= Элемент.ТекущиеДанные.Значение;
		НовыйСтатусПредставление 	= Элемент.ТекущиеДанные.Представление;
		
		ТаблицаСтатусов.Очистить();
		ЗаполнитьСтатусыНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтатусыНаСервере()

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплектаРеквизитыСтадии.Статус КАК Статус,
		|	СтадииКомплектаРеквизитыСтадии.ТипЗадачи КАК ТипЗадачи,
		|	СтадииКомплектаРеквизитыСтадии.Состояние КАК Состояние
		|ИЗ
		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|ГДЕ
		|	СтадииКомплектаРеквизитыСтадии.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", НовыйСтатус);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоСтатусов = Выборка.Количество();
	
	Статус 		= Перечисления.СтатусыЗадач.ПустаяСсылка();
	ТипЗадачи 	= Перечисления.ТипыЗадачКонструирования.ПустаяСсылка();
	Состояние 	= Перечисления.СостоянияЗадач.ПустаяСсылка();
	
	Если КоличествоСтатусов = 0 Тогда
		
		Элементы.ГруппаСтатусы.Видимость 	= Ложь;
		
	ИначеЕсли КоличествоСтатусов = 1 Тогда
		
		Элементы.ГруппаСтатусы.Видимость 	= Истина;      
		Элементы.ТаблицаСтатусов.Видимость 	= Ложь;
		
		Выборка.Следующий();
		
		Статус 		= Выборка.Статус;
		ТипЗадачи 	= Выборка.ТипЗадачи;
		Состояние 	= Выборка.Состояние;
		
	Иначе
		
		Элементы.ГруппаСтатусы.Видимость 	= Истина;      
		Элементы.ТаблицаСтатусов.Видимость 	= Истина;
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаСтатусов.Добавить(), Выборка);
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойЭтапПриИзменении(Элемент)
	Статусы.Очистить();
	Для каждого ЭлементСтатус Из ПолучитьСтатусыЭтапа(ОсновнойЭтап) Цикл
		Статусы.Добавить(ЭлементСтатус.Значение, ЭлементСтатус.Представление);
	КонецЦикла;
	
	Статусы.СортироватьПоПредставлению();
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Комплект = Параметры.Комплект;
	
	Если ТипЗнч(Комплект) = Тип("СправочникСсылка.Композиции") Тогда
		Элементы.Комплект.Заголовок = "Композиция";
	КонецЕсли;
	
	Элементы.ГруппаСтатусы.Видимость = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекущаяСтадия = Выборка.ТекущаяСтадия;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатусыЭтапа(ОсновнойЭтап)


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплекта.Ссылка КАК Статус,
		|	СтадииКомплекта.Родитель КАК Родитель,
		|	СтадииКомплекта.ПолноеНаименование КАК ПолноеНаименование
		|ИЗ
		|	Справочник.СтадииКомплекта КАК СтадииКомплекта
		|ГДЕ
		|	СтадииКомплекта.ОсновнойЭтап = &ОсновнойЭтап
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтадииКомплекта.НомерПоПорядку";
	
	Запрос.УстановитьПараметр("ОсновнойЭтап", ОсновнойЭтап);
	
	ТаблицаСтатусовЭтапы = Запрос.Выполнить().Выгрузить();
	
	СписокСтатусовВозврата = Новый СписокЗначений;
	
	Для каждого ТекущийСтатус Из ТаблицаСтатусовЭтапы Цикл
	
		НайденаяСтрока = ТаблицаСтатусовЭтапы.Найти(ТекущийСтатус.Статус, "Родитель");
		
		Если НайденаяСтрока = Неопределено И СписокСтатусовВозврата.НайтиПоЗначению(ТекущийСтатус.Статус) = Неопределено Тогда
		
			СписокСтатусовВозврата.Добавить(ТекущийСтатус.Статус, ТекущийСтатус.ПолноеНаименование);	
		
		КонецЕсли;
	
	КонецЦикла;
	
	
	Возврат СписокСтатусовВозврата;

КонецФункции // ПолучитьСтатусыЭтапа()

&НаКлиенте
Процедура ТаблицаСтатусовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтатусовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтатусовПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	ТД = Элементы.ТаблицаСтатусов.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Статус 		= ТД.Статус;
	ТипЗадачи 	= ТД.ТипЗадачи;
	Состояние 	= ТД.Состояние;
	
КонецПроцедуры

&НаСервере
Функция ПереместитьНаСервере()
	
	Если ОсновнойЭтап = Перечисления.ОсновныеЭтапы.ПКД Тогда
	
		Возврат ПереносВПКД();	
	
	Иначе
	
		
	
	КонецЕсли;
	
КонецФункции

Функция ПереносВПКД()

	Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
		Возврат "Не заполнен исполнитель."
	КонецЕсли;
	
	ЗавершитьПроизводство();
	УдалитьРКД();
	СоздатьПКД();

КонецФункции //ПереносВПКД

Процедура СоздатьПКД()

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК ЗадачиПКД,
		|	Задачи_ПКД.Выполнена КАК Выполнена
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.ОбъектТЗ = &Комплект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Выполнена";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		
		стПараметры 	= омЗадачиПКДСервер.ПолучитьСтркутуркДляСозданияПКД(Комплект, Комплект.Проект);
		СсылкаНаЗадачу 	= омЗадачиПКДСервер.СоздатьЗадачуПКД(Комплект, Исполнитель, стПараметры);
		
	Иначе
		СсылкаНаЗадачу = Задачи.Задачи_ПКД.ПустаяСсылка();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Выполнена Тогда
				ЗадачаОбъект = СсылкаНаЗадачу.ПолучитьОбъект();
				ЗадачаОбъект.Выполнена 	= Ложь; 
				
				ЗадачаОбъект.Записать();
			КонецЕсли; 
			
			Прервать;
			
		КонецЦикла;
		
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Автор 		= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Задача 		= СсылкаНаЗадачу;
	МенеджерЗаписи.Исполнитель 	= Исполнитель;
	МенеджерЗаписи.Период		= ТекущаяДата();
	МенеджерЗаписи.Состояние	= Состояние;
	МенеджерЗаписи.Статус		= Статус;
	МенеджерЗаписи.ТипЗадачи	= ТипЗадачи;
	МенеджерЗаписи.Записать();
	
	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(СсылкаНаЗадачу);
	
КонецПроцедуры

Процедура УдалитьРКД()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Задачи_РКД.Ссылка КАК ЗадачаРКД
	|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ = &Комплект
		|	И НЕ Задачи_РКД.Выполнена";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗадачаОбъект = Выборка.ЗадачаРКД.ПолучитьОбъект();
		ЗадачаОбъект.Выполнена = Истина;
		ЗадачаОбъект.Записать();
	КонецЦикла;
	

КонецПроцедуры


Процедура ЗавершитьПроизводство()
	
	УИДДоскиДляТЗ = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиДляТЗ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКарточки.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|ГДЕ
		|	КанбанКарточки.Ресурс = &Ресурс
		|	И КанбанКарточки.Доска = &Доска";
	
	Запрос.УстановитьПараметр("Доска", УИДДоскиДляТЗ);
	Запрос.УстановитьПараметр("Ресурс", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	омКанбанПроизводство.ПеревестиРеквизитВЗавершенный(Комплект, "Ручное изменение статуса.");
	
КонецПроцедуры


&НаКлиенте
Процедура Переместить(Команда)
	
	СтрокаОшибка = ПереместитьНаСервере();
	
	Если НЕ ПустаяСтрока(СтрокаОшибка) Тогда
		ПоказатьПредупреждение(, СтрокаОшибка); 
	КонецЕсли; 
	
	Оповестить("ИзменилсяСтатусКомплекта", Новый Структура("Комплект", Комплект));
	
	Закрыть();
	
КонецПроцедуры


