
&НаКлиенте
Процедура СтатусыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтатусыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтатусыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		НовыйСтатус 				= Неопределено;
		НовыйСтатусПредставление 	= "";
		
		Элементы.ГруппаСтатусы.Видимость = Ложь;
		
	Иначе	
		НовыйСтатус 				= Элемент.ТекущиеДанные.Значение;
		НовыйСтатусПредставление 	= Элемент.ТекущиеДанные.Представление;
		
		ТаблицаСтатусов.Очистить();
		ЗаполнитьСтатусыНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтатусыНаСервере()

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплектаРеквизитыСтадии.Статус КАК Статус,
		|	СтадииКомплектаРеквизитыСтадии.ТипЗадачи КАК ТипЗадачи,
		|	СтадииКомплектаРеквизитыСтадии.Состояние КАК Состояние
		|ИЗ
		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|ГДЕ
		|	СтадииКомплектаРеквизитыСтадии.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", НовыйСтатус);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоСтатусов = Выборка.Количество();
	
	Статус 		= Перечисления.СтатусыЗадач.ПустаяСсылка();
	ТипЗадачи 	= Перечисления.ТипыЗадачКонструирования.ПустаяСсылка();
	Состояние 	= Перечисления.СостоянияЗадач.ПустаяСсылка();
	
	Если КоличествоСтатусов = 0 Тогда
		
		Элементы.ГруппаСтатусы.Видимость 	= Ложь;
		
	ИначеЕсли КоличествоСтатусов = 1 Тогда
		
		Элементы.ГруппаСтатусы.Видимость 	= Истина;      
		Элементы.ТаблицаСтатусов.Видимость 	= Ложь;
		
		Выборка.Следующий();
		
		Статус 		= Выборка.Статус;
		ТипЗадачи 	= Выборка.ТипЗадачи;
		Состояние 	= Выборка.Состояние;
		
	Иначе
		
		Элементы.ГруппаСтатусы.Видимость 	= Истина;      
		Элементы.ТаблицаСтатусов.Видимость 	= Истина;
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаСтатусов.Добавить(), Выборка);
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойЭтапПриИзменении(Элемент)
	Статусы.Очистить();
	Для каждого ЭлементСтатус Из ПолучитьСтатусыЭтапа(ОсновнойЭтап) Цикл
		Статусы.Добавить(ЭлементСтатус.Значение, ЭлементСтатус.Представление);
	КонецЦикла;
	
	Статусы.СортироватьПоПредставлению();
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Комплект = Параметры.Комплект;
	
	Если ТипЗнч(Комплект) = Тип("СправочникСсылка.Композиции") Тогда
		Элементы.Комплект.Заголовок = "Композиция";
		ЗаполнитьКомплекты();
	Иначе
		Элементы.ГруппаДанныеКомпозиции.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаСтатусы.Видимость = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекущаяСтадия = Выборка.ТекущаяСтадия;
	КонецЦикла;
	
КонецПроцедуры 

Процедура ЗаполнитьКомплекты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Комплект,
		|	ДанныеКомплекта.Конструктор КАК Конструктор,
		|	ДанныеКомплекта.ТекущаяСтадия КАК ТекущаяСтадия,
		|	ИСТИНА КАК ВыборКомплекта,
		|	ДанныеКомплекта.ТекущаяСтадия.ПолноеНаименование КАК ТекущаяСтадияПолноеНаименование
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплекта
		|		ПО (ДанныеКомплекта.Комплект = ИзделияКомплект.Ссылка)
		|ГДЕ
		|	ИзделияКомплект.Родитель.Композиция = &Композиция
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзделияКомплект.Наименование";
	
	Запрос.УстановитьПараметр("Композиция", Комплект);
	
	ТаблицаКомплектов.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатусыЭтапа(ОсновнойЭтап)


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплекта.Ссылка КАК Статус,
		|	СтадииКомплекта.Родитель КАК Родитель,
		|	СтадииКомплекта.ПолноеНаименование КАК ПолноеНаименование
		|ИЗ
		|	Справочник.СтадииКомплекта КАК СтадииКомплекта
		|ГДЕ
		|	СтадииКомплекта.ОсновнойЭтап = &ОсновнойЭтап
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтадииКомплекта.НомерПоПорядку";
	
	Запрос.УстановитьПараметр("ОсновнойЭтап", ОсновнойЭтап);
	
	ТаблицаСтатусовЭтапы = Запрос.Выполнить().Выгрузить();
	
	СписокСтатусовВозврата = Новый СписокЗначений;
	
	Для каждого ТекущийСтатус Из ТаблицаСтатусовЭтапы Цикл
	
		НайденаяСтрока = ТаблицаСтатусовЭтапы.Найти(ТекущийСтатус.Статус, "Родитель");
		
		Если НайденаяСтрока = Неопределено И СписокСтатусовВозврата.НайтиПоЗначению(ТекущийСтатус.Статус) = Неопределено Тогда
		
			СписокСтатусовВозврата.Добавить(ТекущийСтатус.Статус, ТекущийСтатус.ПолноеНаименование);	
		
		КонецЕсли;
	
	КонецЦикла;
	
	
	Возврат СписокСтатусовВозврата;

КонецФункции // ПолучитьСтатусыЭтапа()

&НаКлиенте
Процедура ТаблицаСтатусовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтатусовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтатусовПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	ТД = Элементы.ТаблицаСтатусов.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Статус 		= ТД.Статус;
	ТипЗадачи 	= ТД.ТипЗадачи;
	Состояние 	= ТД.Состояние;
	
КонецПроцедуры

Функция ПереместитьНаСервере()
	
	Если ОсновнойЭтап = Перечисления.ОсновныеЭтапы.ПКД Тогда
		
		СтрокаОшибки = ПереносВПКД(Комплект);	
		
		Если НЕ ПустаяСтрока(СтрокаОшибки) Тогда
		
			Возврат СтрокаОшибки;
		
		КонецЕсли;
		
		Для каждого х Из ТаблицаКомплектов Цикл
		
			Если х.ВыборКомплекта Тогда
			
				СтрокаОшибки = ПереносВПКД(х.Комплект);	
			
				Если НЕ ПустаяСтрока(СтрокаОшибки) Тогда
					
					Возврат СтрокаОшибки;
					
				КонецЕсли;
			КонецЕсли;	
		
		КонецЦикла;
	
	Иначе
	
		
	
	КонецЕсли;
	
	
КонецФункции

Функция ПереносВПКД(текКомплект)

	Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
		Возврат "Не заполнен исполнитель."
	КонецЕсли;
	
	ЗавершитьПроизводство(текКомплект);
	УдалитьРКД(текКомплект);
	СоздатьПКД(текКомплект);

КонецФункции //ПереносВПКД

Процедура СоздатьПКД(текКомплект)

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК ЗадачиПКД,
		|	Задачи_ПКД.Выполнена КАК Выполнена
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.ОбъектТЗ = &Комплект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Выполнена";
	
	Запрос.УстановитьПараметр("Комплект", текКомплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		
		стПараметры 	= омЗадачиПКДСервер.ПолучитьСтркутуркДляСозданияПКД(текКомплект, текКомплект.Проект); 
		стПараметры.Вставить("Статус", 		Статус);
		стПараметры.Вставить("Состояние", 	Состояние);
		стПараметры.Вставить("ТипЗадачи", 	ТипЗадачи);
		СсылкаНаЗадачу 	= омЗадачиПКДСервер.СоздатьЗадачуПКД(текКомплект, Исполнитель, стПараметры);
		
	Иначе
		СсылкаНаЗадачу = Задачи.Задачи_ПКД.ПустаяСсылка();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Выполнена Тогда
				ЗадачаОбъект = СсылкаНаЗадачу.ПолучитьОбъект();
				ЗадачаОбъект.Выполнена 	= Ложь; 
				
				ЗадачаОбъект.Записать();
			КонецЕсли; 
			
			Прервать;
			
		КонецЦикла;
		
	КонецЕсли;
	
	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(СсылкаНаЗадачу);
	
КонецПроцедуры

Процедура УдалитьРКД(текКомплект)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Задачи_РКД.Ссылка КАК ЗадачаРКД
	|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ = &Комплект
		|	И НЕ Задачи_РКД.Выполнена";
	
	Запрос.УстановитьПараметр("Комплект", текКомплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗадачаОбъект = Выборка.ЗадачаРКД.ПолучитьОбъект();
		ЗадачаОбъект.Выполнена = Истина;
		ЗадачаОбъект.Записать();
	КонецЦикла;
	

КонецПроцедуры

Процедура ЗавершитьПроизводство(текКомплект)
	
	УИДДоскиДляТЗ = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиДляТЗ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКарточки.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|ГДЕ
		|	КанбанКарточки.Ресурс = &Ресурс
		|	И КанбанКарточки.Доска = &Доска";
	
	Запрос.УстановитьПараметр("Доска", УИДДоскиДляТЗ);
	Запрос.УстановитьПараметр("Ресурс", текКомплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	омКанбанПроизводство.ПеревестиРеквизитВЗавершенный(текКомплект, "Ручное изменение статуса.");
	
КонецПроцедуры


&НаКлиенте
Процедура Переместить(Команда)
	
	Если НЕ ЗначениеЗаполнено(НовыйСтатус) Тогда
		ПоказатьПредупреждение(, "Не заполнен новый статус");
		Возврат;
	КонецЕсли;
	
	СтрокаОшибка = ПереместитьНаСервере();
	
	Если НЕ ПустаяСтрока(СтрокаОшибка) Тогда
		ПоказатьПредупреждение(, СтрокаОшибка); 
	КонецЕсли; 
	
	Оповестить("ИзменилсяСтатусКомплекта", Новый Структура("Комплект", Комплект));
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКомплектовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКомплектовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКомплектовПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = НЕ Элемент.ТекущийЭлемент.Имя = "ТаблицаКомплектовВыбор";
	
	Если Элемент.ТекущийЭлемент.Имя = "ТаблицаКомплектовКомплект" Тогда
		
		ТД = Элементы.ТаблицаКомплектов.ТекущиеДанные;
		
		Если ТД = Неопределено Тогда
		
			Возврат;	
		
		КонецЕсли;
		
		ПоказатьЗначение(, ТД.Комплект);
	
	КонецЕсли;
	
КонецПроцедуры


