Процедура СохранитьНаСервере()
	
	ПустойПользователь = Справочники.Пользователи.ПустаяСсылка();
	ЗаписатьЗначения("ТаблицаКнопокПКД", 		"ПКД_", 	ПустойПользователь);
	ЗаписатьЗначения("ТаблицаКнопокРКД", 		"РКД_", 	ПустойПользователь);
	ЗаписатьЗначения("ТаблицаКнопокСостояния", 	"Сост_", 	ПустойПользователь);
	
КонецПроцедуры 

Процедура ЗаписатьЗначения(НаименованиеТаблицы, ТипТаблицы, ПустойПользователь)

	ТЗ = РеквизитФормыВЗначение(НаименованиеТаблицы);
	
	Для каждого СтрокаТаблицы Из ТЗ Цикл
		Если НЕ СтрокаТаблицы.Изменена Тогда
			Продолжить;	
		КонецЕсли;
		
		СтрокаТаблицы.Изменена = Ложь;
		
		ИмяНастройки 	= "СчетчикиКнопки_" + ТипТаблицы + СтрокаТаблицы.Наименование;
		
		Для х = 1 По ТЗ.Колонки.Количество() - 1 Цикл
			
			МенеджерЗаписи = РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ИмяНастройки 	= ИмяНастройки;
			МенеджерЗаписи.НомерНастройки 	= х - 1;
			МенеджерЗаписи.Значение			= СтрокаТаблицы[ТЗ.Колонки.Получить(х).Имя];
			МенеджерЗаписи.Записать(); 
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТЗ, НаименованиеТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

Процедура ЗаполнитьНаименование()
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	СоздатьКолонки("ТаблицаКнопокПКД", 			омЗадачиОбщие.КолонкиТаблицаКнопокПКД(), 		ТипБулево);
	СоздатьКолонки("ТаблицаКнопокРКД", 			омЗадачиОбщие.КолонкиТаблицаКнопокРКД(), 		ТипБулево);
	СоздатьКолонки("ТаблицаКнопокСостояния", 	омЗадачиОбщие.КолонкиТаблицаКнопокСостояние(), 	ТипБулево);
	
	ЗаполнитьТаблицу(омЗадачиОбщие.ПолучитьНаименованиеПКД(), 		"ПКД_",  "ТаблицаКнопокПКД");
	ЗаполнитьТаблицу(омЗадачиОбщие.ПолучитьНаименованиеРКД(), 		"РКД_",  "ТаблицаКнопокРКД");
	ЗаполнитьТаблицу(омЗадачиОбщие.ПолучитьНаименованиеСостояний(), "Сост_", "ТаблицаКнопокСостояния");
                                                                                                                    
КонецПроцедуры // ПолучитьТаблицу()

Процедура СоздатьКолонки(ТаблицаФормы, ИменаКолонок, ТипБулево)

	Реквизиты = Новый Массив; 
	
	Для Каждого ИмяКолонки ИЗ ИменаКолонок Цикл
		Реквизиты.Добавить(Новый РеквизитФормы(СтрЗаменить(ИмяКолонки, " ", "_"), ТипБулево, ТаблицаФормы));
	КонецЦикла;
	
	ИзменитьРеквизиты(Реквизиты);
	
	Для Каждого ИмяКолонки ИЗ ИменаКолонок Цикл
		
		ДанныеКолонки = СтрЗаменить(ИмяКолонки, " ", "_");
		
		Рек = Элементы.Добавить(ТаблицаФормы + ДанныеКолонки, Тип("ПолеФормы"), Элементы[ТаблицаФормы]);
		Рек.Вид = ВидПоляФормы.ПолеФлажка;
		Рек.ПутьКДанным = ТаблицаФормы + "." + ДанныеКолонки;
		Рек.Заголовок = ИмяКолонки;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ЗаполнитьТаблицу(НаименованиеКнопок, ТипТаблицы, НаименованиеТаблицы)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.НомерНастройки КАК НомерНастройки
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&НаименованиеДанных)
		|	И НастройкиПроекта.Значение = ИСТИНА";
	
	Запрос.УстановитьПараметр("НаименованиеДанных", НаименованиеКнопок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТЗ = РеквизитФормыВЗначение(НаименованиеТаблицы);
	
	Для каждого х Из НаименованиеКнопок Цикл
		
		НС = ТЗ.Добавить();
		НС.Наименование = СтрЗаменить(х, "СчетчикиКнопки_" + ТипТаблицы, "");
		
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл 
		
		Наименование = СтрЗаменить(Выборка.ИмяНастройки, "СчетчикиКнопки_" + ТипТаблицы, "");
		
		НайденаяСтрока = ТЗ.Найти(Наименование, "Наименование");
		
		НайденаяСтрока[ТЗ.Колонки.Получить(Выборка.НомерНастройки + 1).Имя] = Истина;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТЗ, НаименованиеТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокПКДПриИзменении(Элемент)
	ТД = Элементы.ТаблицаКнопокПКД.ТекущиеДанные;
	Если НЕ ТД = Неопределено Тогда
		ТД.Изменена = Истина;
		Элементы.ФормаСохранить.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокРКДПриИзменении(Элемент)
	ТД = Элементы.ТаблицаКнопокРКД.ТекущиеДанные;
	Если НЕ ТД = Неопределено Тогда
		ТД.Изменена = Истина;
		Элементы.ФормаСохранить.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокСостоянияПриИзменении(Элемент)
	ТД = Элементы.ТаблицаКнопокСостояния.ТекущиеДанные;
	Если НЕ ТД = Неопределено Тогда
		ТД.Изменена = Истина;
		Элементы.ФормаСохранить.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокПКДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокПКДПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаКнопокРКДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокРКДПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокСостоянияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокСостоянияПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНаименование();
КонецПроцедуры



