
&НаКлиенте
Процедура ТаблицаКнопокПКДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокПКДПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

Процедура СохранитьНаСервере()
	
	ПустойПользователь = Справочники.Пользователи.ПустаяСсылка();
	ЗаписатьЗначения("ТаблицаКнопокПКД", 		"ПКД_", 	ПустойПользователь);
	ЗаписатьЗначения("ТаблицаКнопокРКД", 		"РКД_", 	ПустойПользователь);
	ЗаписатьЗначения("ТаблицаКнопокСостояния", 	"Сост_", 	ПустойПользователь);
	
КонецПроцедуры 

Процедура ЗаписатьЗначения(НаименованиеТаблицы, ТипТаблицы, ПустойПользователь)

	ТЗ = РеквизитФормыВЗначение(НаименованиеТаблицы);
	
	Для каждого СтрокаТаблицы Из ТЗ Цикл
		Если НЕ СтрокаТаблицы.Изменена Тогда
			Продолжить;	
		КонецЕсли;
		
		СтрокаТаблицы.Изменена = Ложь;
		
		ИмяНастройки 	= "СчетчикиКнопки_" + ТипТаблицы + СтрокаТаблицы.Наименование;
		
		Для х = 1 По ТЗ.Колонки.Количество() - 1 Цикл
			
			МенеджерЗаписи = РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ИмяНастройки 	= ИмяНастройки;
			МенеджерЗаписи.НомерНастройки 	= х - 1;
			МенеджерЗаписи.Значение			= СтрокаТаблицы[ТЗ.Колонки.Получить(х).Имя];
			МенеджерЗаписи.Записать(); 
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТЗ, НаименованиеТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокПКДПриИзменении(Элемент)
	ТД = Элементы.ТаблицаКнопокПКД.ТекущиеДанные;
	Если НЕ ТД = Неопределено Тогда
		ТД.Изменена = Истина;
		Элементы.ФормаСохранить.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКнопокРКДПриИзменении(Элемент)
	ТД = Элементы.ТаблицаКнопокРКД.ТекущиеДанные;
	Если НЕ ТД = Неопределено Тогда
		ТД.Изменена = Истина;
		Элементы.ФормаСохранить.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьНаименование();
КонецПроцедуры

Процедура ЗаполнитьНаименование()
	
	ЗаполнитьТаблицу(ПолучитьНаименованиеПКД(), 		"ПКД_",  "ТаблицаКнопокПКД");
	ЗаполнитьТаблицу(ПолучитьНаименованиеРКД(), 		"РКД_",  "ТаблицаКнопокРКД");
	ЗаполнитьТаблицу(ПолучитьНаименованиеСостояний(), 	"Сост_", "ТаблицаКнопокСостояния");

КонецПроцедуры // ПолучитьТаблицу()

Процедура ЗаполнитьТаблицу(НаименованиеКнопок, ТипТаблицы, НаименованиеТаблицы)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.НомерНастройки КАК НомерНастройки
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&НаименованиеДанных)
		|	И НастройкиПроекта.Значение = ИСТИНА";
	
	Запрос.УстановитьПараметр("НаименованиеДанных", НаименованиеКнопок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТЗ = РеквизитФормыВЗначение(НаименованиеТаблицы);
	
	Для каждого х Из НаименованиеКнопок Цикл
		
		НС = ТЗ.Добавить();
		НС.Наименование = СтрЗаменить(х, "СчетчикиКнопки_" + ТипТаблицы, "");
		
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл 
		
		Наименование = СтрЗаменить(Выборка.ИмяНастройки, "СчетчикиКнопки_" + ТипТаблицы, "");
		
		НайденаяСтрока = ТЗ.Найти(Наименование, "Наименование");
		
		НайденаяСтрока[ТЗ.Колонки.Получить(Выборка.НомерНастройки + 1).Имя] = Истина;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТЗ, НаименованиеТаблицы);

КонецПроцедуры

Функция ПолучитьНаименованиеПКД()

	НаименованиеКнопокПКД = Новый Массив(20);
	
	НаименованиеКнопокПКД[0]  = "СчетчикиКнопки_ПКД_ДоработкаДизайнера";
	НаименованиеКнопокПКД[1]  = "СчетчикиКнопки_ПКД_КорректировкаДизайнер";
	НаименованиеКнопокПКД[2]  = "СчетчикиКнопки_ПКД_ВнешнееСоглосование";
	НаименованиеКнопокПКД[3]  = "СчетчикиКнопки_ПКД_Запрос";
	НаименованиеКнопокПКД[4]  = "СчетчикиКнопки_ПКД_Согласовано";
	НаименованиеКнопокПКД[5]  = "СчетчикиКнопки_ПКД_РекламацияДизайнер";
	НаименованиеКнопокПКД[6]  = "СчетчикиКнопки_ПКД_РедакцияДизайнер";
	НаименованиеКнопокПКД[7]  = "СчетчикиКнопки_ПКД_КонтрольКП";
	НаименованиеКнопокПКД[8]  = "СчетчикиКнопки_ПКД_ВозвратССогласования";
	НаименованиеКнопокПКД[9]  = "СчетчикиКнопки_ПКД_ВозвратСЗапроса";
	НаименованиеКнопокПКД[10] = "СчетчикиКнопки_ПКД_СогласованоМенеджер";
	НаименованиеКнопокПКД[11] = "СчетчикиКнопки_ПКД_НачатьВыполнениеКонструктор";
	НаименованиеКнопокПКД[12] = "СчетчикиКнопки_ПКД_ЗавершитьВыполнениеКонструктор";
	НаименованиеКнопокПКД[13] = "СчетчикиКнопки_ПКД_ПриостановитьКонструктор";
	НаименованиеКнопокПКД[14] = "СчетчикиКнопки_ПКД_СбросКонструктором";
	НаименованиеКнопокПКД[15] = "СчетчикиКнопки_ПКД_ДоработкаВедущийКонструктор";
	НаименованиеКнопокПКД[16] = "СчетчикиКнопки_ПКД_КонтрольВедущийКонструктор";
	НаименованиеКнопокПКД[17] = "СчетчикиКнопки_ПКД_СогласованоСИзменением";
	НаименованиеКнопокПКД[18] = "СчетчикиКнопки_ПКД_СогласованоБезИзменений";
	НаименованиеКнопокПКД[19] = "СчетчикиКнопки_ПКД_ОтменаИзделия";
	
	Возврат НаименованиеКнопокПКД;

КонецФункции // ПолучитьНаименованиеПКД()

Функция ПолучитьНаименованиеРКД()

	НаименованиеКнопокПКД = Новый Массив(6);
	
	НаименованиеКнопокПКД[0] = "СчетчикиКнопки_РКД_НачатьВыполнениеКонструктор";
	НаименованиеКнопокПКД[1] = "СчетчикиКнопки_РКД_ЗавершитьВыполнениеКонструктор";
	НаименованиеКнопокПКД[2] = "СчетчикиКнопки_РКД_ПриостановитьКонструктор";
	НаименованиеКнопокПКД[3] = "СчетчикиКнопки_РКД_СбросКонструктором";
	НаименованиеКнопокПКД[4] = "СчетчикиКнопки_РКД_ДоработкаВедущийКонструктор";
	НаименованиеКнопокПКД[5] = "СчетчикиКнопки_РКД_УтвердитьВедущийКонструктор";
	
	Возврат НаименованиеКнопокПКД;

КонецФункции // ПолучитьНаименованиеПКД()

Функция ПолучитьНаименованиеСостояний()

	НаименованиеКнопокПКД = Новый Массив(4);
	
	НаименованиеКнопокПКД[0] = "СчетчикиКнопки_Сост_СтопНачало";
	НаименованиеКнопокПКД[1] = "СчетчикиКнопки_Сост_СтопОстановка";
	НаименованиеКнопокПКД[2] = "СчетчикиКнопки_Сост_РекламацияНачало";
	НаименованиеКнопокПКД[3] = "СчетчикиКнопки_Сост_РекламацияОстановка";
	
	Возврат НаименованиеКнопокПКД;

КонецФункции // ПолучитьНаименованиеПКД()


