
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ПриИзмененииНаСервере();
	
	Если ИмяСобытия = "ИзменениеПКД" Тогда
	
		Элементы.Список.Обновить();	
	
	КонецЕсли;
		
КонецПроцедуры 

&НаСервере
Процедура ПриИзмененииНаСервере()
	Список.Параметры.УстановитьЗначениеПараметра("ОбобщеннаяЗадача", Объединять);
	Список.Параметры.УстановитьЗначениеПараметра("НеВыполнена", НеВыполненые);
КонецПроцедуры

&НаКлиенте
Процедура НеВыполненыеПриИзменении(Элемент)
	ПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбъединятьПриИзменении(Элемент)
	ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда
	
		Элементы.СтатусЗадачи.Видимость = Ложь;	
		Элементы.ТипЗадачи.Видимость 	= Ложь;	
		Элементы.Состояние.Видимость 	= Ложь;	
	
	КонецЕсли;
	
КонецПроцедуры


