&НаКлиенте
Перем ЗавершениеРаботыПриложения;

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если НЕ ЗавершениеРаботыПриложения Тогда
		
		ПриИзмененииНаСервере();
		
		Если ИмяСобытия = "ИзменениеПКД" Тогда
			
			Элементы.Список.Обновить();	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры




&НаСервере
Процедура ПриИзмененииНаСервере()
	Список.Параметры.УстановитьЗначениеПараметра("ОбобщеннаяЗадача", Объединять);
	Список.Параметры.УстановитьЗначениеПараметра("НеВыполнена", НеВыполненые);
КонецПроцедуры

&НаКлиенте
Процедура НеВыполненыеПриИзменении(Элемент)
	ПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбъединятьПриИзменении(Элемент)
	ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда
	
		Элементы.СтатусЗадачи.Видимость = Ложь;	
		Элементы.ТипЗадачи.Видимость 	= Ложь;	
		Элементы.Состояние.Видимость 	= Ложь;	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ЗавершениеРаботыПриложения = ЗавершениеРаботы;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗавершениеРаботыПриложения = Ложь;
КонецПроцедуры


