Перем стКоэффициенты, стИнтервал, КоличествоСекундВДне, тзВывод, тзДаты;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МасштабНаПечать = 100;
	
	Проекты = Параметры.Проекты;
	
	СоздатьТаблицуПечати();
	
КонецПроцедуры

Процедура СоздатьТаблицуПечати()

	ПустаяДата 				= Дата(1,1,1);                    

    СтруктураДанныеГанта 	= омГантПроизводстваНаСервере.ПолучитьТаблицуДанных();
	
	омГантПроизводстваНаСервере.ПолучитьДанныеДиаграммы(Проекты, СтруктураДанныеГанта); 
	
	КвалификаторыЧисло 	= Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный);
	ТипЧисло5_0			= Новый ОписаниеТипов("Число", );
	СтруктураДанныеГанта.тзДанныеГанта.Колонки.Добавить("НомерСтроки",	ТипЧисло5_0);
	СтруктураДанныеГанта.тзПроекты.Колонки.Добавить("НомерСтроки",		ТипЧисло5_0);
	
	Отбор = Новый Структура("Проект", );
	
	НомерСтроки = 3;
	
	Для каждого текПроект Из СтруктураДанныеГанта.тзПроекты Цикл
	
		текПроект.НомерСтроки 	= НомерСтроки;
		НомерСтроки 			= НомерСтроки + 1;
		
		Отбор.Проект = текПроект.Проект;
		
		Для каждого текКомплект Из СтруктураДанныеГанта.тзДанныеГанта.НайтиСтроки(Отбор) Цикл
			текКомплект.НомерСтроки = НомерСтроки;	
			НомерСтроки 			= НомерСтроки + 1;
		КонецЦикла;
	КонецЦикла;
	
	тзЦвета.Загрузить(омДиаграммаГанта.ПолучитьТаблицуЦветов());
	
	омМесяц.ЗаполнитьСписокМесяцами(спМесяцы);
	
	ВывестиДиаграмму(СтруктураДанныеГанта ,НомерСтроки);

КонецПроцедуры


Функция ПолучитьИнтервалДиаграммы(тзДанныеГанта)
	
	ПустаяДата = Дата(1,1,1);
	стИнтервал = Новый Структура("ДатаНачала,ДатаОкончания,мДаты",ПустаяДата,ПустаяДата, Новый Массив);
	
	Для каждого х Из тзДанныеГанта Цикл
		Если стИнтервал.ДатаОкончания < х.ДатаОкончания Тогда
			стИнтервал.ДатаОкончания = х.ДатаОкончания;
		КонецЕсли;
		
	    Если х.ДатаНачала > ПустаяДата Тогда
			Если стИнтервал.ДатаНачала = ПустаяДата Тогда
				стИнтервал.ДатаНачала = х.ДатаНачала;
			ИначеЕсли стИнтервал.ДатаНачала > х.ДатаНачала Тогда
				стИнтервал.ДатаНачала = х.ДатаНачала;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ДеньНеделиДатаНачала = ДеньНедели(стИнтервал.ДатаНачала);
	
	Если Интервалы = 0 И ДеньНеделиДатаНачала > 1 Тогда
		стИнтервал.ДатаНачала = стИнтервал.ДатаНачала - (ДеньНеделиДатаНачала - 1) * КоличествоСекундВДне;
	КонецЕсли;
	
	текДата = стИнтервал.ДатаНачала;

	Пока текДата <= стИнтервал.ДатаОкончания Цикл
		стИнтервал.мДаты.Добавить(текДата);
		
	    текДата = текДата + КоличествоСекундВДне; 
	КонецЦикла;
	
	Возврат стИнтервал;
	
КонецФункции // ПолучитьИнтервалДиаграммы()

Процедура ПолучитьКоэффициенты()

	КоличествоМиллиметровВПикселе = омТабличныйДокументСерверПовтор.ПолучитьКоличествоМиллиметровВПикселе();
	КоличествоДней = Окр((Период.ДатаОкончания - Период.ДатаНачала) / (24 * 3600), 0);
	мИнформацияОЭкране = ПолучитьИнформациюЭкрановКлиента();
	
	Если мИнформацияОЭкране = Неопределено Тогда
		DPI = 60;
		ШиринаЭкрана = 600;
	Иначе
		DPI = мИнформацияОЭкране[0].DPI;
		ШиринаЭкрана = мИнформацияОЭкране[0].Ширина;
	КонецЕсли;
	
	стКоэффициенты =  Новый Структура("КоличествоМиллиметровВПикселе,КоличествоДней,DPI,ШиринаЭкрана,КоличествоИнтервалов"
						,КоличествоМиллиметровВПикселе,КоличествоДней,DPI,ШиринаЭкрана,0);
КонецПроцедуры // ПолучитьКоэффициенты()

&НаКлиенте
Процедура МасштабПриИзменении(Элемент)
	СоздатьТаблицуПечати();
КонецПроцедуры
 

Процедура ВывестиДиаграмму(СтруктураДанныеГанта, МаксНомерСтроки)
	
	ОписаниеЧисло 	= Новый ОписаниеТипов("Число");
	ОписаниеДата 	= Новый ОписаниеТипов("Дата");
	
	тзВывод = Новый ТаблицаЗначений;
	тзВывод.Колонки.Добавить("НомерДаты", ОписаниеЧисло);
	тзВывод.Колонки.Добавить("ОбъектДанных", );
	тзВывод.Колонки.Добавить("СтруктураДанных", );
	тзВывод.Индексы.Добавить("ОбъектДанных, НомерДаты");
	
	тзДаты = Новый ТаблицаЗначений;
	тзДаты.Колонки.Добавить("НомерДаты", ОписаниеЧисло);
	тзДаты.Колонки.Добавить("Дата", ОписаниеДата);
	тзДаты.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	тзДаты.Колонки.Добавить("Месяц", ОписаниеДата);
	тзДаты.Индексы.Добавить("Дата");
	
	
	КоличествоСекундВДне = 24 * 3600;

	стИнтервал = ПолучитьИнтервалДиаграммы(СтруктураДанныеГанта.тзДанныеГанта);

	ЗаполнитьТаблицыДанных(стИнтервал, СтруктураДанныеГанта);
	
	Период.ДатаНачала 		= стИнтервал.ДатаНачала;
	Период.ДатаОкончания 	= стИнтервал.ДатаОкончания;

	ПолучитьКоэффициенты();
	Если стКоэффициенты.КоличествоДней = 0 Тогда
		Возврат;
	КонецЕсли;

	УстановитьШиринуКолонок();
	
	ПолеВывода.ФиксацияСлева = 2;
	
	МаксНомерКолонки = 0;
	ВывестиШапку(МаксНомерКолонки);
	
	НомерСтроки = 3;
	
	КоличествоДат = тзДаты.Количество();
	
	Если КоличествоДат = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	РазлиноватьТаблицу(МаксНомерКолонки - 1, МаксНомерСтроки - 1);
	
	ВывестиДанные(СтруктураДанныеГанта);
	
КонецПроцедуры 

Процедура РазлиноватьТаблицу(КоличествоДат, НомерСтроки)

	стПараметровОбласти = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров();
	стПараметровОбласти.ЦветРамки 		= "210210210";
	стПараметровОбласти.ГраницаСнизу 	= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	стПараметровОбласти.ГраницаСправа 	= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1); 
	
	КешЦвета 									= Неопределено; 
	Для х = 3 По КоличествоДат Цикл
		Для у = 3 По НомерСтроки Цикл
			стПараметровОбласти.НомерСтроки 			= у;
			стПараметровОбласти.НомерКолонки 			= х;
			омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти, КешЦвета);
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры


Процедура ВывестиДанные(СтруктураДанныеГанта) 
	
	текПроект 	= Неопределено;
	текРодиель	= Неопределено;
	
	ЦветБелый 	= Новый Цвет(255,255,255);
	стЦвета = Новый Структура("Производство, Проект", ЦветБелый, ЦветБелый);
	
	
	ЦветПроекта			= ЦветБелый;
	ЦветРодитель 		= ЦветБелый;
	КомпозицияЭлемент 	= ЦветБелый;
	
	Для каждого х Из тзЦвета Цикл
		
		Если х.ЭтоГруппа Тогда
			Продолжить;	
		КонецЕсли;
		
		Если х.НаименованиеЭтапа = "Производство" Тогда
			стЦвета.Производство 	= х.Цвет;
		ИначеЕсли х.НаименованиеЭтапа = "Проект" Тогда
			стЦвета.Проект 			= х.Цвет;
		КонецЕсли; 
		
	КонецЦикла; 
	
	смещениеКолонок = 2;  
	
	стПараметровОбласти = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров();
	стПараметровОбласти.ЦветРамки 		= "210210210";
	стПараметровОбласти.ГраницаСнизу 	= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	стПараметровОбласти.ГраницаСправа 	= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	стПараметровОбласти.ГраницаСлева 	= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 0);
	
	стПараметровОбластиКомплект = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров();
	стПараметровОбластиКомплект.НомерКолонки 			= 2;
	стПараметровОбластиКомплект.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	стПараметровОбластиКомплект.ЦветФона 				= ЦветБелый;

	стОтбор 			= Новый Структура("ОбъектДанных", );
	стОтборПроект		= Новый Структура("Проект", );
	стОтборКомпозиция	= Новый Структура("Композиция",);
	
	ТипКомпозиция = Тип("СправочникСсылка.Композиции");
	
	ВыведенныеНаименования = Новый Массив;

	Для каждого текПроект Из СтруктураДанныеГанта.тзПроекты Цикл 
		
		КешЦвета 									= Неопределено; 
		стПараметровОбласти.Расшифровка				= текПроект.Проект;
		стПараметровОбласти.НомерСтроки 			= текПроект.НомерСтроки;
		стПараметровОбласти.НомерКолонки 			= 2;
		стПараметровОбласти.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
		
		стПараметровОбласти.Текст 					= текПроект.ПроектНаименование;
		стПараметровОбласти.ЦветФона 				= стЦвета.Проект;
		
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти, КешЦвета);
		
		стОтбор.ОбъектДанных = текПроект.Проект;
		НайденыеСтроки = тзВывод.НайтиСтроки(стОтбор);
		
		стПараметровОбласти.Текст = "";
 		ВыводОбъекта(НайденыеСтроки, текПроект, КешЦвета, стПараметровОбласти, смещениеКолонок, стЦвета,,,ВыведенныеНаименования);
		
		стОтборПроект.Проект = текПроект.Проект;
		НайденыеСтроки = СтруктураДанныеГанта.тзДанныеГанта.НайтиСтроки(стОтборПроект);
		
		ВыведенныеНаименования = Новый Массив; 
		
		Для каждого текКомплект Из НайденыеСтроки Цикл
			
			КешЦвета 				= Неопределено; 
			
			стПараметровОбластиКомплект.ЦветФона = ЦветБелый;
			
			стПараметровОбластиКомплект.Расшифровка	= текКомплект.ОбъектТЗ;
			стПараметровОбластиКомплект.НомерСтроки = текКомплект.НомерСтроки;
			стПараметровОбластиКомплект.Текст 		= текКомплект.ОбъектТЗНаименование;
			омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбластиКомплект, КешЦвета);
			
			стПараметровОбласти.Текст = "";
			стОтбор.ОбъектДанных = текКомплект.ОбъектТЗ;
			НайденыеСтрокиКомплекта = тзВывод.НайтиСтроки(стОтбор);
			ВыводОбъекта(НайденыеСтрокиКомплекта, текКомплект, КешЦвета, стПараметровОбласти, смещениеКолонок, стЦвета, Истина, Истина, ВыведенныеНаименования);
		КонецЦикла;
		
	КонецЦикла;
	
	стПараметровОбласти.ГраницаСправа 	= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	
КонецПроцедуры // ВывестиДанные(МаксимальныйНомерДаты)

Процедура ВывестиЛегенду(стПараметровОбластиКомплект, стЦвета)

	стПараметровОбластиКомплект.Расшифровка		= Неопределено;
	стПараметровОбластиКомплект.НомерСтроки 	= стПараметровОбластиКомплект.НомерСтроки + 2;
	стПараметровОбластиКомплект.НомерКолонки 	= 3;
	стПараметровОбластиКомплект.ДлинаОбласти 	= 3;
	стПараметровОбластиКомплект.Текст 			= "Проектирование";
	стПараметровОбластиКомплект.ЦветФона		= стЦвета.Конструирование;	

	омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбластиКомплект);
	
	стПараметровОбластиКомплект.НомерКолонки 	= стПараметровОбластиКомплект.НомерКолонки + 4;
	стПараметровОбластиКомплект.Текст 			= "Согласование";
	стПараметровОбластиКомплект.ЦветФона		= стЦвета.Согласования;	

	омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбластиКомплект);
	
	стПараметровОбластиКомплект.НомерКолонки 	= стПараметровОбластиКомплект.НомерКолонки + 4;
	стПараметровОбластиКомплект.Текст 			= "Производство";
	стПараметровОбластиКомплект.ЦветФона		= стЦвета.Производство;	

	омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбластиКомплект);
	
	стПараметровОбластиКомплект.НомерКолонки 	= стПараметровОбластиКомплект.НомерКолонки + 4;
	стПараметровОбластиКомплект.Текст 			= "Монтаж";
	стПараметровОбластиКомплект.ЦветФона		= стЦвета.Монтаж;	

	омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбластиКомплект);
	
КонецПроцедуры

Процедура ВыводОбъекта(НайденыеСтроки, текКомплект, КешЦвета, стПараметровОбласти, смещениеКолонок, стЦвета = Неопределено, ЭтоКомпозиция = Ложь, Подчиненный = Ложь, ВыведенныеНаименования)
	
	ВыведенныеНаименования.Очистить();
	
	Для каждого текДата Из НайденыеСтроки Цикл
		
		Если ТипЗнч(текДата.СтруктураДанных) = Тип("Структура") Тогда
			стПараметровОбласти.НомерСтроки 	= текКомплект.НомерСтроки;	
			стПараметровОбласти.НомерКолонки 	= текДата.НомерДаты + смещениеКолонок;
			омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти, КешЦвета); 
		Иначе
			КешЦвета = Неопределено;
			
			Если текДата.СтруктураДанных.Количество() = 0 Тогда
				Продолжить;
			ИначеЕсли текДата.СтруктураДанных.Количество() > 1 Тогда
				стПараметровОбласти.ЦветФона 	= стЦвета.Пересечение;
				ВидОбъекта 	= "";
			Иначе
				ВидОбъекта = текДата.СтруктураДанных[0].Значение.ВидОбъекта;
				стПараметровОбласти.ЦветФона 	= ПолучитьЦветЭтапа(ВидОбъекта, стЦвета);
			КонецЕсли;
			стПараметровОбласти.НомерСтроки 	= текКомплект.НомерСтроки;	
			стПараметровОбласти.НомерКолонки 	= текДата.НомерДаты + смещениеКолонок;
			
			ТекстЯчейки = Сред(ВидОбъекта, 1, 3);
			Если ВыведенныеНаименования.Найти(ТекстЯчейки) = Неопределено Тогда
			
				ВыведенныеНаименования.Добавить(ТекстЯчейки);
				
			Иначе
				
				ТекстЯчейки = ""; 
								
			КонецЕсли;
			
			стПараметровОбласти.Текст 			= ТекстЯчейки;	
			омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти, КешЦвета); 
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры // ВыводОбъекта()  

Функция ПолучитьЦветЭтапа(Этап, стЦвета)
	
	Возврат стЦвета[Этап];	
	
КонецФункции // ПолучитьЦветЭтапа()

&НаКлиенте
Функция ПолучитьИзДатыКлюч(текДата)

	Возврат "_" + Формат(День(текДата),"ЧЦ=2; ЧВН=; ЧГ=0") + Формат(Месяц(текДата),"ЧЦ=2; ЧВН=; ЧГ=0") + Формат(Год(текДата),"ЧЦ=4; ЧВН=; ЧГ=0");	

КонецФункции // ПолучитьИздатыКлюч(Дата)()

Процедура ВывестиШапку(НомерКолонки = 0)
	
	КешЦвета = Неопределено;

	стПараметровОбласти = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров();
	стПараметровОбласти.НомерКолонки 	= 2;
	стПараметровОбласти.НомерСтроки 	= 1;
	стПараметровОбласти.ВысотаОбласти 	= 2;
	стПараметровОбласти.Полужирный 		= Истина;
	стПараметровОбласти.Текст 			= "Комплекты"; 
	омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти, КешЦвета);

	стПараметровОбласти.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Обрезать;
	
	НомерКолонки = 3;
	
	стПараметровОбласти.РазмерШрифта 	= 6;
	стПараметровОбласти.НомерСтроки 	= 2;
	стПараметровОбласти.ВысотаОбласти 	= 1;
	
	стПараметровОбластиМесяц = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров();
	стПараметровОбластиМесяц.Полужирный 	= Истина;
	стПараметровОбластиМесяц.НомерКолонки 	= НомерКолонки;
	
	НомерДаты = -1;
	НачалоКолонки = НомерКолонки;
	
	стПараметровОбластиРамка = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров();
	стПараметровОбластиРамка.ЦветРамки 		= "230230230";
	стПараметровОбластиРамка.Объединять 	= Ложь;
	КоличествоСтрок = ПолучитьВысотуТаблицы();
	
	
	Если тзДаты.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли; 
	
	текМесяц = тзДаты[0].Месяц;
	КешЦветаРамка = Неопределено;
	
	Для каждого х Из тзДаты Цикл
		
		
		Если НЕ текМесяц = х.Месяц Тогда
			стПараметровОбластиМесяц.ДлинаОбласти 	= НомерКолонки - НачалоКолонки;		
			стПараметровОбластиМесяц.Текст 			= спМесяцы.НайтиПоЗначению(Месяц(текМесяц)).Представление; 
			омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбластиМесяц, КешЦвета);
			
			стПараметровОбластиМесяц.НомерКолонки 	= НомерКолонки;
			НачалоКолонки 							= НомерКолонки;  
			текМесяц = х.Месяц;
		КонецЕсли;

		Если НомерДаты = х.НомерДаты Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		стПараметровОбласти.НомерКолонки 	= НомерКолонки;
		стПараметровОбласти.Текст 			= ?(НеОтображатьЧисла,"",х.Представление);
		
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти, КешЦвета);
		
		НомерДаты = х.НомерДаты;
		
		стПараметровОбластиРамка.НомерКолонки 	= НомерКолонки;
		стПараметровОбластиРамка.НомерСтроки 	= 3;
		стПараметровОбластиРамка.ВысотаОбласти  = КоличествоСтрок;
		
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбластиРамка, КешЦветаРамка);
		
		НомерКолонки = НомерКолонки + 1;
	КонецЦикла;
	
	Если НЕ НомерКолонки = НачалоКолонки Тогда
		стПараметровОбластиМесяц.ДлинаОбласти 	= НомерКолонки - НачалоКолонки;		
		стПараметровОбластиМесяц.Текст 			= спМесяцы.НайтиПоЗначению(Месяц(текМесяц)).Представление; 
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбластиМесяц, КешЦвета);
	КонецЕсли;
	
	ПолеВывода.ФиксацияСверху = 2;

КонецПроцедуры // ВывестиШапку()

Функция ПолучитьВысотуТаблицы()

	Возврат тзКомплекты.Количество() + Проекты.Количество() + 2;
	
КонецФункции // ПолучитьВысотуТаблицы()

Функция УстановитьШиринуКолонок()
	
	Если ЭтаФорма.Интервалы = 0 Тогда
		КоличествоИнтервалов = стКоэффициенты.КоличествоДней / 7 + 2;
		КоличествоИнтервалов = ?(КоличествоИнтервалов - Цел(КоличествоИнтервалов) = 0, КоличествоИнтервалов, Цел(КоличествоИнтервалов) + 1);
	Иначе
		КоличествоИнтервалов = стКоэффициенты.КоличествоДней; 
	КонецЕсли;
	
	стКоэффициенты.КоличествоИнтервалов = КоличествоИнтервалов;
	
	мШиринаКолонок = Новый Массив(КоличествоИнтервалов + 3);
	мШиринаКолонок[0] = 2;
	мШиринаКолонок[1] = 30;
	мШиринаКолонок[2] = 10;
	
	ШиринаКолонок = (стКоэффициенты.КоличествоМиллиметровВПикселе * стКоэффициенты.ШиринаЭкрана / (КоличествоИнтервалов * 3)) * (МасштабНаПечать / 100) * 1.4; 
	
	ШиринаКолонок = ?(Интервалы = 0, 1, 4) * ШиринаКолонок;
	Для х = 3 По КоличествоИнтервалов + 2 Цикл
		мШиринаКолонок[х] = ШиринаКолонок;
	КонецЦикла;
	
	омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(ЭтаФорма.ПолеВывода, мШиринаКолонок);
	
КонецФункции // УстановитьШиринуКолонок()

&НаКлиенте
Процедура НеОтображатьЧислаПриИзменении(Элемент)
	СоздатьТаблицуПечати();
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалыПриИзменении(Элемент)
	СоздатьТаблицуПечати();
КонецПроцедуры

Функция ЗаполнитьТаблицыДанных(стИнтервал, СтруктураДанныеГанта)

	тзДаты.Очистить();
	тзВывод.Очистить();
	
	ДатаНачала   	= стИнтервал.ДатаНачала;
	ДатаОкончания 	= стИнтервал.ДатаОкончания;
	
	Если НЕ (ЗначениеЗаполнено(ДатаНачала) И (ЗначениеЗаполнено(ДатаОкончания))) Тогда
		Возврат 0;	
	КонецЕсли;
	
	МаксимальныйНомерДаты = ЗаполнитьТаблицуДата(ДатаНачала, ДатаОкончания);
	
	ЗаполнитьТаблицуВывода(СтруктураДанныеГанта);
	
	Возврат МаксимальныйНомерДаты;
	
КонецФункции // ЗаполнитьТаблицыДанных()

Процедура ЗаполнитьТаблицуВывода(СтруктураДанныеГанта)
	
	тзДанныеГанта = СтруктураДанныеГанта.тзДанныеГанта;
	
	стОтбор 				= Новый Структура("НомерДаты, ОбъектДанных", );
	стОтборДата 			= Новый Структура("Дата", );
	КоличествоСекундВДне 	= 24 * 3600;
	
	Для каждого строка_тзЗадач Из тзДанныеГанта Цикл
		ЗаполнитьКомплект(строка_тзЗадач,  стОтбор, стОтборДата, КоличествоСекундВДне);	
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТаблицуВывода()

Процедура ЗаполнитьКомплект(строка_тзЗадач, стОтбор, стОтборДата, КоличествоСекундВДне)
	
	стОтбор.ОбъектДанных = строка_тзЗадач.ОбъектТЗ;

	датаНачала = строка_тзЗадач.ДатаНачала;
	
	Если датаНачала < тзДаты[0].Дата Тогда
		датаНачала = тзДаты[0].Дата;	
	КонецЕсли;
	
	Если строка_тзЗадач.ДатаОкончания > Дата(1, 1, 1) Тогда
		
		Пока датаНачала <= строка_тзЗадач.ДатаОкончания Цикл
			стОтборДата.Дата = датаНачала;
			НомерДаты = тзДаты.НайтиСтроки(стОтборДата)[0].НомерДаты;
			стОтбор.НомерДаты = НомерДаты;
			
			найденыеСтроки = тзВывод.НайтиСтроки(стОтбор);
			
			Если найденыеСтроки.Количество() = 0 Тогда
				
				НС = тзВывод.Добавить();
				НС.НомерДаты 	= НомерДаты;
				НС.ОбъектДанных = стОтбор.ОбъектДанных;
				спДанные = Новый СписокЗначений;
				НС.СтруктураДанных = спДанные;
			Иначе
				НС = найденыеСтроки[0];	
			КонецЕсли;
			
			ДанныеУжеЗаполнены = Ложь;
			
			Для каждого текСписок Из НС.СтруктураДанных Цикл
				Если текСписок.Значение.ВидОбъекта = "Производство" Тогда
					ДанныеУжеЗаполнены = Истина; 
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ ДанныеУжеЗаполнены Тогда
				стДанных = Новый Структура("ВидОбъекта, ЗначениеОбъекта", 
					"Производство", строка_тзЗадач.ОбъектТЗ);
				
				НС.СтруктураДанных.Добавить(стДанных); 
			КонецЕсли;
			
			датаНачала = датаНачала + КоличествоСекундВДне;
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьКомплект(строка_тзЗадач, стОтбор, стОтборДата, КоличествоСекундВДне)

Процедура ЗаполнитьПомещение(строка_тзЗадач, стОтбор, стОтборДата, КоличествоСекундВДне, мКешСделок)
	
	стОтбор.ОбъектДанных = строка_тзЗадач.Помещение;
	
	КэшНайден = Ложь;
	Для каждого х Из мКешСделок Цикл
		Если х.Помещение = стОтбор.ОбъектДанных Тогда
			КэшНайден 		= Истина;
			ЭлементМассива 	= х;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ КэшНайден Тогда
		ЭлементМассива 	= Новый Структура("Помещение, ДатаМинимум, ДатаМаксимум",стОтбор.ОбъектДанных, Дата(1,1,1), Дата(1,1,1));
		мКешСделок.Добавить(ЭлементМассива);
	КонецЕсли;
	
	датаНачала = строка_тзЗадач.ДатаНачала;
	
	Если ЭлементМассива.ДатаМинимум = Неопределено И ЗначениеЗаполнено(датаНачала) Тогда
		ЭлементМассива.ДатаМинимум = датаНачала;
	ИначеЕсли ЭлементМассива.ДатаМинимум > датаНачала ИЛИ НЕ ЗначениеЗаполнено(ЭлементМассива.ДатаМинимум) Тогда	
		ЭлементМассива.ДатаМинимум = датаНачала;
	КонецЕсли;
	
	Если ЭлементМассива.ДатаМаксимум < строка_тзЗадач.ДатаОкончания Тогда
		ЭлементМассива.ДатаМаксимум = строка_тзЗадач.ДатаОкончания;
	КонецЕсли;
	
	Если тзДаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если датаНачала < тзДаты[0].Дата Тогда
		датаНачала = тзДаты[0].Дата;	
	КонецЕсли;
	
	Если строка_тзЗадач.ДатаОкончания > Дата(1,1,1) Тогда
		
		Пока датаНачала <= строка_тзЗадач.ДатаОкончания Цикл
			
			стОтборДата.Дата = датаНачала;
			НомерДаты = тзДаты.НайтиСтроки(стОтборДата)[0].НомерДаты;
			стОтбор.НомерДаты = НомерДаты;
			
			найденыеСтроки = тзВывод.НайтиСтроки(стОтбор);
			
			Если найденыеСтроки.Количество() = 0 Тогда
				
				НС = тзВывод.Добавить();
				НС.НомерДаты 	= НомерДаты;
				НС.ОбъектДанных = стОтбор.ОбъектДанных;
				НС.СтруктураДанных = Новый Структура("ВидОбъекта, ЗначениеОбъекта","Помещение", стОтбор.ОбъектДанных);
			КонецЕсли;
			
			датаНачала = датаНачала + КоличествоСекундВДне;
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры // ЗаполнитьПроект(строка_тзЗадач, стОтбор, стОтборДата, КоличествоСекундВДне, мКешСделок)

Функция ЗаполнитьТаблицуДата(ДатаНачала, ДатаОкончания)

	КоличествоСекундВДне = 24 * 3600; 
	текНомерДаты = 1;
	Если Интервалы = 0 Тогда
		
		Смещение = (ДатаНачала - НачалоНедели(ДатаНачала)) / КоличествоСекундВДне;
	
		ДатаНачала = ДатаНачала - КоличествоСекундВДне * Смещение;
		Представление = День(ДатаНачала);
		
		текСч = 1;
		Пока ДатаНачала <= ДатаОкончания Цикл
			НС = тзДаты.Добавить();
			НС.Дата 			= ДатаНачала;
			НС.НомерДаты 		= текНомерДаты;
			НС.Представление 	= Представление;
			НС.Месяц 			= НачалоМесяца(НС.Дата);
			
			ДатаНачала = ДатаНачала + КоличествоСекундВДне;
			текСч = текСч + 1;
			
			Если текСч = 8 Тогда
				текСч = 1;
				текНомерДаты = текНомерДаты + 1;
				Представление = День(ДатаНачала);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Пока ДатаНачала <= ДатаОкончания Цикл
			НС = тзДаты.Добавить();
			НС.Дата 			= ДатаНачала;
			НС.НомерДаты 		= текНомерДаты;
			НС.Представление 	= День(ДатаНачала);
			НС.Месяц 			= НачалоМесяца(НС.Дата);
			
			ДатаНачала = ДатаНачала + КоличествоСекундВДне;
			текНомерДаты = текНомерДаты + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции // ЗаполнитьТаблицуДата()

&НаКлиенте
Процедура ПриПовторномОткрытии()
	СоздатьТаблицуПечати();
КонецПроцедуры

