&НаКлиенте
Перем КоличествоДнейВМесяце;

&НаКлиенте
Процедура МесяцРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Месяц = омМесяц.МесяцРегулированиеНаСервере(ЭтаФорма.Месяц,Направление);
	СформироватьТабель();
КонецПроцедуры 

Процедура ЗаполнитьНаСервереМесяцы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Месяцы.Наименование КАК Наименование,
		|	Месяцы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Месяцы КАК Месяцы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Месяцы.Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Элементы.Месяц.СписокВыбора.Добавить(Выборка.Ссылка,Выборка.Наименование);
	КонецЦикла;
	
	
	Если ТекущийМесяц = Дата(1,1,1) Тогда
		ТД = ТекущаяДата();
		Если (ТД <= НачалоПериода ИЛИ ТД >= ОкончаниеПериода) И ОкончаниеПериода > Дата(1, 1, 1) Тогда
			ТД = НачалоПериода;	
		КонецЕсли; 
		Год = Год(ТД);
		ТекущийМесяц = НачалоМесяца(ТД);
		Месяц = Справочники.Месяцы.НайтиПоКоду(Месяц(ТД));
	Иначе
		Год = Год(ЭтаФорма.ТекущийМесяц);
		Месяц = Справочники.Месяцы.НайтиПоКоду(Месяц(ТекущийМесяц));
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНаСервереМесяцы();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКалендарь(Команда)
	
	Параметр = Новый Структура("НачалоМесяца", Дата(Год, НомерМесяцаНаССервере(Месяц), 1));
	ОткрытьФорму("Отчет.РабочиеЧасы.Форма.ФормаДобавитьРабочиеЧасы", Параметр, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция НомерМесяцаНаССервере(Месяц)

	Возврат ?(ЗначениеЗаполнено(Месяц), Месяц.Код, 0);	

КонецФункции // НомерМесяцаНаССервере()


&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	СформироватьТабель();
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	СформироватьТабель();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	СформироватьТабель();
КонецПроцедуры

Процедура СформироватьТабель()

	Если ЗначениеЗаполнено(Месяц) Тогда
		НомерМесяца = омМесяц.ПолучитьКодМесяца(Месяц);
	Иначе	
		НомерМесяца = 0;
	КонецЕсли;
	
	Если НомерМесяца = 0 ИЛИ Год = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НачалоМесяца = Дата(Год, НомерМесяца, 1);

КонецПроцедуры


