&НаКлиенте
Процедура МесяцРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Месяц = омМесяц.МесяцРегулированиеНаСервере(ЭтаФорма.Месяц,Направление);
КонецПроцедуры 

Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Месяцы.Наименование КАК Наименование,
		|	Месяцы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Месяцы КАК Месяцы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Месяцы.Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Элементы.Месяц.СписокВыбора.Добавить(Выборка.Ссылка,Выборка.Наименование);
	КонецЦикла;
	
	
	Если ТекущийМесяц = Дата(1,1,1) Тогда
		ТД = ТекущаяДата();
		Если (ТД <= НачалоПериода ИЛИ ТД >= ОкончаниеПериода) И ОкончаниеПериода > Дата(1, 1, 1) Тогда
			ТД = НачалоПериода;	
		КонецЕсли; 
		Год = Год(ТД);
		ТекущийМесяц = НачалоМесяца(ТД);
		Месяц = Справочники.Месяцы.НайтиПоКоду(Месяц(ТД));
	Иначе
		Год = Год(ЭтаФорма.ТекущийМесяц);
		Месяц = Справочники.Месяцы.НайтиПоКоду(Месяц(ТекущийМесяц));
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНаСервере();
КонецПроцедуры


