Функция ПолучитьКраяКомплекта(Комплект) Экспорт
	
	ПустаяДата = Дата(1, 1, 1);
	
	стВозврата = Новый Структура("ДнейТЗ, ДнейРКД, ДнейПКД, КрайПКД, КрайРКД, КрайТЗ", 0 ,0, 0, ПустаяДата ,ПустаяДата, ПустаяДата);

	Если ТипЗнч(Комплект) = Тип("СправочникСсылка.Композиции") Тогда
	
		Возврат ПолучитьДанныеКомпозиции(стВозврата, Комплект);	
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.ДнейПКД КАК ДнейПКД,
		|	ДатыКомплекта.ДнейРКД КАК ДнейРКД,
		|	ДатыКомплекта.ДнейТЗ КАК ДнейТЗ,
		|	ДатыКомплекта.КрайПКД КАК КрайПКД,
		|	ДатыКомплекта.КрайРКД КАК КрайРКД,
		|	ДатыКомплекта.КрайТЗ КАК КрайТЗ
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата ,Выборка);
	КонецЦикла;
	
    Возврат стВозврата; 
	
КонецФункции // ПолучитьКраяКомплекта()

Функция ПолучитьДанныеКомпозиции(стВозврата, Композиция)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.ДнейПКД КАК ДнейПКД,
		|	ДатыКомплекта.ДнейТЗ КАК ДнейТЗ,
		|	ДатыКомплекта.КрайПКД КАК КрайПКД,
		|	ДатыКомплекта.КрайТЗ КАК КрайТЗ
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Композиция";
	
	Запрос.УстановитьПараметр("Композиция", Композиция);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата ,Выборка);
	КонецЦикла;
	
    Возврат стВозврата; 

КонецФункции // ПолучитьДанныеКомпозиции(стВозврата, Комплект)()

Процедура РасчитатьПКДКопозицииНаОснованииКомплектов(мКомплекты) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Родитель.Композиция КАК Композиция
		|ПОМЕСТИТЬ втКомпозицииИзменненые
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Ссылка В(&мКомплекты)
		|	И НЕ(ИзделияКомплект.Родитель.Композиция ЕСТЬ NULL
		|				ИЛИ ИзделияКомплект.Родитель.Композиция = ЗНАЧЕНИЕ(Справочник.Композиции.ПустаяССылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияКомплект.Родитель.Композиция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Комплект,
		|	втКомпозицииИзменненые.Композиция КАК Композиция
		|ПОМЕСТИТЬ втВсеКомплектыКомпозиции
		|ИЗ
		|	втКомпозицииИзменненые КАК втКомпозицииИзменненые
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ПО втКомпозицииИзменненые.Композиция.Ссылка = ИзделияКомплект.Родитель.Композиция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ДатыКомплекта.ДнейПКД) КАК ДнейПКД,
		|	СУММА(ДатыКомплекта.НормаВремени_ПКД) КАК НормаВремени_ПКД,
		|	МИНИМУМ(ДатыКомплекта.КрайПКД) КАК КрайПКД,
		|	МИНИМУМ(ДатыКомплекта.НачалоПКД) КАК НачалоПКД,
		|	втВсеКомплектыКомпозиции.Композиция КАК Комплект,
		|	втВсеКомплектыКомпозиции.Композиция.Проект КАК Проект
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВсеКомплектыКомпозиции КАК втВсеКомплектыКомпозиции
		|		ПО ДатыКомплекта.Комплект = втВсеКомплектыКомпозиции.Комплект
		|
		|СГРУППИРОВАТЬ ПО
		|	втВсеКомплектыКомпозиции.Композиция,
		|	втВсеКомплектыКомпозиции.Композиция.Проект";
	
	Запрос.УстановитьПараметр("мКомплекты", мКомплекты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		МенеджерЗаписи = РегистрыСведений.ДатыКомплекта.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Комплект 	= Выборка.Комплект;
		МенеджерЗаписи.Проект 		= Выборка.Проект;
		
		МенеджерЗаписи.Прочитать();
		
		Если НЕ (МенеджерЗаписи.ДнейПКД = Выборка.ДнейПКД И МенеджерЗаписи.НормаВремени_ПКД = Выборка.НормаВремени_ПКД И
			
			МенеджерЗаписи.КрайПКД = Выборка.ДнейПКД И МенеджерЗаписи.НормаВремени_ПКД = Выборка.НачалоПКД) Тогда
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			
			УстановитьПривилегированныйРежим(Истина);
			МенеджерЗаписи.Записать(); 
			
			текОбъект = Выборка.Комплект.ПолучитьОбъект();
			Отказ = Ложь;
			Б24_СМ_РегистрацияИзмененийСервер.ЗарегистрироватьИзменения(текОбъект, Ложь, Отказ);
				
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьКоличествоПереходов(Комплект) Экспорт

	стПереходы = Новый Структура("ПереходДоработка, ПереходИзменения, ПереходПредставление, ПереходРедакция, ПереходРекламация, Проект, КомплектНаименование"
		, 0, 0, 0, 0, 0, Справочники.Проекты.ПустаяСсылка(), "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.Проект КАК Проект,
		|	ДатыКомплекта.ПереходДоработка КАК ПереходДоработка,
		|	ДатыКомплекта.ПереходИзменения КАК ПереходИзменения,
		|	ДатыКомплекта.ПереходПредставление КАК ПереходПредставление,
		|	ДатыКомплекта.ПереходРедакция КАК ПереходРедакция,
		|	ДатыКомплекта.ПереходРекламация КАК ПереходРекламация,
		|	ДатыКомплекта.Комплект.Наименование КАК КомплектНаименование
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
    	ЗаполнитьЗначенияСвойств(стПереходы, Выборка);
	КонецЦикла;
	
	Возврат стПереходы;
	
КонецФункции // ПолучитьКоличествоПереходов()
