
Процедура ПередЗаписью(Отказ, Замещение)

	ПустаяДата = Дата(1, 1, 1);
	
	Для каждого ТекущаяЗапись Из ЭтотОбъект Цикл
		
		Если ТекущаяЗапись.НачалоПКД = ПустаяДата Тогда
			ТекущаяЗапись.ОкончаниеПКД = ПустаяДата;		
		Иначе
			ТекущаяЗапись.ОкончаниеПКД = омДаты.ДобавитьДниСУчетомВыходных(ТекущаяЗапись.НачалоПКД, ТекущаяЗапись.ДнейПКД);		
		КонецЕсли;
		
		Если ТекущаяЗапись.НачалоРКД = ПустаяДата Тогда
			ТекущаяЗапись.ОкончаниеРКД = ПустаяДата;		
		Иначе
			ТекущаяЗапись.ОкончаниеРКД = омДаты.ДобавитьДниСУчетомВыходных(ТекущаяЗапись.НачалоРКД, ТекущаяЗапись.ДнейТЗ);		
		КонецЕсли;
		
		Если ТекущаяЗапись.НачалоТЗ = ПустаяДата Тогда
			ТекущаяЗапись.ОкончаниеТЗ = ПустаяДата;		
		Иначе
			ТекущаяЗапись.ОкончаниеТЗ = омДаты.ДобавитьДниСУчетомВыходных(ТекущаяЗапись.НачалоТЗ, ТекущаяЗапись.ДнейТЗ);		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
