
Процедура ПередЗаписью(Отказ, Замещение)

	ПустаяДата 	= Дата(1, 1, 1);
	мКомпозиций = Новый Массив;
	мКомплекты 	= Новый Массив;
	
	Для каждого ТекущаяЗапись Из ЭтотОбъект Цикл
		
		Если ТипЗнч(ТекущаяЗапись.Комплект) = Тип("СправочникСсылка.ИзделияКомплект") Тогда
			
			Если ТекущаяЗапись.НачалоПКД = ПустаяДата Тогда
				ТекущаяЗапись.ОкончаниеПКД = ПустаяДата;		
			Иначе
				ТекущаяЗапись.ОкончаниеПКД = омДаты.ДобавитьДниСУчетомВыходных(ТекущаяЗапись.НачалоПКД, ТекущаяЗапись.ДнейПКД);		
			КонецЕсли;
			
			Если ТекущаяЗапись.НачалоРКД = ПустаяДата Тогда
				ТекущаяЗапись.ОкончаниеРКД = ПустаяДата;		
			Иначе
				ТекущаяЗапись.ОкончаниеРКД = омДаты.ДобавитьДниСУчетомВыходных(ТекущаяЗапись.НачалоРКД, ТекущаяЗапись.ДнейТЗ);		
			КонецЕсли;
			
			Если ТекущаяЗапись.НачалоТЗ = ПустаяДата Тогда
				ТекущаяЗапись.ОкончаниеТЗ = ПустаяДата;		
			Иначе
				ТекущаяЗапись.ОкончаниеТЗ = омДаты.ДобавитьДниСУчетомВыходных(ТекущаяЗапись.НачалоТЗ, ТекущаяЗапись.ДнейТЗ);		
			КонецЕсли;
			
			мКомплекты.Добавить(ТекущаяЗапись.Комплект);
			
		Иначе
			
			мКомпозиций.Добавить(ТекущаяЗапись.Комплект);	
		
		КонецЕсли;
		
		
	КонецЦикла;
	
	Если НЕ мКомплекты.Количество() = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИзделияКомплект.Родитель.Композиция КАК Композиция
			|ИЗ
			|	Справочник.ИзделияКомплект КАК ИзделияКомплект
			|ГДЕ
			|	ИзделияКомплект.Ссылка В(&мКомплекты)
			|	И НЕ ИзделияКомплект.Родитель.Композиция В (&мКомпозиций)
			|	И НЕ ИзделияКомплект.Родитель.Композиция = ЗНАЧЕНИЕ(Справочник.Композиции.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	ИзделияКомплект.Родитель.Композиция";
		
		Запрос.УстановитьПараметр("мКомпозиций", мКомпозиций);
		Запрос.УстановитьПараметр("мКомплекты", мКомплекты);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			мКомпозиций.Добавить(Выборка.Композиция);
		КонецЦикла;
		
	КонецЕсли; 
	
	Если НЕ мКомпозиций.Количество() = 0 Тогда
	
		омКомпозиции.ЗаполнитьКоличествоДнейКомпозиции(мКомпозиций);	
	
	КонецЕсли;
	
КонецПроцедуры
