
&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
	
	Таб = ЭтаФорма.ПолеВывода;
	Таб.Очистить();
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Номенклатура) Тогда
		Возврат;	
	КонецЕсли;
	
	Макет = Отчеты.ДвижениеНоменклатуры.ПолучитьМакет("Макет");
	
	Таб.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.Регистратор КАК Документ,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.СуммаСНДСНачальныйОстаток КАК СуммаСНДСНачальныйОстаток,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.СуммаСНДСКонечныйОстаток КАК СуммаСНДСКонечныйОстаток,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.СуммаСНДСПриход КАК СуммаСНДСПриход,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.СуммаСНДСРасход КАК СуммаСНДСРасход,
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдИзм
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровНаСкладах.ОстаткиИОбороты(, &ТекущаяДата, Регистратор, , Номенклатура = &Номенклатура) КАК ОстаткиТоваровНаСкладахОстаткиИОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОстаткиТоваровНаСкладахОстаткиИОбороты.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	обСтрока = Макет.ПолучитьОбласть("Строка");
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Документ) Тогда
			обСтрока.Параметры.Заполнить(Выборка);
			Таб.Вывести(обСтрока);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Номенклатура") Тогда
		ЭтаФорма.Номенклатура = Параметры.Номенклатура;
		НоменклатураПриИзмененииНаСервере();
	
	КонецЕсли;
КонецПроцедуры
