
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	

	НаборЗаписей = РегистрыСведений.СостояниеЗамера.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектИзменения.Установить(Ссылка);
	
	Для каждого х Из Помещения Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период 			= Дата;
		НоваяЗапись.ОбъектЗамера 	= х.Помещение;
		НоваяЗапись.ОбъектИзменения = Ссылка;
		НоваяЗапись.СтатусЗамера 	= НовыйСтатус;
	
	КонецЦикла;
	
	НаборЗаписей.Записать();

КонецПроцедуры 

Процедура ОбработкаУдаленияПроведения(Отказ)
	НаборЗаписей = РегистрыСведений.СостояниеЗамера.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектИзменения.Установить(Ссылка);
	
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		Префикс = Проект.Префикс + "-";
		УстановитьНовыйНомер(Префикс); 
	КонецЕсли;
	
	СокращенноеНазвание = омЗаполнениеРеквизиов.ПолучитьСокращенноеНазвание(ЭтотОбъект);

КонецПроцедуры
 

