
&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	HTML = "  <HTML>
	|<head>
	|<meta http-equiv=""X-UA-Compatible"" content=""IE=9""/>
	|</HEAD>
	|<body>
	|<div id=""TEST"">111</div>
	|</body>
	|</html>";
	
	//|<script>function onclick(){alert('Координаты');return 1;}</script> 
	
	
КонецПроцедуры

&НаКлиенте
Процедура HTMLДокументСформирован(Элемент)
	а = ом_JS_Клиенте.ПервыйБраузерДокументСформирован(Элементы.HTML);
	ом_JS_Клиенте.ДобавитьКоманду(а, "TEST", "alert('Координаты');", "onclick");
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	а = ом_JS_Клиенте.ПервыйБраузерДокументСформирован(Элементы.HTML); 
	в = ом_JS_Клиенте.НайтиЭлемент(а, "TEST"); 
	сообщить(в.onclick());
КонецПроцедуры


