&НаКлиенте
Перем ТекущийПользователь;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.НовыйСтатус = Перечисления.СтатусыЗамера.Рабочий;	
	Иначе
		ЗаполнитьЗадачиПроверить(Объект.ГабаритныеЧертежи, Объект.Ссылка);
		
		Если Объект.Проведен Тогда
			Элементы.Группа2.ТолькоПросмотр = Истина;	
			КоманднаяПанель.ТолькоПросмотр 	= Истина;	
		КонецЕсли;
	КонецЕсли;
	                              
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьЗадачиПроверить(ТаблицаГабаритныеЧертежи, СсылкаНаАкт)

	ПустаяСсылкаЗадача = Задачи.ПроверитьГабаритныеЧертежи.ПустаяСсылка();
	
	Для каждого х Из ТаблицаГабаритныеЧертежи Цикл
	
		х.ЗадачаПроверить = ПустаяСсылкаЗадача;
	    х.ЗадачаВыполнена = Ложь;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
		|	ПроверитьГабаритныеЧертежи.Ссылка КАК ЗадачаПроверить,
		|	ПроверитьГабаритныеЧертежи.Выполнена КАК ЗадачаВыполнена
		|ИЗ
		|	Документ.АктПриемкиГабаритныхЧертежей.ГабаритныеЧертежи КАК АктПриемкиГабаритныхЧертежейГабаритныеЧертежи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.ПроверитьГабаритныеЧертежи КАК ПроверитьГабаритныеЧертежи
		|		ПО АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж = ПроверитьГабаритныеЧертежи.ОбъектТЗ
		|ГДЕ
		|	ПроверитьГабаритныеЧертежи.Основание = &СсылкаНаАкт
		|	И АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.Ссылка = &СсылкаНаАкт";
	
	Запрос.УстановитьПараметр("СсылкаНаАкт", СсылкаНаАкт);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Отбор = Новый Структура("ГабаритныйЧертеж", );
	
	Пока Выборка.Следующий() Цикл
		
		Отбор.ГабаритныйЧертеж = выборка.ГабаритныйЧертеж;
		НайденыеСтроки = ТаблицаГабаритныеЧертежи.НайтиСтроки(Отбор);
		
		Для каждого х Из НайденыеСтроки Цикл
			ЗаполнитьЗначенияСвойств(х, Выборка);		
		КонецЦикла;
		
	КонецЦикла;
	

КонецПроцедуры


&НаКлиенте
Процедура Подписать(Команда)
	ОткрытьФормуПодписи(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Отозвать(Команда)
	ОткрытьФормуПодписи(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодписи(ОтзывПодписи)

    ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПодписи", ЭтаФорма);
	ОткрытьФорму("Документ.АктПриемкиПомещения.Форма.ФормаПодписи", Новый Структура("ОтзывПодписи", ОтзывПодписи), ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	

КонецПроцедуры // ОткрытьФормуПодписи()

&НаКлиенте
Процедура ПослеВыбораПодписи(Результат, ДополнительныеПараметры) Экспорт

	

КонецПроцедуры // ПослеВыбораПодписи()



&НаКлиенте
Процедура ВидимостьКнопокПодпись()

	ЕстьПользовательВПодписях = Ложь;
	
	Для каждого х Из Объект.Соглосователи Цикл
	
		Если х.Соглосователь = ТекущийПользователь И НЕ х.ПодписьОтозвана Тогда
			ЕстьПользовательВПодписях = Истина;
			Прервать;
		КонецЕсли;	
	
	КонецЦикла;
	
	Элементы.СоглосователиПодписать.Видимость 	= НЕ ЕстьПользовательВПодписях;
	Элементы.СоглосователиОтозвать.Видимость 	= ЕстьПользовательВПодписях;
	
КонецПроцедуры // ВидимостьКнопокПодпись()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущийПользователь = омСотрудники.ПолучитьТекущегоПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ГабаритныеЧертежиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если Объект.Проведен Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если Объект.ГабаритныеЧертежи.Количество() = 0 Тогда
		НеПоказыватьГЧ = Неопределено;
	Иначе
		НеПоказыватьГЧ = Новый Массив;
		
		Для каждого х Из Объект.ГабаритныеЧертежи Цикл
			НеПоказыватьГЧ.Добавить(х.ГабаритныйЧертеж);
		КонецЦикла;
		
	КонецЕсли;
	
	омГабаритныйЧертежНаКлиенте.ОткрытьПодборГЧ(Объект, ЭтаФорма, , , НеПоказыватьГЧ, Истина);
	
КонецПроцедуры 


&НаКлиенте
Процедура ПослеВыбораГЧ(Результат, ДополнительныеПараметры) Экспорт	
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;                         
	
	Если ДополнительныеПараметры = Неопределено Тогда
		
		Если НЕ Результат = Неопределено Тогда
			
			Для каждого ГабаритныйЧертеж Из Результат Цикл
				
				НС = Объект.ГабаритныеЧертежи.Добавить();
				НС.ГабаритныйЧертеж = ГабаритныйЧертеж;
				
			КонецЦикла;
			
		КонецЕсли;                         
		
	Иначе
		ДополнительныеПараметры.ТД.ГабаритныйЧертеж = Результат;	
	КонецЕсли; 
	
КонецПроцедуры // ПослеВыбораЭлементовСделки() 

&НаКлиенте
Процедура СделкаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеЗамеров");
КонецПроцедуры

&НаКлиенте
Процедура ГабаритныеЧертежиПередНачаломИзменения(Элемент, Отказ)
	
	ТД = Элемент.ТекущиеДанные;
	
	Если Элемент.ТекущийЭлемент.Имя = "ГабаритныеЧертежиЗадачаПроверить" Тогда
	
		Отказ = Истина;
		
		
		Если Не ТД = Неопределено Тогда
		
			ПоказатьЗначение(, ТД.ЗадачаПроверить);	
		
		КонецЕсли;
	
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ГабаритныеЧертежиГабаритныйЧертеж" Тогда
		
		Если Объект.Проведен Тогда
		
			Отказ = Истина;
			Если Не ТД = Неопределено Тогда
				ПоказатьЗначение(, ТД.ГабаритныйЧертеж);	
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		Отказ = Объект.Проведен;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГабаритныеЧертежиПередУдалением(Элемент, Отказ)
	Отказ = Объект.Проведен;
КонецПроцедуры


