&НаКлиенте
Перем ТекущийПользователь;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
	Если Параметры.Ключ.Пустая() Тогда
	
		Объект.НовыйСтатус = Перечисления.СтатусыЗамера.Рабочий;	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подписать(Команда)
	ОткрытьФормуПодписи(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Отозвать(Команда)
	ОткрытьФормуПодписи(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодписи(ОтзывПодписи)

    ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПодписи", ЭтаФорма);
	ОткрытьФорму("Документ.АктПриемкиПомещения.Форма.ФормаПодписи", Новый Структура("ОтзывПодписи", ОтзывПодписи), ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	

КонецПроцедуры // ОткрытьФормуПодписи()

&НаКлиенте
Процедура ПослеВыбораПодписи(Результат, ДополнительныеПараметры) Экспорт

	

КонецПроцедуры // ПослеВыбораПодписи()



&НаКлиенте
Процедура ВидимостьКнопокПодпись()

	ЕстьПользовательВПодписях = Ложь;
	
	Для каждого х Из Объект.Соглосователи Цикл
	
		Если х.Соглосователь = ТекущийПользователь И НЕ х.ПодписьОтозвана Тогда
			ЕстьПользовательВПодписях = Истина;
			Прервать;
		КонецЕсли;	
	
	КонецЦикла;
	
	Элементы.СоглосователиПодписать.Видимость 	= НЕ ЕстьПользовательВПодписях;
	Элементы.СоглосователиОтозвать.Видимость 	= ЕстьПользовательВПодписях;
	
КонецПроцедуры // ВидимостьКнопокПодпись()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущийПользователь = омСотрудники.ПолучитьТекущегоПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ГабаритныеЧертежиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если Объект.ГабаритныеЧертежи.Количество() = 0 Тогда
		НеПоказыватьГЧ = Неопределено;
	Иначе
		НеПоказыватьГЧ = Новый Массив;
		
		Для каждого х Из Объект.ГабаритныеЧертежи Цикл
			НеПоказыватьГЧ.Добавить(х.ГабаритныйЧертеж);
		КонецЦикла;
		
	КонецЕсли;
	
	омГабаритныйЧертежНаКлиенте.ОткрытьПодборГЧ(Объект, ЭтаФорма, , , НеПоказыватьГЧ, Истина);
	
КонецПроцедуры 


&НаКлиенте
Процедура ПослеВыбораГЧ(Результат, ДополнительныеПараметры) Экспорт	
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;                         
	
	Если ДополнительныеПараметры = Неопределено Тогда
		
		Если НЕ Результат = Неопределено Тогда
			
			Для каждого ГабаритныйЧертеж Из Результат Цикл
				
				НС = Объект.ГабаритныеЧертежи.Добавить();
				НС.ГабаритныйЧертеж = ГабаритныйЧертеж;
				
			КонецЦикла;
			
		КонецЕсли;                         
		
	Иначе
		ДополнительныеПараметры.ТД.ГабаритныйЧертеж = Результат;	
	КонецЕсли; 
	
КонецПроцедуры // ПослеВыбораЭлементовСделки() 

&НаКлиенте
Процедура СделкаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеЗамеров");
КонецПроцедуры


