
Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		
		Если НЕ ДополнительныеСвойства.Свойство("ЗаписьИнтерактивная") Тогда
			
			Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗагрузкаСБитрикс24") Тогда
				ЭтотОбъект.ДополнительныеСвойства.ЗагрузкаСБитрикс24 = Ложь;
			КонецЕсли;
			
			Отказ = Ложь;
			Б24_СМ_РегистрацияИзмененийСервер.ЗарегистрироватьИзменения(ЭтотОбъект, Ложь, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда 

		ОсновноеПомещение = Справочники.Помещения.ПустаяСсылка();
		
		Если НЕ ЭтотОбъект.Ссылка.Родитель = Родитель И ЗначениеЗаполнено(Ссылка) Тогда
		
			ПриВключенииВКомпозицию();	
		
		КонецЕсли;
		
		Для каждого х Из ИзделияЭлемент Цикл
			
			Если х.Основное Тогда
				
				Если ЗначениеЗаполнено(х.ИзделиеЭлемент) Тогда
					ОсновноеПомещение = х.ИзделиеЭлемент.Помещения;	
				КонецЕсли;	
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриВключенииВКомпозицию()

	УстановитьПривилегированныйРежим(Истина);
	
	НоваяКомпозиция = Родитель.Композиция;
	
	Если НЕ ЗначениеЗаполнено(НоваяКомпозиция) Тогда
		Возврат;	
	КонецЕсли;
	
	Композиция = Справочники.Композиции.ПустаяСсылка();
	
	КомпозицияВТЗ = ИзменениеВТЗ(НоваяКомпозиция); 
	
	Если КомпозицияВТЗ = "ТЗ завершено" Тогда
	
		ПеревестиЗадачуВедущемуКонструктору(НоваяКомпозиция);	
	
	КонецЕсли;

КонецПроцедуры 

Процедура ПеревестиЗадачуВедущемуКонструктору(НоваяКомпозиция) Экспорт

	ЗадачаПКДКомплзиция = Неопределено;		
	ЗадачаПКДКомплект 	= Неопределено;		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.ОбъектТЗ = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ТаймингЗадач.Период) КАК Период,
		|	ТаймингЗадач.Задача КАК Задача
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|ГДЕ
		|	ТаймингЗадач.Задача.ОбъектТЗ = &ОбъектТЗ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаймингЗадач.Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Ссылка,
		|	ЕСТЬNULL(ТаймингЗадач.Состояние, НЕОПРЕДЕЛЕНО) КАК Состояние,
		|	Задачи_ПКД.ТипЗадачи КАК ТипЗадачи
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
		|			ПО (вт.Период = ТаймингЗадач.Период)
		|		ПО Задачи_ПКД.Ссылка = ТаймингЗадач.Задача
		|ГДЕ
		|	Задачи_ПКД.ОбъектТЗ = &ОбъектТЗ
		|	И НЕ Задачи_ПКД.Выполнена";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", НоваяКомпозиция);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗадачаПКДКомплект = Выборка.Ссылка;
		
		ОбъектКомплект = ЗадачаПКДКомплект.ПолучитьОбъект();
		ОбъектКомплект.Композиция = НоваяКомпозиция;
		ОбъектКомплект.Записать();
		
	КонецЦикла;
	
	Выборка = Результат[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗадачаПКДКомпозиция = Выборка.Ссылка;
		Состояние 			= Выборка.Состояние;
		ТипЗадачи 			= Выборка.ТипЗадачи;
	КонецЦикла; 
	
	Если ЗадачаПКДКомпозиция = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееДействие Тогда
	
		ТаймингЗадач = РегистрыСведений.ТаймингЗадач;
		
		ОбъектКомпозиция 						= ЗадачаПКДКомпозиция.ПолучитьОбъект();
		ОбъектКомпозиция.ТипЗадачи 				= Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором;
		ОбъектКомпозиция.ДополнительноеСвойство = "Добавление комплекта";
		ОбъектКомпозиция.Записать();
		
		
		стДанные = ТаймингЗадач.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором, Конструктор, Перечисления.СтатусыЗадач.Разработка, ОбъектКомпозиция.ТипЗадачи);
		ТаймингЗадач.УстановитьСостояниеИсполнительЗадачи(ЗадачаПКДКомпозиция, стДанные);
		
	КонецЕсли;
	
	
КонецПроцедуры


Функция ИзменениеВТЗ(НоваяКомпозиция)

	ИмяДоски = омКанбанДоскиНаСервереПовтор.ПолучитьИмяДоски("НаименованиеДоскиДляТЗ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанДоски.УИД КАК УИД
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.КанбанДоски КАК КанбанДоски
		|ГДЕ
		|	КанбанДоски.Наименование = &ИмяДоски
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КанбанКарточки.УИД КАК УИД
		|ПОМЕСТИТЬ втКарточка
		|ИЗ
		|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО КанбанКарточки.Доска = вт.УИД
		|ГДЕ
		|	КанбанКарточки.Ресурс = &Ресурс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(КанбанКолонки.НомерПоПорядку, 0) КАК НомерКолонки,
		|	КанбанПереходКарточкиСрезПоследних.УИДКарточка КАК УИДКарточка,
		|	КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка КАК УИДКудаКолонка
		|ИЗ
		|	РегистрСведений.КанбанПереходКарточки.СрезПоследних(
		|			,
		|			УИДКарточка В
		|				(ВЫБРАТЬ
		|					втКарточка.УИД
		|				ИЗ
		|					втКарточка)) КАК КанбанПереходКарточкиСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = КанбанКолонки.УИД";
	
	Запрос.УстановитьПараметр("ИмяДоски", ИмяДоски);
	Запрос.УстановитьПараметр("Ресурс", НоваяКомпозиция);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.НомерКолонки < 2 Тогда
			Возврат "Ожидание ТЗ";                
		КонецЕсли; 
		
		Если ПустаяСтрока(Выборка.УИДКудаКолонка) ИЛИ Выборка.УИДКудаКолонка = "00000000-0000-0000-0000-000000000000" Тогда
			Возврат "ТЗ завершено";                
		КонецЕсли; 
		
		Если НЕ ПеревестиВОжиданиеКарточку(Выборка.УИДКарточка, ИмяДоски) Тогда
			Возврат "Ошибка ТЗ канбан";
		КонецЕсли;
		
		Возврат "ТЗ изменено";
		
	КонецЦикла;
	
	Возврат "Нет в ТЗ";                
	
КонецФункции 

Функция ПеревестиВОжиданиеКарточку(УИДКарточка, ИмяДоски)

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКолонки.УИД КАК УИДКолонки,
		|	КанбанДорожки.УИД КАК УИДДорожки,
		|	КанбанДоски.УИД КАК УИДДоски
		|ИЗ
		|	РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанДоски КАК КанбанДоски
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанДорожки КАК КанбанДорожки
		|			ПО (КанбанДорожки.Доска = КанбанДоски.УИД)
		|		ПО КанбанКолонки.Доска = КанбанДоски.УИД
		|ГДЕ
		|	КанбанДоски.Наименование = &Наименование
		|	И КанбанКолонки.НомерПоПорядку = 1
		|	И КанбанДорожки.НомерПоПорядку = 1";
	
	Запрос.УстановитьПараметр("Наименование", ИмяДоски);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ПустаяСтрока(Выборка.УИДКолонки) ИЛИ ПустаяСтрока(Выборка.УИДДорожки) Тогда
			Возврат Ложь;	
		КонецЕсли;
		
		стПараметрыПерехода = омКанбанНачальноеЗаполнение.ПолучитьСтруктуруДляЭлементовКанбана("ПереходКарточки"
				, "Добавлен комплект " + Наименование + "(" + Формат(ТекущаяДата(), "ДФ=dd.MM.yy") + ")");
		
		стПараметрыПерехода.Доска 			= Выборка.УИДДоски;
		стПараметрыПерехода.НомерВКолонке 	= -1;
		стПараметрыПерехода.УИДКудаКолонка 	= Выборка.УИДКолонки;
		стПараметрыПерехода.УИДКудаДорожка 	= Выборка.УИДДорожки;
		стПараметрыПерехода.УИДКарточка 	= УИДКарточка;
		
		УИДПерехода = омКанбанНачальноеЗаполнение.СоздатьДвижениеКарточки(стПараметрыПерехода); 
		
		Возврат Истина;
		
	КонецЦикла;
	
	
	Возврат Ложь;	
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ДанныеЗаполнения = Неопределено И ЗначениеЗаполнено(ДанныеЗаполнения.Родитель) Тогда
		Проект = ДанныеЗаполнения.Родитель.Проект; 
	КонецЕсли;
	
КонецПроцедуры



