
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда 

		ОсновноеПомещение = Справочники.Помещения.ПустаяСсылка();
		
		Для каждого х Из ИзделияЭлемент Цикл
			
			Если х.Основное Тогда
				
				Если ЗначениеЗаполнено(х.ИзделиеЭлемент) Тогда
					ОсновноеПомещение = х.ИзделиеЭлемент.Помещения;	
				КонецЕсли;	
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Комментарии.Количество() = 0 Тогда
			Комментарий = "";	
		Иначе
			Комментарий = Комментарии[0].Текст;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ДанныеЗаполнения = Неопределено И ЗначениеЗаполнено(ДанныеЗаполнения.Родитель) Тогда
		Проект = ДанныеЗаполнения.Родитель.Проект; 
	КонецЕсли;
	
КонецПроцедуры



