
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ЗадачаПроверкиГабаритногоЧертежа) Тогда
	
		Элементы.Проект.ТолькоПросмотр 			= Истина;	
		Элементы.ИзделиеКомплект.ТолькоПросмотр = Истина;
		
		стДанныеЗадачиОснования = ПолучитьДанныеЗадачиОснования(Объект.ЗадачаПроверкиГабаритногоЧертежа);
		
		Если ПустаяСтрока(стДанныеЗадачиОснования.Комментарий) Тогда
			Элементы.КоментарийОснования.Видимость 		= Ложь;	
		Иначе
			КоментарийОснования = стДанныеЗадачиОснования.Комментарий
		КонецЕсли; 
		
		Если стДанныеЗадачиОснования.СтатусЗамера = Неопределено Тогда
			СостояниеГабаритногоЧертежа = "Состояние замера " + стДанныеЗадачиОснования.ГабаритныйЧертежНаименование + " неопределено."
		Иначе
			СостояниеГабаритногоЧертежа = "Состояние замера " + стДанныеЗадачиОснования.ГабаритныйЧертежНаименование + " " + стДанныеЗадачиОснования.СтатусЗамера + ".";
			Если стДанныеЗадачиОснования.СтатусЗамера = ПредопределенноеЗначение("Перечисление.СтатусыЗамера.Проектный") Тогда
				Элементы.СостояниеГабаритногоЧертежа.ЦветТекста	= Новый Цвет(255, 20, 30);	
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Элементы.КоментарийОснования.Видимость 			= Ложь;	
		Элементы.СостояниеГабаритногоЧертежа.Видимость 	= Ложь;	

	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьДанныеЗадачиОснования(ЗадачаПроверкиГабаритногоЧертежа)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроверитьГабаритныеЧертежи.Комментарий КАК Комментарий,
		|	ЕСТЬNULL(СостояниеЗамераСрезПоследних.СтатусЗамера, НЕОПРЕДЕЛЕНО) КАК СтатусЗамера,
		|	ПроверитьГабаритныеЧертежи.ГабаритныйЧертеж.Наименование КАК ГабаритныйЧертежНаименование
		|ИЗ
		|	Задача.ПроверитьГабаритныеЧертежи КАК ПроверитьГабаритныеЧертежи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеЗамера.СрезПоследних КАК СостояниеЗамераСрезПоследних
		|		ПО (ПроверитьГабаритныеЧертежи.ГабаритныйЧертеж = (ВЫРАЗИТЬ(СостояниеЗамераСрезПоследних.ОбъектЗамера КАК Справочник.ГабаритныеЧертежи)))";
	
	Выборка = Запрос.Выполнить().Выбрать();

	стВозврата = Новый Структура("Комментарий, ГабаритныйЧертежНаименование, СтатусЗамера", "", "", Неопределено);
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата, Выборка);
	КонецЦикла;
	
    Возврат стВозврата;
КонецФункции // ПолучитьДанныеЗадачиОснования()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеЗамеров");
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадачу(Команда)
	Объект.Выполнена = Истина;
	Записать();
	Закрыть();
КонецПроцедуры
