
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Логирование

Процедура ЗаданиеПроверитьУдалитьИсториюОбменов() Экспорт
	
	ОбщиеНастройки = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеХранилищаНастроек("ОбщиеНастройки");
	Если ОбщиеНастройки <> Неопределено И ОбщиеНастройки.РежимОтладки = Истина Тогда
		ДатаВключенияРежимаОтладки = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеХранилищаНастроек("ДатаВключенияРежимаОтладки");
		ВремяРаботыРежимаОтладки = 60*60*24;
		Если ДатаВключенияРежимаОтладки = Неопределено ИЛИ ДатаВключенияРежимаОтладки < ТекущаяДатаСеанса() - ВремяРаботыРежимаОтладки Тогда
			ОбщиеНастройки.РежимОтладки = Ложь;
			Б24_К_ОбщегоНазначенияВызовСервера.УстановитьЗначениеВХранилищаНастроек("ОбщиеНастройки", ОбщиеНастройки);
		КонецЕсли;
	КонецЕсли;    
	
	ОбрезатьИсториюОбменов = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеХранилищаНастроек("ОбщиеНастройки", "ОбрезатьИсториюОбменов");
	Если НЕ ОбрезатьИсториюОбменов = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОбрезатьИсториюОбменов = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеХранилищаНастроек("ОбщиеНастройки", "ЧислоДнейХраненияИстории");
	
	ЧислоДнейХраненияИстории = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеХранилищаНастроек("ОбщиеНастройки","ЧислоДнейХраненияИстории");
	Если ЧислоДнейХраненияИстории = Неопределено Тогда
		ЧислоДнейХраненияИстории = Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьОбщиеНастройкиПоУмолчанию().ЧислоДнейХраненияИстории;
	КонецЕсли;
	
	ОбрезатьЛог(ЧислоДнейХраненияИстории);
	
КонецПроцедуры

Процедура ОбрезатьЛог(ЧислоДнейХраненияИстории) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	Б24_К_Логирование.Период КАК Период
	|ИЗ
	|	РегистрСведений.Б24_К_Логирование КАК Б24_К_Логирование
	|
	|СГРУППИРОВАТЬ ПО
	|	Б24_К_Логирование.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		
		ДатаКонца = НачалоДня(ТекущаяДатаСеанса())- 60*60*24*ЧислоДнейХраненияИстории;
		
		Выборка = ВыполненныйЗапрос.Выбрать(); 
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Период <= ДатаКонца Тогда
				
				НаборЗаписей = РегистрыСведений.Б24_К_Логирование.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
				
				НаборЗаписей.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьИзмеренияЛогирования(СтруктураНастроек) Экспорт
	
	СтруктураНастроек.Логирование.Измерение1 = "";
	СтруктураНастроек.Логирование.Измерение2 = "";
	СтруктураНастроек.Логирование.Измерение3 = "";
	СтруктураНастроек.Логирование.Измерение4 = "";
	СтруктураНастроек.Логирование.Измерение5 = "";
	СтруктураНастроек.Логирование.Измерение6 = "";
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
