
&НаКлиенте
Процедура ТипОтчетаСтрокаПриИзменении(Элемент)
	Элементы.Интервал.Видимость = ТипОтчета;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТипОтчетаСтрокаПриИзменении(Неопределено);
	
	Интервал.ДатаОкончания = ТекущаяДата();
	Интервал.ДатаНачала		= ДобавитьМесяц(Интервал.ДатаОкончания, -2);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	Макет = Обработки.ПриостановленныеКомплекты.ПолучитьМакет("Макет");
	
	ПолеВывода.Очистить();
	
	ПолеВывода.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	Если ТипОтчета Тогда
	    ТаблицаВывода = Новый ТаблицаЗначений;
	Иначе	
		ТаблицаВывода = ПолучитьТаблицуВыводаСостояние();	
	КонецЕсли;                                
	
	Область = Макет.ПолучитьОбласть("Строка");
	
	Для каждого х Из ТаблицаВывода Цикл
	
		Область.Параметры.Заполнить(х);
		ПолеВывода.Вывести(Область);
	
	КонецЦикла;
	
КонецПроцедуры 

Функция ПолучитьТаблицуВыводаСостояние()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГлабольныеСостояниеКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ГлабольныеСостояниеКомплектаСрезПоследних.ПредыдущаяСтадия КАК ПредыдущаяСтадия,
		|	ГлабольныеСостояниеКомплектаСрезПоследних.Период КАК Дата
		|ИЗ
		|	РегистрСведений.ГлабольныеСостояниеКомплекта.СрезПоследних КАК ГлабольныеСостояниеКомплектаСрезПоследних
		|ГДЕ
		|	ГлабольныеСостояниеКомплектаСрезПоследних.ГлобальныйСтатус = &ГлобальныйСтатус
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	ГлабольныеСостояниеКомплектаСрезПоследних.Комплект.Наименование";
	
	Запрос.УстановитьПараметр("ГлобальныйСтатус", Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТаблицуВыводаСостояние()


&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры
