
&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Проект) Тогда
	
		Элементы.Комплект.ТолькоПросмотр = Ложь;
		Элементы.Комплект.СписокВыбора.ЗагрузитьЗначения(ПолучитьКомплектыПроекта(Проект));
	
	Иначе
	
		Элементы.Комплект.СписокВыбора.Очистить();
		Элементы.Комплект.ТолькоПросмотр = Истина;
	
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьКомплектыПроекта(Проект)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Проект = &Проект
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзделияКомплект.Наименование";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции // ПолучитьКомплектыПроекта()
 