
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("НеЗакрывать", 	НеЗакрывать); 
	Параметры.Свойство("Задача", 		Задача); 
	
	Если ЗначениеЗаполнено(Задача) Тогда
		Комплект = Задача.ОбъектТЗ;
	Иначе
		Параметры.Свойство("Комплект", Комплект);
	КонецЕсли;
	
	Элементы.Задача.Видимость = ЗначениеЗаполнено(Задача);
	
	Отказ = Не ЗначениеЗаполнено(Комплект);
	
	Если НЕ Отказ Тогда
		СоздатьФоновуюЗадачу();	
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьФоновуюЗадачу()
	
	АдресРезультата = ПоместитьВоВременноеХранилище("", УникальныйИдентификатор);
	
	ПараметрыФункции 	= Новый Массив(2);
	ПараметрыФункции[0] = Комплект;	
	ПараметрыФункции[1] = АдресРезультата;	
	Задание = ФоновыеЗадания.Выполнить("омФайлыPDM.ИнформацияОЗаблокированныхPDM", ПараметрыФункции, , "ИнформацияОЗаблокированныхPDM");
	ЗаданиеУникальныйИдентификатор = Задание.УникальныйИдентификатор;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПроверкаВыполненияФоновогоЗадания", 0.6, Истина);
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗавершитьЗадачу()
	
	ЗавершитьЗадачуНаСервере(Задача);
	стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Задача, "ЗабратьПрава");
	
	Если ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
		Закрыть();
	Иначе	
		ПоказатьПредупреждение(,стВозврата.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗавершитьЗадачуНаСервере(ЗадачаПКД) 
	
	Если ТипЗнч(ЗадачаПКД) = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда 
		
		мКомплектыДляАналогичногоДействия = Новый Массив;
		Задачи.Задачи_ПКД.ДействияНаСервере("ЗавершениеРаботы", мКомплектыДляАналогичногоДействия, ЗадачаПКД, ЗадачаПКД.ТипЗадачи, ЗадачаПКД.Исполнитель, ЗадачаПКД.ОбъектТЗ);	
		
	ИначеЕсли ТипЗнч(ЗадачаПКД) = Тип("ЗадачаСсылка.Задачи_РКД") Тогда
	
		Задачи.Задачи_РКД.ДействияНаСервере("ЗавершениеРаботы", ЗадачаПКД, ЗадачаПКД.ОбъектТЗ, ЗадачаПКД.НеИзменяетСтадию);	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаВыполненияФоновогоЗадания()

	ДанныеВыполнения = ПроверитьВыполнениеФоновогоЗаданияНаСервере(ЗаданиеУникальныйИдентификатор);
	
	Если ДанныеВыполнения.Активно Тогда
		ПодключитьОбработчикОжидания("ПроверкаВыполненияФоновогоЗадания", 0.4, Истина)
	Иначе
		
		
		СтрокаХМЛ = ПолучитьИзВременногоХранилища(АдресРезультата);
		
		Если ПустаяСтрока(СтрокаХМЛ) Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияОповещения", ЭтаФорма);
			ПоказатьПредупреждение(ОписаниеОповещения, "Не удалось получить данные");
			
		Иначе	
			
			ДобавитьСтрокиВТаблицу(СтрокаХМЛ);
			
			Если ТаблицаРазрегестрированых.Количество() = 0 И НЕ НеЗакрывать Тогда
				ЗавершитьЗадачу();
				Если Открыта() Тогда
					Закрыть();	
				КонецЕсли;
			КонецЕсли;
			
			Элементы.ГруппаОжидание.Видимость 				= Ложь;
			Элементы.ГруппаРазрегестрированые.Видимость 	= Истина;
			
		КонецЕсли;
		
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПроверитьВыполнениеФоновогоЗаданияНаСервере(ЗаданиеУникальныйИдентификатор)
	
	ДанныеВыполнения = Новый Структура("Активно, Сообщение", Ложь ,"");
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ЗаданиеУникальныйИдентификатор);
	
	Если Задание = Неопределено Тогда
	
		Возврат ДанныеВыполнения;	
	
	КонецЕсли; 
	
	ДанныеВыполнения.Активно = Задание.Состояние = СостояниеФоновогоЗадания.Активно;
	
	Если НЕ ДанныеВыполнения.Активно Тогда
		
		Для Каждого Сообщение Из Задание.ПолучитьСообщенияПользователю(Истина) Цикл
			ДанныеВыполнения.Сообщение = Сообщение;
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат ДанныеВыполнения;
	
КонецФункции // ПроверитьВыполнениеФоновогоЗаданияНаСервере()


&НаКлиенте
Функция ДобавитьСтрокиВТаблицу(СтрокаХМЛ)

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаХМЛ);
	
	ИмяПоля = "";
	ИмяПК 	= НРег(ИмяКомпьютера());
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.Имя = "files_folders" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЧтениеXML.Имя = "file_folders" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			НоваяСтрока = ТаблицаРазрегестрированых.Добавить();
			
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ИмяПоля = ЧтениеXML.Имя;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст И Не ПустаяСтрока(ИмяПоля) Тогда
			Если ИмяПоля = "name" Тогда
				НоваяСтрока.ИмяФайла 			= ЧтениеXML.Значение;
			ИначеЕсли ИмяПоля = "local_path" Тогда
				НоваяСтрока.ПутьКФайлу 			= ЧтениеXML.Значение;
			ИначеЕсли ИмяПоля = "LockedByUserName" Тогда
				НоваяСтрока.КтоЗаблокировал 	= ЧтениеXML.Значение;
			ИначеЕсли ИмяПоля = "LockedOnComputer" Тогда
				НоваяСтрока.Компьютер 			= ЧтениеXML.Значение;
			КонецЕсли;
		КонецЕсли; 
		
		Если ЧтениеXML.Имя = "file_folders" И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			НоваяСтрока.НаЛокальномКомпе = НРег(НоваяСтрока.Компьютер) = ИмяПК;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции // ДобавитьСтрокиВДерево() 

&НаКлиенте
Процедура ТаблицаРазрегестрированыхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРазрегестрированыхПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРазрегестрированыхПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТД = Элементы.ТаблицаРазрегестрированых.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКфайлу = ТД.ПутьКФайлу + ТД.ИмяФайла;
	
	Файл = Новый Файл(ПутьКфайлу);
	
	Если Файл.Существует() Тогда
		ЗапуститьПриложение(ПутьКфайлу);
	Иначе
		ПоказатьПредупреждение(, "Файл " + ПутьКфайлу + " не существует на локальном компьютере.");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияОповещения(ДополнительныеПараметры) Экспорт

	Закрыть();	

КонецПроцедуры // ПослеЗакрытияОповещения()

&НаКлиенте
Процедура Обновить(Команда)
	
	ТаблицаРазрегестрированых.Очистить();
	
	Элементы.ГруппаОжидание.Видимость 			= Истина;
	Элементы.ГруппаРазрегестрированые.Видимость = Ложь;
	
	
	СоздатьФоновуюЗадачу();	
	ПодключитьОбработчикОжидания("ПроверкаВыполненияФоновогоЗадания", 0.8, Истина);
	
КонецПроцедуры


