
&НаКлиенте
Функция ВыгрузитьВPDM(ЭлементВыгрузки, ТипВыгрузки = "Комплект", ПараметрыВыгрузки = Неопределено) Экспорт       
	
	стВозврата = Новый Структура("ОписаниеОшибки,ВыгруженВPDM","","");
	
	стДанныеВыгрузки = омВыгрузкаCRMНаСевере.ПолучитьДанныеВыгрузки();
	
	ПутьКФайлуEXE = ом_ПДМ_клиент_сервер.ПолучитьПутьКВыгузке(ТипВыгрузки, стДанныеВыгрузки);
	
	Если ПустаяСтрока(ПутьКФайлуEXE) Тогда       
		
		стВозврата.ОписаниеОшибки = "Не заполнен путь к исполняемому файлу.";        
		Возврат стВозврата;	
	
	КонецЕсли;
	
	ПутьКФайлуЗагрузки = стДанныеВыгрузки.ПутьКФайлуЗагрузки; 
	
	Если ПустаяСтрока(ПутьКФайлуЗагрузки) Тогда
		
		стВозврата.ОписаниеОшибки = "Каталог выгрузки не заполнен.";
		Возврат стВозврата;	
	
	КонецЕсли;
	
	ТестКаталог = Новый Файл(ПутьКФайлуЗагрузки); 
	
	Если НЕ ТестКаталог.Существует() Тогда
		
		стВозврата.ОписаниеОшибки = "Каталог " + ПутьКФайлуЗагрузки + " не существует.";
		Возврат стВозврата;	
	
	КонецЕсли; 

	стДанныеЭлемента = омВыгрузкаCRMНаСевере.ПолучитьДанныеЭлемента(ЭлементВыгрузки, ТипВыгрузки, ПараметрыВыгрузки);
	
	НаименованиеЭлемента = стДанныеЭлемента.НаименованиеЭлемента;
	
	КоличествоЭлементов = стДанныеЭлемента.мДанныеЭлемента.Количество();
	
	Если КоличествоЭлементов = 0 Тогда
		
		Если ПустаяСтрока(стДанныеЭлемента.Ошибка) Тогда
			стВозврата.ОписаниеОшибки = "Нет данных для выгрузки";	
		Иначе
			стВозврата.ОписаниеОшибки = стДанныеЭлемента.Ошибка;	
		КонецЕсли; 
		
	ИначеЕсли КоличествоЭлементов = 1 Тогда
		
		ТекстДок = ом_ПДМ_клиент_сервер.СоздатьФайлВыгрузки(стДанныеЭлемента.мДанныеЭлемента, ТипВыгрузки);
		
		ом_ПДМ_клиент_сервер.ЗапуститьИсполнение(ТекстДок, стВозврата, ТестКаталог, ПутьКФайлуEXE, НаименованиеЭлемента, ТипВыгрузки, ЭлементВыгрузки);
		
	Иначе
		
		стПараметры = Новый Структура("мДанныеЭлемента, ТипВыгрузки, НаименованиеЭлемента", 
										стДанныеЭлемента.мДанныеЭлемента, ТипВыгрузки, НаименованиеЭлемента);
		ОткрытьФорму("ОбщаяФорма.ФормаОтправкаНесколькихЗначенийВ_ПДМ", стПараметры);
		
	КонецЕсли;
	
	Возврат стВозврата;
	
КонецФункции // ВыгрузитьВPDM()

