
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Комплект,
		|	ИзделияКомплект.Родитель.Композиция КАК Композиция
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Родитель.Композиция В(&Композиция)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаймингКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ТаймингКомплектаСрезПоследних.ВСоставеКомпозиции КАК ВСоставеКомпозиции,
		|	ТаймингКомплектаСрезПоследних.ДатаОтказаСогласования КАК ДатаОтказаСогласования,
		|	ТаймингКомплектаСрезПоследних.ДатаОтправкиСогласования КАК ДатаОтправкиСогласования,
		|	ТаймингКомплектаСрезПоследних.ДатаСогласования КАК ДатаСогласования
		|ИЗ
		|	РегистрСведений.ТаймингКомплекта.СрезПоследних(, Комплект В (&Комплект)) КАК ТаймингКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Композиция", Комплекты.ВыгрузитьКолонку("Комплект"));
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаКомплектов = Результат[0].Выгрузить();
	ТаблицаКомплектов.Индексы.Добавить("Композиция");
	
	ТаблицаТекущих = Результат[1].Выгрузить();
	ТаблицаТекущих.Индексы.Добавить("Композиция");
	
	Отбор = Новый Структура("Композиция", );
	ТипКомпозиция = Тип("СправочникСсылка.Композиции");
	
	// регистр ВнешнееСогласование
	Движения.ВнешниеСогласования.Записывать = Истина;
	Для Каждого ТекСтрокаКомплекты Из Комплекты Цикл
		
		Движение = Движения.ВнешниеСогласования.Добавить();
		Движение.Период 			= Дата;
		Движение.Проект 			= Проект;
		Движение.ДатаОтправки 		= ДатаОтправки;
		Движение.Комплект 			= ТекСтрокаКомплекты.Комплект;
		Движение.ДатаОтказа 		= ТекСтрокаКомплекты.ДатаОтказа;
		Движение.ДатаСогласования 	= ТекСтрокаКомплекты.ДатаСогласования;
		Движение.ВСоставеКомпозиции = Ложь;
		
		Отбор.Композиция = ТекСтрокаКомплекты.Комплект;
		ЗаписатьВТаймингКомплекта(ТаблицаТекущих, Отбор, Движение);
		
		Если ТипКомпозиция = ТипЗнч(ТекСтрокаКомплекты.Комплект) Тогда
			
			Для каждого х Из ТаблицаКомплектов.НайтиСтроки(Отбор) Цикл
				
				Движение = Движения.ВнешниеСогласования.Добавить();
				Движение.Период 			= Дата;
				Движение.Проект 			= Проект;
				Движение.ДатаОтправки 		= ДатаОтправки;
				Движение.Комплект 			= х.Комплект;
				Движение.ДатаОтказа 		= ТекСтрокаКомплекты.ДатаОтказа;
				Движение.ДатаСогласования 	= ТекСтрокаКомплекты.ДатаСогласования;
				Движение.ВСоставеКомпозиции = Истина;
				
				Отбор.Композиция = х.Комплект;
				ЗаписатьВТаймингКомплекта(ТаблицаТекущих, Отбор, Движение);
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры 

Процедура ЗаписатьВТаймингКомплекта(ТаблицаТекущих, Отбор, ТекСтрокаКомплекты)
	
	НайденыеСтроки = ТаблицаТекущих.НайтиСтроки(Отбор);
	
	Если НайденыеСтроки.Количество() > 0 Тогда
		ТС = НайденыеСтроки[0];
		
		Если ТС.ДатаОтправки 		= ДатаОтправки 
			И ТС.ДатаОтказа 		= ТекСтрокаКомплекты.ДатаОтказа 
			И ТС.ДатаСогласования 	= ТекСтрокаКомплекты.ДатаСогласования 
			И ТС.ВСоставеКомпозиции = ТекСтрокаКомплекты.ВСоставеКомпозиции Тогда
			
			Возврат;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ЗначениеРесурсов 					= омЗаписьВРегистры.ПолучитьСтркутуруДанныхДляЗаписиВРегистрТаймингКомплекта(ТекСтрокаКомплекты.Комплект);		
	ЗначениеРесурсов.ДатаОтправки 		= ТекСтрокаКомплекты.СозданиеЭлемента;
	ЗначениеРесурсов.ДатаОтказа 		= ТекСтрокаКомплекты.ДатаОтказа;
	ЗначениеРесурсов.ДатаСогласования 	= ТекСтрокаКомплекты.ДатаСогласования;
	ЗначениеРесурсов.ВСоставеКомпозиции = ТекСтрокаКомплекты.ВСоставеКомпозиции;
	
	омЗаписьВРегистры.ЗаписатьВРегистрТаймингКомплекта(ЗначениеРесурсов);
	
КонецПроцедуры

