
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Комплект,
		|	ИзделияКомплект.Родитель.Композиция КАК Композиция
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Родитель.Композиция В(&Композиция)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаймингКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ТаймингКомплектаСрезПоследних.ВСоставеКомпозиции КАК ВСоставеКомпозиции,
		|	ТаймингКомплектаСрезПоследних.ДатаОтказаСогласования КАК ДатаОтказаСогласования,
		|	ТаймингКомплектаСрезПоследних.ДатаОтправкиСогласования КАК ДатаОтправкиСогласования,
		|	ТаймингКомплектаСрезПоследних.ДатаСогласования КАК ДатаСогласования
		|ИЗ
		|	РегистрСведений.ТаймингКомплекта.СрезПоследних(, Комплект В (&Композиция)) КАК ТаймингКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Композиция", Комплекты.ВыгрузитьКолонку("Комплект"));
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаКомплектов = Результат[0].Выгрузить();
	ТаблицаКомплектов.Индексы.Добавить("Композиция");
	
	ТаблицаТекущих = Результат[1].Выгрузить();
	ТаблицаТекущих.Индексы.Добавить("Комплект");
	
	Отбор 			= Новый Структура("Композиция", );
	ОтборКомплект 	= Новый Структура("Комплект", );
	ТипКомпозиция 	= Тип("СправочникСсылка.Композиции");
	
	// регистр ВнешнееСогласование
	Движения.ВнешниеСогласования.Записывать = Истина;
	Для Каждого ТекСтрокаКомплекты Из Комплекты Цикл
		
		Движение = Движения.ВнешниеСогласования.Добавить();
		Движение.Период 			= Дата;
		Движение.Проект 			= Проект;
		Движение.ДатаОтправки 		= ДатаОтправки;
		Движение.Комплект 			= ТекСтрокаКомплекты.Комплект;
		Движение.ДатаОтказа 		= ТекСтрокаКомплекты.ДатаОтказа;
		Движение.ДатаСогласования 	= ТекСтрокаКомплекты.ДатаСогласования;
		Движение.ВСоставеКомпозиции = Ложь;
		
		ОтборКомплект.Комплект 		= ТекСтрокаКомплекты.Комплект;
		ЗаписатьВТаймингКомплекта(ТаблицаТекущих, ОтборКомплект, Движение);
		
		Если ТипКомпозиция = ТипЗнч(ТекСтрокаКомплекты.Комплект) Тогда
			
			Отбор.Композиция = ТекСтрокаКомплекты.Комплект;
			Для каждого х Из ТаблицаКомплектов.НайтиСтроки(Отбор) Цикл
				
				Движение = Движения.ВнешниеСогласования.Добавить();
				Движение.Период 			= Дата;
				Движение.Проект 			= Проект;
				Движение.ДатаОтправки 		= ДатаОтправки;
				Движение.Комплект 			= х.Комплект;
				Движение.ДатаОтказа 		= ТекСтрокаКомплекты.ДатаОтказа;
				Движение.ДатаСогласования 	= ТекСтрокаКомплекты.ДатаСогласования;
				Движение.ВСоставеКомпозиции = Истина;
				
				ОтборКомплект.Комплект = х.Комплект;
				ЗаписатьВТаймингКомплекта(ТаблицаТекущих, ОтборКомплект, Движение);
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры 

Процедура ЗаписатьВТаймингКомплекта(ТаблицаТекущих, Отбор, ТекСтрокаКомплекты)
	
	НайденыеСтроки = ТаблицаТекущих.НайтиСтроки(Отбор);
	
	ПустаяДата 					= Дата(1, 1, 1);
	ИзмененаДатаОтправки 		= Ложь;
	ИзмененаДатаСогласования 	= Ложь;
	ИзмененаДатаОказа 			= Ложь;
	
	ОписаниеДействия = "";
	
	Если НайденыеСтроки.Количество() = 0 Тогда 
		
		ОписаниеДействия = ОписаниеДействия + "Установлена дата отправки согласования " + Формат(ДатаОтправки, "ДФ=dd.MM.yy");
		
		Если НЕ ТекСтрокаКомплекты.ДатаСогласования = ПустаяДата Тогда
			ИзмененаДатаСогласования = Истина;
			ОписаниеДействия = ОписаниеДействия + "Установлена дата согласования " + Формат(ТекСтрокаКомплекты.ДатаСогласования, "ДФ=dd.MM.yy");
		КонецЕсли;
		Если НЕ ТекСтрокаКомплекты.ДатаОтказа = ПустаяДата Тогда
			ИзмененаДатаОказа = Истина;
			ОписаниеДействия = ОписаниеДействия + "Установлена дата отказа согласования " + Формат(ТекСтрокаКомплекты.ДатаОтказа, "ДФ=dd.MM.yy");
		КонецЕсли;
		
		ИзмененаДатаОтправки = Истина;
		
	Иначе
		
		ТС = НайденыеСтроки[0];
		
		Если НЕ ТС.ДатаСогласования = ТекСтрокаКомплекты.ДатаСогласования Тогда
			ИзмененаДатаСогласования = Истина;	
			ОписаниеДействия = ОписаниеДействия + ?(ТС.ДатаСогласования = ПустаяДата, "Установлена", "Изменена") + " дата согласования " + Формат(ТекСтрокаКомплекты.ДатаСогласования, "ДФ=dd.MM.yy");
		КонецЕсли;
		Если НЕ ТС.ДатаОтказаСогласования 	= ТекСтрокаКомплекты.ДатаОтказа Тогда
			ИзмененаДатаОказа = Истина;
			ОписаниеДействия = ОписаниеДействия + ?(ТС.ДатаОтказаСогласования = ПустаяДата, "Установлена", "Изменена") + " дата отказа согласования " + Формат(ТекСтрокаКомплекты.ДатаОтказа, "ДФ=dd.MM.yy");
		КонецЕсли;
		Если НЕ ТС.ДатаОтправкиСогласования 	= ДатаОтправки Тогда
			ИзмененаДатаОтправки = Истина;
			ОписаниеДействия = ОписаниеДействия + ?(ТС.ДатаОтправкиСогласования = ПустаяДата, "Установлена", "Изменена") + " дата отправки согласования " + Формат(ДатаОтправки, "ДФ=dd.MM.yy");
		КонецЕсли;

		Если НЕ(ИзмененаДатаСогласования ИЛИ ИзмененаДатаОказа ИЛИ ИзмененаДатаОтправки) Тогда
			
			Возврат;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ЗначениеРесурсов = омЗаписьВРегистры.ПолучитьСтркутуруДанныхДляЗаписиВРегистрТаймингКомплекта(ТекСтрокаКомплекты.Комплект);		
	ЗначениеРесурсов.ДатаОтправкиСогласования 	= ДатаОтправки;
	ЗначениеРесурсов.ДатаОтказаСогласования 	= ТекСтрокаКомплекты.ДатаОтказа;
	ЗначениеРесурсов.ДатаСогласования 			= ТекСтрокаКомплекты.ДатаСогласования;
	ЗначениеРесурсов.ВСоставеКомпозиции 		= ТекСтрокаКомплекты.ВСоставеКомпозиции;
	ЗначениеРесурсов.ОписаниеДействия 			= ОписаниеДействия;
	
	омЗаписьВРегистры.ЗаписатьВРегистрТаймингКомплекта(ЗначениеРесурсов);
	
КонецПроцедуры

