&НаСервере
Функция ПолучитьИмяПапки(СсылкаНаГруппу) Экспорт
	Возврат СсылкаНаГруппу.Наименование;
КонецФункции // ПолучитьИмяПапки()

Процедура ПечатьРасширенный(ТабДок, Ссылка) Экспорт
	Макет = Справочники.ПриложенияКДоговорам.ПолучитьМакет("ПечатьРасширенный");
	ПечатьПриложения(ТабДок, Ссылка, Макет);
КонецПроцедуры

Процедура ПечатьКраткое(ТабДок, Ссылка) Экспорт
	Макет = Справочники.ПриложенияКДоговорам.ПолучитьМакет("ПечатьКраткий");
	ПечатьПриложения(ТабДок, Ссылка, Макет);
КонецПроцедуры

Процедура ПечатьПриложения(ТабДок, Ссылка, Макет) Экспорт

	обШапка 	= Макет.ПолучитьОбласть("Шапка");
	обИзделие 	= Макет.ПолучитьОбласть("Изделие");
	обУслуга 	= Макет.ПолучитьОбласть("Услуга");
	обПодвал 	= Макет.ПолучитьОбласть("Подвал");
	
	стДанные = ПолучитьЗапрос(Ссылка,Ложь);
	
	Выборка 			= стДанные.Выборка;
	тзИзделиеЗаказчика 	= стДанные.тзИзделиеЗаказчика;

	ТабДок.Очистить();

	стОтбор = Новый Структура("Договор",); 
	
	ВыводитьСуммы = РольДоступна("ЦенаВДоговоре");
	ПустаяКартинка = БиблиотекаКартинок.Пустая;	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		Итого 			= 0;
		НомерПоПорядку 	= 1;

		обШапка.Параметры.Заполнить(Выборка);
		обШапка.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора,"ДЛФ=DD");
		ТабДок.Вывести(обШапка);

		стОтбор.Договор = Выборка.Договор;      
		
		Для Каждого х из тзИзделиеЗаказчика.НайтиСтроки(стОтбор) Цикл
			обИзделие.Параметры.Заполнить(х);
			Если ВыводитьСуммы Тогда
				обИзделие.Параметры.Сумма = х.Цена * х.Количество;
				Итого = Итого + обИзделие.Параметры.Сумма;
			Иначе
				обИзделие.Параметры.Цена = "";	
			КонецЕсли;
			обИзделие.Параметры.Номер = НомерПоПорядку;
			
			Если ТипЗнч(х.Картинка) = Тип("ХранилищеЗначения") Тогда
				Данные = х.Картинка.Получить();
				Если ТипЗнч(Данные) = Тип("Картинка") Тогда
					лкКартинка = Данные;
				ИначеЕсли ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
					лкКартинка = Новый Картинка(Данные, Ложь);
				Иначе
					лкКартинка = Неопределено;
				КонецЕсли;	
			Иначе
				лкКартинка = Неопределено;
			КонецЕсли;
			
			Если лкКартинка = Неопределено Тогда
				обИзделие.Рисунки.D1.Картинка = ПустаяКартинка; 			
			Иначе
				обИзделие.Рисунки.D1.Картинка = лкКартинка; 			
			КонецЕсли;
			
			ТабДок.Вывести(обИзделие);
			
			НомерПоПорядку = НомерПоПорядку + 1;
		КонецЦикла;
		
		ВыборкаУслугиПриложенияДоговора = Выборка.УслугиПриложенияДоговора.Выбрать(); 
		
		Пока ВыборкаУслугиПриложенияДоговора.Следующий() Цикл
			обУслуга.Параметры.Заполнить(ВыборкаУслугиПриложенияДоговора);
			Если ВыводитьСуммы Тогда
				Итого = Итого + ВыборкаУслугиПриложенияДоговора.Сумма;
			Иначе
				обУслуга.Параметры.Цена  = "";	
				обУслуга.Параметры.Сумма = "";	
			КонецЕсли;
			обУслуга.Параметры.Номер = НомерПоПорядку;
			ТабДок.Вывести(обУслуга);
			НомерПоПорядку = НомерПоПорядку + 1;
		КонецЦикла;
		
		Если ВыводитьСуммы Тогда
			обПодвал.Параметры.Итого = Итого;	
			ТабДок.Вывести(обПодвал); 
		КонецЕсли;
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьЗапрос(Ссылка, Краткое = Истина)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриложенияКДоговорам.ДатаДоговора КАК ДатаДоговора,
	|	ПриложенияКДоговорам.Отказ КАК Отказ,
	|	ПриложенияКДоговорам.Проект КАК Проект,
	|	ПриложенияКДоговорам.УслугиПриложенияДоговора.(
	|		НомерСтроки КАК НомерСтроки,
	|		УслугаПриложенияДоговора КАК Наименование,
	|		Количество КАК Количество,
	|		Комментарий КАК Комментарий,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Цена КАК Цена,
	|		"""" КАК РазмерТЗ,
	|		"""" КАК Помещения,
	|		Сумма КАК Сумма
	|	) КАК УслугиПриложенияДоговора,
	|	ПриложенияКДоговорам.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ПриложенияКДоговорам КАК ПриложенияКДоговорам
	|ГДЕ
	|	ПриложенияКДоговорам.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеИзделияЗаказчика.НаименованиеСАртикулом КАК Наименование,
	|	ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика.Количество КАК Количество,
	|	ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика.ЦенаВДоговоре КАК Цена,
	|	ПриложенияКДоговорамИзделияЗаказчика.НомерСтроки КАК НомерСтроки,
	|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка КАК Договор,
	|	ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика.РазмерПоТЗ КАК РазмерТЗ,
	|	ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика.ПомещенияСтрокой КАК Помещение,
	|	ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика.Описание КАК Описание,
	|	ПриложенияКДоговорамИзделияЗаказчика.Комментарий КАК Комментарий,
	|	КартинкиНоменклатуры.Картинка КАК Картинка
	|ИЗ
	|	Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК ПриложенияКДоговорамИзделияЗаказчика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
	|		ПО ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика = ДанныеИзделияЗаказчика.ИзделиеЗаказчика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КартинкиНоменклатуры КАК КартинкиНоменклатуры
	|		ПО ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика = КартинкиНоменклатуры.ИзделиеЭлемент
	|ГДЕ
	|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка В(&Ссылка)
	|	И ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика.Количество > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	
	Результат = Запрос.ВыполнитьПакет();
	
	тзИзделиеЗаказчика = Результат[1].Выгрузить();
	
	Выборка = Результат[0].Выбрать();

	                                                   
	Возврат Новый Структура("тзИзделиеЗаказчика,Выборка",тзИзделиеЗаказчика,Выборка);
	
КонецФункции // ПолучитьЗапрос()

&НаСервере
Функция ПолучитНаименованиеТабличногоДокумента(ПараметрКоманды) Экспорт

	Если Тип("Массив") = ТипЗнч(ПараметрКоманды) Тогда
		Если ПараметрКоманды.Количество() = 0 Тогда
			Возврат "";
		Иначе
		СсылкаПриложения = ПараметрКоманды[0];
		КонецЕсли;
	
	ИначеЕсли Тип("СправочникСсылка.ПриложенияКДоговорам") = ТипЗнч(ПараметрКоманды) Тогда
		СсылкаПриложения = ПараметрКоманды;
	Иначе
		Возврат "";	
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриложенияКДоговорам.ДатаДоговора КАК ДатаДоговора,
		|	ПриложенияКДоговорам.НомерДоговора КАК НомерДоговора,
		|	ПриложенияКДоговорам.Проект.Наименование КАК Проект
		|ИЗ
		|	Справочник.ПриложенияКДоговорам КАК ПриложенияКДоговорам
		|ГДЕ
		|	ПриложенияКДоговорам.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаПриложения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаименованиеТабличногоДокумента = "";
	Пока Выборка.Следующий() Цикл
		НаименованиеТабличногоДокумента = "Приложение " + Выборка.Проект + " №" +  Выборка.НомерДоговора + " от " + Формат(Выборка.ДатаДоговора,"ДФ=dd.MM.yy");
	КонецЦикла;
	
    Возврат НаименованиеТабличногоДокумента;
КонецФункции // ПолучитНаименованиеТабличногоДокумента()

// КомплектыКомпозиции это массив или список значений с композициями и комплектами
Функция ПолучитьДатыКомплектовПриложенияКДоговору(КомплектыКомпозиции, ИзПроекта = Истина, МинимальныеДаты = Истина) Экспорт

	ОписаниеДата = Новый ОписаниеТипов("Дата");
	ТаблицаВозврата = Новый ТаблицаЗначений;
	ТаблицаВозврата.Колонки.Добавить("КомплектыКомпозиции");
	ТаблицаВозврата.Колонки.Добавить("СрокОкончанияМонтажа", 		ОписаниеДата);
	ТаблицаВозврата.Колонки.Добавить("СрокОкончанияПроизводства", 	ОписаниеДата);
	ТаблицаВозврата.Колонки.Добавить("СрокОкончанияПКД", 			ОписаниеДата);
	
	Если ИзПроекта Тогда
	
		Возврат ПолучитьИзПроекта(ТаблицаВозврата, КомплектыКомпозиции);	
	
	Иначе
	
		Возврат ПолучитьИзПриложения(ТаблицаВозврата, КомплектыКомпозиции, МинимальныеДаты);	
	
	КонецЕсли;
	
	
КонецФункции // ПолучитьДатыКомплектовПриложенияКДоговору() 

Функция ПолучитьИзПроекта(ТаблицаВозврата, КомплектыКомпозиции)

	КомплектыПоПроектам = ПолучитьДанныеПоПроектам(КомплектыКомпозиции); 
	ДанныеПроектов		= ПолучитьДанныеПроектов(КомплектыПоПроектам.ВыгрузитьКолонку("Проект"));
	
	Отбор = Новый Структура("Проект", );
	
	Для каждого ТекущийПроект Из ДанныеПроектов Цикл
		
		Отбор.Проект = ТекущийПроект.Проект;
		Для каждого ТекущийКомплект Из КомплектыПоПроектам.НайтиСтроки(Отбор) Цикл
			
			НС = ТаблицаВозврата.Добавить();	
			НС.КомплектыКомпозиции = ТекущийКомплект.КомплектыКомпозиции;
			
			ЗаполнитьЗначенияСвойств(НС, ТЕкущийПроект);
			
		КонецЦикла;
		
	КонецЦикла; 
	
	Возврат ТаблицаВозврата;

КонецФункции // ПолучитьИзПроекта(ТаблицаВозврата, КомплектыКомпозиции)

Функция ПолучитьДанныеПроектов(Проекты)


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.КрайМонтажа КАК СрокОкончанияМонтажа,
		|	Проекты.КрайПКД КАК СрокОкончанияПКД,
		|	Проекты.КрайПроизводства КАК СрокОкончанияПроизводства,
		|	Проекты.Ссылка КАК Проект
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.Ссылка В(&Проекты)";
	
	Запрос.УстановитьПараметр("Проекты", Проекты);
	
	Возврат Запрос.Выполнить().Выгрузить();
	

КонецФункции // ПолучитьДанныеПроектов()


Функция ПолучитьДанныеПоПроектам(КомплектыКомпозиции)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК КомплектыКомпозиции,
		|	ИзделияКомплект.Проект КАК Проект
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Ссылка В(&Ссылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Композиции.Ссылка,
		|	Композиции.Проект
		|ИЗ
		|	Справочник.Композиции КАК Композиции
		|ГДЕ
		|	Композиции.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", ?(ТипЗнч(КомплектыКомпозиции) = Тип("СписокЗначений")
																	, КомплектыКомпозиции.ВыгрузитьЗначение()
																	, КомплектыКомпозиции));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьДанныеПоПроектам()


Функция ПолучитьИзПриложения(ТаблицаВозврата, КомплектыКомпозиции, МинимальныеДаты)

    СтруктураДанных = РазделитьДанные(КомплектыКомпозиции); // Комплекты, Композиции
	
	Если СтруктураДанных.Композиции.Количество() = 0 Тогда
		ТаблицаСоответствия = Неопределено;
	Иначе
		ТаблицаСоответствия = ДополнитьКомплекты(СтруктураДанных);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК ИзделиеКомплект,
		|	МАКСИМУМ(ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ДатаДоговора) КАК ДатаДоговора
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК ПриложенияКДоговорамИзделияЗаказчика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|			ПО ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент = ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент
		|		ПО ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика = ИзделияЗаказчикаИзделияЭлемент.Ссылка
		|ГДЕ
		|	ИзделияКомплектИзделияЭлемент.Ссылка В(&Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияКомплектИзделияЭлемент.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК Комплект,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокОкончанияМонтажа КАК СрокОкончанияМонтажа,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокОкончанияПКД КАК СрокОкончанияПКД,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокОкончанияПроизводства КАК СрокОкончанияПроизводства,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.Отказ КАК Отказ
		|ПОМЕСТИТЬ втКомплект
		|ИЗ
		|	Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК ПриложенияКДоговорамИзделияЗаказчика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|			ПО ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент = ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент
		|		ПО ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика = ИзделияЗаказчикаИзделияЭлемент.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ДатаДоговора = вт.ДатаДоговора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКомплект.Комплект КАК Комплект,
		|	втКомплект.СрокОкончанияМонтажа КАК СрокОкончанияМонтажа,
		|	втКомплект.СрокОкончанияПКД КАК СрокОкончанияПКД,
		|	втКомплект.СрокОкончанияПроизводства КАК СрокОкончанияПроизводства,
		|	втКомплект.Отказ КАК Отказ
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКомплект КАК втКомплект
		|		ПО вт.ИзделиеКомплект = втКомплект.Комплект";
	
	Запрос.УстановитьПараметр("Ссылка", СтруктураДанных.Параметр);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НайденаяСтрока = ТаблицаВозврата.Найти(Выборка.Комплект, "КомплектыКомпозиции");
		
		Если НайденаяСтрока = Неопределено Тогда
			
			Если НЕ СтруктураДанных.Комплекты.Найти(Выборка.Комплект) = Неопределено Тогда
				НС = ТаблицаВозврата.Добавить();
				НС.КомплектыКомпозиции = Выборка.Комплект;
				ЗаполнитьЗначенияСвойств(НС, Выборка);
			КонецЕсли;
			
		Иначе
		
			Если МинимальныеДаты Тогда
			
				НайденаяСтрока.СрокОкончанияМонтажа 		= Мин(НайденаяСтрока.СрокОкончанияМонтажа, 		Выборка.СрокОкончанияМонтажа);	
				НайденаяСтрока.СрокОкончанияПКД 			= Мин(НайденаяСтрока.СрокОкончанияПКД, 			Выборка.СрокОкончанияПКД);	
				НайденаяСтрока.СрокОкончанияПроизводства 	= Мин(НайденаяСтрока.СрокОкончанияПроизводства, Выборка.СрокОкончанияПроизводства);	
			
			Иначе
			
				НайденаяСтрока.СрокОкончанияМонтажа 		= Макс(НайденаяСтрока.СрокОкончанияМонтажа, 		Выборка.СрокОкончанияМонтажа);	
				НайденаяСтрока.СрокОкончанияПКД 			= Макс(НайденаяСтрока.СрокОкончанияПКД, 			Выборка.СрокОкончанияПКД);	
				НайденаяСтрока.СрокОкончанияПроизводства 	= Макс(НайденаяСтрока.СрокОкончанияПроизводства, 	Выборка.СрокОкончанияПроизводства);	
			
			КонецЕсли;
		
		КонецЕсли;
		
		Если НЕ ТаблицаСоответствия = Неопределено Тогда
			
			НайденаяСтрока = ТаблицаСоответствия.Найти(Выборка.Комплект, "Комплект");
			
			ПустаяДата = Дата(1, 1, 1);
			
			Если НЕ НайденаяСтрока = Неопределено Тогда
				
				Если МинимальныеДаты Тогда
					
					Если НайденаяСтрока.СрокОкончанияМонтажа = ПустаяДата Тогда
						НайденаяСтрока.СрокОкончанияМонтажа 	= Выборка.СрокОкончанияМонтажа;	
					Иначе
						НайденаяСтрока.СрокОкончанияМонтажа 	= Мин(НайденаяСтрока.СрокОкончанияМонтажа, 	Выборка.СрокОкончанияМонтажа);	
					КонецЕсли;
					
					Если НайденаяСтрока.СрокОкончанияПКД = ПустаяДата Тогда
						НайденаяСтрока.СрокОкончанияПКД 	= Выборка.СрокОкончанияПКД;	
					Иначе
						НайденаяСтрока.СрокОкончанияПКД 	= Мин(НайденаяСтрока.СрокОкончанияПКД, 	Выборка.СрокОкончанияПКД);	
					КонецЕсли;
					
					Если НайденаяСтрока.СрокОкончанияПроизводства = ПустаяДата Тогда
						НайденаяСтрока.СрокОкончанияПроизводства 	= Выборка.СрокОкончанияПроизводства;	
					Иначе
						НайденаяСтрока.СрокОкончанияПроизводства 	= Мин(НайденаяСтрока.СрокОкончанияПроизводства, 		Выборка.СрокОкончанияПроизводства);	
					КонецЕсли;
					
				Иначе
					
					НайденаяСтрока.СрокОкончанияМонтажа 		= Макс(НайденаяСтрока.СрокОкончанияМонтажа, 		Выборка.СрокОкончанияМонтажа);	
					НайденаяСтрока.СрокОкончанияПКД 			= Макс(НайденаяСтрока.СрокОкончанияПКД, 			Выборка.СрокОкончанияПКД);	
					НайденаяСтрока.СрокОкончанияПроизводства 	= Макс(НайденаяСтрока.СрокОкончанияПроизводства, 	Выборка.СрокОкончанияПроизводства);	
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	Если НЕ ТаблицаСоответствия = Неопределено Тогда
		
		Отбор = Новый Структура("Композиция", );
		
		Для каждого ТекущаяКомпозиция Из СтруктураДанных.Композиции Цикл
		
			Отбор.Композиция = ТекущаяКомпозиция;
			НС = ТаблицаВозврата.Добавить();
			НС.КомплектыКомпозиции = ТекущаяКомпозиция;
			
			Для каждого х Из ТаблицаСоответствия.НайтиСтроки(Отбор) Цикл
			
				Если МинимальныеДаты Тогда
					
					Если НС.СрокОкончанияМонтажа = ПустаяДата Тогда
						НС.СрокОкончанияМонтажа 	= х.СрокОкончанияМонтажа;	
					Иначе
						НС.СрокОкончанияМонтажа 	= Мин(НС.СрокОкончанияМонтажа, 	х.СрокОкончанияМонтажа);	
					КонецЕсли;
					
					Если НС.СрокОкончанияПКД = ПустаяДата Тогда
						НС.СрокОкончанияПКД 	= х.СрокОкончанияПКД;	
					Иначе
						НС.СрокОкончанияПКД 	= Мин(НС.СрокОкончанияПКД, 	х.СрокОкончанияПКД);	
					КонецЕсли;
					
					Если НС.СрокОкончанияПроизводства = ПустаяДата Тогда
						НС.СрокОкончанияПроизводства 	= х.СрокОкончанияПроизводства;	
					Иначе
						НС.СрокОкончанияПроизводства 	= Мин(НС.СрокОкончанияПроизводства, х.СрокОкончанияПроизводства);	
					КонецЕсли;
					
				Иначе
					
					НС.СрокОкончанияМонтажа 		= Макс(НС.СрокОкончанияМонтажа, 		х.СрокОкончанияМонтажа);	
					НС.СрокОкончанияПКД 			= Макс(НС.СрокОкончанияПКД, 			х.СрокОкончанияПКД);	
					НС.СрокОкончанияПроизводства 	= Макс(НС.СрокОкончанияПроизводства, 	х.СрокОкончанияПроизводства);	
					
				КонецЕсли;
			
			КонецЦикла;
		
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаВозврата;

КонецФункции // ПолучитьИзПриложения()


Функция ДополнитьКомплекты(СтруктураДанных)
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Комплект,
		|	ИзделияКомплект.Родитель.Композиция КАК Композиция,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК СрокОкончанияМонтажа,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК СрокОкончанияПКД,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК СрокОкончанияПроизводства
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Родитель.Композиция В(&Композиция)";
	
	Запрос.УстановитьПараметр("Композиция", СтруктураДанных.Композиции);
	
	ТаблицаСоответствия = Запрос.Выполнить().Выгрузить();
	
	Для каждого х Из ТаблицаСоответствия Цикл
	
		СтруктураДанных.Параметр.Добавить(х.Комплект);	
	
	КонецЦикла;
	
	
	Возврат ТаблицаСоответствия;

КонецФункции // ДополнитьКомплекты()


Функция РазделитьДанные(КомплектыКомпозиции)

	ТипКомпозиции = Тип("СправочникСсылка.Композиции");
	
	СтруктураДанных = Новый Структура("Комплекты, Композиции, Параметр", Новый Массив, Новый Массив, Новый Массив);
	
	Если ТипЗнч(КомплектыКомпозиции) = Тип("СписокЗначений") Тогда
		МассивКомплектыКомпозиции = КомплектыКомпозиции.ВыгрузитьЗначение();	
	Иначе
		МассивКомплектыКомпозиции = КомплектыКомпозиции;	
	КонецЕсли;
	
	Для каждого х Из КомплектыКомпозиции Цикл
	
		Если ТипКомпозиции = ТипЗнч(х) Тогда
			СтруктураДанных.Композиции.Добавить(х);
		Иначе	
			СтруктураДанных.Комплекты.Добавить(х);
			СтруктураДанных.Параметр.Добавить(х);
		КонецЕсли;	
	
	КонецЦикла; 
	
	Возврат СтруктураДанных;

КонецФункции // РазделитьДанные()
