
Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		ЗаполнитьИтогоСделка();
		ЗаполнитьДатыОкончания();
		УстановитьАктуальность();
		ПроверкаСозданиеЗадачи();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьАктуальность()
	НаборЗаписей = РегистрыСведений.АктуальныеИзделияКомплектыЭлементы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПриложениеКДоговору.Установить(Ссылка);
	
    НаборЗаписей.Записать();
	
	мИзделияЗаказчика = ИзделияЗаказчика.ВыгрузитьКолонку("ИзделиеЗаказчика");
	
	
	
	Для каждого х Из мИзделияЗаказчика Цикл
		МенеджерЗаписи = РегистрыСведений.ДанныеИзделияЗаказчика.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИзделиеЗаказчика = х;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.Актуальность = Истина;
		
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент КАК ИзделиеЭлемент
		|ИЗ
		|	Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|ГДЕ
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка В(&мИзделияЗаказчика)";
	
	Запрос.УстановитьПараметр("мИзделияЗаказчика", мИзделияЗаказчика);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
    мИзделияЭлемент = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписей = РегистрыСведений.АктуальныеИзделияКомплектыЭлементы.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.ПриложениеКДоговору 	= Ссылка;
		МенеджерЗаписей.ИзделиеКомплектЭлемент 	= Выборка.ИзделиеЭлемент;
		МенеджерЗаписей.Записать();
		
		мИзделияЭлемент.Добавить(Выборка.ИзделиеЭлемент);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК ИзделиеКомплект
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.ИзделияЭлемент.ИзделиеЭлемент В(&мИзделияЭлемент)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияКомплект.Ссылка";
	
	Запрос.УстановитьПараметр("мИзделияЭлемент", мИзделияЭлемент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписей = РегистрыСведений.АктуальныеИзделияКомплектыЭлементы.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.ПриложениеКДоговору 	= Ссылка;
		МенеджерЗаписей.ИзделиеКомплектЭлемент 	= Выборка.ИзделиеКомплект;
		МенеджерЗаписей.Записать();
		
		мИзделияЭлемент.Добавить(Выборка.ИзделиеКомплект);
	КонецЦикла;
	

КонецПроцедуры // УстановитьАктуальность()

Процедура ЗаполнитьИтогоСделка()

	НаборЗаписей = РегистрыСведений.ИтогоПроекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Договор.Установить(Ссылка);
	
	НаборЗаписей.Записать();
	
	Знак = ?(Отказ, -1, 1);
	
	НаборЗаписей = РегистрыСведений.ИтогоПроекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Договор.Установить(Ссылка);
	НаборЗаписей.Отбор.Проект.Установить(Проект);
		
	Для каждого х Из ИзделияЗаказчика Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Договор 		 = Ссылка;
		НоваяЗапись.Проект  		 = Проект;
		НоваяЗапись.ИзделияЗаказчика = х.ИзделиеЗаказчика;
		НоваяЗапись.Количество 		 = Знак * х.ИзделиеЗаказчика.Количество;
	КонецЦикла;
	
	НаборЗаписей.Записать();

КонецПроцедуры // ЗаполнитьИтогоСделка()

Процедура ПередЗаписью(Отказ)
	Если НЕ ЭтоГруппа Тогда
		Родитель = омКонтрольПапки.КонтрольПапкиЭлементаСправочника(Проект, Ссылка.Метаданные().Имя); 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика КАК ИзделиеЗаказчика
		|ИЗ
		|	Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК ПриложенияКДоговорамИзделияЗаказчика
		|ГДЕ
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка = &Ссылка
		|	И НЕ ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика В (&ИзделиеЗаказчика)";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ИзделиеЗаказчика", ИзделияЗаказчика.ВыгрузитьКолонку("ИзделиеЗаказчика"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.ДанныеИзделияЗаказчика.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ИзделиеЗаказчика = Выборка.ИзделиеЗаказчика;
			МенеджерЗаписи.Прочитать();
			
			МенеджерЗаписи.Актуальность = Ложь;
			
			МенеджерЗаписи.Записать();

		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьДатыОкончания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК Обработан,
		|	ОконачаниеДоговора.ИзделияКомплект КАК ИзделияКомплект,
		|	ОконачаниеДоговора.Период КАК Период,
		|	ОконачаниеДоговора.ОкончаниеПроизводства КАК ОкончаниеПроизводства,
		|	ОконачаниеДоговора.ОкончаниеМонтаж КАК ОкончаниеМонтаж,
		|	ОконачаниеДоговора.ОкончаниеСЗапасом КАК ОкончаниеСЗапасом
		|ИЗ
		|	РегистрСведений.ОконачаниеДоговора КАК ОконачаниеДоговора
		|ГДЕ
		|	ОконачаниеДоговора.ПриложениеКДоговору = &ПриложениеКДоговору
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК ИзделияКомплект,
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка КАК ИзделияЗаказчика
		|ИЗ
		|	Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|		ПО ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент = ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент
		|ГДЕ
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка В(&Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияКомплектИзделияЭлемент.Ссылка,
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка";
	
	Запрос.УстановитьПараметр("ПриложениеКДоговору", Ссылка);
	Запрос.УстановитьПараметр("Ссылка", ИзделияЗаказчика.ВыгрузитьКолонку("ИзделиеЗаказчика"));
	
	ПакетВыгрузки = Запрос.ВыполнитьПакет();
	тзТекущиеКомплекты = ПакетВыгрузки[0].Выгрузить();
	тзТекущиеКомплекты.Индексы.Добавить("ИзделияКомплект");
	
	тзИзделияКомплект = ПакетВыгрузки[1].Выгрузить();
	тзИзделияКомплект.Индексы.Добавить("ИзделияЗаказчика");

	
	СекундВНеделе = 24 * 7 * 3600;
	
	ОкончаниеПроизводства 	= ДатаДоговора 			+ СрокПроизводстваВНеделях 	* СекундВНеделе;
	ОкончаниеМонтаж 		= ОкончаниеПроизводства + СрокМонтажаВНеделях 		* СекундВНеделе;
	ОкончаниеСЗапасом 		= ОкончаниеМонтаж 		+ ВнутреннийЗапасВНеделях 	* СекундВНеделе;
	
	
	стОтбор = Новый Структура("ИзделияЗаказчика", );
	Для каждого строкаИзделиеЗаказчика Из ИзделияЗаказчика Цикл
		стОтбор.ИзделияЗаказчика = строкаИзделиеЗаказчика.ИзделиеЗаказчика;
		НайденыеСтроки = тзИзделияКомплект.НайтиСтроки(стОтбор);
		
		Для каждого х Из НайденыеСтроки Цикл
			
			НайденаяСтрока = тзТекущиеКомплекты.Найти(х.ИзделияКомплект,"ИзделияКомплект");
			
			Если НЕ НайденаяСтрока = Неопределено Тогда
				НайденаяСтрока.Обработан = Истина;
				Если НайденаяСтрока.ОкончаниеПроизводства = ОкончаниеПроизводства 
					И НайденаяСтрока.ОкончаниеСЗапасом = ОкончаниеСЗапасом 
					И НайденаяСтрока.ОкончаниеМонтаж = ОкончаниеМонтаж 
					И НайденаяСтрока.Период = ДатаДоговора Тогда
					
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.ОконачаниеДоговора.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИзделияКомплект.Установить(х.ИзделияКомплект);
			НаборЗаписей.Отбор.Период.Установить(ДатаДоговора);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ИзделияКомплект 		= х.ИзделияКомплект;
			НоваяЗапись.Период 					= ДатаДоговора;
			НоваяЗапись.ОкончаниеПроизводства 	= ОкончаниеПроизводства; 
			НоваяЗапись.ОкончаниеМонтаж 		= ОкончаниеМонтаж; 
			НоваяЗапись.ОкончаниеСЗапасом 		= ОкончаниеСЗапасом; 
			НоваяЗапись.ПриложениеКДоговору 	= Ссылка;
			
			НаборЗаписей.Записать();
			
		КонецЦикла;
		
	КонецЦикла;
	
	стОтбор = Новый Структура("Обработан", Ложь);
	
	НайденыеСтроки = тзТекущиеКомплекты.НайтиСтроки(стОтбор);
	
	Для каждого х Из НайденыеСтроки Цикл
		НаборЗаписей = РегистрыСведений.ОконачаниеДоговора.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИзделияКомплект.Установить(х.ИзделияКомплект);
		НаборЗаписей.Отбор.Период.Установить(ДатаДоговора);
		
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДатыОкончания()

Процедура ПроверкаСозданиеЗадачи()

	Если ПодписьДата = Дата(1, 1, 1) Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодготовкаПроекта.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ПодготовкаПроекта КАК ПодготовкаПроекта
		|ГДЕ
		|	ПодготовкаПроекта.Назначение = &Назначение";
	
	Запрос.УстановитьПараметр("Назначение", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Если НомерПоПорядку = 1 Тогда
		ТипЗадачи = ПредопределенноеЗначение("Перечисление.ОбъектыЗадач.СоздатьКартуПроектаДиз");	
		
		стПараметры = Задачи.ПодготовкаПроекта.ПолучитьСтруктуруДляСозданияЗадачи(Ссылка, Перечисления.ОбъектыЗадач.ПодготовитьОзнакомительныйВыезд, Ссылка);
		Задачи.ПодготовкаПроекта.СоздатьЗадачуПоПараметрам(стПараметры);
		
	Иначе
		ТипЗадачи = ПредопределенноеЗначение("Перечисление.ОбъектыЗадач.ДополнитьКартуПроектаДиз");	
	КонецЕсли;
	
	стПараметры = Задачи.ПодготовкаПроекта.ПолучитьСтруктуруДляСозданияЗадачи(Ссылка, ТипЗадачи, Ссылка);
	Задачи.ПодготовкаПроекта.СоздатьЗадачуПоПараметрам(стПараметры);
	

КонецПроцедуры
