Функция ПолучитьПолныйПутьЭлементаСправочника(СсылкаНаЭлементСправочника, ВключатьЭлементСправочник = Истина
			, ТекущиеИмяЭлемента = "", мРодителей = Неопределено) Экспорт
	
	мРодителей = Новый Массив;

	Если НЕ ЗначениеЗаполнено(СсылкаНаЭлементСправочника) Тогда
	
		Возврат "";	
	
	КонецЕсли;
	
	ИмяСправочника = СсылкаНаЭлементСправочника.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Родитель КАК Родитель,
	               |	Номенклатура.Родитель.Наименование КАК РодительНаименование
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка = &Ссылка
	               |	И Номенклатура.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Номенклатура", ИмяСправочника);
	
	Если ВключатьЭлементСправочник Тогда
	
		мРодителей.Добавить(СсылкаНаЭлементСправочника);
		
		Если ПустаяСтрока(ТекущиеИмяЭлемента) Тогда
			
			стрПолныйПутьЭлементаСправочника = СсылкаНаЭлементСправочника.Наименование;
			
		Иначе
			
			стрПолныйПутьЭлементаСправочника = ТекущиеИмяЭлемента;
			
		КонецЕсли;
		
	Иначе

		стрПолныйПутьЭлементаСправочника = "";
	
	КонецЕсли;
	
	
	ЗаполнитьПолныйПутьЭлементаСправочника(Запрос, стрПолныйПутьЭлементаСправочника, мРодителей, СсылкаНаЭлементСправочника);
	
	Возврат стрПолныйПутьЭлементаСправочника;
	
КонецФункции // ПолучитьПолныйПутьЭлементаСправочника()

Процедура ЗаполнитьПолныйПутьЭлементаСправочника(Запрос, стрПолныйПутьЭлементаСправочника, мРодителей, Знач СсылкаНаЭлементСправочника)
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаЭлементСправочника);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

			мРодителей.Добавить(Выборка.Родитель);
			
            стрПолныйПутьЭлементаСправочника = СокрЛП(Выборка.РодительНаименование) 
				+ ?(ПустаяСтрока(стрПолныйПутьЭлементаСправочника), "", ".") + стрПолныйПутьЭлементаСправочника;
				
			
	        ЗаполнитьПолныйПутьЭлементаСправочника(Запрос, стрПолныйПутьЭлементаСправочника, мРодителей, Выборка.Родитель);
	КонецЦикла;
	
КонецПроцедуры

Функция КолонкиТаблицыЗначений(ТаблицаЗначений) Экспорт
	
	Результат = Новый Массив;
	
	Если ТипЗнч(ТаблицаЗначений) = Тип("ДанныеФормыКоллекция") Тогда
	
		врТаблица = ТаблицаЗначений.Выгрузить();
		
	Иначе
		
		врТаблица = ТаблицаЗначений; 
	
	КонецЕсли;
	
	Для Каждого ТекущаяКолонка Из врТаблица.Колонки Цикл
		Результат.Добавить(ТекущаяКолонка.Имя);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции
