&НаКлиенте
Перем ДатаДобавления, АвторДобавления;

&НаКлиенте
Процедура ДополнениеТЗПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.ДополнениеТЗ.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		
		ДатаОзнакомления 	= Дата(2001, 1, 1);
		ОписаниеИзменения 	= "";	
		ИмяФайла 			= "";	
		
	Иначе
		
		ДатаОзнакомления 		= ТД.ДатаОзнакомления;
		ДатаДобавления 			= ТД.ДатаДобавления;	
		АвторДобавления 		= ТД.АвторДобавления;	
		ОписаниеИзменения 		= ТД.ОписаниеИзменения;	
		ИмяФайла 				= ТД.ИмяФайла + "." + ТД.Расширение;	
	
	КонецЕсли;
	
	Элементы.ИмяФайла.Доступность 	= ?(ПустаяСтрока(ИмяФайла), Ложь, Истина);
	Элементы.Ознакомлен.Доступность = ?(ДатаОзнакомления = дата(1, 1, 1), Истина, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры) = Тип("ДанныеФормыСтруктура") И Параметры.Свойство("Комплект") Тогда
		Комплект = Параметры.Комплект;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Комплект) Тогда 
		
		ЗаполнитьТаблицу();
		
	Иначе

		Отказ = Истина;	
	
	КонецЕсли;

КонецПроцедуры 

Процедура ЗаполнитьТаблицу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Дополнение_к_ТЗ.ДатаДобавления КАК ДатаДобавления,
		|	Дополнение_к_ТЗ.АвторДобавления КАК АвторДобавления,
		|	Дополнение_к_ТЗ.ДатаОзнакомления КАК ДатаОзнакомления,
		|	Дополнение_к_ТЗ.ЕстьФайл КАК ЕстьФайл,
		|	Дополнение_к_ТЗ.ИмяФайла КАК ИмяФайла,
		|	Дополнение_к_ТЗ.Ознакомился КАК Ознакомился,
		|	Дополнение_к_ТЗ.ОписаниеИзменения КАК ОписаниеИзменения,
		|	Дополнение_к_ТЗ.Расширение КАК Расширение,
		|	Дополнение_к_ТЗ.ФайлТЗ КАК ФайлТЗ
		|ИЗ
		|	РегистрСведений.Дополнение_к_ТЗ КАК Дополнение_к_ТЗ
		|ГДЕ
		|	Дополнение_к_ТЗ.Комплект = &Комплект
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаДобавления";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	ДополнениеТЗ.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ОзнакомленНаСервере(Комплект, ДатаДобавления, АвторДобавления)
	
	ДатаОзнакомления 	= ТекущаяДата();
	Ознакомился 		= ПараметрыСеанса.ТекущийПользователь;
	
	МенеджерЗаписи = РегистрыСведений.Дополнение_к_ТЗ.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Комплект 		= Комплект;
	МенеджерЗаписи.ДатаДобавления 	= ДатаДобавления;
	МенеджерЗаписи.АвторДобавления 	= АвторДобавления; 
	
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Ознакомился 		= Ознакомился;
	МенеджерЗаписи.ДатаОзнакомления = ДатаОзнакомления;
	
	МенеджерЗаписи.Записать();
	
	Возврат Новый Структура("ДатаОзнакомления, Ознакомился", ДатаОзнакомления, Ознакомился);
	
КонецФункции

&НаКлиенте
Процедура Ознакомлен(Команда)
	
	стОзнакомился = ОзнакомленНаСервере(Комплект, ДатаДобавления, АвторДобавления);
	
	Для каждого х Из ДополнениеТЗ Цикл
		
		Если НЕ х.ДатаДобавления = ДатаДобавления Тогда
			Продолжить;	
		КонецЕсли;	
		
		Если НЕ х.АвторДобавления = АвторДобавления Тогда
			Продолжить;	
		КонецЕсли;
		
		х.ДатаОзнакомления 	= стОзнакомился.ДатаОзнакомления;
		х.Ознакомился 		= стОзнакомился.Ознакомился;
		
		Прервать;
		
	КонецЦикла;
	
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ИмяФайлаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПолноеИмяФайла = КаталогВременныхФайлов()  + ИмяФайла;
 	
	Файл = Новый Файл(ПолноеИмяФайла);
	
	Если Файл.Существует() Тогда
	
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытиеФайлаПродолжение", ЭтаФорма, ПолноеИмяФайла);
		
		Попытка
		
			НачатьУдалениеФайлов(ОписаниеОповещения, ПолноеИмяФайла);
			
		Исключение
			
			ПоказатьПредупреждение(, "Файл уже открыт");
			Возврат;
		
		КонецПопытки;
		
	Иначе
		
		ОткрытиеФайлаПродолжение(ПолноеИмяФайла);
	
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОткрытиеФайлаПродолжение(ПолноеИмяФайла) Экспорт

	АдресВХ = ПолучитьАдресВременногоХранилища(Комплект, ДатаДобавления, АвторДобавления, ИмяФайла);
	
	Если ПустаяСтрока(АдресВХ) Тогда
		
		ПоказатьПредупреждение(, "Файл не найден");
		
	Иначе
		
		Двоичное = ПолучитьИзВременногоХранилища(АдресВХ);  // по адресу временного хранилища получаем двоичные данные
		Двоичное.Записать(ПолноеИмяФайла);
		
		ЗапуститьПриложение(ПолноеИмяФайла);
	КонецЕсли;
	
КонецПроцедуры // ОткрытиеФайлаПродолжение()  

&НаСервереБезКонтекста
Функция ПолучитьАдресВременногоХранилища(Комплект, ДатаДобавления, АвторДобавления, ИмяФайла)

	ДатаОзнакомления 	= ТекущаяДата();
	Ознакомился 		= ПараметрыСеанса.ТекущийПользователь;
	
	МенеджерЗаписи = РегистрыСведений.Дополнение_к_ТЗ.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Комплект 		= Комплект;
	МенеджерЗаписи.ДатаДобавления 	= ДатаДобавления;
	МенеджерЗаписи.АвторДобавления 	= АвторДобавления; 
	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.ЕстьФайл Тогда
		
		ПолноеИмяФайла = КаталогВременныхФайлов()  + ИмяФайла;
		
		ДвоичныеДанные = МенеджерЗаписи.ФайлТЗ.Получить();
		
		Если ДвоичныеДанные = Неопределено Тогда
			Возврат "";
		КонецЕсли;
		
		ДвоичныеДанные.Записать(ПолноеИмяФайла);
		
		Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайла));
		
		УдалитьФайлы(ПолноеИмяФайла);
		
		Возврат Адрес;
		
	КонецЕсли;
	
	
	Возврат "";
	
КонецФункции // ПолучитьАдресВременногоХранилища() 

