 
&НаКлиенте
Перем ИзмененыСлужебныеНастройки;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		
		стДанные = РегистрыСведений.ТаймингЗадач.ПолучитьСостояниеЗадачи(Объект.Ссылка);
		ТекущиеСостояние 		= стДанные.Состояние;
		ТекущиеСостояниеСтрокой = стДанные.Представление;
		КрайРКД					= ПолучитьКрайРКД();
		
	КонецЕсли;
	
	Если Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором 
		ИЛИ Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.Разработка Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Истина;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		
	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Истина;	
		
	КонецЕсли;
	
	Состояние = ТекущиеСостояние;

КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ИзмененыСлужебныеНастройки = Ложь;
	Элементы.ГруппаИстория.Видимость = Ложь;
	ВидимостьКнопок();
	
КонецПроцедуры

Функция ПолучитьКрайРКД()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.КрайРКД КАК КрайРКД
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Объект.ИзделиеКомплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КрайРКД; 
	КонецЦикла; 
	
	Возврат Дата(1, 1, 1);
	
КонецФункции // ПолучитьКрайПКД()

#Область Команды

#Область  КомандыКонструктора

&НаКлиенте
Процедура НачатьВыполнение(Команда)
	
	КонструкторОбъекта = КонтрольСоответствияКонструкторов(Объект.ИзделиеКомплект);
	
	Если КонструкторОбъекта = Объект.Исполнитель Тогда
	
		//стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Объект.ОбъектТЗ, "Конструктор");
		//Если НЕ ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
		//	ПоказатьПредупреждение(,стВозврата.ОписаниеОшибки);	
		//КонецЕсли;
	
	Иначе	
		
		ПоказатьПредупреждение(, "Конструктор в объекте " + КонструкторОбъекта + " не соответствует исполнителю");
		Возврат;
		
	КонецЕсли;
	
	стДанные = ДействияНаСервере("НачатьВыполнение", Объект.Ссылка, Объект.Исполнитель);
	ТекущиеСостояние 		= стДанные.Состояние;
	ТекущиеСостояниеСтрокой = стДанные.Представление;
	ВидимостьКнопок();
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыполнение(Команда)
	
	Если Модифицированность Тогда
		
		ПоказатьПредупреждение(, "Не обходимо сохранить задачу.");
		Возврат;
		
	КонецЕсли;
	
	стДанные = ДействияНаСервере("ЗавершениеРаботы", Объект.Ссылка, Объект.ИзделиеКомплект);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Приостановить(Команда)
	
	стДанные = ДействияНаСервере("Приостановить", Объект.Ссылка, Объект.Исполнитель);
	ТекущиеСостояние 		= стДанные.Состояние;
	ТекущиеСостояниеСтрокой = стДанные.Представление;
	ВидимостьКнопок();
	
КонецПроцедуры
#КонецОбласти

#Область КомандыВедущегоКонструктороа

&НаКлиенте
Процедура ДоработкаВедущийКонструктор(Команда)
	
	стДанные = ДействияНаСервере("ДоработкаВедущийКонструктор", Объект.Ссылка, Объект.Исполнитель);
	Закрыть();
	
КонецПроцедуры 


&НаКлиенте
Процедура Завершение(Команда)

	стДанные = ДействияНаСервере("Завершение", Объект.Ссылка, Объект.Исполнитель);
	Закрыть();
	
КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура История(Команда)
	
	История = ДействияНаСервере("История", Объект.Ссылка);
	Элементы.ГруппаИстория.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИсторию(Команда)
	Элементы.ГруппаИстория.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти  

&НаСервереБезКонтекста
Функция КонтрольСоответствияКонструкторов(ОбъектТЗ)

	Возврат омКонструктор.ПолучитьДанныеОбъекта(ОбъектТЗ).КонструкторПользователь;		

КонецФункции // КонтрольСоответствияКонструкторов()

&НаСервереБезКонтекста
Функция ДействияНаСервере(Действие, Задача, Параметр = Неопределено)
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;

	Если Действие = "История" Тогда
		Возврат МенеджерРегистра.ПолучитьИсториюЗадачи(Задача);
	КонецЕсли;
	
	стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(,,Перечисления.СтатусыЗадач.РКД);
	
	Если Действие = "НачатьВыполнение" Тогда 
		стДанные.Состояние 	= Перечисления.СостоянияЗадач.ВРаботеКонструктора;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
	ИначеЕсли Действие = "Приостановить" Тогда
		стДанные.Состояние 	= Перечисления.СостоянияЗадач.ПриостановкаКонструктором;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
	ИначеЕсли Действие = "ЗавершениеРаботы" Тогда
		
		ВедущийКонструктор = омСотрудники.СотрудникиОбъекта(Параметр).ВедущийКонструктор;
		
		ОбъектЗадача 				= Задача.ПолучитьОбъект();
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ИзделиеКомплект)  + ".РКД.Проверка";
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором;
		ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.РКД;
		ОбъектЗадача.Исполнитель 	= ВедущийКонструктор;
		ОбъектЗадача.Записать();
		
		стДанные.Состояние 		= Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором;
		стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
		стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
		
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
		
	ИначеЕсли Действие = "ДоработкаВедущийКонструктор" Тогда
		
		Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);
		
		ОбъектЗадача 				= Задача.ПолучитьОбъект(); 
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ИзделиеКомплект)  + ".РКД.Доработка";
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.РКД;
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором;
		ОбъектЗадача.Исполнитель 	= Конструктор;
		
		ОбъектЗадача.Записать();
		
		стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
		стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
		стДанные.Состояние 		= Перечисления.СостоянияЗадач.ОжиданиеКонструктором;
		
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
		
	ИначеЕсли Действие = "Завершение" Тогда
		
		
		ОбъектЗадача 				= Задача.ПолучитьОбъект();
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ИзделиеКомплект)  + ".РКД.Завершена";
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.РКД;
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Завершение;
		ОбъектЗадача.Выполнена      = Истина;
		
		ОбъектЗадача.Записать(); 
		
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
		
	КонецЕсли;
	
	
	Возврат РегистрыСведений.ТаймингЗадач.ПолучитьСостояниеЗадачи(Задача);
	
КонецФункции // ДействияНаСервере()  

&НаКлиенте
Процедура ВидимостьКнопок()
	
	Если ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ЗавершенаКонструктором") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Ложь;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ВРаботеКонструктора") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Ложь;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Истина;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Истина;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Истина;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ОжиданиеКонструктором") Тогда
		
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Истина;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ПриостановкаКонструктором") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Истина;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		
	КонецЕсли;
	
	
КонецПроцедуры // ВидимостьКнопок()

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	ИзмененыСлужебныеНастройки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если ИзмененыСлужебныеНастройки Тогда
	
		ИзменитьСостоянияНаСервере(Объект.Ссылка, Объект.ОбъектТЗ, Объект.ТипЗадачи, Объект.СтатусЗадачи, Состояние);		
	
	КонецЕсли;
КонецПроцедуры  

&НаСервереБезКонтекста
Процедура ИзменитьСостоянияНаСервере(Задача, ОбъектТЗ, ТипЗадачи, СтатусЗадачи, Состояние)
	
	Исполнитель = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадачСрезПоследних.Исполнитель КАК Исполнитель
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Исполнитель = Выборка.Исполнитель			
	КонецЦикла;
	
	МЗ = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	МЗ.Период =  ТекущаяДата();
	МЗ.Автор = ПараметрыСеанса.ТекущийПользователь;
	МЗ.Задача = Задача;
	МЗ.Исполнитель = Исполнитель;
	МЗ.Состояние = Состояние;
	МЗ.Статус = СтатусЗадачи;
	МЗ.ТипЗадачи = ТипЗадачи;
	
	МЗ.Записать();
	
	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
	
КонецПроцедуры // ИзменитьСостоянияНаСервере()



