
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		Элементы.Проект.СписокВыбора.Добавить(Объект.Проект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Комплект) Тогда
		Элементы.Комплект.СписокВыбора.Добавить(Объект.Комплект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Элементы.Проект.СписокВыбора.Очистить();
	
	Для каждого ЗначениеПроекта Из ПолучитьСписокПроектовВПроизводстве() Цикл
		Элементы.Проект.СписокВыбора.Добавить(ЗначениеПроекта.Значение, ЗначениеПроекта.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПроектовВПроизводстве()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(КанбанКарточки.Ресурс КАК Справочник.ИзделияКомплект) КАК Комплект
		|ПОМЕСТИТЬ втКомплекты
		|ИЗ
		|	РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДКарточка = КанбанКарточки.УИД
		|ГДЕ
		|	КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка В(&УИДКудаКолонка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втКомплекты.Комплект.Проект КАК Проект,
		|	втКомплекты.Комплект.Проект.Наименование КАК Наименование,
		|	втКомплекты.Комплект.Проект.Префикс КАК Префикс,
		|	втКомплекты.Комплект.Проект.Номер КАК Номер
		|ИЗ
		|	втКомплекты КАК втКомплекты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер";
	
	Запрос.УстановитьПараметр("УИДКудаКолонка", омКанбанПроизводство.ПолучитьУИДКолонокПороизводства());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокВозврата = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		СписокВозврата.Добавить(Выборка.Проект, Формат(Выборка.Номер, "ЧГ=0") + "-" + Выборка.Наименование + " (" + Выборка.Префикс + ")");
	КонецЦикла;
	
	Возврат СписокВозврата;
	
КонецФункции // ПолучитьСписокПроектовВПроизводстве()

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	Объект.Комплект = ПредопределенноеЗначение("Справочник.ИзделияКомплект.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура КомплектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Элементы.Комплект.СписокВыбора.Очистить();
	
	Для каждого ЗначениеПроекта Из ПолучитьСписокКомплектовВПроизводстве(Объект.Проект) Цикл
		Элементы.Комплект.СписокВыбора.Добавить(ЗначениеПроекта.Значение, ЗначениеПроекта.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокКомплектовВПроизводстве(Проект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(КанбанКарточки.Ресурс КАК Справочник.ИзделияКомплект) КАК Комплект
		|ПОМЕСТИТЬ втКомплекты
		|ИЗ
		|	РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДКарточка = КанбанКарточки.УИД
		|ГДЕ
		|	КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка В(&УИДКудаКолонка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Рекламация.Комплект КАК Комплект
		|ПОМЕСТИТЬ втСуществующие
		|ИЗ
		|	Документ.Рекламация КАК Рекламация
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Рекламация.Проект = &Проект
		|		КОНЕЦ
		|	И НЕ Рекламация.ПометкаУдаления
		|	И НЕ Рекламация.РКДВыполнено
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втКомплекты.Комплект КАК Комплект,
		|	втКомплекты.Комплект.Наименование КАК Наименование
		|ИЗ
		|	втКомплекты КАК втКомплекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ втСуществующие КАК втСуществующие
		|		ПО втКомплекты.Комплект = втСуществующие.Комплект
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ втКомплекты.Комплект.Проект = &Проект
		|		КОНЕЦ
		|	И втСуществующие.Комплект ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("УИДКудаКолонка", омКанбанПроизводство.ПолучитьУИДКолонокПороизводства());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокВозврата = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		СписокВозврата.Добавить(Выборка.Комплект, Выборка.Наименование);
	КонецЦикла;
	
	Возврат СписокВозврата;
	
КонецФункции // ПолучитьСписокПроектовВПроизводстве()

&НаКлиенте
Процедура КомплектПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Комплект) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Проект) Тогда
			Объект.Проект = ПолучитьПроект(Объект.Комплект); 	
		КонецЕсли; 
		
		ПользователиКомплекта = омСотрудники.СотрудникиОбъекта(Объект.Комплект);
		
		Объект.Конструктор 			= ПользователиКомплекта.Конструктор;
		Объект.ВедущийКонструктор 	= ПользователиКомплекта.ВедущийКонструктор;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПроект(Комплект)

	Возврат Комплект.Проект;	

КонецФункции // ПлдучтьПроект(Комплект)

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	УИДДоскиПроизводство = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
	
	ДанныеКарточки = омКанбанДоскиНаСервере.ПолучитьКарточкиКанбанаСКолонкамиИТегами(УИДДоскиПроизводство, ТекущийОбъект.Комплект);
	
	Если ДанныеКарточки.Количество() = 0 Тогда
		УИДКудаКолонка 	= "";
		УИДКарточка 	= "";
	Иначе
		УИДКудаКолонка 	= ДанныеКарточки[0].УИДКудаКолонка;
		УИДКарточка		= ДанныеКарточки[0].УИДКарточка;	
	КонецЕсли;
	
	Если Не ПустаяСтрока(УИДКарточка) Тогда
		
		УИДКолонкиПриостановки = омКанбанДоскиНаСервереПовтор.ПолучитьУИДКолонки(УИДДоскиПроизводство, "_Приостановка_Производства");
		
		Если УИДКолонкиПриостановки = УИДКудаКолонка Тогда
			
			Если (НЕ ТекущийОбъект.ОстановитьПроизводство ИЛИ ТекущийОбъект.РКДВыполнено) И НЕ ПустаяСтрока(ТекущийОбъект.ПредыдущаяСтатдияПроизводства) Тогда
				
				ТекущийОбъект.ПредыдущаяСтатдияПроизводства	= "";	
				
			КонецЕсли; 
			
		Иначе
			
			Если ТекущийОбъект.ОстановитьПроизводство И НЕ ТекущийОбъект.РКДВыполнено Тогда
				
				ТекущийОбъект.ПредыдущаяСтатдияПроизводства	= УИДКудаКолонка;	
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры


