
Функция СоздатьЗадачуВнешнегоПроизводства(ОбъектТЗ, Проект = Неопределено, Исполнитель = Неопределено, Комментарий = "") Экспорт

    НоваяЗадача 				= Задачи.ЗадачаВнешнееПроизводство.СоздатьЗадачу();
	
	НоваяЗадача.Автор 			= ПараметрыСеанса.ТекущийПользователь;
	НоваяЗадача.Дата 			= ТекущаяДата();
	НоваяЗадача.Исполнитель 	= Исполнитель;
	НоваяЗадача.Комментарий		= Комментарий;
	НоваяЗадача.Наименование	= Строка(ОбъектТЗ) + ".Внешняя";
	НоваяЗадача.ОбъектТЗ		= ОбъектТЗ;
	НоваяЗадача.Проект			= ?(Проект = Неопределено, ОбъектТЗ.Проект, Проект);
	
	НоваяЗадача.Записать();
	
	Возврат НоваяЗадача.Ссылка;

КонецФункции // СоздатьЗадачуВнешнегоПроизводства()

Функция ТипВнешнегоПроизводства(ОбъектТЗ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешнееПроизводствоСрезПоследних.ТипВнешнегоПроизводства КАК ТипВнешнегоПроизводства,
		|	МАКСИМУМ(ВнешнееПроизводствоСрезПоследних.Период) КАК Период,
		|	ЗадачаВнешнееПроизводство.Ссылка КАК ЗадачаВнешнегоПроизводства
		|ИЗ
		|	РегистрСведений.ВнешнееПроизводство.СрезПоследних КАК ВнешнееПроизводствоСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачаВнешнееПроизводство КАК ЗадачаВнешнееПроизводство
		|		ПО ВнешнееПроизводствоСрезПоследних.Комплект = ЗадачаВнешнееПроизводство.ОбъектТЗ
		|ГДЕ
		|	ВнешнееПроизводствоСрезПоследних.Комплект = &Комплект
		|	И НЕ ЗадачаВнешнееПроизводство.Выполнена
		|
		|СГРУППИРОВАТЬ ПО
		|	ВнешнееПроизводствоСрезПоследних.ТипВнешнегоПроизводства,
		|	ЗадачаВнешнееПроизводство.Ссылка";
	
	Запрос.УстановитьПараметр("Комплект", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Новый Структура("ТипВнешнегоПроизводства, ЗадачаВнешнегоПроизводства", Выборка.ТипВнешнегоПроизводства, Выборка.ЗадачаВнешнегоПроизводства);
	КонецЦикла;
	
    Возврат Неопределено;
КонецФункции // ТипВнешнегоПроизводства()

