
Функция СоздатьЗадачуВнешнегоПроизводства(ОбъектТЗ, Проект = Неопределено, ТипЗадачи = Неопределено, Исполнитель = Неопределено, ПКД = Ложь) Экспорт

	
	Если ТипЗадачи = Неопределено Тогда
		
		ТекущийТипЗадачи 	= Перечисления.ТипыЗадачКонструирования.ВнешнееПКД;
		ТекущаяСтадия 		= омСтадииКомплектаПовтор.ПолучитьСтадиюВнешнееПКД();	
	
	Иначе
		
		ТекущийТипЗадачи 	= ТипЗадачи;		
		МассивСтадий 		= омСтадииКомплекта.ПолучитьСтадииПоТипу(ТипЗадачи);	
		
		Если МассивСтадий.Количество() = 0 Тогда
			ТекущаяСтадия = Неопределено;
		Иначе
			ТекущаяСтадия = МассивСтадий[0];
		КонецЕсли;
		
	КонецЕсли;
	
	НоваяЗадача 				= Задачи.ЗадачаВнешнееПроизводство.СоздатьЗадачу();
	
	НоваяЗадача.Автор 			= ПараметрыСеанса.ТекущийПользователь;
	НоваяЗадача.Дата 			= ТекущаяДата();
	НоваяЗадача.ОбъектТЗ		= ОбъектТЗ;
	НоваяЗадача.Исполнитель 	= Исполнитель;
	НоваяЗадача.ПКД 			= ПКД;
	НоваяЗадача.Наименование	= Строка(ОбъектТЗ) + ".Внешняя";
	НоваяЗадача.ТипЗадачи		= ТекущийТипЗадачи;
	НоваяЗадача.Проект			= ?(Проект = Неопределено, ОбъектТЗ.Проект, Проект);
	
	НоваяЗадача.Записать();
	
	стПараметры = Новый Структура("Комплект, ТекущаяСтадия", );
	стПараметры.Комплект 		= ОбъектТЗ;
	стПараметры.ТекущаяСтадия 	= ТекущаяСтадия;
	
	РегистрыСведений.ДанныеКомплекта.ИзменитьДанныеКомплекта(стПараметры);
	
	Возврат НоваяЗадача.Ссылка;

КонецФункции // СоздатьЗадачуВнешнегоПроизводства()

Функция ТипВнешнегоПроизводства(ОбъектТЗ) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НазначениеПодрядчикаКомплекты.ПКД КАК ПКД,
		|	НазначениеПодрядчикаКомплекты.РКД КАК РКД,
		|	НазначениеПодрядчикаКомплекты.Производство КАК Производство
		|ИЗ
		|	Документ.НазначениеПодрядчика.Комплекты КАК НазначениеПодрядчикаКомплекты
		|ГДЕ
		|	НазначениеПодрядчикаКомплекты.Комплект = &Комплект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗадачаВнешнееПроизводство.Ссылка КАК ЗадачаВнешнегоПроизводства
		|ИЗ
		|	Задача.ЗадачаВнешнееПроизводство КАК ЗадачаВнешнееПроизводство
		|ГДЕ
		|	ЗадачаВнешнееПроизводство.ОбъектТЗ = &Комплект
		|	И НЕ ЗадачаВнешнееПроизводство.Выполнена";
	

	Запрос.УстановитьПараметр("Комплект", ОбъектТЗ);
	
	Результат = Запрос.ВыполнитьПакет();
	
	СтруктураВозврата = Новый Структура("ПКД, РКД, Производство, ЗадачаВнешнегоПроизводства", Ложь, Ложь, Ложь);
	
	Выборка = Результат[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		 СтруктураВозврата.ПКД 			= Выборка.ПКД;
		 СтруктураВозврата.РКД 			= Выборка.РКД;
		 СтруктураВозврата.Производство = Выборка.Производство;
	КонецЦикла;
	
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		 СтруктураВозврата.ЗадачаВнешнегоПроизводства =  Выборка.ЗадачаВнешнегоПроизводства;
	КонецЦикла;
	
    Возврат СтруктураВозврата;
	
КонецФункции // ТипВнешнегоПроизводства()

