#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ДобавитьОбъектВТаблицуИзменений(НастройкаПодключения, ТипДанныхДляРегистрацииИзменений, Ключ, Объект, ПодчиненныйОбъект = Неопределено, ВремяЗаписиВМиллисекундах = Неопределено) Экспорт
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("НастройкаПодключения"	, НастройкаПодключения);
	СтруктураОтбора.Вставить("ТипДанных"				, ТипДанныхДляРегистрацииИзменений);
	СтруктураОтбора.Вставить("Ключ"					, Ключ);
	СтруктураОтбора.Вставить("Объект"					, Объект);
	СтруктураОтбора.Вставить("ПодчиненныйОбъект"		, ПодчиненныйОбъект);
	
	Если РегистрыСведений.Б24_СУ_ТаблицаИзменений.Получить(СтруктураОтбора).ВремяЗаписиВМиллисекундах = 0 Тогда 
		Если ЗначениеЗаполнено(Объект) ИЛИ ЗначениеЗаполнено(ПодчиненныйОбъект) Тогда
			
			НоваяЗапись = РегистрыСведений.Б24_СУ_ТаблицаИзменений.СоздатьМенеджерЗаписи();  
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураОтбора);
			НоваяЗапись.ВремяЗаписиВМиллисекундах	= ?(ВремяЗаписиВМиллисекундах = Неопределено, ТекущаяУниверсальнаяДатаВМиллисекундах(), ВремяЗаписиВМиллисекундах);
			НоваяЗапись.Записать();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция НаличиеИзмененийПоТипуДанных(НастройкаПодключения, ТипДанных) Экспорт
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения);
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_СУ_ТаблицаИзменений.НастройкаПодключения КАК НастройкаПодключения,
	|	Б24_СУ_ТаблицаИзменений.ТипДанных КАК ТипДанных,
	|	Б24_СУ_ТаблицаИзменений.Ключ КАК Ключ,
	|	Б24_СУ_ТаблицаИзменений.Объект КАК Объект,
	|	Б24_СУ_ТаблицаИзменений.ПодчиненныйОбъект КАК ПодчиненныйОбъект,
	|	Б24_СУ_ТаблицаИзменений.ВремяЗаписиВМиллисекундах КАК ВремяЗаписиВМиллисекундах
	|ИЗ
	|	РегистрСведений.Б24_СУ_ТаблицаИзменений КАК Б24_СУ_ТаблицаИзменений
	|ГДЕ
	|	Б24_СУ_ТаблицаИзменений.НастройкаПодключения = &НастройкаПодключения
	|	И Б24_СУ_ТаблицаИзменений.ТипДанных = &ТипДанных";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецЕсли