&НаСервере
Функция ПолучитьПомещенияОбъекта(Объект, СовместитьНаименованиеСКодом = Ложь, БезКомметнария = Истина, БезПомеченныхНаУдаление = Истина) Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Помещения.Ссылка КАК Помещение,
		|	Помещения.Комментарий КАК Комментарий,
		|	Помещения.КодДляМаркировки КАК КодДляМаркировки,
		|	Помещения.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Помещения КАК Помещения
		|ГДЕ
		|	Помещения.Объект = &Объект
		|	И ВЫБОР
		|			КОГДА &БезПомеченныхНаУдаление
		|				ТОГДА Помещения.ПометкаУдаления = ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И Помещения.ЭтоГруппа = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("БезПомеченныхНаУдаление", БезПомеченныхНаУдаление);
	
	Если БезКомметнария Тогда
		Запрос.Текст = СтрЗаменить(ТекстЗапроса,"Помещения.Комментарий КАК Комментарий,","");
	Иначе
		Запрос.Текст = ТекстЗапроса; 
	КонецЕсли;
	
	Если СовместитьНаименованиеСКодом Тогда
		Возврат СовместитьНаименованиеСКодом(Запрос.Выполнить().Выгрузить(),БезКомметнария);
	Иначе
		Возврат Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	
КонецФункции // ПолучитьПомещенияОбъекта()

&НаСервере
Функция СовместитьНаименованиеСКодом(тзПомещения,БезКомметнария)
	тзВозврата = тзПомещения.СкопироватьКолонки(?(БезКомметнария,"Помещение, Наименование","Помещение, Комментарий, Наименование"));
	
	Для каждого х Из тзПомещения Цикл
		НС = тзВозврата.Добавить();
		ЗаполнитьЗначенияСвойств(НС, х, ,"Наименование");	
		НС.Наименование = ПолучитьОбъединенуюСтроку(х.КодДляМаркировки,х.Наименование);
	КонецЦикла;
	
	тзВозврата.Сортировать("Наименование");
	
	Возврат тзВозврата;
КонецФункции // СовместитьНаименованиеСКодом()

&НаСервере
Функция ПолучитьОбъединенуюСтроку(КодДляМаркировки,Наименование)

	Возврат ?(ПустаяСтрока(КодДляМаркировки),"","(" + СокрЛП(КодДляМаркировки) + ") ") + СокрЛП(Наименование);	

КонецФункции // ПолучитьОбъединенуюСтроку()

&НаСервере
Функция ПолучитьРодительИзделияПоОбъекту(Объект, СоздаватьРодителя = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИзделияЭлемент.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИзделияЭлемент КАК ИзделияЭлемент
		|ГДЕ
		|	ИзделияЭлемент.ЭтоГруппа = ИСТИНА
		|	И ИзделияЭлемент.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
    Если СоздаватьРодителя Тогда
	   	СпрРодитель = Справочники.ИзделияЭлемент.СоздатьГруппу();
		СпрРодитель.Наименование 	= Объект;
		СпрРодитель.Проект 			= Объект;
		СпрРодитель.Записать();
		
	
	Иначе
		Возврат Справочники.ИзделияЭлемент.ПустаяСсылка();
	КонецЕсли;
КонецФункции // ПолучитьРодительИзделияПоОбъекту()

&НаСервере
Функция ПолучитьНомерСделки(Сделка) Экспорт

	Если НЕ ЗначениеЗаполнено(Сделка) Тогда
		Возврат "";
	КонецЕсли;
	
    Возврат Формат(Сделка.Номер,"ЧЦ=2; ЧВН=");
КонецФункции // ПолучитьКодПомещения()

&НаСервере
Функция ПолучитьПрефиксСделки(Сделка) Экспорт

	Если НЕ ЗначениеЗаполнено(Сделка) Тогда
		Возврат "";
	КонецЕсли;
	
    Возврат Сделка.Префикс;
КонецФункции // ПолучитьПрефиксСделки()

&НаСервере
Функция ПолучитьСотрудниковСделки(Сделка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Дизайнер КАК Дизайнер,
		|	Проекты.Сметчик КАК Сметчик
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.Ссылка = &Проект";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	стСотрудники = Новый Структура("СотрудникиСтрокой,Дизайнер,Сметчик","",Неопределено,Неопределено);
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Дизайнер) Тогда
			стСотрудники.Дизайнер = Выборка.Дизайнер;
			стСотрудники.СотрудникиСтрокой = стСотрудники.СотрудникиСтрокой + "Дизайнер " + Выборка.Дизайнер + ". "
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Сметчик) Тогда
			стСотрудники.Сметчик = Выборка.Сметчик;
			стСотрудники.СотрудникиСтрокой = стСотрудники.СотрудникиСтрокой + "Сметчик " + Выборка.Сметчик + ". "
		КонецЕсли;
	КонецЦикла;
	
    Возврат стСотрудники;
КонецФункции // ПолучитьСотрудниковСделки()
