
Процедура ПриЗаписи(Отказ)
	УстановитьПривилегированныйРежим(Истина);
	
	КонтрольНаименованияПапки(Ссылка);  
	
	Если НЕ (ПометкаУдаления ИЛИ ПараметрыСеанса.ЗагрузкаИзБитрикс) И ЕстьДоговор Тогда
		омОбменБитрикс24.СинхронизацияСделокиСБитрикс(Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КонтрольНаименованияПапки(текСсылка)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", текСсылка);
	ПроверкаПапки(Запрос,текСсылка,ДанныеДляКонтрольПапкиИзделия(текСсылка));	
	ПроверкаПапки(Запрос,текСсылка,ДанныеДляКонтрольПапкиПомещения(текСсылка));	
	ПроверкаПапки(Запрос,текСсылка,ДанныеДляКонтрольПапкиЭлементыСделки(текСсылка));	
	ПроверкаПапки(Запрос,текСсылка,ДанныеДляКонтрольПапкиДоговорСделки(текСсылка));	
	ПроверкаПапки(Запрос,текСсылка,ДанныеДляКонтрольПапкиКомплект(текСсылка));	
	ПроверкаПапки(Запрос,текСсылка,ДанныеДляКонтрольПапкиПроизводственныйКомплект(текСсылка));
	ПроверкаПапки(Запрос,текСсылка,ДанныеДляКонтрольПапкиГабаритныеЧертежи(текСсылка));
	ПроверкаПапки(Запрос,текСсылка,ДанныеДляКонтрольПапкиКомпозиции(текСсылка));
КонецПроцедуры // КонтрольНаименованияПапки()

&НаСервере
Процедура ПроверкаПапки(Запрос,текСсылка,стПараметры)
	
	Запрос.Текст = стПараметры.ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЕстьПапка = Ложь;
	НаименованиеПапки = "";
	СсылкаНаПапку = Справочники[стПараметры.НаименованиеСправочника].ПустаяСсылка();
	Пока Выборка.Следующий() Цикл
		ЕстьПапка = Истина;
		НаименованиеПапки = Выборка.Наименование;
		СсылкаНаПапку = Выборка.СсылкаНаПапку;
	КонецЦикла;
	
	КонтрольПапки(ЕстьПапка,НаименованиеПапки,СсылкаНаПапку,текСсылка,стПараметры);
	
КонецПроцедуры // ПроверкаПапки()


&НаСервере
Функция ДанныеДляКонтрольПапкиКомпозиции(текСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Композиции.Наименование КАК Наименование,
	               |	Композиции.Ссылка КАК СсылкаНаПапку
	               |ИЗ
	               |	Справочник.Композиции КАК Композиции
	               |ГДЕ
	               |	Композиции.Проект = &Проект
	               |	И Композиции.ЭтоГруппа = ИСТИНА";
	
	Возврат Новый Структура("ТекстЗапроса,НаименованиеСправочника"
	,ТекстЗапроса
	,"Композиции");
	
КонецФункции // КонтрольПапкиИзделия()

&НаСервере
Функция ДанныеДляКонтрольПапкиГабаритныеЧертежи(текСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ГабаритныеЧертежи.Наименование КАК Наименование,
	               |	ГабаритныеЧертежи.Ссылка КАК СсылкаНаПапку
	               |ИЗ
	               |	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
	               |ГДЕ
	               |	ГабаритныеЧертежи.Проект = &Проект
	               |	И ГабаритныеЧертежи.ЭтоГруппа = ИСТИНА";
	
	Возврат Новый Структура("ТекстЗапроса,НаименованиеСправочника"
	,ТекстЗапроса
	,"ГабаритныеЧертежи");
	
КонецФункции // КонтрольПапкиИзделия()


&НаСервере
Функция ДанныеДляКонтрольПапкиЭлементыСделки(текСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ИзделияЭлемент.Наименование КАК Наименование,
	               |	ИзделияЭлемент.Ссылка КАК СсылкаНаПапку
	               |ИЗ
	               |	Справочник.ИзделияЭлемент КАК ИзделияЭлемент
	               |ГДЕ
	               |	ИзделияЭлемент.Проект = &Проект
	               |	И ИзделияЭлемент.ЭтоГруппа = ИСТИНА";
	
	Возврат Новый Структура("ТекстЗапроса,НаименованиеСправочника"
	,ТекстЗапроса
	,"ИзделияЭлемент");
	
КонецФункции // КонтрольПапкиИзделия()

&НаСервере
Функция ДанныеДляКонтрольПапкиИзделия(текСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ИзделияЗаказчика.Наименование КАК Наименование,
	               |	ИзделияЗаказчика.Ссылка КАК СсылкаНаПапку
	               |ИЗ
	               |	Справочник.ИзделияЗаказчика КАК ИзделияЗаказчика
	               |ГДЕ
	               |	ИзделияЗаказчика.Проект = &Проект
	               |	И ИзделияЗаказчика.ЭтоГруппа = ИСТИНА";
	
	Возврат Новый Структура("ТекстЗапроса,НаименованиеСправочника"
	,ТекстЗапроса
	,"ИзделияЗаказчика");
	
КонецФункции // КонтрольПапкиИзделия()

&НаСервере
Функция ДанныеДляКонтрольПапкиКомплект(текСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ИзделияКомплект.Наименование КАК Наименование,
	               |	ИзделияКомплект.Ссылка КАК СсылкаНаПапку
	               |ИЗ
	               |	Справочник.ИзделияКомплект КАК ИзделияКомплект
	               |ГДЕ
	               |	ИзделияКомплект.Проект = &Проект
	               |	И ИзделияКомплект.ЭтоГруппа = ИСТИНА
	               |	И ИзделияКомплект.Родитель = ЗНАЧЕНИЕ(Справочник.ИзделияКомплект.ПустаяСсылка)";
	
	Возврат Новый Структура("ТекстЗапроса,НаименованиеСправочника"
	,ТекстЗапроса
	,"ИзделияКомплект");
	
КонецФункции // КонтрольПапкиИзделия()

&НаСервере
Функция ДанныеДляКонтрольПапкиПроизводственныйКомплект(текСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПроизводственныеКомплекты.Наименование КАК Наименование,
	               |	ПроизводственныеКомплекты.Ссылка КАК СсылкаНаПапку
	               |ИЗ
	               |	Справочник.ПроизводственныеКомплекты КАК ПроизводственныеКомплекты
	               |ГДЕ
	               |	ПроизводственныеКомплекты.Проект = &Проект
	               |	И ПроизводственныеКомплекты.ЭтоГруппа = ИСТИНА";
	
	Возврат Новый Структура("ТекстЗапроса,НаименованиеСправочника"
	,ТекстЗапроса
	,"ПроизводственныеКомплекты");
	
КонецФункции // КонтрольПапкиИзделия()

&НаСервере
Функция ДанныеДляКонтрольПапкиДоговорСделки(текСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПриложенияКДоговорам.Наименование КАК Наименование,
	               |	ПриложенияКДоговорам.Ссылка КАК СсылкаНаПапку
	               |ИЗ
	               |	Справочник.ПриложенияКДоговорам КАК ПриложенияКДоговорам
	               |ГДЕ
	               |	ПриложенияКДоговорам.Проект = &Проект
	               |	И ПриложенияКДоговорам.ЭтоГруппа = ИСТИНА";
	
	Возврат Новый Структура("ТекстЗапроса,НаименованиеСправочника"
	,ТекстЗапроса
	,"ПриложенияКДоговорам");
	
КонецФункции // КонтрольПапкиИзделия()

&НаСервере
Функция ДанныеДляКонтрольПапкиПомещения(текСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Помещения.Наименование КАК Наименование,
	               |	Помещения.Ссылка КАК СсылкаНаПапку
	               |ИЗ
	               |	Справочник.Помещения КАК Помещения
	               |ГДЕ
	               |	Помещения.Проект = &Проект
	               |	И Помещения.ЭтоГруппа = ИСТИНА";
	
	Возврат Новый Структура("ТекстЗапроса,НаименованиеСправочника"
	,ТекстЗапроса
	,"Помещения");
	
КонецФункции // КонтрольПапкиИзделия()

&НаСервере
Процедура КонтрольПапки(ЕстьПапка,НаименованиеПапки,СсылкаНаПапку,текСсылка,стПараметры)
	
	ПравильноеНаименованиеПапки = Справочники[стПараметры.НаименованиеСправочника].ПолучитьИмяПапки(текСсылка);
	
	Если ЕстьПапка Тогда
		Если НЕ НаименованиеПапки = ПравильноеНаименованиеПапки Тогда
			обСсылкаНаПапку = СсылкаНаПапку.ПолучитьОбъект();
			обСсылкаНаПапку.Наименование = ПравильноеНаименованиеПапки;
			обСсылкаНаПапку.Записать();
		КонецЕсли;
	Иначе
		обСсылкаНаПапку = Справочники[стПараметры.НаименованиеСправочника].СоздатьГруппу();
		обСсылкаНаПапку.Наименование = ПравильноеНаименованиеПапки;
		обСсылкаНаПапку.Проект = текСсылка;
		обСсылкаНаПапку.Записать();
	КонецЕсли;	
КонецПроцедуры // КонтрольПапки(ЕстьПапка,НаименованиеПапки,текСсылка,стПараметры) 


