Функция ИзменитьСчетчикСобытий(Задача, НаименованиеДействия, ТипДействия) Экспорт

	МассивДействий = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.НомерНастройки КАК НомерНастройки
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки
		|	И НастройкиПроекта.Значение = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ДанныеКомплектаСрезПоследних.КоличествоСогласований, 0) КАК КоличествоСогласований,
		|	Задачи_ПКД.ОбъектТЗ КАК ОбъектТЗ
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	Задачи_ПКД.Ссылка = &Задача";
	
	Запрос.УстановитьПараметр("ИмяНастройки", СоответствиеДейстий(НаименованиеДействия, ТипДействия, МассивДействий));
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Результат = Запрос.ВыполнитьПакет();
		
	КоличествоСогласований = 0;
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		КоличествоСогласований 	= Выборка.КоличествоСогласований;
		ОтборКомплект = Новый Структура("Комплект", Выборка.ОбъектТЗ);
	КонецЦикла;
	
	ОтборЗадача = Новый Структура("Задача", Задача);
	Выборка = Результат[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ИзменитьСчетчик(ОтборЗадача, ОтборКомплект, МассивДействий[Выборка.НомерНастройки - 1], КоличествоСогласований);
	КонецЦикла;
	
КонецФункции // ИзменитьСчетчикСобытий()

Функция ИзменитьСчетчик(ОтборЗадача, ОтборКомплект, НаименованиеДействия, КоличествоСогласований)
	
	Если НаименованиеДействия = "Согласование" Тогда
		НовоеКоличествоСогласований = КоличествоСогласований + 1;
		РегистрыСведений.ДанныеКомплекта.ИзменитьДанныеКомплекта(Новый Структура("Комплект, КоличествоСогласований", ОтборКомплект.Комплект, НовоеКоличествоСогласований));
		Возврат НовоеКоличествоСогласований;
	КонецЕсли;
	
	МенеджерРегистра = РегистрыСведений.ТаймингЗадач;
	стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных();
	
	Если НаименованиеДействия = "Номер ПКД согласованное" И КоличествоСогласований > 0 Тогда	
		
		ДанныеКомплекта = МенеджерРегистра.ПолучитьПоследнее(, ОтборЗадача);
		МенеджерРегистра.ЗаписатьНомераЗадачи(ОтборЗадача.Задача, ДанныеКомплекта.НомерПКД + 1);
		
		омЗадачиОбщие.ИзменитьНаименованиеЗадачи(ОтборЗадача.Задача);
		
	ИначеЕсли НаименованиеДействия = "Номер ПКД не согласованное" Тогда	

		ДанныеКомплекта = МенеджерРегистра.ПолучитьПоследнее(, ОтборЗадача);
		МенеджерРегистра.ЗаписатьНомераЗадачи(ОтборЗадача.Задача, ДанныеКомплекта.НомерПКД + 1);	
		
		омЗадачиОбщие.ИзменитьНаименованиеЗадачи(ОтборЗадача.Задача);
		
	ИначеЕсли НаименованиеДействия = "Доработка" Тогда	
		
		//стДанные.ПереходДоработка = Истина;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ОтборЗадача.Задача, стДанные);
		
	ИначеЕсли НаименованиеДействия = "Изменение" Тогда	
		
		стДанные.ПереходИзменения = Истина;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ОтборЗадача.Задача, стДанные);
		
	ИначеЕсли НаименованиеДействия = "Редакция" Тогда	
		
		стДанные.ПереходРедакция = Истина;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ОтборЗадача.Задача, стДанные);
		
	ИначеЕсли НаименованиеДействия = "Рекламация" Тогда	
		
		стДанные.ПереходРекламация = Истина;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ОтборЗадача.Задача, стДанные);
		
	КонецЕсли;
	

КонецФункции

Функция СоответствиеДейстий(НаименованиеДействия, ТипДействия, МассивДействий)

	Если ТипДействия = "ПКД" Тогда
		МассивДействий = омЗадачиОбщие.КолонкиТаблицаКнопокПКД(); 
		Возврат	СоответствиеДейстийПКД(НаименованиеДействия);
	ИначеЕсли ТипДействия = "РКД" Тогда
		МассивДействий = омЗадачиОбщие.КолонкиТаблицаКнопокРКД(); 
		Возврат	СоответствиеДейстийРКД(НаименованиеДействия);
	ИначеЕсли ТипДействия = "Состояние" Тогда
		МассивДействий = омЗадачиОбщие.КолонкиТаблицаКнопокСостояние(); 
		Возврат	СоответствиеДейстийСостояние(НаименованиеДействия);
	КонецЕсли;	

КонецФункции // СоответствиеДейстий()

Функция СоответствиеДейстийПКД(НаименованиеДействия)

	НаименованиеКонопок = омЗадачиОбщие.ПолучитьНаименованиеПКД();
	
	Если НаименованиеДействия = "СбросКонструктором" Тогда
		Возврат НаименованиеКонопок[14];		
	ИначеЕсли НаименованиеДействия = "НачатьВыполнение" Тогда
		Возврат НаименованиеКонопок[11];
	ИначеЕсли НаименованиеДействия = "Приостановить" Тогда
		Возврат НаименованиеКонопок[13];
	ИначеЕсли НаименованиеДействия = "ЗавершениеРаботы" Тогда
		Возврат НаименованиеКонопок[12];
	ИначеЕсли НаименованиеДействия = "ДоработкаВедущийКонструктор" Тогда
		Возврат НаименованиеКонопок[15];
	ИначеЕсли НаименованиеДействия = "КонтрольВедущийКонструктор" Тогда
		Возврат НаименованиеКонопок[16];
	ИначеЕсли НаименованиеДействия = "ДоработкаДизайнера" Тогда
		Возврат НаименованиеКонопок[0];
	ИначеЕсли НаименованиеДействия = "КорректировкаДизайнер" Тогда
		Возврат НаименованиеКонопок[1];
	ИначеЕсли НаименованиеДействия = "РедакцияДизайнер" Тогда
		Возврат НаименованиеКонопок[6];
	ИначеЕсли НаименованиеДействия = "РекламацияДизайнер" Тогда
		Возврат НаименованиеКонопок[5];
	ИначеЕсли НаименованиеДействия = "КонтрольКП" Тогда
		Возврат НаименованиеКонопок[7];
	ИначеЕсли НаименованиеДействия = "Согласовано" Тогда
		Возврат НаименованиеКонопок[4];
	ИначеЕсли НаименованиеДействия = "ВозвратСЗапроса" Тогда
		Возврат НаименованиеКонопок[9];
	ИначеЕсли НаименованиеДействия = "ВозвратССогласования" Тогда
		Возврат НаименованиеКонопок[8];
	ИначеЕсли НаименованиеДействия = "ОтменаИзделия" Тогда
		Возврат НаименованиеКонопок[19];
	ИначеЕсли НаименованиеДействия = "СогласованоБезИзменений" Тогда
		Возврат НаименованиеКонопок[18];
	ИначеЕсли НаименованиеДействия = "СогласованоСИзменением" Тогда
		Возврат НаименованиеКонопок[17];
	КонецЕсли;
	
	Возврат "";    

КонецФункции // СоответствиеДейстийПКД(НаименованиеДействия)

Функция СоответствиеДейстийРКД(НаименованиеДействия)

	НаименованиеКонопок = омЗадачиОбщие.ПолучитьНаименованиеРКД();

	Если НаименованиеДействия = "НачатьВыполнение" Тогда
		Возврат НаименованиеКонопок[0];		
	ИначеЕсли НаименованиеДействия = "СбросДизайнеромКорректировкаДизайнера" Тогда
		Возврат НаименованиеКонопок[6];
	ИначеЕсли НаименованиеДействия = "СбросДизайнеромИзменениеЗаказчиком" Тогда
		Возврат НаименованиеКонопок[7];
	ИначеЕсли НаименованиеДействия = "СбросКонструктором" Тогда
		Возврат НаименованиеКонопок[3];
	ИначеЕсли НаименованиеДействия = "Приостановить" Тогда
		Возврат НаименованиеКонопок[2];
	ИначеЕсли НаименованиеДействия = "ЗавершениеРаботы" Тогда
		Возврат НаименованиеКонопок[1];
	ИначеЕсли НаименованиеДействия = "ДоработкаВедущийКонструктор" Тогда
		Возврат НаименованиеКонопок[4];
	ИначеЕсли НаименованиеДействия = "ОжиданиеСогласования" Тогда
		//Возврат НаименованиеКонопок[1];
	ИначеЕсли НаименованиеДействия = "Утверждение" Тогда
		Возврат НаименованиеКонопок[5];
	ИначеЕсли НаименованиеДействия = "ОжиданиеГЧ" Тогда
		Возврат НаименованиеКонопок[8];
	КонецЕсли;
	
	Возврат "";    

КонецФункции // СоответствиеДейстийПКД(НаименованиеДействия)

Функция СоответствиеДейстийСостояние(НаименованиеДействия)

	НаименованиеКонопок = омЗадачиОбщие.ПолучитьНаименованиеСостояний();

	Если НаименованиеДействия = "СтопНачало" Тогда
		Возврат НаименованиеКонопок[0];		
	ИначеЕсли НаименованиеДействия = "СтопОстановка" Тогда
		Возврат НаименованиеКонопок[1];
	ИначеЕсли НаименованиеДействия = "РекламацияНачало" Тогда
		Возврат НаименованиеКонопок[2];
	ИначеЕсли НаименованиеДействия = "РекламацияОстановка" Тогда
		Возврат НаименованиеКонопок[3];
	КонецЕсли;

КонецФункции // СоответствиеДейстийПКД(НаименованиеДействия)


