Функция ИзменитьСчетчикСобытий(Задача, НаименованиеДействия, ТипДействия) Экспорт

	НаименованиеСобытия = СоответствиеДейстий(НаименованиеДействия, ТипДействия);
	
	

КонецФункции // ИзменитьСчетчикСобытий()

Функция СоответствиеДейстий(НаименованиеДействия, ТипДействия)

	Если ТипДействия = "ПКД" Тогда
		Возврат	СоответствиеДейстийПКД(НаименованиеДействия);
	ИначеЕсли ТипДействия = "РКД" Тогда
		Возврат	СоответствиеДейстийРКД(НаименованиеДействия);
	ИначеЕсли ТипДействия = "Состояние" Тогда
		Возврат	СоответствиеДейстийСостояние(НаименованиеДействия);
	КонецЕсли;	

КонецФункции // СоответствиеДейстий()

Функция СоответствиеДейстийПКД(НаименованиеДействия)

	НаименованиеКонопок = омЗадачиОбщие.ПолучитьНаименованиеПКД();
	
	Если НаименованиеДействия = "СбросКонструктором" Тогда
		Возврат НаименованиеКонопок[14];		
	ИначеЕсли НаименованиеДействия = "НачатьВыполнение" Тогда
		Возврат НаименованиеКонопок[11];
	ИначеЕсли НаименованиеДействия = "Приостановить" Тогда
		Возврат НаименованиеКонопок[13];
	ИначеЕсли НаименованиеДействия = "ЗавершениеРаботы" Тогда
		Возврат НаименованиеКонопок[12];
	ИначеЕсли НаименованиеДействия = "ДоработкаВедущийКонструктор" Тогда
		Возврат НаименованиеКонопок[15];
	ИначеЕсли НаименованиеДействия = "КонтрольВедущийКонструктор" Тогда
		Возврат НаименованиеКонопок[16];
	ИначеЕсли НаименованиеДействия = "ДоработкаДизайнера" Тогда
		Возврат НаименованиеКонопок[0];
	ИначеЕсли НаименованиеДействия = "КорректировкаДизайнер" Тогда
		Возврат НаименованиеКонопок[1];
	ИначеЕсли НаименованиеДействия = "РедакцияДизайнер" Тогда
		Возврат НаименованиеКонопок[6];
	ИначеЕсли НаименованиеДействия = "РекламацияДизайнер" Тогда
		Возврат НаименованиеКонопок[5];
	ИначеЕсли НаименованиеДействия = "КонтрольКП" Тогда
		Возврат НаименованиеКонопок[7];
	ИначеЕсли НаименованиеДействия = "Согласовано" Тогда
		Возврат НаименованиеКонопок[4];
	ИначеЕсли НаименованиеДействия = "ВозвратСЗапроса" Тогда
		Возврат НаименованиеКонопок[9];
	ИначеЕсли НаименованиеДействия = "ВозвратССогласования" Тогда
		Возврат НаименованиеКонопок[8];
	ИначеЕсли НаименованиеДействия = "ОтменаИзделия" Тогда
		Возврат НаименованиеКонопок[19];
	ИначеЕсли НаименованиеДействия = "СогласованоБезИзменений" Тогда
		Возврат НаименованиеКонопок[18];
	ИначеЕсли НаименованиеДействия = "СогласованоСИзменением" Тогда
		Возврат НаименованиеКонопок[17];
	КонецЕсли;
	
	Возврат "";    

КонецФункции // СоответствиеДейстийПКД(НаименованиеДействия)

Функция СоответствиеДейстийРКД(НаименованиеДействия)

	

КонецФункции // СоответствиеДейстийПКД(НаименованиеДействия)

Функция СоответствиеДейстийСостояние(НаименованиеДействия)

	

КонецФункции // СоответствиеДейстийПКД(НаименованиеДействия)


