
Процедура ПередЗаписью(Отказ)
	Если НЕ ЭтоГруппа Тогда
		Родитель = омКонтрольПапки.КонтрольПапкиЭлементаСправочника(Проект, Ссылка.Метаданные().Имя);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		
		Отказ = Ложь;
		Б24_СМ_РегистрацияИзмененийСервер.ЗарегистрироватьИзменения(ЭтотОбъект, Ложь, Отказ);
		
		РегистрыСведений.СостояниеЗамера.УстановитьСтатусЗамера(Ссылка, , , , Истина);
		
		омЗадачи.СоздатьЗадачуНаСозданиеГабаритногоЧеритежа(Проект, Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры
