//ОбъектДанных композиция комплект
Функция ПолучитьДанныеОбъекта(ОбъектДанных, КонструкторПользователь = Неопределено) Экспорт
	
	стВозврата = Новый Структура("КонструкторПользователь, КонструкторСотрудник, ТекущаяСтадия", );
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК КонструкторСотрудник,
		|	Пользователи.Ссылка КАК КонструкторПользователь,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ДанныеКомплектаСрезПоследних.Конструктор = Пользователи.Сотрудник
		|ГДЕ
		|	ДанныеКомплектаСрезПоследних.Комплект = &ОбъектДанных
		|	И НЕ ДанныеКомплектаСрезПоследних.Конструктор = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ОбъектДанных", ОбъектДанных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата, Выборка);
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(стВозврата.КонструкторСотрудник) И ЗначениеЗаполнено(КонструкторПользователь) Тогда
	
		КонструкторСотрудник = омСотрудники.ПолучитьСотруднткаПоПользователю(КонструкторПользователь);
		ИзменитьКонструктораНаСервереОдинОбъект(ОбъектДанных, КонструкторСотрудник);
		
		стВозврата.КонструкторСотрудник 	= КонструкторСотрудник;
		стВозврата.КонструкторПользователь 	= КонструкторПользователь;
	
	КонецЕсли;
	
	Возврат стВозврата;
	
КонецФункции // ПолучитьДанныеОбъекта()

Процедура ИзменитьКонструктораНаСервере(ОбъектТЗ, Конструктор) Экспорт

	Если ТипЗнч(ОбъектТЗ) = тип("Массив") Тогда
		
		Для каждого х Из ОбъектТЗ Цикл
			
			ИзменитьКонструктораНаСервереОдинОбъект(х, Конструктор);
			
		КонецЦикла;
		
	Иначе
		
		ИзменитьКонструктораНаСервереОдинОбъект(ОбъектТЗ, Конструктор);
		
	КонецЕсли;
	
	
КонецПроцедуры // ИзменитьКонструктораНаСервере()

Процедура ИзменитьКонструктораНаСервереОдинОбъект(ОбъектТЗ, Конструктор)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &ОбъектТЗ) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	МенеджерЗаписи 			= РегистрыСведений.ДанныеКомплекта.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Комплект = ОбъектТЗ; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
	КонецЦикла;
	
	МенеджерЗаписи.Период 		= ТекущаяДата(); 
	МенеджерЗаписи.Автор 		= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Конструктор 	= Конструктор;
	МенеджерЗаписи.Комплект 	= ОбъектТЗ; 
	
    МенеджерЗаписи.Записать();
	
	СтруктуруДляИзмененияИсполнителя = омЗадачаОбщаяНаСервере.ПолучитьСтруктуруДляИзмененияИсполнителя(Конструктор, , Истина);
	//омЗадачаОбщаяНаСервере.ИзменитьИсполнителяЗадачиОбщей(СтруктуруДляИзмененияИсполнителя, ОбъектТЗ); 
	
КонецПроцедуры // ИзменитьКонструктораНаСервере()

Функция ВозможностьИзменитьКонструктора(ОбъектТЗ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК Задачи_РКД
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО Задачи_РКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ = &ОбъектТЗ
		|	И Задачи_РКД.ТипЗадачи В(&ТипЗадачи)
		|	И НЕ Задачи_РКД.Выполнена
		|	И НЕ ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеКонструктором)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Задачи_ПКД
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО Задачи_ПКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|ГДЕ
		|	Задачи_ПКД.ОбъектТЗ = &ОбъектТЗ
		|	И Задачи_ПКД.ТипЗадачи В(&ТипЗадачи)
		|	И НЕ Задачи_ПКД.Выполнена
		|	И НЕ ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеКонструктором)";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	Запрос.УстановитьПараметр("ТипЗадачи", омЗадачиПКДПовтор.ТипыЗадачКонструктора());
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Задачи_РКД;	
	КонецЦикла;
	
	Выборка = Результат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Задачи_ПКД;	
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // ВозможностьИзменитьКонструктора()

Процедура ИзменитьИсполнителяВЗадаче(ОбъектТЗ, Конструктор) Экспорт
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Задача,
		|	ЕСТЬNULL(ТаймингЗадачСрезПоследних.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеКонструктором)) КАК Состояние
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО Задачи_ПКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|ГДЕ
		|	(ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеКонструктором)
		|			ИЛИ ТаймингЗадачСрезПоследних.Состояние ЕСТЬ NULL)
		|	И Задачи_ПКД.ОбъектТЗ = &ОбъектТЗ
		|	И НЕ Задачи_ПКД.Выполнена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК Задача,
		|	ЕСТЬNULL(ТаймингЗадачСрезПоследних.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеКонструктором)) КАК Состояние
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО Задачи_РКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|ГДЕ
		|	(ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеКонструктором)
		|			ИЛИ ТаймингЗадачСрезПоследних.Состояние ЕСТЬ NULL)
		|	И Задачи_РКД.ОбъектТЗ = &ОбъектТЗ
		|	И НЕ Задачи_РКД.Выполнена";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	Результат 	= Запрос.ВыполнитьПакет();
	Выборка 	= Результат[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Задача) Тогда
			
			ОбъектЗадача = Выборка.Задача.ПолучитьОбъект(); 
			ОбъектЗадача.Исполнитель = омСотрудники.ПолучитьПользователяПоСотруднтку(Конструктор);	
			ОбъектЗадача.Записать();
			
		КонецЕсли;
	КонецЦикла;
	
	Выборка 	= Результат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Задача) Тогда
			
			ОбъектЗадача = Выборка.Задача.ПолучитьОбъект(); 
			ОбъектЗадача.Исполнитель = омСотрудники.ПолучитьПользователяПоСотруднтку(Конструктор);	
			ОбъектЗадача.Записать();
			
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ИзменитьЗначениеПерехода(Комплект, НаименованиеИзменения) Экспорт

	Проект = Комплект.Проект;
	
	МенеджерЗаписи = РегистрыСведений.ДатыКомплекта.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Проект 	= Проект;
	МенеджерЗаписи.Комплект = Комплект;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Проект 	= Проект;
	МенеджерЗаписи.Комплект = Комплект;
	
	МенеджерЗаписи[НаименованиеИзменения] = МенеджерЗаписи[НаименованиеИзменения] + 1;
	
	МенеджерЗаписи.Записать();

КонецПроцедуры

Функция ЗаполнитьКомплектыКонструктора(Проект, Конструктор) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ втПользователь
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Конструктор = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Пользователи.Ссылка = &Конструктор
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задачи_ПКД.ОбъектТЗ КАК ОбъектТЗ
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	НЕ Задачи_ПКД.Выполнена
		|	И НЕ Задачи_ПКД.ТипЗадачи В (&ТипЗадачи)
		|	И ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Задачи_ПКД.Проект = &Проект
		|		КОНЕЦ
		|	И НЕ Задачи_ПКД.ОбобщеннаяЗадача
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Задачи_РКД.ОбъектТЗ
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	НЕ Задачи_РКД.Выполнена
		|	И НЕ Задачи_РКД.ТипЗадачи В (&ТипЗадачи)
		|	И ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Задачи_РКД.Проект = &Проект
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.ОбъектТЗ КАК ОбъектТЗ,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
		|	втПользователь.Сотрудник КАК Сотрудник,
		|	втПользователь.Сотрудник.Наименование КАК СотрудникНаименование
		|ПОМЕСТИТЬ втОбъекты
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних(, ) КАК ДанныеКомплектаСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПользователь КАК втПользователь
		|			ПО (втПользователь.Сотрудник = ДанныеКомплектаСрезПоследних.Конструктор)
		|		ПО вт.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.ОбъектТЗ,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия,
		|	втПользователь.Сотрудник,
		|	втПользователь.Сотрудник.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОбъекты.ОбъектТЗ КАК Комплект,
		|	втОбъекты.ТекущаяСтадия КАК ТекущаяСтадия,
		|	ЕСТЬNULL(ИзменениеСотрудникаСрезПоследних.ВедущийКонструктор, втОбъекты.ОбъектТЗ.Проект.ВедущийКонструктор) КАК ВедущийКонструктор,
		|	ЕСТЬNULL(ИзменениеСотрудникаСрезПоследних.Дизайнер, втОбъекты.ОбъектТЗ.Проект.Дизайнер) КАК Дизайнер,
		|	втОбъекты.Сотрудник КАК Сотрудник,
		|	втОбъекты.СотрудникНаименование КАК СотрудникНаименование,
		|	втОбъекты.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование,
		|	втОбъекты.ТекущаяСтадия.ПолноеНаименование КАК ТекущаяСтадияПолноеНаименование
		|ИЗ
		|	втОбъекты КАК втОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИзменениеСотрудника.СрезПоследних КАК ИзменениеСотрудникаСрезПоследних
		|		ПО втОбъекты.ОбъектТЗ = ИзменениеСотрудникаСрезПоследних.ОбъектИзменения
		|
		|УПОРЯДОЧИТЬ ПО
		|	СотрудникНаименование,
		|	втОбъекты.ОбъектТЗ.Наименование";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Конструктор", Конструктор);
	Запрос.УстановитьПараметр("ТипЗадачи", омЗадачиПКДПовтор.ТипыЗадачКонструктора());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЗаполнитьЗадачи_РКД_ПКД(Проект, Конструктор = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Задача,
		|	Задачи_ПКД.Проект КАК Проект,
		|	Задачи_ПКД.Исполнитель КАК Исполнитель,
		|	ДатыКомплекта.КрайПКД КАК Край,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадияСсылка,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия.ПолноеНаименование КАК ТекущаяСтадия
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ПО Задачи_ПКД.ОбъектТЗ = ДатыКомплекта.Комплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	НЕ Задачи_ПКД.Выполнена
		|	И Задачи_ПКД.ТипЗадачи В(&ТипЗадачи)
		|	И ВЫБОР
		|			КОГДА &Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Задачи_ПКД.Исполнитель = &Исполнитель
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Задачи_ПКД.Проект = &Проект
		|		КОНЕЦ
		|	И НЕ Задачи_ПКД.ОбобщеннаяЗадача
		|	И НЕ ДанныеКомплектаСрезПоследних.ТекущаяСтадия.ОграниченныйПоказ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Задачи_РКД.Ссылка,
		|	Задачи_РКД.Проект,
		|	Задачи_РКД.Исполнитель,
		|	ДатыКомплекта.КрайРКД,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия.ПолноеНаименование
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ПО Задачи_РКД.ОбъектТЗ = ДатыКомплекта.Комплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО Задачи_РКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	НЕ Задачи_РКД.Выполнена
		|	И ВЫБОР
		|			КОГДА &Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Задачи_РКД.Исполнитель = &Исполнитель
		|		КОНЕЦ
		|	И Задачи_РКД.ТипЗадачи В(&ТипЗадачи)
		|	И НЕ Задачи_РКД.СтатусЗадачи = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ОжиданиеГЧ)
		|	И ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Задачи_РКД.Проект = &Проект
		|		КОНЕЦ
		|	И НЕ ДанныеКомплектаСрезПоследних.ТекущаяСтадия.ОграниченныйПоказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Задача КАК Задача,
		|	ЕСТЬNULL(МАКСИМУМ(ДанныеКомплекта.Период), ДАТАВРЕМЯ(1, 1, 1)) КАК Период,
		|	вт.ТекущаяСтадияСсылка КАК ТекущаяСтадияСсылка
		|ПОМЕСТИТЬ вт1
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|		ПО вт.Задача.ОбъектТЗ = ДанныеКомплекта.Комплект
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.Задача,
		|	вт.ТекущаяСтадияСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Задача КАК Задача,
		|	вт.Задача.Наименование КАК Наименование,
		|	вт.Проект КАК Проект,
		|	вт.Исполнитель КАК Исполнитель,
		|	вт.Край КАК Край,
		|	вт.ТекущаяСтадия КАК ТекущаяСтадия,
		|	ВЫБОР
		|		КОГДА вт.Задача.КороткаяСрочнаяЗадача
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК Картинка,
		|	ЕСТЬNULL(МАКСИМУМ(ДанныеКомплекта.Период), ДАТАВРЕМЯ(1, 1, 1)) КАК Период,
		|	вт.ТекущаяСтадияСсылка КАК ТекущаяСтадияСсылка
		|ПОМЕСТИТЬ вт2
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт1 КАК вт1
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|			ПО вт1.Задача.ОбъектТЗ = ДанныеКомплекта.Комплект
		|				И (ДанныеКомплекта.Период < вт1.Период)
		|				И (НЕ вт1.ТекущаяСтадияСсылка = ДанныеКомплекта.ТекущаяСтадия)
		|		ПО вт.Задача = вт1.Задача
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА вт.Задача.КороткаяСрочнаяЗадача
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ,
		|	вт.ТекущаяСтадия,
		|	вт.Исполнитель,
		|	вт.Край,
		|	вт.Проект,
		|	вт.Задача,
		|	вт.Задача.Наименование,
		|	вт.ТекущаяСтадияСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеКомплекта.ТекущаяСтадия.ПолноеНаименование КАК ПредыдущаяСтадия,
		|	вт2.Задача КАК Задача,
		|	вт2.Наименование КАК Наименование,
		|	вт2.Проект КАК Проект,
		|	вт2.Исполнитель КАК Исполнитель,
		|	вт2.Край КАК Край,
		|	вт2.ТекущаяСтадия КАК ТекущаяСтадия,
		|	вт2.Картинка КАК Картинка,
		|	вт2.Исполнитель.Наименование КАК ИсполнительНаименование,
		|	вт2.Задача.ОбъектТЗ КАК ОбъектТЗ,
		|	вт2.Задача.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование,
		|	вт2.Исполнитель.Сотрудник КАК ИсполнительСотрудник,
		|	вт2.Исполнитель.Сотрудник.Наименование КАК ИсполнительСотрудникНаименование,
		|	вт2.ТекущаяСтадияСсылка КАК ТекущаяСтадияСсылка
		|ИЗ
		|	вт2 КАК вт2
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|		ПО вт2.Задача.ОбъектТЗ = ДанныеКомплекта.Комплект
		|			И вт2.Период = ДанныеКомплекта.Период
		|			И (вт2.Период > ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("ТипЗадачи", 		омЗадачиПКДПовтор.ТипыЗадачКонструктора());
	Запрос.УстановитьПараметр("Исполнитель", 	Конструктор);
	Запрос.УстановитьПараметр("Проект", 		Проект);
	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

