//ОбъектДанных композиция комплект
Функция ПолучитьДанныеОбъекта(ОбъектДанных) Экспорт
	
	стВозврата = Новый Структура("КонструкторПользователь, КонструкторСотрудник, ТекущаяСтадия", );
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК КонструкторСотрудник,
		|	Пользователи.Ссылка КАК КонструкторПользователь,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &ОбъектДанных) КАК ДанныеКомплектаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ДанныеКомплектаСрезПоследних.Конструктор = Пользователи.Сотрудник";
	
	Запрос.УстановитьПараметр("ОбъектДанных", ОбъектДанных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата, Выборка);
	КонецЦикла;
	
	Возврат стВозврата;
	
КонецФункции // ПолучитьДанныеОбъекта()

Процедура ИзменитьКонструктораНаСервере(ОбъектТЗ, Конструктор) Экспорт

	Если ТипЗнч(ОбъектТЗ) = тип("Массив") Тогда
		
		Для каждого х Из ОбъектТЗ Цикл
			
			ИзменитьКонструктораНаСервереОдинОбъект(х, Конструктор);
			
		КонецЦикла;
		
	Иначе
		
		ИзменитьКонструктораНаСервереОдинОбъект(ОбъектТЗ, Конструктор);
		
	КонецЕсли;
	
	
КонецПроцедуры // ИзменитьКонструктораНаСервере()

Процедура ИзменитьКонструктораНаСервереОдинОбъект(ОбъектТЗ, Конструктор)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &ОбъектТЗ) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	МенеджерЗаписи = РегистрыСведений.ДанныеКомплекта.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Комплект = ОбъектТЗ; 
	
	МенеджерЗаписи.Период 		= ТекущаяДата(); 
	МенеджерЗаписи.Автор 		= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Конструктор 	= Конструктор;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
	КонецЦикла;
	
    МенеджерЗаписи.Записать();
	
КонецПроцедуры // ИзменитьКонструктораНаСервере()

Функция ВозможностьИзменитьКонструктора(ОбъектТЗ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задача_РКД.Ссылка КАК Задача_РКД
		|ИЗ
		|	Задача.Задача_РКД КАК Задача_РКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО Задача_РКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|ГДЕ
		|	Задача_РКД.ИзделиеКомплект = &ОбъектТЗ
		|	И Задача_РКД.ТипЗадачи В(&ТипЗадачи)
		|	И НЕ Задача_РКД.Выполнена
		|	И НЕ ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеКонструктором)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Задачи_ПКД
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО Задачи_ПКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|ГДЕ
		|	Задачи_ПКД.ОбъектТЗ = &ОбъектТЗ
		|	И Задачи_ПКД.ТипЗадачи В(&ТипЗадачи)
		|	И НЕ Задачи_ПКД.Выполнена
		|	И НЕ ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеКонструктором)";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	Запрос.УстановитьПараметр("ТипЗадачи", омЗадачиПКДПовтор.ТипыЗадачКонструктора());
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Задача_РКД;	
	КонецЦикла;
	
	Выборка = Результат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Задачи_ПКД;	
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // ВозможностьИзменитьКонструктора()


