&НаСервере
Функция КонтрольПапкиЭлементаСправочника(Сделка, НаименованиеСправочника) Экспорт
	
	НаименованиеСделки = Строка(Сделка);
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	#НаименованиеСправочника#.Ссылка КАК Ссылка,
		|	#НаименованиеСправочника#.Наименование КАК Наименование
		|ИЗ
		|	Справочник.#НаименованиеСправочника# КАК #НаименованиеСправочника#
		|ГДЕ
		|	#НаименованиеСправочника#.Проект = &Проект
		|	И #НаименованиеСправочника#.ЭтоГруппа = ИСТИНА";
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "#НаименованиеСправочника#", НаименованиеСправочника);
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Спр = Справочники[НаименованиеСправочника].СоздатьГруппу();
		Спр.Наименование 	= НаименованиеСделки;
		Спр.Проект 			= Сделка;		
		Спр.Записать();
		
	    Возврат Спр.Ссылка;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		текГруппаСправочника 		= Выборка.Ссылка;
		текНаименованиеСправочника 	= Выборка.Наименование;
	КонецЦикла;
	

	Если НЕ текНаименованиеСправочника = НаименованиеСделки Тогда
		обГруппаСправочника = текГруппаСправочника.ПолучитьОбъект();
		обГруппаСправочника.Наименование = НаименованиеСделки;
	    обГруппаСправочника.Записать();
	КонецЕсли;
	
	Возврат текГруппаСправочника;	

КонецФункции // КонтрольПапкиЭлементаСправочника()
