
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УдалитьВсеЗаписи(Команда)
	
	УдалитьВсе();
	Элементы.Список.Обновить();
	
	Элементы.СписокНеотправленныеПакеты.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВсе()
	
	НаборЗаписей = РегистрыСведений.Б24_СУ_ПакетыВыгрузки.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура УдалитьВсеИзменения(Команда)
	
	УдалитьВсеИзмененияНаСервере();   
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьВсеИзмененияНаСервере()
	
	НаборЗаписей = РегистрыСведений.Б24_СУ_ТаблицаИзменений.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
