
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КлючРезультат 			= "[Результат]";
	КлючОбщиеНастройки 		= "[СтруктураНастроек]";
	КлючОбъект 				= "[Объект1С]";
	КлючСтрокаТаблицыОбъект = "[СтрокаТаблицыОбъекта1С]";
	
	
	Элементы.ГруппаРезультат.Видимость = Параметры.Тип = "Функция";
	Элементы.ГруппаСтрокаТаблицыОбъекта1С.Видимость = Параметры.Свойство("ЭтоСтрокаТЧ");
	
	Если Параметры.Свойство("Алгоритм") Тогда
		Алгоритм = Параметры.Алгоритм	
	Иначе
		
		Если Параметры.Тип = "Функция" Тогда
			Алгоритм = "//  Пример алгоритма:
			|
			|[Результат] = [Объект1С].Наименование;";
		Иначе
			Алгоритм = "//  Пример алгоритма:
			|
			|[Объект1С].УстановитьНовыйКод();";
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.Свойство("КлючиПортала") Тогда
		
		Для каждого ТекЭлемент Из Параметры.КлючиПортала Цикл 
			
			Если Параметры.Назначение = "Загрузка" Тогда
				ТаблицаКлючейПортала.Добавить("[ОбъектПортала].Получить("""+ТекЭлемент.Значение+""")", ТекЭлемент.Представление);
			Иначе
				ТаблицаКлючейПортала.Добавить("[СтруктураДанных]."+ТекЭлемент.Значение, ТекЭлемент.Представление);
			КонецЕсли;
			
		КонецЦикла;
	
		Элементы.ГруппаКлючиПортала.Видимость = Истина;
	Иначе
		Элементы.ГруппаКлючиПортала.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрименить(Команда)
	Закрыть(Алгоритм);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПараметрКлючаПортала(Команда)   
	
	ТекущиеДанные = Элементы.ТаблицаКлючейПортала.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Алгоритм = Алгоритм + ТекущиеДанные.Значение;
	КонецЕсли;
	
	ТекущийЭлемент = Элементы.Алгоритм;
	Длина = СтрДлина(Алгоритм) + 1;
	ОбновитьОтображениеДанных(Элементы.Алгоритм);
	Элементы.Алгоритм.УстановитьГраницыВыделения(Длина, Длина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПараметрОбщиеНастройки(Команда)
	
	Алгоритм = Алгоритм + "[СтруктураНастроек]";
	
	ТекущийЭлемент = Элементы.Алгоритм;
	Длина = СтрДлина(Алгоритм) + 1;
	ОбновитьОтображениеДанных(Элементы.Алгоритм);
	Элементы.Алгоритм.УстановитьГраницыВыделения(Длина, Длина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПараметрОбъект1С(Команда)
	
	Алгоритм = Алгоритм + "[Объект1С]";
	
	ТекущийЭлемент = Элементы.Алгоритм;
	Длина = СтрДлина(Алгоритм) + 1;
	ОбновитьОтображениеДанных(Элементы.Алгоритм);
	Элементы.Алгоритм.УстановитьГраницыВыделения(Длина, Длина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПараметрРезультат(Команда)
	
	Алгоритм = Алгоритм + "[Результат] = ";
	
	ТекущийЭлемент = Элементы.Алгоритм;
	Длина = СтрДлина(Алгоритм) + 1;
	ОбновитьОтображениеДанных(Элементы.Алгоритм);
	Элементы.Алгоритм.УстановитьГраницыВыделения(Длина, Длина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПараметрСтрокаТаблицыОбъекта1С(Команда)
	
	Алгоритм = Алгоритм + "[СтрокаТаблицыОбъекта1С]";
	
	ТекущийЭлемент = Элементы.Алгоритм;
	Длина = СтрДлина(Алгоритм) + 1;
	ОбновитьОтображениеДанных(Элементы.Алгоритм);
	Элементы.Алгоритм.УстановитьГраницыВыделения(Длина, Длина);
	
КонецПроцедуры
