
Функция ПолучитьСотрудникаОбъекта(ОбъектИзменения) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ИзменениеСотрудникаСрезПоследних.Дизайнер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|				ИЛИ ИзменениеСотрудникаСрезПоследних.Дизайнер ЕСТЬ NULL
		|			ТОГДА ИзменениеСотрудникаСрезПоследних.ОбъектИзменения.Проект.Дизайнер
		|		ИНАЧЕ ИзменениеСотрудникаСрезПоследних.Дизайнер
		|	КОНЕЦ КАК Дизайнер,
		|	ВЫБОР
		|		КОГДА ИзменениеСотрудникаСрезПоследних.ВедущийКонструктор = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|				ИЛИ ИзменениеСотрудникаСрезПоследних.ВедущийКонструктор ЕСТЬ NULL
		|			ТОГДА ИзменениеСотрудникаСрезПоследних.ОбъектИзменения.Проект.ВедущийКонструктор
		|		ИНАЧЕ ИзменениеСотрудникаСрезПоследних.ВедущийКонструктор
		|	КОНЕЦ КАК ВедущийКонструктор,
		|	ВЫБОР
		|		КОГДА ИзменениеСотрудникаСрезПоследних.Менеджер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|				ИЛИ ИзменениеСотрудникаСрезПоследних.Менеджер ЕСТЬ NULL
		|			ТОГДА ИзменениеСотрудникаСрезПоследних.ОбъектИзменения.Проект.Менеджер
		|		ИНАЧЕ ИзменениеСотрудникаСрезПоследних.Менеджер
		|	КОНЕЦ КАК Менеджер,
		|	ИзменениеСотрудникаСрезПоследних.ОбъектИзменения КАК ОбъектИзменения,
		|	ИзменениеСотрудникаСрезПоследних.ОбъектИзменения.Конструктор КАК Конструктор
		|ИЗ
		|	РегистрСведений.ИзменениеСотрудника.СрезПоследних(, ОбъектИзменения В (&ОбъектИзменения)) КАК ИзменениеСотрудникаСрезПоследних";
	
	Запрос.УстановитьПараметр("ОбъектИзменения", ОбъектИзменения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Тип("Массив") = ТипЗнч(ОбъектИзменения) Тогда
		Возврат РезультатЗапроса.Выгрузить();	
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Сотрудники = Новый Структура("Менеджер, Конструктор, ВедущийКонструктор, Дизайнер", );
		ЗаполнитьЗначенияСвойств(Сотрудники, Выборка);
		
		Возврат Сотрудники;
		
	КонецЦикла;
	
    Возврат Неопределено;

КонецФункции // ПолучитьСотрудникаОбъекта()
