
Функция ПолучитьРасширениеКартинок() Экспорт

	МассивРасширений = Новый Массив(3);
	МассивРасширений[0] = "jpg"; 
	МассивРасширений[1] = "jpeg"; 
	МассивРасширений[2] = "png";
	
	Возврат МассивРасширений;

КонецФункции // ПолучитьРасширениеКартинок()

Функция ПолучитьРасширениеExcel() Экспорт

	МассивРасширений = Новый Массив(2);
	МассивРасширений[0] = "xls"; 
	МассивРасширений[1] = "xlsx";
	
	Возврат МассивРасширений;

КонецФункции // ПолучитьРасширениеExcel()

Функция ПолучитьРасширениеPDF() Экспорт

	МассивРасширений = Новый Массив(1);
	МассивРасширений[0] = "pdf"; 
	
	Возврат МассивРасширений;

КонецФункции // ПолучитьРасширениеPDF()

Функция ПолучитьСтрокуДляВыбораКартинок() Экспорт
	
	ВСкобках 	= "";
	Фильтры		= "";	

	Для каждого х Из ПолучитьРасширениеКартинок() Цикл
	
		ВСкобках 	= ВСкобках + ?(ПустаяСтрока(ВСкобках), "", " ") 	+ "*." + х + ";";	
		Фильтры 	= Фильтры + ?(ПустаяСтрока(ВСкобках), " ", "; ") 	+ "*." + х;	
	
	КонецЦикла;
	
	Возврат СтрШаблон("Файлы изображений (%1)| %2", ВСкобках, Фильтры);
	
КонецФункции // ПолучитьСтрокуДляВыбораКартинок()

Функция ПолучитьТипФайлаПоРасширению(Расширение) Экспорт
	
	текРасширение = СокрЛП(Расширение);
	Если Лев(текРасширение, 1) = "." Тогда
		текРасширение = Сред(текРасширение, 2);
	КонецЕсли;

	Если НЕ ПолучитьРасширениеКартинок().Найти(текРасширение) = Неопределено Тогда
		Возврат "picture";	
	КонецЕсли;	

	Если НЕ ПолучитьРасширениеPDF().Найти(текРасширение) = Неопределено Тогда
		Возврат "pdf";	
	КонецЕсли;	

	Если НЕ ПолучитьРасширениеExcel().Найти(текРасширение) = Неопределено Тогда
		Возврат "xls";	
	КонецЕсли;
	
	Возврат "";

КонецФункции // ПолучитьТипФайлаПоРасширению()
	