&НаКлиенте
Функция ПолучитьИОбработатьДанные(ОкноДокумента, стСтруктураКанбана, СчетчикОбращений, Сотрудник, Проект, стНастройки) Экспорт
	
	НомерВерсии = стСтруктураКанбана.СтруктураДоски.НомерВерсии;
	
	Если СчетчикОбращений > 10 Тогда
		
		Если НЕ омКанбанДоскиНаСервере.ПолучитьНомерВерсии(стСтруктураКанбана.СтруктураДоски.УИДДоски) = НомерВерсии Тогда
			Возврат Истина;
		КонецЕсли;
		
		СчетчикОбращений = 0;
		
	Иначе
		СчетчикОбращений = СчетчикОбращений + 1;
	КонецЕсли;
		
	Если ОкноДокумента = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Пока ОкноДокумента.queueHead < ОкноДокумента.queueTail Цикл //Если есть что-то в очереди
		
		ОкноДокумента.queueHead = ОкноДокумента.queueHead + 1;
		Данные = ПрочитатьДанныеИзJSON(ОкноДокумента.getEvent(ОкноДокумента.queueHead));
		
		Если Данные = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		event = Данные.Получить("event");
		
		Если event = Неопределено Тогда
			Продолжить;	
		КонецЕсли; 
		
		Если event = "ClickItem" Тогда
			Продолжить;	
		КонецЕсли;
		
		Если event = "DbClickItem" Тогда
			
			itemId = Данные.Получить("itemId");
			
			Если НЕ itemId = Неопределено Тогда
				
				Ресуср = омКанбанДоскиНаСервере.ПолучитьСсылкуПоУИДРеквизита(itemId);
				
				Если НЕ Ресуср = Неопределено Тогда
					
					ПоказатьЗначение(, Ресуср);
					
				КонецЕсли; 
			КонецЕсли; 
			
			Продолжить;	
			
		КонецЕсли;
		
		Если event = "DropItem" Тогда
			омКанбанДоскиНаСервере.ЗаписатПереход(Данные, стСтруктураКанбана.СтруктураДоски.УИДДоски); 
		КонецЕсли;
		
		СчетчикОбращений = 0;
		
		Возврат Ложь;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ПрочитатьДанныеИзJSON(СтрокаJSON)
	Результат = ПрочитатьСтрокуJSON(СтрокаJSON);
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		Возврат ПрочитатьСтрокуJSON(Результат);
	Иначе
		Возврат Результат;
	КонецЕсли; 
КонецФункции

&НаКлиенте
Функция ПрочитатьСтрокуJSON(СтрокаJSON) Экспорт
	
	Результат = Неопределено;
	
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции


