#Область Картинки
&НаКлиенте
Перем НомерКартинки, ВсегоКартинок;

&НаКлиенте
Процедура ОбщаяКомандаКартинка(Команда)
	омКартинкиНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры 

&НаКлиенте
Процедура ИнформацияОКартинках()

	

КонецПроцедуры // ИнформацияОКартинках()

НаСервереБезКонтекста
Функция ПолучитьИнформациюОКартинках()

	

КонецФункции // ПолучитьИнформациюОКартинках()



&НаКлиенте
Процедура ВывестиКартинку()

		

КонецПроцедуры // ВывестиКартинку()


#КонецОбласти

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект); 
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		ЗаполнитьКомплекты();
	КонецЕсли;
	
	омКартинкиНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКартинки);
	
КонецПроцедуры

&НаКлиенте
Процедура Комплекты1ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Комплекты1ПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Комплекты1ПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

Процедура ЗаполнитьКомплекты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИзделияКомплектОбразцы.Ссылка КАК Ссылка,
		|	ИзделияКомплектОбразцы.Ссылка.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ИзделияКомплект.Образцы КАК ИзделияКомплектОбразцы
		|ГДЕ
		|	ИзделияКомплектОбразцы.Образец = &Образец
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Запрос.УстановитьПараметр("Образец", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Комплекты.Добавить(Выборка.Ссылка, Выборка.Наименование);	
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
#Область Картинки
	НомерКартинки = 0;
	Если Объект.Картинки.Количество()	> 0 Тогда
		ВывестиКартинку();
	КонецЕсли;
#КонецОбласти 



КонецПроцедуры

