
&НаСервере
Функция ПолучитьЕдиницыИзмеренийНоменклатуры(Номенклатура, ПолныйНабор = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕдиницыИзмеренияНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмеренияНоменклатуры.Коэффициент КАК Коэффициент,
	|	ЕдиницыИзмеренияНоменклатуры.Множитель КАК Множитель";
	Если ПолныйНабор Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ЕдиницыИзмеренияНоменклатуры.Ссылка КАК Ссылка,
		|	ЕдиницыИзмеренияНоменклатуры.Код КАК Код,
		|	ЕдиницыИзмеренияНоменклатуры.Наименование КАК Наименование";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|ИЗ
	|	Справочник.ЕдиницыИзмеренияНоменклатуры КАК ЕдиницыИзмеренияНоменклатуры
	|ГДЕ
	|	ЕдиницыИзмеренияНоменклатуры.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Коэффициент";
	
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	
	Возврат Запрос.Выполнить().Выгрузить();
	

КонецФункции // ПолучитьКдиницыИзмеренийНоменклатуры()

&НаСервере
Функция ЗаписатьЕдиницыИзмерения(тзНовыеЗначения,Номенклатура) Экспорт
	тзТекущиеЗначения = ПолучитьЕдиницыИзмеренийНоменклатуры(Номенклатура,Истина);
	тзТекущиеЗначения.Колонки.Добавить("Обработан",Новый ОписаниеТипов("Булево"));
	
	Для каждого новыеЗначения Из тзНовыеЗначения Цикл
		Если новыеЗначения.Множитель = 0 Тогда
			новыеЗначения.Множитель = 1;
		КонецЕсли;
		НайденоеЗначение = Ложь;
		Для каждого текущиеЗначения Из тзТекущиеЗначения Цикл
			Если новыеЗначения.ЕдиницаИзмерения = текущиеЗначения.ЕдиницаИзмерения Тогда
				
				НайденоеЗначение = Истина;
				текущиеЗначения.Обработан = Истина;	
				
				Если НЕ (новыеЗначения.Коэффициент = текущиеЗначения.Коэффициент 
					И новыеЗначения.Множитель = текущиеЗначения.Множитель) Тогда
					
					обЕдиницыИзмеренияНоменклатуры = текущиеЗначения.Ссылка.ПолучитьОбъект();
					обЕдиницыИзмеренияНоменклатуры.Коэффициент = новыеЗначения.Коэффициент;
					обЕдиницыИзмеренияНоменклатуры.Множитель = новыеЗначения.Множитель;
					обЕдиницыИзмеренияНоменклатуры.Записать();	
				КонецЕсли;	
				
				Прервать;
				
			КонецЕсли;	
		КонецЦикла;
		
		Если НЕ НайденоеЗначение Тогда
			обЕдиницыИзмеренияНоменклатуры = Справочники.ЕдиницыИзмеренияНоменклатуры.СоздатьЭлемент();
			
			обЕдиницыИзмеренияНоменклатуры.Владелец = Номенклатура;
			обЕдиницыИзмеренияНоменклатуры.ЕдиницаИзмерения = новыеЗначения.ЕдиницаИзмерения;
			обЕдиницыИзмеренияНоменклатуры.Коэффициент = новыеЗначения.Коэффициент;
			обЕдиницыИзмеренияНоменклатуры.Множитель = новыеЗначения.Множитель;
			обЕдиницыИзмеренияНоменклатуры.Записать();	
			
		КонецЕсли;
	КонецЦикла;
	
	Для каждого текущиеЗначения Из тзТекущиеЗначения.НайтиСтроки(Новый Структура("Обработан", Ложь)) Цикл
		обЕдиницыИзмеренияНоменклатуры = текущиеЗначения.Ссылка.ПолучитьОбъект();
		обЕдиницыИзмеренияНоменклатуры.Удалить();
	КонецЦикла;
	
КонецФункции // ЗаписатьЕдиницыИзмерения()

&НаСервере
Функция ЕдиницыИзмеренийНоменклатурыДляВыбора(Номенклатура) Экспорт
	мЕдиницы = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат мЕдиницы;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕдиницыИзмеренияНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.ЕдиницыИзмеренияНоменклатуры КАК ЕдиницыИзмеренияНоменклатуры
		|ГДЕ
		|	ЕдиницыИзмеренияНоменклатуры.Владелец = &Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЕдиницыИзмеренияНоменклатуры.Наименование";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		мЕдиницы.Добавить(Выборка.ОсновнаяЕдиницаИзмерения);
	КонецЦикла;
	
	Выборка = Результат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		мЕдиницы.Добавить(Выборка.ЕдиницаИзмерения);
	КонецЦикла;
	
    Возврат мЕдиницы;
КонецФункции // ЕдиницыИзмеренийНоменклатуры()

&НаСервере
Функция ПолучитьКоэффициентыЕИ(мЕдиницыМатериал, НеРавные_1 = Ложь) Экспорт
	ТипСтруктура = Тип("Структура");

	мЕдиницы = Новый Массив;
	Если НЕ НеРавные_1 Тогда
		мНоменклатура = Новый Массив;
	КонецЕсли;
	
	
	Для каждого текЕИ Из мЕдиницыМатериал Цикл
		Если ТипСтруктура = ТипЗнч(текЕИ) Тогда
			мЕдиницы.Добавить(текЕИ.ЕдиницыИзмерения);
			Если НЕ НеРавные_1 Тогда
				мНоменклатура.Добавить(текЕИ.мНоменклатура);
			КонецЕсли;
		Иначе
			мЕдиницы.Добавить(текЕИ.ЕдиницыИзмерения);
		КонецЕсли;		
	КонецЦикла; 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕдиницыИзмеренияНоменклатуры.Владелец КАК Номенклатура,
		|	ЕдиницыИзмеренияНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЕдиницыИзмеренияНоменклатуры.Коэффициент КАК Коэффициент,
		|	ЕдиницыИзмеренияНоменклатуры.Множитель КАК Множитель
		|ИЗ
		|	Справочник.ЕдиницыИзмеренияНоменклатуры КАК ЕдиницыИзмеренияНоменклатуры
		|ГДЕ
		|	ЕдиницыИзмеренияНоменклатуры.Ссылка В(&мЕдиницы)
		|	И ВЫБОР
		|			КОГДА &НеРавные_1
		|				ТОГДА ЕдиницыИзмеренияНоменклатуры.Коэффициент * ЕдиницыИзмеренияНоменклатуры.Множитель <> 1
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("мЕдиницы", мЕдиницы);
	Запрос.УстановитьПараметр("НеРавные_1", НеРавные_1);
	
	Если НЕ НеРавные_1 И мНоменклатура.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылкаа,
		|	Номенклатура.ОсновнаяЕдиницаИзмерения,
		|	1,
		|	1
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&мНоменклатура)";
		
		
		Запрос.УстановитьПараметр("мНоменклатура", мНоменклатура); 
		
	КонецЕсли;
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции // ПолучитьКоэффициентыЕИ()

&НаСервере
Функция ПолучитьКоэффициентНаСервере(Номенклатура,ЕдиницаИзмерения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕдиницыИзмеренияНоменклатуры.Коэффициент / ВЫБОР
		|		КОГДА ЕдиницыИзмеренияНоменклатуры.Множитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕдиницыИзмеренияНоменклатуры.Множитель
		|	КОНЕЦ КАК Коэффициент
		|ИЗ
		|	Справочник.ЕдиницыИзмеренияНоменклатуры КАК ЕдиницыИзмеренияНоменклатуры
		|ГДЕ
		|	ЕдиницыИзмеренияНоменклатуры.Владелец = &Номенклатура
		|	И ЕдиницыИзмеренияНоменклатуры.ЕдиницаИзмерения = &ЕдиницаИзмерения";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаИзмерения);
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатПакет[0].Выбрать();	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОсновнаяЕдиницаИзмерения = ЕдиницаИзмерения Тогда
			Возврат 1;
		КонецЕсли;
	КонецЦикла;
	
	Выборка = РезультатПакет[1].Выбрать();	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Коэффициент;
	КонецЦикла;
	
   Возврат 0;
КонецФункции // ПолучитьКоэффициентНаСервере(Материал,ЕдиницыИзмерения)()

&НаСервере
Функция ПолучитьЕдиницуПоУмолчанию(ТипЕдиницы = Неопределено) Экспорт
	
	Если ТипЕдиницы = Перечисления.ТипыНоменклатуры.Прочее Тогда
		Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК Значение,
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	И НастройкиПроекта.НомерНастройки = 0
		|	И НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)";
	

	Если ТипЕдиницы = Неопределено Тогда
		ИмяНастройки = Отчеты.ОбщиеНастройки.Создать().ПолучитьСписокИменРеквизитов();
		мВозврата = Новый Массив;
	Иначе
		ИмяНастройки = ТипЕдиницы;
	КонецЕсли;

	Запрос.УстановитьПараметр("ИмяНастройки",ИмяНастройки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ТипЕдиницы = Неопределено Тогда
			мВозврата.Добавить(Новый Структура(Выборка.ИмяНастройки,Выборка.Значение));	
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЕдиницы = Неопределено Тогда
		Возврат мВозврата;
	КонецЕсли;
	
	Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка(); 
	
КонецФункции // ПолучитьЕдиницуПоУмолчанию()

&НаСервере
Функция ПолучитьОсновнуюЕдиницуИзмерения(Номенклатура) Экспорт
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Номенклатура.ОсновнаяЕдиницаИзмерения;
	КонецЕсли; 
	
	Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка(); 
	
КонецФункции // ПолучитьОсновнуюЕдиницуИзмерения()
