
Процедура СделкаПриИзмененииНаСервере()
	
	ПолеВывода.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Проект) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ТипОтчета = 0 Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МАКСИМУМ(СостояниеЗамера.Период) КАК Период,
			|	СостояниеЗамера.ОбъектЗамера КАК ОбъектЗамера
			|ПОМЕСТИТЬ вт
			|ИЗ
			|	РегистрСведений.СостояниеЗамера КАК СостояниеЗамера
			|ГДЕ
			|	СостояниеЗамера.ОбъектЗамера.Проект = &Проект
			|
			|СГРУППИРОВАТЬ ПО
			|	СостояниеЗамера.ОбъектЗамера
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера КАК ОбъектЗамера,
			|	СостояниеЗамераСрезПоследних.СтатусЗамера КАК СтатусЗамера,
			|	ЕСТЬNULL(ПлановаяГотовностьГабаритныхЧертежей.ДатаГотовности, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаГотовности,
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера.Наименование КАК Наименование,
			|	СостояниеЗамераСрезПоследних.ОбъектИзменения КАК ОбъектИзменения,
			|	ВЫРАЗИТЬ(ВыездНаЗамерГабаритныеЧертежи.Ссылка.Комментарий КАК СТРОКА(100)) КАК Комментарий,
			|	ЕСТЬNULL(МАКСИМУМ(ВыездНаЗамерГабаритныеЧертежи.Ссылка.ДатаВыездаФакт), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыездаФакт,
			|	ЕСТЬNULL(ВыездНаЗамерГабаритныеЧертежи.Ссылка.Ссылка, НЕОПРЕДЕЛЕНО) КАК Выезд,
			|	ЕСТЬNULL(ВыездНаЗамерГабаритныеЧертежи.Ссылка.СокращенноеНазвание, """") КАК СокращенноеНазвание,
			|	ЕСТЬNULL(СоздатьМодельГабаритногоЧертежа.ДатаСоздания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаМодели
			|ИЗ
			|	РегистрСведений.СостояниеЗамера.СрезПоследних КАК СостояниеЗамераСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановаяГотовностьГабаритныхЧертежей КАК ПлановаяГотовностьГабаритныхЧертежей
			|		ПО СостояниеЗамераСрезПоследних.ОбъектЗамера = ПлановаяГотовностьГабаритныхЧертежей.ГабаритныйЧертеж
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыездНаЗамер.ГабаритныеЧертежи КАК ВыездНаЗамерГабаритныеЧертежи
			|		ПО ((ВЫРАЗИТЬ(СостояниеЗамераСрезПоследних.ОбъектЗамера КАК Справочник.ГабаритныеЧертежи)) = ВыездНаЗамерГабаритныеЧертежи.ГабаритныйЧертеж)
			|			И (ВыездНаЗамерГабаритныеЧертежи.Ссылка.Проведен)
			|			И (ВыездНаЗамерГабаритныеЧертежи.ЗамерПроизведен)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.СоздатьМодельГабаритногоЧертежа КАК СоздатьМодельГабаритногоЧертежа
			|		ПО СостояниеЗамераСрезПоследних.ОбъектЗамера = СоздатьМодельГабаритногоЧертежа.ГабаритныйЧертеж
			|			И (СоздатьМодельГабаритногоЧертежа.Выполнена)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
			|		ПО СостояниеЗамераСрезПоследних.ОбъектЗамера = вт.ОбъектЗамера
			|			И СостояниеЗамераСрезПоследних.Период = вт.Период
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(СостояниеЗамераСрезПоследних.ОбъектЗамера) = ТИП(Справочник.ГабаритныеЧертежи)
			|	И НЕ ЕСТЬNULL(СостояниеЗамераСрезПоследних.ОбъектЗамера.ЭтоГруппа, ЛОЖЬ)
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСТЬNULL(ПлановаяГотовностьГабаритныхЧертежей.ДатаГотовности, ДАТАВРЕМЯ(1, 1, 1)),
			|	СостояниеЗамераСрезПоследних.СтатусЗамера,
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера,
			|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.Ссылка,
			|	СостояниеЗамераСрезПоследних.Период,
			|	СостояниеЗамераСрезПоследних.ОбъектИзменения,
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера.Наименование,
			|	ВЫРАЗИТЬ(СостояниеЗамераСрезПоследних.ОбъектИзменения.Комментарий КАК СТРОКА(100)),
			|	ЕСТЬNULL(ВыездНаЗамерГабаритныеЧертежи.Ссылка.СокращенноеНазвание, """"),
			|	ВЫРАЗИТЬ(ВыездНаЗамерГабаритныеЧертежи.Ссылка.Комментарий КАК СТРОКА(100)),
			|	СоздатьМодельГабаритногоЧертежа.ДатаСоздания
			|
			|УПОРЯДОЧИТЬ ПО
			|	Наименование";
		
		
	Иначе
	
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера КАК ОбъектЗамера,
			|	СостояниеЗамераСрезПоследних.СтатусЗамера КАК СтатусЗамера,
			|	ЕСТЬNULL(ПлановаяГотовностьПомещений.ДатаГотовности, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаГотовности,
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера.Наименование КАК Наименование,
			|	СостояниеЗамераСрезПоследних.ОбъектИзменения КАК ОбъектИзменения,
			|	ВЫРАЗИТЬ(ВыездНаЗамерГабаритныеЧертежи.Ссылка.Комментарий КАК СТРОКА(100)) КАК Комментарий,
			|	ЕСТЬNULL(МАКСИМУМ(ВыездНаЗамерГабаритныеЧертежи.Ссылка.ДатаВыездаФакт), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыездаФакт,
			|	ЕСТЬNULL(ВыездНаЗамерГабаритныеЧертежи.Ссылка.Ссылка, НЕОПРЕДЕЛЕНО) КАК Выезд,
			|	ЕСТЬNULL(ВыездНаЗамерГабаритныеЧертежи.Ссылка.СокращенноеНазвание, """") КАК СокращенноеНазвание
			|ИЗ
			|	РегистрСведений.СостояниеЗамера.СрезПоследних КАК СостояниеЗамераСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановаяГотовностьПомещений КАК ПлановаяГотовностьПомещений
			|		ПО СостояниеЗамераСрезПоследних.ОбъектЗамера = ПлановаяГотовностьПомещений.Помещение
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыездНаЗамер.ГабаритныеЧертежи КАК ВыездНаЗамерГабаритныеЧертежи
			|		ПО ((ВЫРАЗИТЬ(СостояниеЗамераСрезПоследних.ОбъектЗамера КАК Справочник.Помещения)) = ВыездНаЗамерГабаритныеЧертежи.Помещение)
			|			И (ВыездНаЗамерГабаритныеЧертежи.Ссылка.Проведен)
			|			И (ВыездНаЗамерГабаритныеЧертежи.ЗамерПроизведен)
			|ГДЕ
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера.Проект = &Проект
			|	И ТИПЗНАЧЕНИЯ(СостояниеЗамераСрезПоследних.ОбъектЗамера) = ТИП(Справочник.Помещения)
			|	И НЕ ЕСТЬNULL(СостояниеЗамераСрезПоследних.ОбъектЗамера.ЭтоГруппа, ЛОЖЬ)
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСТЬNULL(ПлановаяГотовностьПомещений.ДатаГотовности, ДАТАВРЕМЯ(1, 1, 1)),
			|	СостояниеЗамераСрезПоследних.СтатусЗамера,
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера,
			|	ВыездНаЗамерГабаритныеЧертежи.Ссылка.Ссылка,
			|	СостояниеЗамераСрезПоследних.Период,
			|	СостояниеЗамераСрезПоследних.ОбъектИзменения,
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера.Наименование,
			|	ВЫРАЗИТЬ(СостояниеЗамераСрезПоследних.ОбъектИзменения.Комментарий КАК СТРОКА(100)),
			|	ЕСТЬNULL(ВыездНаЗамерГабаритныеЧертежи.Ссылка.СокращенноеНазвание, """"),
			|	ВЫРАЗИТЬ(ВыездНаЗамерГабаритныеЧертежи.Ссылка.Комментарий КАК СТРОКА(100))
			|
			|УПОРЯДОЧИТЬ ПО
			|	Наименование";
	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = Отчеты.СостояниеГабаритныхЧертежей.ПолучитьМакет("Макет");
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Загаловок = "Состояние замеров " + ?(ТипОтчета = 0, "габаритных чертежей.", "помещений.");
	
	ПолеВывода.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Строка");
	
	Пока Выборка.Следующий() Цикл
		
    	Область.Параметры.Заполнить(Выборка);	
		
		ПолеВывода.Вывести(Область);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельФормыБыстрыеОтборы(Элемент) экспорт
Сообщить(ЭтаФорма.ТекущийЭлемент.Имя);
КонецПроцедуры        

&НаКлиенте
Процедура СделкаПриИзменении(Элемент)
	СделкаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипОтчетаПриИзменении(Элемент)
	СделкаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьРасшифровку(Команда)
	Элементы.ГруппаРасшифровка.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаРасшифровка.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыводаОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	ТипРасшифровки = ТипЗнч(Расшифровка);
	
	Если ТипРасшифровки = Тип("СправочникСсылка.ГабаритныеЧертежи") ИЛИ ТипРасшифровки = Тип("СправочникСсылка.Помещения") Тогда
	
		СтандартнаяОбработка = Ложь;
		ВывестиРасшифровку(Расшифровка);
	
	КонецЕсли;
КонецПроцедуры

Процедура ВывестиРасшифровку(Расшифровка)

	Элементы.ГруппаРасшифровка.Видимость = Истина;
	ПолеРасшифровки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеЗамера.Период КАК Дата,
		|	СостояниеЗамера.ОбъектИзменения КАК Документ,
		|	СостояниеЗамера.СтатусЗамера КАК Статус,
		|	ЕСТЬNULL(СостояниеЗамера.ОбъектИзменения.Комментарий, """") КАК Комментарий
		|ИЗ
		|	РегистрСведений.СостояниеЗамера КАК СостояниеЗамера
		|ГДЕ
		|	СостояниеЗамера.ОбъектЗамера = &ОбъектЗамера
		|
		|УПОРЯДОЧИТЬ ПО
		|	СостояниеЗамера.Период";
	
	Запрос.УстановитьПараметр("ОбъектЗамера", Расшифровка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = Отчеты.СостояниеГабаритныхЧертежей.ПолучитьМакет("Расшифровка");
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.ОбъектЗамера = Расшифровка;
	
	ПолеРасшифровки.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Строка");

	Пока Выборка.Следующий() Цикл
		Область.Параметры.Заполнить(Выборка);	
		ПолеРасшифровки.Вывести(Область);
	КонецЦикла;
	
КонецПроцедуры
