
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНаСервере();
КонецПроцедуры

Процедура ОбновитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадачСрезПоследних.Задача КАК Задача,
		|	ТаймингЗадачСрезПоследних.Исполнитель КАК Конструктор,
		|	ТаймингЗадачСрезПоследних.Период КАК Дата
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|ГДЕ
		|	ТаймингЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ВРаботеКонструктора)
		|	И НЕ ЕСТЬNULL(ТаймингЗадачСрезПоследних.Задача.ОбобщеннаяЗадача, ЛОЖЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаймингЗадачСрезПоследних.Период";
	
	ЗадачиВРаботе.Загрузить(Запрос.Выполнить().Выгрузить());
	

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиВРаботеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиВРаботеПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиВРаботеПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ТД = Элементы.ЗадачиВРаботе.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТД.Задача);
	
КонецПроцедуры
