
#Область ПроцедурыИФункцииФормированияПакетов

///////////////////////////////////////////////////////////////////
//			ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЙ ПАКЕТОВ            //
/////////////////////////////////////////////////////////////////



// Процедура формирует пакеты данных, указанного типа
//
// Параметры:
//  СтруктураНастроек	 - 	 Структура с общими настройками
//  ТипДанных		 - 	 Тип операции
Процедура ФормированиеПакетовДанных(пСтруктураНастроек, ТипДанных) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	ТзнДанных = Новый ТаблицаЗначений;
	ТзнДанных.Колонки.Добавить("НастройкаПодключения");
	ТзнДанных.Колонки.Добавить("ТипДанных");
	ТзнДанных.Колонки.Добавить("Объект");
	ТзнДанных.Колонки.Добавить("ПодчиненныйОбъект");
	
	Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Компания Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки компаний.");
		
		Для каждого ТекЭлемент Из СтруктураНастроек.Сущности Цикл
			
			Если ТекЭлемент.ВидСущности = "Компания" И ТекЭлемент.ВыгружатьНаПортал Тогда
				
				Для каждого ТекОтбор Из СтруктураНастроек.ОтборыДляВыгрузкиНаПортал Цикл
					
					Если ТекЭлемент.ВидСущности = ТекОтбор.ВидСущности И ТекЭлемент.ИмяОбъекта = ТекОтбор.ИмяОбъекта Тогда
						
						СхемаВыгрузки = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСхемуКомпоновки(ТекЭлемент.ВидСущности, ТекЭлемент.ИмяОбъекта); 
						
						Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СхемаВыгрузки, ТекОтбор.Значение);
						ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
						ПеренестиДанныеСтрокТаблицыВДругуюТаблицу(ТзнДанных, ТаблицаОбъектовОбменаВыгрузки)
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТзнДанных, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных компаний завершено.");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Контакт Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки контактов.");
		
		Для каждого ТекЭлемент Из СтруктураНастроек.Сущности Цикл
			
			Если ТекЭлемент.ВидСущности = "Контакт" И ТекЭлемент.ВыгружатьНаПортал Тогда
				
				Для каждого ТекОтбор Из СтруктураНастроек.ОтборыДляВыгрузкиНаПортал Цикл
					
					Если ТекЭлемент.ВидСущности = ТекОтбор.ВидСущности И ТекЭлемент.ИмяОбъекта = ТекОтбор.ИмяОбъекта Тогда
						
						СхемаВыгрузки = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСхемуКомпоновки(ТекЭлемент.ВидСущности, ТекЭлемент.ИмяОбъекта); 
						
						Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СхемаВыгрузки, ТекОтбор.Значение);
						ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
						ПеренестиДанныеСтрокТаблицыВДругуюТаблицу(ТзнДанных, ТаблицаОбъектовОбменаВыгрузки)
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТзнДанных, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных контактов завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Реквизит Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки реквизитов клиентов.");
		
		Для каждого ТекЭлемент Из СтруктураНастроек.Сущности Цикл
			
			Если ТекЭлемент.ВидСущности = "Реквизит" И ТекЭлемент.ВыгружатьНаПортал Тогда
				
				Для каждого ТекОтбор Из СтруктураНастроек.ОтборыДляВыгрузкиНаПортал Цикл
					
					Если ТекЭлемент.ВидСущности = ТекОтбор.ВидСущности И ТекЭлемент.ИмяОбъекта = ТекОтбор.ИмяОбъекта Тогда
						
						СхемаВыгрузки = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСхемуКомпоновки(ТекЭлемент.ВидСущности, ТекЭлемент.ИмяОбъекта); 
						
						Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СхемаВыгрузки, ТекОтбор.Значение);
						ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
						ПеренестиДанныеСтрокТаблицыВДругуюТаблицу(ТзнДанных, ТаблицаОбъектовОбменаВыгрузки)
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТзнДанных, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных реквизитов клиентов завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.БанковскийСчетРеквизита Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки банковских счетов реквизитов клиентов.");
		
		Для каждого ТекЭлемент Из СтруктураНастроек.Сущности Цикл
			
			Если ТекЭлемент.ВидСущности = "Банковский счет" И ТекЭлемент.ВыгружатьНаПортал Тогда
				
				Для каждого ТекОтбор Из СтруктураНастроек.ОтборыДляВыгрузкиНаПортал Цикл
					
					Если ТекЭлемент.ВидСущности = ТекОтбор.ВидСущности И ТекЭлемент.ИмяОбъекта = ТекОтбор.ИмяОбъекта Тогда
						
						СхемаВыгрузки = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСхемуКомпоновки(ТекЭлемент.ВидСущности, ТекЭлемент.ИмяОбъекта); 
						
						Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СхемаВыгрузки, ТекОтбор.Значение);
						ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
						ПеренестиДанныеСтрокТаблицыВДругуюТаблицу(ТзнДанных, ТаблицаОбъектовОбменаВыгрузки)
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТзнДанных, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных банковских счетов реквизитов клиентов завершено");
		
  	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара2 Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки групп товаров.");
		
		Для каждого ТекЭлемент Из СтруктураНастроек.Сущности Цикл
			
			Если (СтруктураНастроек.ВерсияТоваров = "v.2" И ТекЭлемент.ВидСущности = "Товар2" И ТекЭлемент.ВыгружатьНаПортал)
				ИЛИ (НЕ СтруктураНастроек.ВерсияТоваров = "v.2" И ТекЭлемент.ВидСущности = "Товар" И ТекЭлемент.ВыгружатьНаПортал) Тогда
				
				Для каждого ТекОтбор Из СтруктураНастроек.ОтборыДляВыгрузкиНаПортал Цикл
					
					Если ТекЭлемент.ВидСущности = ТекОтбор.ВидСущности И ТекЭлемент.ИмяОбъекта = ТекОтбор.ИмяОбъекта Тогда
						
						ТаблицаОбъектовОбменаВыгрузки = ПолучитьТаблицуОбъектовОбменаВыгрузкиГруппТоваров(СтруктураНастроек, ТипДанных, ТекОтбор.Значение);
						ПеренестиДанныеСтрокТаблицыВДругуюТаблицу(ТзнДанных, ТаблицаОбъектовОбменаВыгрузки)
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТзнДанных, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных групп товаров завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара2 Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки свойств товаров.");
		
		Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СтруктураНастроек.СтруктураСхемКомпоновки.ВыгрузкаСвойствТоваров);
		
		ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТаблицаОбъектовОбменаВыгрузки, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных свойств товаров завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоПредложения Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки свойств предложений.");
		
		Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СтруктураНастроек.СтруктураСхемКомпоновки.ВыгрузкаСвойствПредложений);
		
		ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТаблицаОбъектовОбменаВыгрузки, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных свойств предложений завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара2 ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваПредложения Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки значений свойств товаров/предложений.");
		
		Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СтруктураНастроек.СтруктураСхемКомпоновки.ВыгрузкаЗначенийСвойств);
		
		ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТаблицаОбъектовОбменаВыгрузки, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных значений свойств товаров завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Прайс Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки прайсов.");
		
		ТаблицаОбъектовОбменаВыгрузки = Новый ТаблицаЗначений;  
		ТаблицаОбъектовОбменаВыгрузки.Колонки.Добавить("НастройкаПодключения"	, Новый ОписаниеТипов("СправочникСсылка.Б24_К_НастройкиПодключения"));	
		ТаблицаОбъектовОбменаВыгрузки.Колонки.Добавить("ТипДанных"				, Новый ОписаниеТипов("ПеречислениеСсылка.Б24_К_ТипыДанныхДляОбменаСПорталом"));	
		ТаблицаОбъектовОбменаВыгрузки.Колонки.Добавить("Объект"					, Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));	
		
		Если СтруктураНастроек.НастройкиСинхронизацииТоваров.Свойство("Прайсы") Тогда
			
			ДобавленныеПрайсы = Новый Массив;
			Для каждого ТекЗначение Из СтруктураНастроек.НастройкиСинхронизацииТоваров.Прайсы Цикл  
				
				Если ДобавленныеПрайсы.Найти(ТекЗначение.Значение) = Неопределено Тогда
					
					ДобавленныеПрайсы.Добавить(ТекЗначение.Значение);
					
					НоваяЗапись = ТаблицаОбъектовОбменаВыгрузки.Добавить();	
					НоваяЗапись.НастройкаПодключения 	= СтруктураНастроек.НастройкаПодключения;
					НоваяЗапись.ТипДанных 				= ТипДанных;
					НоваяЗапись.Объект 					= ТекЗначение.Значение;  
					
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЕсли;
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТаблицаОбъектовОбменаВыгрузки, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных прайсов завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения2 Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки единиц измерения товаров.");
		
		Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СтруктураНастроек.СтруктураСхемКомпоновки.ВыгрузкаЕдиницИзмерения);
		
		ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТаблицаОбъектовОбменаВыгрузки, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных единиц измерений товаров завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Товар Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки товаров.");
		
		Для каждого ТекЭлемент Из СтруктураНастроек.Сущности Цикл
			
			Если ТекЭлемент.ВидСущности = "Товар" И ТекЭлемент.ВыгружатьНаПортал Тогда
				
				Для каждого ТекОтбор Из СтруктураНастроек.ОтборыДляВыгрузкиНаПортал Цикл
					
					Если ТекЭлемент.ВидСущности = ТекОтбор.ВидСущности И ТекЭлемент.ИмяОбъекта = ТекОтбор.ИмяОбъекта Тогда
						
						СхемаВыгрузки = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСхемуКомпоновки(ТекЭлемент.ВидСущности, ТекЭлемент.ИмяОбъекта); 
						
						Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СхемаВыгрузки, ТекОтбор.Значение);
						ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
						ПеренестиДанныеСтрокТаблицыВДругуюТаблицу(ТзнДанных, ТаблицаОбъектовОбменаВыгрузки)
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТзнДанных, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных товаров завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Товар2 Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки товаров.");
		
		Для каждого ТекЭлемент Из СтруктураНастроек.Сущности Цикл
			
			Если ТекЭлемент.ВидСущности = "Товар2" И ТекЭлемент.ВыгружатьНаПортал Тогда
				
				Для каждого ТекОтбор Из СтруктураНастроек.ОтборыДляВыгрузкиНаПортал Цикл
					
					Если ТекЭлемент.ВидСущности = ТекОтбор.ВидСущности И ТекЭлемент.ИмяОбъекта = ТекОтбор.ИмяОбъекта Тогда
						
						СхемаВыгрузки = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСхемуКомпоновки(ТекЭлемент.ВидСущности, ТекЭлемент.ИмяОбъекта); 
						
						Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СхемаВыгрузки, ТекОтбор.Значение);
						ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
						ПеренестиДанныеСтрокТаблицыВДругуюТаблицу(ТзнДанных, ТаблицаОбъектовОбменаВыгрузки)
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТзнДанных, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных товаров завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Предложение Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки предложений товаров.");
		
		Для каждого ТекЭлемент Из СтруктураНастроек.Сущности Цикл
			
			Если ТекЭлемент.ВидСущности = "Предложение" И ТекЭлемент.ВыгружатьНаПортал Тогда
				
				Для каждого ТекОтбор Из СтруктураНастроек.ОтборыДляВыгрузкиНаПортал Цикл
					
					Если ТекЭлемент.ВидСущности = ТекОтбор.ВидСущности И ТекЭлемент.ИмяОбъекта = ТекОтбор.ИмяОбъекта Тогда
						
						Если СтруктураНастроек.ВыгружаемыеТовары = Неопределено Тогда
							СтруктураНастроек.ВыгружаемыеТовары = ВсеВыгружаемыеТовары(СтруктураНастроек.ТипыОбъектовОбмена.Товар2, СтруктураНастроек);
						КонецЕсли;
						
						СхемаВыгрузки = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСхемуКомпоновки(ТекЭлемент.ВидСущности, ТекЭлемент.ИмяОбъекта); 
						
						Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СхемаВыгрузки, ТекОтбор.Значение);
						ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
						ПеренестиДанныеСтрокТаблицыВДругуюТаблицу(ТзнДанных, ТаблицаОбъектовОбменаВыгрузки)
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТзнДанных.Свернуть("НастройкаПодключения, ТипДанных, Объект, ПодчиненныйОбъект");
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТзнДанных, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных предложений товаров завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Цена Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки цен товаров/предложений.");
		
		Если СтруктураНастроек.ВыгружаемыеТовары = Неопределено Тогда
			СтруктураНастроек.ВыгружаемыеТовары = ВсеВыгружаемыеТовары(СтруктураНастроек.ТипыОбъектовОбмена.Товар2, СтруктураНастроек);
		КонецЕсли;
		
		Если СтруктураНастроек.ВыгружаемыеПредложения = Неопределено Тогда
			СтруктураНастроек.ВыгружаемыеПредложения = ВсеВыгружаемыеПредложения(СтруктураНастроек.ТипыОбъектовОбмена.Предложение, СтруктураНастроек);
		КонецЕсли;  
			
		Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СтруктураНастроек.СтруктураСхемКомпоновки.ВыгрузкаЦен);
		ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТаблицаОбъектовОбменаВыгрузки, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных цен товаров/предложений завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Остаток Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки остаток товаров/предложений.");
		
		Если СтруктураНастроек.ВыгружаемыеТовары = Неопределено Тогда
			СтруктураНастроек.ВыгружаемыеТовары = ВсеВыгружаемыеТовары(СтруктураНастроек.ТипыОбъектовОбмена.Товар2, СтруктураНастроек);
		КонецЕсли;
		
		Если СтруктураНастроек.ВыгружаемыеПредложения = Неопределено Тогда
			СтруктураНастроек.ВыгружаемыеПредложения = ВсеВыгружаемыеПредложения(СтруктураНастроек.ТипыОбъектовОбмена.Предложение, СтруктураНастроек);
		КонецЕсли;  
			
		Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СтруктураНастроек.СтруктураСхемКомпоновки.ВыгрузкаОстатков);
		ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТаблицаОбъектовОбменаВыгрузки, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных остаток товаров/предложений завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлТовара2 ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлПредложения Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки картинок товаров/предложений.");
		
		Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СтруктураНастроек.СтруктураСхемКомпоновки.ВыгрузкаКартинокФайлов);
		
		ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТаблицаОбъектовОбменаВыгрузки, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных картинок товаров/предложений завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Счет ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.РеквизитыСчета Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки счетов. Вид данных:" + Строка(ТипДанных));
		
		Для каждого ТекЭлемент Из СтруктураНастроек.Сущности Цикл
			
			Если ТекЭлемент.ВидСущности = "Счет" И ТекЭлемент.ВыгружатьНаПортал Тогда
				
				Для каждого ТекОтбор Из СтруктураНастроек.ОтборыДляВыгрузкиНаПортал Цикл
					
					Если ТекЭлемент.ВидСущности = ТекОтбор.ВидСущности И ТекЭлемент.ИмяОбъекта = ТекОтбор.ИмяОбъекта Тогда
						
						СхемаВыгрузки = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСхемуКомпоновки(ТекЭлемент.ВидСущности, ТекЭлемент.ИмяОбъекта); 
						
						Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СхемаВыгрузки, ТекОтбор.Значение);
						ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
						ПеренестиДанныеСтрокТаблицыВДругуюТаблицу(ТзнДанных, ТаблицаОбъектовОбменаВыгрузки)
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТзнДанных, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных счетов завершено. Вид данных:" + Строка(ТипДанных));
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Счет2 Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки счетов. Вид данных:" + Строка(ТипДанных));
		
		Для каждого ТекЭлемент Из СтруктураНастроек.Сущности Цикл
			
			Если ТекЭлемент.ВидСущности = "Счет2" И ТекЭлемент.ВыгружатьНаПортал Тогда
				
				Для каждого ТекОтбор Из СтруктураНастроек.ОтборыДляВыгрузкиНаПортал Цикл
					
					Если ТекЭлемент.ВидСущности = ТекОтбор.ВидСущности И ТекЭлемент.ИмяОбъекта = ТекОтбор.ИмяОбъекта Тогда
						
						СхемаВыгрузки = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСхемуКомпоновки(ТекЭлемент.ВидСущности, ТекЭлемент.ИмяОбъекта); 
						
						Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СхемаВыгрузки, ТекОтбор.Значение);
						ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
						ПеренестиДанныеСтрокТаблицыВДругуюТаблицу(ТзнДанных, ТаблицаОбъектовОбменаВыгрузки)
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТзнДанных, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных счетов завершено. Вид данных:" + Строка(ТипДанных));
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Проект ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.РеквизитыСделки
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ТоварыСделки Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки сделок. Вид данных:" + Строка(ТипДанных));
		
		Для каждого ТекЭлемент Из СтруктураНастроек.Сущности Цикл
			
			Если ТекЭлемент.ВидСущности = "Проект" И ТекЭлемент.ВыгружатьНаПортал Тогда
				
				Для каждого ТекОтбор Из СтруктураНастроек.ОтборыДляВыгрузкиНаПортал Цикл
					
					Если ТекЭлемент.ВидСущности = ТекОтбор.ВидСущности И ТекЭлемент.ИмяОбъекта = ТекОтбор.ИмяОбъекта Тогда
						
						СхемаВыгрузки = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСхемуКомпоновки(ТекЭлемент.ВидСущности, ТекЭлемент.ИмяОбъекта); 
						
						
						ТаблицаОбъектовОбменаВыгрузки = Новый ТаблицаЗначений;
						ТаблицаОбъектовОбменаВыгрузки.Колонки.Добавить("НастройкаПодключения");
						ТаблицаОбъектовОбменаВыгрузки.Колонки.Добавить("ТипДанных");
						ТаблицаОбъектовОбменаВыгрузки.Колонки.Добавить("Объект");
						ТаблицаОбъектовОбменаВыгрузки.Колонки.Добавить("ПодчиненныйОбъект"); 
						
						НС = ТаблицаОбъектовОбменаВыгрузки.Добавить();
						НС.НастройкаПодключения = СтруктураНастроек.НастройкаПодключения;
						НС.ТипДанных = ТипДанных;
						НС.Объект = Справочники.Проекты.НайтиПоКоду("000000012");
						//Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СхемаВыгрузки, ТекОтбор.Значение);
						//ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
						ПеренестиДанныеСтрокТаблицыВДругуюТаблицу(ТзнДанных, ТаблицаОбъектовОбменаВыгрузки)
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТзнДанных, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных сделок завершено. Вид данных:" + Строка(ТипДанных));
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКомпании ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКонтакта 
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСделки 
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКомпании ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКонтакта 
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСчета ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСделки 
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоЗаказа ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваЗаказа  
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета2 ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСчета2 Тогда 
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для объектов с типом:" + Строка(ТипДанных));
		
		Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СтруктураНастроек.СтруктураСхемКомпоновки.ВыгрузкаПользовательскихПолей);
		
		ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТаблицаОбъектовОбменаВыгрузки, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных для объектов с типом:" + Строка(ТипДанных) + " завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Заказ ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.УказанныеСвойстваЗаказа Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для объектов с типом:" + Строка(ТипДанных));
		
		Для каждого ТекЭлемент Из СтруктураНастроек.Сущности Цикл
			
			Если ТекЭлемент.ВидСущности = "Заказ" И ТекЭлемент.ВыгружатьНаПортал Тогда
				
				Для каждого ТекОтбор Из СтруктураНастроек.ОтборыДляВыгрузкиНаПортал Цикл
					
					Если ТекЭлемент.ВидСущности = ТекОтбор.ВидСущности И ТекЭлемент.ИмяОбъекта = ТекОтбор.ИмяОбъекта Тогда
						
						СхемаВыгрузки = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСхемуКомпоновки(ТекЭлемент.ВидСущности, ТекЭлемент.ИмяОбъекта); 
						
						Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СхемаВыгрузки, ТекОтбор.Значение);
						ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
						ПеренестиДанныеСтрокТаблицыВДругуюТаблицу(ТзнДанных, ТаблицаОбъектовОбменаВыгрузки)
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТзнДанных, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных для объектов с типом:" + Строка(ТипДанных) + " завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Оплата Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для объектов с типом:" + Строка(ТипДанных));
		
		Для каждого ТекЭлемент Из СтруктураНастроек.Сущности Цикл
			
			Если ТекЭлемент.ВидСущности = "Оплата" И ТекЭлемент.ВыгружатьНаПортал Тогда
				
				Для каждого ТекОтбор Из СтруктураНастроек.ОтборыДляВыгрузкиНаПортал Цикл
					
					Если ТекЭлемент.ВидСущности = ТекОтбор.ВидСущности И ТекЭлемент.ИмяОбъекта = ТекОтбор.ИмяОбъекта Тогда
						
						СхемаВыгрузки = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСхемуКомпоновки(ТекЭлемент.ВидСущности, ТекЭлемент.ИмяОбъекта); 
						
						Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СхемаВыгрузки, ТекОтбор.Значение);
						ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
						ПеренестиДанныеСтрокТаблицыВДругуюТаблицу(ТзнДанных, ТаблицаОбъектовОбменаВыгрузки)
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТзнДанных, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных для объектов с типом:" + Строка(ТипДанных) + " завершено");
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Отгрузка Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для объектов с типом:" + Строка(ТипДанных));
		
		Для каждого ТекЭлемент Из СтруктураНастроек.Сущности Цикл
			
			Если ТекЭлемент.ВидСущности = "Отгрузка" И ТекЭлемент.ВыгружатьНаПортал Тогда
				
				Для каждого ТекОтбор Из СтруктураНастроек.ОтборыДляВыгрузкиНаПортал Цикл
					
					Если ТекЭлемент.ВидСущности = ТекОтбор.ВидСущности И ТекЭлемент.ИмяОбъекта = ТекОтбор.ИмяОбъекта Тогда
						
						СхемаВыгрузки = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСхемуКомпоновки(ТекЭлемент.ВидСущности, ТекЭлемент.ИмяОбъекта); 
						
						Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СхемаВыгрузки, ТекОтбор.Значение);
						ТаблицаОбъектовОбменаВыгрузки = Запрос.Выполнить().Выгрузить();
						ПеренестиДанныеСтрокТаблицыВДругуюТаблицу(ТзнДанных, ТаблицаОбъектовОбменаВыгрузки)
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТзнДанных, ТипДанных);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование пакетов данных для объектов с типом:" + Строка(ТипДанных) + " завершено");
		
	Иначе		
		
	КонецЕсли;
	
	пСтруктураНастроек.ВыгружаемыеТовары 			= СтруктураНастроек.ВыгружаемыеТовары; 	
	пСтруктураНастроек.ВыгружаемыеПредложения 		= СтруктураНастроек.ВыгружаемыеПредложения; 	
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	
	
КонецПроцедуры

Процедура ПеренестиДанныеСтрокТаблицыВДругуюТаблицу(Приемник, Источник)
	
	Для каждого ТекСтрока Из Источник Цикл
		НоваяСтрока = Приемник.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока); 
	КонецЦикла;
	
КонецПроцедуры

// Процедура - загружает таблицы данных в регистр сведений, хранящий пакеты данных
//
// Параметры:
//  СтруктураНастроек		 			- 	 Структура с общими настройками
//  ТаблицаОбъектовОбменаВыгрузки	- 	 Таблица значений с данными, которые нужно выгрузить на сайт 
//  ТипДанных		 				- 	 Тип данных выгружаемый на портал
Процедура ЗагрузкаТаблицыДанныхВРегистрПакетов(СтруктураНастроек, ТаблицаОбъектовОбменаВыгрузки, ТипДанных)
	
	ТаблицаОбъектовОбменаВыгрузки.Колонки.Добавить("Пакет");
	
	РазбивкаТаблицыДанныхНаПакеты(СтруктураНастроек, ТипДанных, ТаблицаОбъектовОбменаВыгрузки);
	
	НаборЗаписей = РегистрыСведений.Б24_КС_ПакетыВыгрузки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НастройкаПодключения.Установить(СтруктураНастроек.НастройкаПодключения);
	НаборЗаписей.Отбор.ТипДанных.Установить(ТипДанных);
	НаборЗаписей.Загрузить(ТаблицаОбъектовОбменаВыгрузки);
	НаборЗаписей.Записать();             
	
КонецПроцедуры

// Процедура - разбивает данные таблицы значений на пакеты данных
//
// Параметры:
//  СтруктураНастроек		 - 	 Структура с общими настройками
//  Таблица				 - 	 Таблица данных с выгружаемыми данными 
//  Узел				 - 	 Узел настроек обмена 
//  Каталог				 - 	 Идентификатор каталога(инфоблока), в который будет произведена выгрузка данных 
Процедура РазбивкаТаблицыДанныхНаПакеты(СтруктураНастроек, ТипДанных, Таблица)
	
	Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Компания ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Контакт Тогда
		КоличествоДанныхВПакете = Цел(СтруктураНастроек.КоличествоДанныхВПакете/2);	  // + дела
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Реквизит  Тогда
		КоличествоДанныхВПакете = Цел(СтруктураНастроек.КоличествоДанныхВПакете/4);	  // выгружается сразу и юр и факт адреса		
	ИначеЕсли (ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Товар) И СтруктураНастроек.НастройкиСинхронизацииТоваров.ВыгружатьКартинкиИФайлы Тогда
		КоличествоДанныхВПакете = Цел(СтруктураНастроек.КоличествоДанныхВПакете/5);	  // картинки медленно грузятся и могут отвалиться, поэтому пакеты делим на 5
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Товар2 Тогда
		КоличествоДанныхВПакете = 50;	 
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлТовара2 ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлПредложения Тогда
		КоличествоДанныхВПакете = Цел(СтруктураНастроек.КоличествоДанныхВПакете/5);	  		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Счет  Тогда
		КоличествоДанныхВПакете = Цел(СтруктураНастроек.КоличествоДанныхВПакете/2);	  // выгружается сразу и счет и реквизиты счета		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Счет2  Тогда
		КоличествоДанныхВПакете = Цел(СтруктураНастроек.КоличествоДанныхВПакете/3);	  // выгружается сразу и счет и товары		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Проект  Тогда
		КоличествоДанныхВПакете = Цел(СтруктураНастроек.КоличествоДанныхВПакете/4);	  // выгружается сразу и сделка и товары и реквизиты и дело		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Заказ  Тогда
		КоличествоДанныхВПакете = Цел(СтруктураНастроек.КоличествоДанныхВПакете/2);	  // выгружается сразу шапка и товары		
	Иначе
		КоличествоДанныхВПакете = СтруктураНастроек.КоличествоДанныхВПакете;	
	КонецЕсли;
	
	Итератор 	= 0;
	Пакет 		= 1;
	
	Для каждого ТекСтр Из Таблица Цикл
		
		Если Не ЗначениеЗаполнено(ТекСтр.Объект) Тогда
			Продолжить;
		КонецЕсли;
		
		Итератор = Итератор + 1;
		
		Если Итератор > КоличествоДанныхВПакете Тогда
			Пакет = Пакет + 1;
			Итератор = 1;
		КонецЕсли;
		
		ТекСтр.Пакет = Пакет;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуОбъектовОбменаВыгрузкиГруппТоваров(СтруктураНастроек, ТипДанных, СКДВыгрузкиНоменклатуры) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Объект");
	Результат.Колонки.Добавить("ТипДанных");
	Результат.Колонки.Добавить("НастройкаПодключения");
	
	Если ((СтруктураНастроек.ВерсияТоваров = "v.2" И СтруктураНастроек.НастройкиСинхронизацииТоваров.ИсточникИерархии = "Произвольная иерархия")
		ИЛИ НЕ СтруктураНастроек.ВерсияТоваров = "v.2") И ЗначениеЗаполнено(СтруктураНастроек.НастройкиСинхронизацииТоваров.ДеревоГрупп) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ПолнаяВыгрузка"				, СтруктураНастроек.ПолнаяВыгрузка);
		Запрос.УстановитьПараметр("ВремяЗаписиВМиллисекундах"	, СтруктураНастроек.ВремяЗапускаВМиллисекундах);
		Запрос.УстановитьПараметр("ТипДанных"					, ТипДанных);
		Запрос.УстановитьПараметр("НастройкаПодключения"		, СтруктураНастроек.НастройкаПодключения);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	Б24_КС_ПользовательскиеГруппыТоваров.Ссылка КАК Группа
		|ИЗ
		|	Справочник.Б24_КС_ПользовательскиеГруппыТоваров КАК Б24_КС_ПользовательскиеГруппыТоваров
		|ГДЕ
		|	(ВЫБОР
		|				КОГДА &ПолнаяВыгрузка
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Б24_КС_ПользовательскиеГруппыТоваров.Ссылка В
		|						(ВЫБРАТЬ
		|							Б_ТаблицаИзменений.Объект
		|						ИЗ
		|							РегистрСведений.Б24_КС_ТаблицаИзменений КАК Б_ТаблицаИзменений
		|						ГДЕ
		|							Б_ТаблицаИзменений.ТипДанных = &ТипДанных
		|							И Б_ТаблицаИзменений.НастройкаПодключения = &НастройкаПодключения
		|							И Б_ТаблицаИзменений.ВремяЗаписиВМиллисекундах <= &ВремяЗаписиВМиллисекундах)
		|			КОНЕЦ
		|			ИЛИ Б24_КС_ПользовательскиеГруппыТоваров.Ссылка В
		|				(ВЫБРАТЬ
		|					Б24_КС_ПакетыВыгрузки.Объект
		|				ИЗ
		|					РегистрСведений.Б24_КС_ПакетыВыгрузки КАК Б24_КС_ПакетыВыгрузки
		|				ГДЕ
		|					Б24_КС_ПакетыВыгрузки.ТипДанных = &ТипДанных
		|					И Б24_КС_ПакетыВыгрузки.НастройкаПодключения = &НастройкаПодключения))
		|	И Б24_КС_ПользовательскиеГруппыТоваров.Ссылка В ИЕРАРХИИ(&ДеревоГрупп)
		|ИТОГИ ПО
		|	Группа ТОЛЬКО ИЕРАРХИЯ";
		
		Запрос.УстановитьПараметр("ДеревоГрупп", СтруктураНастроек.НастройкиСинхронизацииТоваров.ДеревоГрупп);	
		
	ИначеЕсли СтруктураНастроек.ВерсияТоваров = "v.2" И СтруктураНастроек.НастройкиСинхронизацииТоваров.ИсточникИерархии = "Категории номенклатуры" Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ПолнаяВыгрузка"				, СтруктураНастроек.ПолнаяВыгрузка);
		Запрос.УстановитьПараметр("ВремяЗаписиВМиллисекундах"	, СтруктураНастроек.ВремяЗапускаВМиллисекундах);
		Запрос.УстановитьПараметр("ТипДанных"					, ТипДанных);
		Запрос.УстановитьПараметр("НастройкаПодключения"		, СтруктураНастроек.НастройкаПодключения);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыНоменклатуры.Ссылка КАК Группа
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|ГДЕ
		|	(ВЫБОР
		|				КОГДА &ПолнаяВыгрузка
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВидыНоменклатуры.Ссылка В
		|						(ВЫБРАТЬ
		|							Б_ТаблицаИзменений.Объект
		|						ИЗ
		|							РегистрСведений.Б24_КС_ТаблицаИзменений КАК Б_ТаблицаИзменений
		|						ГДЕ
		|							Б_ТаблицаИзменений.ТипДанных = &ТипДанных
		|							И Б_ТаблицаИзменений.НастройкаПодключения = &НастройкаПодключения
		|							И Б_ТаблицаИзменений.ВремяЗаписиВМиллисекундах <= &ВремяЗаписиВМиллисекундах)
		|			КОНЕЦ
		|			ИЛИ ВидыНоменклатуры.Ссылка В
		|				(ВЫБРАТЬ
		|					Б24_КС_ПакетыВыгрузки.Объект
		|				ИЗ
		|					РегистрСведений.Б24_КС_ПакетыВыгрузки КАК Б24_КС_ПакетыВыгрузки
		|				ГДЕ
		|					Б24_КС_ПакетыВыгрузки.ТипДанных = &ТипДанных
		|					И Б24_КС_ПакетыВыгрузки.НастройкаПодключения = &НастройкаПодключения))
		|ИТОГИ ПО
		|	Группа ИЕРАРХИЯ";
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ПолнаяВыгрузка"				, СтруктураНастроек.ПолнаяВыгрузка);
		Запрос.УстановитьПараметр("ВремяЗаписиВМиллисекундах"	, СтруктураНастроек.ВремяЗапускаВМиллисекундах);
		Запрос.УстановитьПараметр("ТипДанных"					, ТипДанных);
		Запрос.УстановитьПараметр("НастройкаПодключения"		, СтруктураНастроек.НастройкаПодключения);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Группа
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа
		|	И (ВЫБОР
		|				КОГДА &ПолнаяВыгрузка
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Номенклатура.Ссылка В
		|						(ВЫБРАТЬ
		|							Б_ТаблицаИзменений.Объект
		|						ИЗ
		|							РегистрСведений.Б24_КС_ТаблицаИзменений КАК Б_ТаблицаИзменений
		|						ГДЕ
		|							Б_ТаблицаИзменений.ТипДанных = &ТипДанных
		|							И Б_ТаблицаИзменений.НастройкаПодключения = &НастройкаПодключения
		|							И Б_ТаблицаИзменений.ВремяЗаписиВМиллисекундах <= &ВремяЗаписиВМиллисекундах)
		|			КОНЕЦ
		|			ИЛИ Номенклатура.Ссылка В
		|				(ВЫБРАТЬ
		|					Б24_КС_ПакетыВыгрузки.Объект
		|				ИЗ
		|					РегистрСведений.Б24_КС_ПакетыВыгрузки КАК Б24_КС_ПакетыВыгрузки
		|				ГДЕ
		|					Б24_КС_ПакетыВыгрузки.ТипДанных = &ТипДанных
		|					И Б24_КС_ПакетыВыгрузки.НастройкаПодключения = &НастройкаПодключения))
		|ИТОГИ ПО
		|	Группа ТОЛЬКО ИЕРАРХИЯ";
		
	КонецЕсли;
	
	тзнДанных = Запрос.Выполнить().Выгрузить();
	тзнДанных.Свернуть("Группа");
	
	Для каждого ТекСтрока Из тзнДанных Цикл
		
		Если ЗначениеЗаполнено(ТекСтрока.Группа) И ТекСтрока.Группа <> СтруктураНастроек.НастройкиСинхронизацииТоваров.ДеревоГрупп Тогда
			НовСтрока = Результат.Добавить();
			НовСтрока.Объект				= ТекСтрока.Группа;
			НовСтрока.ТипДанных 			= ТипДанных;
			НовСтрока.НастройкаПодключения 	= СтруктураНастроек.НастройкаПодключения;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;	
	
КонецФункции

// Функция - возвращает Запрос для выгрузки пакетов данных
//
// Параметры:
//  СтруктураНастроек		 					- 	 Структура с общими настройками
//  ТипДанных								 - 	 Признак, для каких данных нужно формировать Запрос 
//  СхемаВыгрузки							 - 	 Схема компоновки данных выгрузки данных
//  НастройкиКомпоновщикаИзНастройкиОбмена	 - 	 Настройки отборов компоновки данных
// Возвращаемое значение:
//  Запрос для получения пакетов данных  
Функция ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СхемаВыгрузки, НастройкиКомпоновщикаИзНастройкиОбмена = Неопределено) Экспорт
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаВыгрузки)); 
	Если ЗначениеЗаполнено(НастройкиКомпоновщикаИзНастройкиОбмена) Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновщикаИзНастройкиОбмена);
		КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаВыгрузки.НастройкиПоУмолчанию);
	КонецЕсли;
	
	Для Каждого ТекПараметрСКД Из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл    
		
		Если ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("НастройкаПодключения") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= СтруктураНастроек.НастройкаПодключения; 	
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("ТипДанных") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= ТипДанных; 
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("ПолнаяВыгрузка") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= СтруктураНастроек.ПолнаяВыгрузка; 	
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("ВремяЗапускаВМиллисекундах") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= СтруктураНастроек.ВремяЗапускаВМиллисекундах; 	
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("мСвойстваИсключения") Тогда
			СпкПараметр = Новый СписокЗначений;
			СпкПараметр.ЗагрузитьЗначения(СтруктураНастроек.ПредопределенныеСвойства.НеВыгружаемыеСвойства);
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= СпкПараметр;
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("Период") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= СтруктураНастроек.ДатаФормирования; 	
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("Портал") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= СтруктураНастроек.Портал; 
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("ЕстьОтборПоСвойствам") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= Ложь;        
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("ЭтоТоварыCRM") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= НЕ СтруктураНастроек.ВерсияТоваров = "v.2";
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("ПустаяСсылкаХарактеристики") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();   
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("спкВидовПартнера") Тогда
			
			СпкПараметр = Новый СписокЗначений;
		
			Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Компания Тогда
				СпкПараметр.ЗагрузитьЗначения(СтруктураНастроек.ТипыКонтрагентовДляКомпаний);
			ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Контакт Тогда
				СпкПараметр.ЗагрузитьЗначения(СтруктураНастроек.ТипыКонтрагентовДляКонтактов);
			ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Реквизит Тогда
				
				Для каждого ТекЭлемент Из СтруктураНастроек.ТипыКонтрагентовДляКомпаний Цикл
					СпкПараметр.Добавить(ТекЭлемент);	
				КонецЦикла;
				
				Для каждого ТекЭлемент Из СтруктураНастроек.ТипыКонтрагентовДляКонтактов Цикл
					СпкПараметр.Добавить(ТекЭлемент);	
				КонецЦикла;
				
			КонецЕсли;
				
			ТекПараметрСКД.Значение 		= СпкПараметр;
			ТекПараметрСКД.Использование 	= Истина;
				
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("спкКомпаний") Тогда
			
			СпкПараметр = Новый СписокЗначений;
			СпкПараметр.ЗагрузитьЗначения(СтруктураНастроек.ТипыКонтрагентовДляКомпаний);
			
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= СпкПараметр; 
			
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("спкКонтактов") Тогда
			
			СпкПараметр = Новый СписокЗначений;
			СпкПараметр.ЗагрузитьЗначения(СтруктураНастроек.ТипыКонтрагентовДляКонтактов);
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= СпкПараметр; 
			
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("Справочник_Партнеры") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНаборСвойств("Справочник_Партнеры"); 
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("Справочник_КонтактныеЛицаПартнеров") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНаборСвойств("Справочник_КонтактныеЛицаПартнеров"); 
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("Справочник_Номенклатура") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНаборСвойств("Справочник_Номенклатура"); 
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("Справочник_ХарактеристикиНоменклатуры") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНаборСвойств("Справочник_ХарактеристикиНоменклатуры"); 
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("Документ_СчетНаОплатуКлиенту") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНаборСвойств("Документ_СчетНаОплатуКлиенту"); 
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("Документ_ЗаказКлиента") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНаборСвойств("Документ_ЗаказКлиента"); 
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("Ценообразование20") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= СтруктураНастроек.ИспользуетсяЦенообразование20; 
		ИначеЕсли ТекПараметрСКД.Параметр = Новый ПараметрКомпоновкиДанных("Ценообразование25") Тогда
			ТекПараметрСКД.Использование 	= Истина;
			ТекПараметрСКД.Значение 		= СтруктураНастроек.ИспользуетсяЦенообразование25; 
		КонецЕсли;
		
	КонецЦикла;    
	
#Область ДопПараметрыТоваровПредложений
	Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Товар ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара 
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Товар2 ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара2 ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Предложение
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Цена ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Остаток Тогда
		
		Склады	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСклады(СтруктураНастроек.НастройкаПодключения, СтруктураНастроек.ВерсияТоваров);  
		Прайсы	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьПрайсы(СтруктураНастроек.НастройкаПодключения, СтруктураНастроек.ВерсияТоваров);  
		
		НайденныйПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Склады");
		Если НайденныйПараметрСКД <> Неопределено Тогда
			НайденныйПараметрСКД.Значение 		= Склады;
			НайденныйПараметрСКД.Использование 	= Истина;
		КонецЕсли;
		
		НайденныйПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Прайсы");
		Если НайденныйПараметрСКД <> Неопределено Тогда
			НайденныйПараметрСКД.Значение 		= Прайсы;
			НайденныйПараметрСКД.Использование 	= Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураНастроек.НастройкиСинхронизацииТоваров.ДеревоГрупп) Тогда 
			Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Товар 
				ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара Тогда
				УстановкаОтбораПоДеревуГрупп(СтруктураНастроек, КомпоновщикНастроек);   		
			ИначеЕсли СтруктураНастроек.НастройкиСинхронизацииТоваров.Свойство("ИсточникИерархии") 
				И СтруктураНастроек.НастройкиСинхронизацииТоваров.ИсточникИерархии = "Произвольная иерархия" Тогда
				УстановкаОтбораПоДеревуГрупп(СтруктураНастроек, КомпоновщикНастроек);   		
			КонецЕсли;
		КонецЕсли; 
			
		Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Предложение 
			ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Цена ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Остаток Тогда
			НайденныйПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ВыгружаемыеТовары");
			Если НайденныйПараметрСКД <> Неопределено Тогда
				НайденныйПараметрСКД.Значение 		= СтруктураНастроек.ВыгружаемыеТовары;
				НайденныйПараметрСКД.Использование 	= Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Цена ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Остаток Тогда
			
			НайденныйПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ВыгружаемыеПредложения");
			Если НайденныйПараметрСКД <> Неопределено Тогда
				НайденныйПараметрСКД.Значение 		= СтруктураНастроек.ВыгружаемыеПредложения;
				НайденныйПараметрСКД.Использование 	= Истина;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;  
	
	Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара2 ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваПредложения Тогда
		
		НайденныйПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ТипДанныхСвойство");
		Если НайденныйПараметрСКД <> Неопределено Тогда  
			
			ТипДанныхСвойство = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара2;
			Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваПредложения Тогда
				ТипДанныхСвойство = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоПредложения;    
			КонецЕсли;
			
			НайденныйПараметрСКД.Значение 		= ТипДанныхСвойство;
			НайденныйПараметрСКД.Использование 	= Истина;
		КонецЕсли;
		
	КонецЕсли;
#КонецОбласти	
	
#Область ДопПараметрыДокументов
	Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Счет ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.РеквизитыСчета ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Счет2 Тогда
		
		ДатаНачалаВыгрузкиСчетов = Неопределено;
		СтруктураНастроек.НастройкиСинхронизацииСчетов.Свойство("ДатаНачалаВыгрузкиСчетов", ДатаНачалаВыгрузкиСчетов);
		
		НайденныйПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачалаВыгрузкиСчетов");
		Если НайденныйПараметрСКД <> Неопределено Тогда
			НайденныйПараметрСКД.Значение 		= ДатаНачалаВыгрузкиСчетов;
			НайденныйПараметрСКД.Использование 	= Истина;
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Проект ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.РеквизитыСделки 
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ТоварыСделки Тогда
		
		ДатаНачалаВыгрузкиСделок = Неопределено;
		СтруктураНастроек.НастройкиСинхронизацииСделок.Свойство("ДатаНачалаВыгрузкиСделок", ДатаНачалаВыгрузкиСделок);
		
		НайденныйПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачалаВыгрузкиСделок");
		Если НайденныйПараметрСКД <> Неопределено Тогда
			НайденныйПараметрСКД.Значение 		= ДатаНачалаВыгрузкиСделок;
			НайденныйПараметрСКД.Использование 	= Истина;
		КонецЕсли; 

		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Заказ 
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Оплата ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Отгрузка Тогда
		                                                                      
		ДатаНачалаВыгрузкиЗаказов = Неопределено;                  		
		СтруктураНастроек.НастройкиСинхронизацииЗаказов.Свойство("ДатаНачалаВыгрузкиЗаказов", ДатаНачалаВыгрузкиЗаказов);
		
		НайденныйПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачалаВыгрузкиЗаказов");
		Если НайденныйПараметрСКД <> Неопределено Тогда
			НайденныйПараметрСКД.Значение 		= ДатаНачалаВыгрузкиЗаказов;
			НайденныйПараметрСКД.Использование 	= Истина;
		КонецЕсли;
		
	КонецЕсли;
#КонецОбласти  	
		
	Запрос = Новый Запрос;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаВыгрузки, КомпоновщикНастроек.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанных"));
	Запрос.Текст = МакетКомпоновкиДанных.НаборыДанных.ОсновнойНаборДанных.Запрос;
	
	Для каждого Параметр Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
		Запрос.Параметры.Вставить(Параметр.Имя, Параметр.Значение);
	КонецЦикла;
	
	Возврат Запрос; 	
	
КонецФункции

Процедура УстановкаОтбораПоДеревуГрупп(СтруктураНастроек, КомпоновщикНастроек)
	
	СписокНоменклатурыДереваГрупп  = Новый СписокЗначений;
	
	ОтборПоДеревуГрупп 	= "ПрограммныйОтборПоДеревуГрупп";
	Отбор 				= КомпоновщикНастроек.Настройки.Отбор;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Б24_КС_ПользовательскиеГруппыТоваров.Номенклатура
	|ИЗ
	|	Справочник.Б24_КС_ПользовательскиеГруппыТоваров.Товары КАК Б24_КС_ПользовательскиеГруппыТоваров
	|ГДЕ
	|	Б24_КС_ПользовательскиеГруппыТоваров.Ссылка В ИЕРАРХИИ (&ДеревоГрупп)";
	
	Запрос.УстановитьПараметр("ДеревоГрупп", СтруктураНастроек.НастройкиСинхронизацииТоваров.ДеревоГрупп);
	
	тзнТоваров = Запрос.Выполнить().Выгрузить();
	СписокНоменклатурыДереваГрупп.ЗагрузитьЗначения(тзнТоваров.ВыгрузитьКолонку("Номенклатура"));
	
	Если СписокНоменклатурыДереваГрупп.Количество() > 0 Тогда
		
		НовыйЭлемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ИдентификаторПользовательскойНастройки = ОтборПоДеревуГрупп;
		НовыйЭлемент.ЛевоеЗначение 	=  Новый ПолеКомпоновкиДанных("Объект");
		НовыйЭлемент.ВидСравнения 	= ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
		НовыйЭлемент.ПравоеЗначение = СписокНоменклатурыДереваГрупп;
		НовыйЭлемент.Использование 	= Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВсеВыгружаемыеТовары(ТипДанных, СтруктураНастроек)
	
	Результат = Новый Массив;
	
	Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки товаров.");
	
	ПолнаяВыгрузкаПред = СтруктураНастроек.ПолнаяВыгрузка;
	СтруктураНастроек.ПолнаяВыгрузка = Истина; 
	
	Для каждого ТекЭлемент Из СтруктураНастроек.Сущности Цикл
		
		Если ТекЭлемент.ВидСущности = "Товар2" И ТекЭлемент.ВыгружатьНаПортал Тогда
			
			Для каждого ТекОтбор Из СтруктураНастроек.ОтборыДляВыгрузкиНаПортал Цикл
				
				Если ТекЭлемент.ВидСущности = ТекОтбор.ВидСущности И ТекЭлемент.ИмяОбъекта = ТекОтбор.ИмяОбъекта Тогда
					
					СхемаВыгрузки = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСхемуКомпоновки(ТекЭлемент.ВидСущности, ТекЭлемент.ИмяОбъекта); 
					
					Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СхемаВыгрузки, ТекОтбор.Значение);
					ТаблицаОбъектов = Запрос.Выполнить().Выгрузить();  
					
					ТаблицаОбъектов.Свернуть("Объект");	
					Результат = ТаблицаОбъектов.ВыгрузитьКолонку("Объект");     
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураНастроек.ПолнаяВыгрузка = ПолнаяВыгрузкаПред; 
	
	Возврат Результат;

КонецФункции

Функция ВсеВыгружаемыеПредложения(ТипДанных, СтруктураНастроек)
	
	Результат = Новый Массив;
	
	Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакетов данных для выгрузки товаров.");
	
	ПолнаяВыгрузкаПред = СтруктураНастроек.ПолнаяВыгрузка;
	СтруктураНастроек.ПолнаяВыгрузка = Истина; 
	
	Для каждого ТекЭлемент Из СтруктураНастроек.Сущности Цикл
		
		Если ТекЭлемент.ВидСущности = "Предложение" И ТекЭлемент.ИмяОбъекта = "ХарактеристикиНоменклатуры" И ТекЭлемент.ВыгружатьНаПортал Тогда
			
			Для каждого ТекОтбор Из СтруктураНастроек.ОтборыДляВыгрузкиНаПортал Цикл
				
				Если ТекЭлемент.ВидСущности = ТекОтбор.ВидСущности И ТекЭлемент.ИмяОбъекта = ТекОтбор.ИмяОбъекта Тогда
					
					СхемаВыгрузки = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСхемуКомпоновки(ТекЭлемент.ВидСущности, ТекЭлемент.ИмяОбъекта); 
					
					Запрос = ПолучитьЗапросДляВыгрузкиДанных(СтруктураНастроек, ТипДанных, СхемаВыгрузки, ТекОтбор.Значение);
					ТаблицаОбъектов = Запрос.Выполнить().Выгрузить();  
					
					Если ТаблицаОбъектов.Колонки.Найти("ПодчиненныйОбъект") <> Неопределено Тогда
						ТаблицаОбъектов.Свернуть("ПодчиненныйОбъект");	
						Результат = ТаблицаОбъектов.ВыгрузитьКолонку("ПодчиненныйОбъект");     
					Иначе
						Результат.Добавить(Неопределено);	
						Результат.Добавить(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());	
					КонецЕсли;   
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураНастроек.ПолнаяВыгрузка = ПолнаяВыгрузкаПред; 
	
	Возврат Результат;

КонецФункции

#КонецОбласти


#Область ОбщиеПроцедурыИФункцииОбмена

///////////////////////////////////////////////////////////////////
//			       ПРОЦЕДУРЫ И ФУНКЦИИ ОБМЕНА                   //
/////////////////////////////////////////////////////////////////


Функция ПолучитьСтруктуруКлючейБатчЗапросов(ТипДанных, Объект, ПодчиненныйОбъект = Неопределено, ЗаписыватьПриИстина = Ложь) 
	
	Результат = Новый Структура;
	
	Результат.Вставить("Тип"						, ТипДанных);
	Результат.Вставить("Объект"						, Объект);
	Результат.Вставить("ПодчиненныйОбъект"			, ПодчиненныйОбъект);
	Результат.Вставить("ЗаписыватьПриИстина"		, ЗаписыватьПриИстина);
					
	Возврат Результат;
	
КонецФункции

// Функция - возвращает массив данных пакета по заданным критериям
//
// Параметры:
//  СтруктураНастроек	 - 	Структура с общими настройками  
//  ТипДанных		 - 	Тип операции     
//  Пакет		 	- 	Пакет данных     
//  ЭтоДозагрузка	 - 	Если истина, то сначала выполняется дозагрузка неотправленных данных     
// Возвращаемое значение:
//   Таблица значений с данными пакетов 
Функция ПолучитьПакетИзРегистраПакетов(СтруктураНастроек, ТипДанных, Пакет) Экспорт
	
	Запрос = Новый Запрос;    	
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_КС_ПакетыВыгрузки.Объект КАК Объект,
	|	Б24_КС_ПакетыВыгрузки.ПодчиненныйОбъект КАК ПодчиненныйОбъект
	|ИЗ
	|	РегистрСведений.Б24_КС_ПакетыВыгрузки КАК Б24_КС_ПакетыВыгрузки
	|ГДЕ
	|	Б24_КС_ПакетыВыгрузки.ТипДанных = &ТипДанных
	|	И Б24_КС_ПакетыВыгрузки.Пакет = &Пакет
	|	И Б24_КС_ПакетыВыгрузки.НастройкаПодключения = &НастройкаПодключения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Б24_КС_ПакетыВыгрузки.Пакет";
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	Запрос.УстановитьПараметр("Пакет", Пакет);
	Запрос.УстановитьПараметр("НастройкаПодключения", СтруктураНастроек.НастройкаПодключения);
	
	тзнДанных = Запрос.Выполнить().Выгрузить();
	
	Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Товар ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Предложение
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара2 ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваПредложения 
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Цена ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Остаток Тогда
		мДанных = Б24_К_ОбщегоНазначенияВызовСервера.ПреобразоватьТаблицуВМассив(ТзнДанных);	
	Иначе
		мДанных = тзнДанных.ВыгрузитьКолонку("Объект");
	КонецЕсли;
	
	Возврат мДанных; 	
	
КонецФункции

Процедура УдалениеРегистрацииПоТипуДанных(СтруктураНастроек, ТипДанных, МассивДанных) Экспорт
	
	Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Товар Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
		ОписаниеТиповН = Новый ОписаниеТипов(Массив);
		Массив.Очистить();
		Массив.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ОписаниеТиповХ = Новый ОписаниеТипов(Массив);		
				
		тзнДанных = Новый ТаблицаЗначений;
		тзнДанных.Колонки.Добавить("Объект"				, ОписаниеТиповН);
		тзнДанных.Колонки.Добавить("ПодчиненныйОбъект"	, ОписаниеТиповХ);
		
		Для Каждого ТекСтрока Из МассивДанных Цикл
			НоваяСтрокаДанных = тзнДанных.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДанных, ТекСтрока);
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("мТаблицаДанных"			, тзнДанных);
		Запрос.УстановитьПараметр("ТипДанных"				, ТипДанных);
		Запрос.УстановитьПараметр("Неопределено"			, Неопределено);
		Запрос.УстановитьПараметр("НастройкаПодключения"	, СтруктураНастроек.НастройкаПодключения);
		
		Если Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.ХарактеристикиНоменклатурыИспользуются() Тогда
			Запрос.Текст = "ВЫБРАТЬ
			|	мТаблицаДанных.Объект КАК Объект,
			|	мТаблицаДанных.ПодчиненныйОбъект КАК ПодчиненныйОбъект
			|ПОМЕСТИТЬ ВТ_Данные
			|ИЗ
			|	&мТаблицаДанных КАК мТаблицаДанных
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Б24_КС_ТаблицаИзменений.НастройкаПодключения КАК НастройкаПодключения,
			|	Б24_КС_ТаблицаИзменений.ТипДанных КАК ТипДанных,
			|	Б24_КС_ТаблицаИзменений.Объект КАК Объект,
			|	Б24_КС_ТаблицаИзменений.ПодчиненныйОбъект КАК ПодчиненныйОбъект
			|ИЗ
			|	РегистрСведений.Б24_КС_ТаблицаИзменений КАК Б24_КС_ТаблицаИзменений
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Данные КАК ВТ_Данные
			|		ПО (Б24_КС_ТаблицаИзменений.Объект = ВТ_Данные.Объект
			|				ИЛИ Б24_КС_ТаблицаИзменений.Объект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|				ИЛИ Б24_КС_ТаблицаИзменений.Объект = &Неопределено)
			|			И Б24_КС_ТаблицаИзменений.ПодчиненныйОбъект = ВТ_Данные.ПодчиненныйОбъект
			|ГДЕ
			|	Б24_КС_ТаблицаИзменений.ТипДанных = &ТипДанных
			|	И Б24_КС_ТаблицаИзменений.НастройкаПодключения = &НастройкаПодключения";
		Иначе       // запрос ниже для совместимости. Потом можно его убрать.
			Запрос.Текст = "ВЫБРАТЬ
			|	мТаблицаДанных.Объект КАК Объект,
			|	мТаблицаДанных.ПодчиненныйОбъект КАК ПодчиненныйОбъект
			|ПОМЕСТИТЬ ВТ_Данные
			|ИЗ
			|	&мТаблицаДанных КАК мТаблицаДанных
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Б24_КС_ТаблицаИзменений.НастройкаПодключения КАК НастройкаПодключения,
			|	Б24_КС_ТаблицаИзменений.ТипДанных КАК ТипДанных,
			|	Б24_КС_ТаблицаИзменений.Объект КАК Объект,
			|	Б24_КС_ТаблицаИзменений.ПодчиненныйОбъект КАК ПодчиненныйОбъект
			|ИЗ
			|	РегистрСведений.Б24_КС_ТаблицаИзменений КАК Б24_КС_ТаблицаИзменений
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Данные КАК ВТ_Данные
			|		ПО (Б24_КС_ТаблицаИзменений.Объект = ВТ_Данные.Объект
			|				ИЛИ Б24_КС_ТаблицаИзменений.Объект = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
			|ГДЕ
			|	Б24_КС_ТаблицаИзменений.ТипДанных = &ТипДанных
			|	И Б24_КС_ТаблицаИзменений.НастройкаПодключения = &НастройкаПодключения";
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Прочитать();
			Запись.Удалить();
		КонецЦикла;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Предложение Тогда 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВремяЗаписиВМиллисекундах"	, СтруктураНастроек.ВремяЗапускаВМиллисекундах);
		Запрос.УстановитьПараметр("ТипДанных"					, ТипДанных);
		Запрос.УстановитьПараметр("НастройкаПодключения"		, СтруктураНастроек.НастройкаПодключения);
		Запрос.Текст = "ВЫБРАТЬ
		|	Б24_КС_ТаблицаИзменений.НастройкаПодключения КАК НастройкаПодключения,
		|	Б24_КС_ТаблицаИзменений.ТипДанных КАК ТипДанных,
		|	Б24_КС_ТаблицаИзменений.Объект КАК Объект,
		|	Б24_КС_ТаблицаИзменений.ПодчиненныйОбъект КАК ПодчиненныйОбъект
		|ИЗ
		|	РегистрСведений.Б24_КС_ТаблицаИзменений КАК Б24_КС_ТаблицаИзменений
		|ГДЕ           
		|	Б24_КС_ТаблицаИзменений.НастройкаПодключения = &НастройкаПодключения
		|	И Б24_КС_ТаблицаИзменений.ТипДанных = &ТипДанных
		|	И Б24_КС_ТаблицаИзменений.ВремяЗаписиВМиллисекундах <= &ВремяЗаписиВМиллисекундах";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Прочитать();
			Запись.Удалить();
		КонецЦикла; 
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Цена ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Остаток Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
		ОписаниеТиповН = Новый ОписаниеТипов(Массив);
		Массив.Очистить();
		Массив.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ОписаниеТиповХ = Новый ОписаниеТипов(Массив);		
				
		тзнДанных = Новый ТаблицаЗначений;
		тзнДанных.Колонки.Добавить("Объект"				, ОписаниеТиповН);
		тзнДанных.Колонки.Добавить("ПодчиненныйОбъект"	, ОписаниеТиповХ);
		
		Для Каждого ТекСтрока Из МассивДанных Цикл
			НоваяСтрокаДанных = тзнДанных.Добавить();
			НоваяСтрокаДанных.Объект 			= ТекСтрока.Объект; 
			НоваяСтрокаДанных.ПодчиненныйОбъект = ТекСтрока.ПодчиненныйОбъект; 
			
			мЧасти = СтрРазделить(ТекСтрока.ПодчиненныйОбъект, "#");
			Если мЧасти.Количество() = 2 Тогда       
				НоваяСтрокаДанных.ПодчиненныйОбъект = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоXML(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"), мЧасти[0]);
			КонецЕсли;
			
		КонецЦикла;

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("мТаблицаДанных"			, тзнДанных);
		Запрос.УстановитьПараметр("ТипДанных"				, ТипДанных);
		Запрос.УстановитьПараметр("НастройкаПодключения"	, СтруктураНастроек.НастройкаПодключения);
		Запрос.Текст = "ВЫБРАТЬ
		|	мТаблицаДанных.Объект КАК Объект,
		|	мТаблицаДанных.ПодчиненныйОбъект КАК ПодчиненныйОбъект
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	&мТаблицаДанных КАК мТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Б24_КС_ТаблицаИзменений.НастройкаПодключения КАК НастройкаПодключения,
		|	Б24_КС_ТаблицаИзменений.ТипДанных КАК ТипДанных,
		|	Б24_КС_ТаблицаИзменений.Объект КАК Объект,
		|	Б24_КС_ТаблицаИзменений.ПодчиненныйОбъект КАК ПодчиненныйОбъект
		|ИЗ
		|	РегистрСведений.Б24_КС_ТаблицаИзменений КАК Б24_КС_ТаблицаИзменений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Данные КАК ВТ_Данные
		|		ПО (Б24_КС_ТаблицаИзменений.Объект = ВТ_Данные.Объект
		|			И Б24_КС_ТаблицаИзменений.ПодчиненныйОбъект = ВТ_Данные.ПодчиненныйОбъект)
		|ГДЕ
		|	Б24_КС_ТаблицаИзменений.ТипДанных = &ТипДанных
		|	И Б24_КС_ТаблицаИзменений.НастройкаПодключения = &НастройкаПодключения";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Прочитать();
			Запись.Удалить();
		КонецЦикла; 
		
	Иначе       
		
		ДанныеДляУдаления = МассивДанных;   
		
		Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваПредложения 
			ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара2 Тогда 
			
			ДанныеДляУдаления = Новый Массив;
			Для каждого ТекСтрока Из МассивДанных Цикл
				ДанныеДляУдаления.Добавить(ТекСтрока.Объект);
			КонецЦикла; 
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
		Запрос.УстановитьПараметр("мОбъекты" , ДанныеДляУдаления);
		Запрос.УстановитьПараметр("НастройкаПодключения", СтруктураНастроек.НастройкаПодключения);
		Запрос.Текст = "ВЫБРАТЬ
		|	Б24_КС_ТаблицаИзменений.Объект КАК Объект,
		|	Б24_КС_ТаблицаИзменений.ТипДанных КАК ТипДанных,
		|	Б24_КС_ТаблицаИзменений.ПодчиненныйОбъект КАК ПодчиненныйОбъект,
		|	Б24_КС_ТаблицаИзменений.НастройкаПодключения КАК НастройкаПодключения
		|ИЗ
		|	РегистрСведений.Б24_КС_ТаблицаИзменений КАК Б24_КС_ТаблицаИзменений
		|ГДЕ
		|	Б24_КС_ТаблицаИзменений.ТипДанных = &ТипДанных
		|	И Б24_КС_ТаблицаИзменений.Объект В(&мОбъекты)
		|	И Б24_КС_ТаблицаИзменений.НастройкаПодключения = &НастройкаПодключения";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Прочитать();
			Запись.Удалить();
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьКоличествоВыгружаемыхПакетов(СтруктураНастроек, ТипДанных) Экспорт
	
	Результат = 0;
	
	Запрос = Новый Запрос;    	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Б24_КС_ПакетыВыгрузки.Пакет КАК Пакет
	|ИЗ
	|	РегистрСведений.Б24_КС_ПакетыВыгрузки КАК Б24_КС_ПакетыВыгрузки
	|ГДЕ
	|	Б24_КС_ПакетыВыгрузки.ТипДанных = &ТипДанных
	|	И Б24_КС_ПакетыВыгрузки.НастройкаПодключения = &НастройкаПодключения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пакет УБЫВ";
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	Запрос.УстановитьПараметр("НастройкаПодключения", СтруктураНастроек.НастройкаПодключения);
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		тзнДанных = ВыполненныйЗапрос.Выгрузить();	
		Результат = тзнДанных[0].Пакет;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Успешно,  ТипДанных, Пакет, Данные) Экспорт
	
	Если Успешно Тогда
		НаборЗаписей = РегистрыСведений.Б24_КС_ПакетыВыгрузки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пакет.Установить(Пакет);
		НаборЗаписей.Отбор.НастройкаПодключения.Установить(СтруктураНастроек.НастройкаПодключения);
		НаборЗаписей.Отбор.ТипДанных.Установить(ТипДанных);
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			НаборЗаписей.Отбор.Объект.Установить(Данные.Объект);
			НаборЗаписей.Отбор.ПодчиненныйОбъект.Установить(Данные.ПодчиненныйОбъект);
		Иначе
			НаборЗаписей.Отбор.Объект.Установить(Данные);
		КонецЕсли;
		
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнениеТелефонаИПочтыДляПартнера(СтруктураНастроек, Контрагент, МенеджерВременныхТаблиц, СтруктураИспВидовКИ, ТелоЗапроса)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Объект", Контрагент);
	Запрос.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВТ_Телефоны КАК ВТ_Телефоны
	|ГДЕ
	|	ВТ_Телефоны.Объект = &Объект";
	
	ВыборкаТелефонов = Запрос.Выполнить().Выбрать();	
	
	Счетчик = 0;
	Пока ВыборкаТелефонов.Следующий() Цикл       
		
		НомерТелефона = ВыборкаТелефонов.Представление;
		
		ТипТелефона = "";
		Если ВыборкаТелефонов.Вид = СтруктураИспВидовКИ.ТелефонРабочий ИЛИ ВыборкаТелефонов.Вид = СтруктураИспВидовКИ.ТелефонРабочийОрг ИЛИ ВыборкаТелефонов.Вид = СтруктураИспВидовКИ.ТелефонРабочийКонЛица Тогда
			ТипТелефона = "WORK";
		ИначеЕсли ВыборкаТелефонов.Вид = СтруктураИспВидовКИ.ТелефонМобильный ИЛИ ВыборкаТелефонов.Вид = СтруктураИспВидовКИ.ТелефонМобильныйОрг ИЛИ ВыборкаТелефонов.Вид = СтруктураИспВидовКИ.ТелефонМобильныйКонЛица Тогда
			ТипТелефона = "MOBILE";
		ИначеЕсли ВыборкаТелефонов.Вид = СтруктураИспВидовКИ.ТелефонДомашний ИЛИ ВыборкаТелефонов.Вид = СтруктураИспВидовКИ.ТелефонДомашнийОрг ИЛИ ВыборкаТелефонов.Вид = СтруктураИспВидовКИ.ТелефонДомашнийКонЛица Тогда
			ТипТелефона = "HOME";
		Иначе
			Продолжить;
		КонецЕсли;
		
		МассивКонтактов = РазбитьТелефоныВМассив(НомерТелефона);	
		Для Каждого ТекКонтакт Из МассивКонтактов Цикл 
			ТелоЗапроса = ТелоЗапроса + "&fields[PHONE]["+Строка(Счетчик)+"][VALUE]="+Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(СокрЛП(ТекКонтакт))+"&fields[PHONE]["+Строка(Счетчик)+"][VALUE_TYPE]=" + ТипТелефона; 
			Счетчик = Счетчик + 1;
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Объект", Контрагент);
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_Почта.Представление КАК Представление,
	|	ВТ_Почта.Вид КАК Вид
	|ИЗ
	|	ВТ_Почта КАК ВТ_Почта
	|ГДЕ
	|	ВТ_Почта.Объект = &Объект";
	
	ВыборкаПочт = Запрос.Выполнить().Выбрать();	
	
	Счетчик = 0;
	Пока ВыборкаПочт.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаПочт.Представление) Тогда
			Продолжить;
		КонецЕсли;	
		
		КорректныйАдрес = ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(ВыборкаПочт.Представление);
		Если НЕ КорректныйАдрес Тогда
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Некорректный email:" + ВыборкаПочт.Представление + " у контрагента: " + Строка(Контрагент));	
			Продолжить;
		КонецЕсли;
		
		ТипПочты = "";
		Если ВыборкаПочт.Вид = СтруктураИспВидовКИ.ПочтаРабочий ИЛИ ВыборкаПочт.Вид = СтруктураИспВидовКИ.ПочтаРабочийОрг ИЛИ ВыборкаПочт.Вид = СтруктураИспВидовКИ.ПочтаРабочийКонЛица Тогда
			ТипПочты = "WORK";
		ИначеЕсли ВыборкаПочт.Вид = СтруктураИспВидовКИ.ПочтаЧастная ИЛИ ВыборкаПочт.Вид = СтруктураИспВидовКИ.ПочтаЧастнаяОрг ИЛИ ВыборкаПочт.Вид = СтруктураИспВидовКИ.ПочтаЧастнаяКонЛица Тогда
			ТипПочты = "HOME";
		Иначе
			Продолжить;                                                                          
		КонецЕсли;
		
		ЕстьЗапятые 		= Ложь;
		ЕстьТочкаЗапятые 	= Ложь;
		МассивКонтактов 	= Новый Массив;
		
		Если СтрНайти(ВыборкаПочт.Представление, ",") > 0 Тогда
			ЕстьЗапятые = Истина;
			МассивКонтактов = СтрРазделить(ВыборкаПочт.Представление, ",")
		КонецЕсли;
		
		Если СтрНайти(ВыборкаПочт.Представление, ";") > 0 Тогда
			ЕстьТочкаЗапятые = Истина;
			МассивКонтактов = СтрРазделить(ВыборкаПочт.Представление, ";")
		КонецЕсли;
		
		Если НЕ ЕстьТочкаЗапятые И НЕ ЕстьЗапятые Тогда
			МассивКонтактов.Добавить(ВыборкаПочт.Представление);	
		КонецЕсли;
		
		Для Каждого ТекКонтакт Из МассивКонтактов Цикл 
			ТелоЗапроса = ТелоЗапроса + "&fields[EMAIL]["+Строка(Счетчик)+"][VALUE]="+Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(СокрЛП(ТекКонтакт))+"&fields[EMAIL]["+Строка(Счетчик)+"][VALUE_TYPE]=" + ТипПочты; 
			Счетчик = Счетчик + 1;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


#Область ПроверкаНаличияВБитрикс24  

Функция ПроверитьНаличиеКомпанийПередДобавлениемНовых(СтруктураНастроек, МассивДанных)
	
	Результат = Новый Массив;
	
	ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Компания;
	
	ВыгружатьКлиентов 								= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Компания", "Партнеры", "ВыгружатьНаПортал");
	ПравилаПоискаПриВыгрузкеНаПорталКлиентов 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Компания", "Партнеры", "ПравилаПоискаПриВыгрузкеНаПортал");
	
	ВыгружатьОрганизации 							= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Компания", "Организации", "ВыгружатьНаПортал");
	ПравилаПоискаПриВыгрузкеНаПорталОрганизаций 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Компания", "Организации", "ПравилаПоискаПриВыгрузкеНаПортал");

	мВыгружаемыеЭлементы 	= Новый Массив;
	Для каждого ТекЭлемент Из МассивДанных Цикл 
		
		ТипЭлемента = ТипЗнч(ТекЭлемент);
		Если ВыгружатьКлиентов = Истина И ПравилаПоискаПриВыгрузкеНаПорталКлиентов <> "" И ТипЭлемента = Тип("СправочникСсылка.Партнеры") Тогда
			мВыгружаемыеЭлементы.Добавить(ТекЭлемент);
		ИначеЕсли ВыгружатьОрганизации = Истина И ПравилаПоискаПриВыгрузкеНаПорталОрганизаций <> "" И ТипЭлемента = Тип("СправочникСсылка.Организации") Тогда
			мВыгружаемыеЭлементы.Добавить(ТекЭлемент);
		КонецЕсли;
		
	КонецЦикла;

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
#Область ФормированиеВременныхТаблицДанных
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивДанных"	, мВыгружаемыеЭлементы);
	Запрос.УстановитьПараметр("ТипТелефона"		, Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ТипПочты"		, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ТипДанных"		, ТипДанных);
	Запрос.УстановитьПараметр("Портал"			, СтруктураНастроек.Портал);	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Партнер КАК Объект,
	|	Партнеры.Наименование КАК Наименование,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП
	|ПОМЕСТИТЬ ВТ_Справочник
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|		ПО Контрагенты.Партнер = Партнеры.Ссылка
	|ГДЕ
	|	Партнеры.Ссылка В(&МассивДанных)
	|	И НЕ Партнеры.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ИдентификаторыОбъектов.Объект
	|				ИЗ
	|					ВТ_ИдентификаторыОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Организации.Ссылка,
	|	Организации.Наименование,
	|	Организации.ИНН,
	|	Организации.КПП
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка В(&МассивДанных)
	|	И НЕ Организации.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ИдентификаторыОбъектов.Объект
	|				ИЗ
	|					ВТ_ИдентификаторыОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.Ссылка КАК Объект,
	|	ПартнерыКонтактнаяИнформация.Представление КАК Представление,
	|	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|	ПартнерыКонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|	ПартнерыКонтактнаяИнформация.Вид КАК Вид
	|ПОМЕСТИТЬ ВТ_Телефоны
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.Тип = &ТипТелефона
	|	И ПартнерыКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Справочник.Объект
	|			ИЗ
	|				ВТ_Справочник)
	|	И ПартнерыКонтактнаяИнформация.НомерТелефона <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Ссылка,
	|	ОрганизацииКонтактнаяИнформация.Представление,
	|	ОрганизацииКонтактнаяИнформация.НомерТелефона,
	|	ОрганизацииКонтактнаяИнформация.НомерТелефонаБезКодов,
	|	ОрганизацииКонтактнаяИнформация.Вид
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Тип = &ТипТелефона
	|	И ОрганизацииКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Справочник.Объект
	|			ИЗ
	|				ВТ_Справочник)
	|	И ОрганизацииКонтактнаяИнформация.НомерТелефона <> """"
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.Ссылка КАК Объект,
	|	ПартнерыКонтактнаяИнформация.Представление КАК Представление,
	|	ПартнерыКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|	ПартнерыКонтактнаяИнформация.Вид КАК Вид
	|ПОМЕСТИТЬ ВТ_Почта
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.Тип = &ТипПочты
	|	И ПартнерыКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Справочник.Объект
	|			ИЗ
	|				ВТ_Справочник)
	|	И ПартнерыКонтактнаяИнформация.Представление <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Ссылка,
	|	ОрганизацииКонтактнаяИнформация.Представление,
	|	ОрганизацииКонтактнаяИнформация.АдресЭП,
	|	ОрганизацииКонтактнаяИнформация.Вид
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Тип = &ТипПочты
	|	И ОрганизацииКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Справочник.Объект
	|			ИЗ
	|				ВТ_Справочник)
	|	И ОрганизацииКонтактнаяИнформация.Представление <> """"
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Справочник.Объект КАК Объект
	|ИЗ
	|	ВТ_Справочник КАК ВТ_Справочник";
#КонецОбласти
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		
		ДеревоПравилКлиентов = Неопределено;
		Если ПравилаПоискаПриВыгрузкеНаПорталКлиентов <> "" Тогда
			ДеревоПравилКлиентов = ЗначениеИзСтрокиВнутр(ПравилаПоискаПриВыгрузкеНаПорталКлиентов);
		КонецЕсли;
		
		ДеревоПравилОрганизаций = Неопределено;
		Если ПравилаПоискаПриВыгрузкеНаПорталОрганизаций <> "" Тогда
			ДеревоПравилОрганизаций = ЗначениеИзСтрокиВнутр(ПравилаПоискаПриВыгрузкеНаПорталОрганизаций);
		КонецЕсли;
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Проверка наличия компаний перед добавлением новых");
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Наименования"	, Новый Массив);
		СтруктураДанных.Вставить("Телефоны"		, Новый Массив);
		СтруктураДанных.Вставить("Почта"		, Новый Массив);
		СтруктураДанных.Вставить("ИНН"			, Новый Массив);
		СтруктураДанных.Вставить("КПП"			, Новый Массив);
		СтруктураДанных.Вставить("ИННКПП"		, Новый Массив);

		мЗапросы = Новый Массив;
		
#Область ЗаполнениеСтруктурыДанных         

		Если (ДеревоПравилКлиентов <> Неопределено И ДеревоПравилКлиентов.Строки.Найти("Наименование компании",,Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилОрганизаций <> Неопределено И ДеревоПравилОрганизаций.Строки.Найти("Наименование компании",,Истина) <> Неопределено) Тогда

			ТелоHTTPЗапроса = "select[]=ID&select[]=TITLE";   //Наименование
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	

			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
			
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ЗначениеЗаполнено(Выборка.Наименование) Тогда
						ЕстьФильтр = Истина;                    
						ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("TITLE", Выборка.Наименование, Истина);
					КонецЕсли;		
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[TITLE]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.company.list?" + ТелоHTTPЗапроса + "&start=-1"));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		Если (ДеревоПравилКлиентов <> Неопределено И ДеревоПравилКлиентов.Строки.Найти("ИНН",,Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилОрганизаций <> Неопределено И ДеревоПравилОрганизаций.Строки.Найти("ИНН",,Истина) <> Неопределено) Тогда

			ТелоHTTPЗапроса = "select[]=ID&select[]=ENTITY_ID&select[]=RQ_INN&filter[ENTITY_TYPE_ID]=4";  //ИНН
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	
			
			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
				
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ЗначениеЗаполнено(Выборка.ИНН) Тогда
						ЕстьФильтр = Истина;          
						ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("RQ_INN", Выборка.ИНН, Истина);
					КонецЕсли;		
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[INN]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.list?" + ТелоHTTPЗапроса + "&start=-1"));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		Если (ДеревоПравилКлиентов <> Неопределено И ДеревоПравилКлиентов.Строки.Найти("КПП",,Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилОрганизаций <> Неопределено И ДеревоПравилОрганизаций.Строки.Найти("КПП",,Истина) <> Неопределено) Тогда

			ТелоHTTPЗапроса = "select[]=ID&select[]=ENTITY_ID&select[]=RQ_KPP&filter[ENTITY_TYPE_ID]=4";   //КПП
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	
			
			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
				
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ЗначениеЗаполнено(Выборка.КПП) Тогда
						ЕстьФильтр = Истина;     
						ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("RQ_KPP", Выборка.КПП, Истина);
					КонецЕсли;
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[KPP]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.list?" + ТелоHTTPЗапроса));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		Если (ДеревоПравилКлиентов <> Неопределено И ДеревоПравилКлиентов.Строки.Найти("ИНН+КПП",,Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилОрганизаций <> Неопределено И ДеревоПравилОрганизаций.Строки.Найти("ИНН+КПП",,Истина) <> Неопределено) Тогда

			ТелоHTTPЗапроса = "select[]=ID&select[]=ENTITY_ID&select[]=RQ_INN&select[]=RQ_KPP&filter[ENTITY_TYPE_ID]=4";   //ИНН+КПП
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	
			
			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
				
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл    
					
					Если ЗначениеЗаполнено(Выборка.ИНН) Тогда
						ЕстьФильтр = Истина;     
						ТелоHTTPЗапроса = ТелоHTTPЗапроса  + СформироватьФильтрПоКлючу("RQ_INN", Выборка.ИНН, Истина);
						ТелоHTTPЗапроса = ТелоHTTPЗапроса  + СформироватьФильтрПоКлючу("RQ_KPP", Выборка.КПП, Истина);
					КонецЕсли;   
					
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[INNKPP]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.list?" + ТелоHTTPЗапроса + "&start=-1"));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		ОбработатьЗапросыДляИдентификацииНаПортале(СтруктураНастроек, мЗапросы, СтруктураДанных);
		
		Если (ДеревоПравилКлиентов <> Неопределено И ДеревоПравилКлиентов.Строки.Найти("Емейл",,Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилОрганизаций <> Неопределено И ДеревоПравилОрганизаций.Строки.Найти("Емейл",,Истина) <> Неопределено) Тогда
			ПолучитьДанныеТелефоновЕмейловДляИдентификацииНаПортале(СтруктураНастроек, МенеджерВременныхТаблиц, "crm.company.list", "Почта", СтруктураДанных); 
		КонецЕсли;

		Если (ДеревоПравилКлиентов <> Неопределено И ДеревоПравилКлиентов.Строки.Найти("Телефон",,Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилОрганизаций <> Неопределено И ДеревоПравилОрганизаций.Строки.Найти("Телефон",,Истина) <> Неопределено) Тогда
			ПолучитьДанныеТелефоновЕмейловДляИдентификацииНаПортале(СтруктураНастроек, МенеджерВременныхТаблиц, "crm.company.list", "Телефоны", СтруктураДанных);
		КонецЕсли; 
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
#КонецОбласти
		
		ДеревоПравилКлиентов = Неопределено;
		Если ПравилаПоискаПриВыгрузкеНаПорталКлиентов <> "" Тогда
			ДеревоПравилКлиентов = ЗначениеИзСтрокиВнутр(ПравилаПоискаПриВыгрузкеНаПорталКлиентов);
		КонецЕсли;
		
		ДеревоПравилОрганизаций = Неопределено;
		Если ПравилаПоискаПриВыгрузкеНаПорталОрганизаций <> "" Тогда
			ДеревоПравилОрганизаций = ЗначениеИзСтрокиВнутр(ПравилаПоискаПриВыгрузкеНаПорталОрганизаций);
		КонецЕсли;

		Выборка = ВыполненныйЗапрос.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ДанныеДляПоиска = Новый Структура;
			ДанныеДляПоиска.Вставить("СтруктураДанных"			, СтруктураДанных);
			ДанныеДляПоиска.Вставить("МенеджерВременныхТаблиц"	, МенеджерВременныхТаблиц);
			ДанныеДляПоиска.Вставить("Объект"					, Выборка.Объект);
			ДанныеДляПоиска.Вставить("ТипДанных"				, ТипДанных);
			
			ТипЭлемента = ТипЗнч(Выборка.Объект);
			Если ТипЭлемента = Тип("СправочникСсылка.Партнеры") Тогда
				
				Если ДеревоПравилКлиентов = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Результат.Добавить(ПроверитьЭлементПоПравиламИдентификации(СтруктураНастроек, ДанныеДляПоиска, ДеревоПравилКлиентов));
				
			ИначеЕсли ТипЭлемента = Тип("СправочникСсылка.Организации") Тогда
				
				Если ДеревоПравилОрганизаций = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Результат.Добавить(ПроверитьЭлементПоПравиламИдентификации(СтруктураНастроек, ДанныеДляПоиска, ДеревоПравилОрганизаций));
				
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьНаличиеКонтактовПередДобавлениемНовых(СтруктураНастроек, МассивДанных)
	
	Результат = Новый Массив;
	
	ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Контакт;
	
	ВыгружатьКлиентов 								= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Контакт", "Партнеры", "ВыгружатьНаПортал");
	ПравилаПоискаПриВыгрузкеНаПорталКлиентов 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Контакт", "Партнеры", "ПравилаПоискаПриВыгрузкеНаПортал");
	
	ВыгружатьКонтактныеЛица							= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Контакт", "КонтактныеЛицаПартнеров", "ВыгружатьНаПортал");
	ПравилаПоискаПриВыгрузкеНаПорталКонтактныхЛиц 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Контакт", "КонтактныеЛицаПартнеров", "ПравилаПоискаПриВыгрузкеНаПортал");

	мВыгружаемыеЭлементы 	= Новый Массив;
	Для каждого ТекЭлемент Из МассивДанных Цикл 
		
		ТипЭлемента = ТипЗнч(ТекЭлемент);
		Если ВыгружатьКлиентов = Истина И ПравилаПоискаПриВыгрузкеНаПорталКлиентов <> "" И ТипЭлемента = Тип("СправочникСсылка.Партнеры") Тогда
			мВыгружаемыеЭлементы.Добавить(ТекЭлемент);
		ИначеЕсли ВыгружатьКонтактныеЛица = Истина И ПравилаПоискаПриВыгрузкеНаПорталКонтактныхЛиц <> "" И ТипЭлемента = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			мВыгружаемыеЭлементы.Добавить(ТекЭлемент);
		КонецЕсли;
		
	КонецЦикла;

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
#Область ФормированиеВременныхТаблицДанных
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивДанных"	, мВыгружаемыеЭлементы);
	Запрос.УстановитьПараметр("ТипТелефона"		, Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ТипПочты"		, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ТипДанных"		, ТипДанных);
	Запрос.УстановитьПараметр("Портал"			, СтруктураНастроек.Портал);	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Партнер КАК Объект,
	|	Партнеры.Наименование КАК Наименование,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное
	|ПОМЕСТИТЬ ВТ_Справочник
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|		ПО Контрагенты.Партнер = Партнеры.Ссылка
	|ГДЕ
	|	Партнеры.Ссылка В(&МассивДанных)
	|	И НЕ Партнеры.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ИдентификаторыОбъектов.Объект
	|				ИЗ
	|					ВТ_ИдентификаторыОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтактныеЛицаПартнеров.Ссылка,
	|	КонтактныеЛицаПартнеров.Наименование,
	|	"""",
	|	"""",
	|	КонтактныеЛицаПартнеров.Наименование
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|ГДЕ
	|	КонтактныеЛицаПартнеров.Ссылка В(&МассивДанных)
	|	И НЕ КонтактныеЛицаПартнеров.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ИдентификаторыОбъектов.Объект
	|				ИЗ
	|					ВТ_ИдентификаторыОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.Ссылка КАК Объект,
	|	ПартнерыКонтактнаяИнформация.Представление КАК Представление,
	|	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|	ПартнерыКонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|	ПартнерыКонтактнаяИнформация.Вид КАК Вид
	|ПОМЕСТИТЬ ВТ_Телефоны
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.Тип = &ТипТелефона
	|	И ПартнерыКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Справочник.Объект
	|			ИЗ
	|				ВТ_Справочник)
	|	И ПартнерыКонтактнаяИнформация.НомерТелефона <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка,
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление,
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона,
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефонаБезКодов,
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Вид
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
	|ГДЕ
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип = &ТипТелефона
	|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Справочник.Объект
	|			ИЗ
	|				ВТ_Справочник)
	|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона <> """"
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.Ссылка КАК Объект,
	|	ПартнерыКонтактнаяИнформация.Представление КАК Представление,
	|	ПартнерыКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|	ПартнерыКонтактнаяИнформация.Вид КАК Вид
	|ПОМЕСТИТЬ ВТ_Почта
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.Тип = &ТипПочты
	|	И ПартнерыКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Справочник.Объект
	|			ИЗ
	|				ВТ_Справочник)
	|	И ПартнерыКонтактнаяИнформация.Представление <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка,
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление,
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.АдресЭП,
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Вид
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
	|ГДЕ
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип = &ТипПочты
	|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Справочник.Объект
	|			ИЗ
	|				ВТ_Справочник)
	|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление <> """"
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Справочник.Объект КАК Объект
	|ИЗ
	|	ВТ_Справочник КАК ВТ_Справочник";
#КонецОбласти
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		
		ДеревоПравилКлиентов = Неопределено;
		Если ПравилаПоискаПриВыгрузкеНаПорталКлиентов <> "" Тогда
			ДеревоПравилКлиентов = ЗначениеИзСтрокиВнутр(ПравилаПоискаПриВыгрузкеНаПорталКлиентов);
		КонецЕсли;
		
		ДеревоПравилКонтактныхЛиц = Неопределено;
		Если ПравилаПоискаПриВыгрузкеНаПорталКонтактныхЛиц <> "" Тогда
			ДеревоПравилКонтактныхЛиц = ЗначениеИзСтрокиВнутр(ПравилаПоискаПриВыгрузкеНаПорталКонтактныхЛиц);
		КонецЕсли;
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Проверка наличия контактов перед добавлением новых");
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Фамилии"		, Новый Массив);
		СтруктураДанных.Вставить("Имена"		, Новый Массив);
		СтруктураДанных.Вставить("Отчества"		, Новый Массив);
		СтруктураДанных.Вставить("Телефоны"		, Новый Массив);
		СтруктураДанных.Вставить("Почта"		, Новый Массив);
		СтруктураДанных.Вставить("ИНН"			, Новый Массив);
		СтруктураДанных.Вставить("КПП"			, Новый Массив);
		СтруктураДанных.Вставить("ИННКПП"		, Новый Массив);

		мЗапросы = Новый Массив;
		
#Область ЗаполнениеСтруктурыДанных

		Если (ДеревоПравилКлиентов <> Неопределено И ДеревоПравилКлиентов.Строки.Найти("Фамилия",, Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилКонтактныхЛиц <> Неопределено И ДеревоПравилКонтактныхЛиц.Строки.Найти("Фамилия",, Истина) <> Неопределено) Тогда

			ТелоHTTPЗапроса = "select[]=ID&select[]=LAST_NAME";   //фамилия
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	

			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
			
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл
					
					лНаименованиеПолное = ?(ЗначениеЗаполнено(Выборка.НаименованиеПолное), Выборка.НаименованиеПолное, Выборка.Наименование); 
					ФИО = Б24_К_ОбщегоНазначенияВызовСервера.РазобратьФИО(лНаименованиеПолное);
					
					Если ЗначениеЗаполнено(ФИО.Фамилия) Тогда
						ЕстьФильтр = Истина;                         
						ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("LAST_NAME", ФИО.Фамилия, Истина);
					КонецЕсли;	
					
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[LAST_NAME]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.contact.list?" + ТелоHTTPЗапроса + "&start=-1"));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		Если (ДеревоПравилКлиентов <> Неопределено И ДеревоПравилКлиентов.Строки.Найти("Имя",, Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилКонтактныхЛиц <> Неопределено И ДеревоПравилКонтактныхЛиц.Строки.Найти("Имя",, Истина) <> Неопределено) Тогда

			ТелоHTTPЗапроса = "select[]=ID&select[]=NAME";   //имя
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	

			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
			
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл
					
					лНаименованиеПолное = ?(ЗначениеЗаполнено(Выборка.НаименованиеПолное), Выборка.НаименованиеПолное, Выборка.Наименование); 
					ФИО = Б24_К_ОбщегоНазначенияВызовСервера.РазобратьФИО(лНаименованиеПолное);     
					
					Если ЗначениеЗаполнено(ФИО.Имя) Тогда
						ЕстьФильтр = Истина;       
						ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("NAME", ФИО.Имя, Истина);
					КонецЕсли;	
					
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[NAME]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.contact.list?" + ТелоHTTPЗапроса + "&start=-1"));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		Если (ДеревоПравилКлиентов <> Неопределено И ДеревоПравилКлиентов.Строки.Найти("Отчество",, Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилКонтактныхЛиц <> Неопределено И ДеревоПравилКонтактныхЛиц.Строки.Найти("Отчество",, Истина) <> Неопределено) Тогда

			ТелоHTTPЗапроса = "select[]=ID&select[]=SECOND_NAME";   //отчество
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	

			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
			
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл
					
					лНаименованиеПолное = ?(ЗначениеЗаполнено(Выборка.НаименованиеПолное), Выборка.НаименованиеПолное, Выборка.Наименование); 
					ФИО = Б24_К_ОбщегоНазначенияВызовСервера.РазобратьФИО(лНаименованиеПолное);  
					
					Если ЗначениеЗаполнено(ФИО.Отчество) И ФИО.Отчество <> "ИП" Тогда
						ЕстьФильтр = Истина;   
						ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("SECOND_NAME", ФИО.Отчество, Истина);
					КонецЕсли;
					
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[SECOND_NAME]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.contact.list?" + ТелоHTTPЗапроса + "&start=-1"));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		Если (ДеревоПравилКлиентов <> Неопределено И ДеревоПравилКлиентов.Строки.Найти("ИНН",, Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилКонтактныхЛиц <> Неопределено И ДеревоПравилКонтактныхЛиц.Строки.Найти("ИНН",, Истина) <> Неопределено) Тогда

			ТелоHTTPЗапроса = "select[]=ID&select[]=ENTITY_ID&select[]=RQ_INN&filter[ENTITY_TYPE_ID]=3";  //ИНН
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	
			
			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
				
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ЗначениеЗаполнено(Выборка.ИНН) Тогда
						ЕстьФильтр = Истина;  
						ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("RQ_INN", Выборка.ИНН, Истина);
					КонецЕсли;		
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[INN]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.list?" + ТелоHTTPЗапроса + "&start=-1"));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
			
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		Если (ДеревоПравилКлиентов <> Неопределено И ДеревоПравилКлиентов.Строки.Найти("КПП",, Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилКонтактныхЛиц <> Неопределено И ДеревоПравилКонтактныхЛиц.Строки.Найти("КПП",, Истина) <> Неопределено) Тогда

			ТелоHTTPЗапроса = "select[]=ID&select[]=ENTITY_ID&select[]=RQ_KPP&filter[ENTITY_TYPE_ID]=3";   //КПП
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	
			
			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
				
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ЗначениеЗаполнено(Выборка.КПП) Тогда
						ЕстьФильтр = Истина;  
						ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("RQ_KPP", Выборка.КПП, Истина);
					КонецЕсли;
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[KPP]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.list?" + ТелоHTTPЗапроса + "&start=-1"));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		Если (ДеревоПравилКлиентов <> Неопределено И ДеревоПравилКлиентов.Строки.Найти("ИНН+КПП",, Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилКонтактныхЛиц <> Неопределено И ДеревоПравилКонтактныхЛиц.Строки.Найти("ИНН+КПП",, Истина) <> Неопределено) Тогда     

			ТелоHTTPЗапроса = "select[]=ID&select[]=ENTITY_ID&select[]=RQ_INN&select[]=RQ_KPP&filter[ENTITY_TYPE_ID]=3";   //ИНН+КПП
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	
			
			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
				
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл    
					
					Если ЗначениеЗаполнено(Выборка.ИНН) Тогда
						ЕстьФильтр = Истина;     
						ТелоHTTPЗапроса = ТелоHTTPЗапроса  + СформироватьФильтрПоКлючу("RQ_INN", Выборка.ИНН, Истина);
						ТелоHTTPЗапроса = ТелоHTTPЗапроса  + СформироватьФильтрПоКлючу("RQ_KPP", Выборка.КПП, Истина);
					КонецЕсли;   
					
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[INNKPP]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.list?" + ТелоHTTPЗапроса + "&start=-1"));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		ОбработатьЗапросыДляИдентификацииНаПортале(СтруктураНастроек, мЗапросы, СтруктураДанных);
		
		Если (ДеревоПравилКлиентов <> Неопределено И ДеревоПравилКлиентов.Строки.Найти("Емейл",, Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилКонтактныхЛиц <> Неопределено И ДеревоПравилКонтактныхЛиц.Строки.Найти("Емейл",, Истина) <> Неопределено) Тогда     
			ПолучитьДанныеТелефоновЕмейловДляИдентификацииНаПортале(СтруктураНастроек, МенеджерВременныхТаблиц, "crm.contact.list", "Почта", СтруктураДанных); 
		КонецЕсли; 
		
		Если (ДеревоПравилКлиентов <> Неопределено И ДеревоПравилКлиентов.Строки.Найти("Телефон",, Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилКонтактныхЛиц <> Неопределено И ДеревоПравилКонтактныхЛиц.Строки.Найти("Телефон",, Истина) <> Неопределено) Тогда     
			ПолучитьДанныеТелефоновЕмейловДляИдентификацииНаПортале(СтруктураНастроек, МенеджерВременныхТаблиц, "crm.contact.list", "Телефоны", СтруктураДанных);
		КонецЕсли;
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
#КонецОбласти
		
		ДеревоПравилКлиентов = Неопределено;
		Если ПравилаПоискаПриВыгрузкеНаПорталКлиентов <> "" Тогда
			ДеревоПравилКлиентов = ЗначениеИзСтрокиВнутр(ПравилаПоискаПриВыгрузкеНаПорталКлиентов);
		КонецЕсли;
		
		ДеревоПравилКонтактныхЛиц = Неопределено;
		Если ПравилаПоискаПриВыгрузкеНаПорталКонтактныхЛиц <> "" Тогда
			ДеревоПравилКонтактныхЛиц = ЗначениеИзСтрокиВнутр(ПравилаПоискаПриВыгрузкеНаПорталКонтактныхЛиц);
		КонецЕсли;

		Выборка = ВыполненныйЗапрос.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ДанныеДляПоиска = Новый Структура;
			ДанныеДляПоиска.Вставить("СтруктураДанных"			, СтруктураДанных);
			ДанныеДляПоиска.Вставить("МенеджерВременныхТаблиц"	, МенеджерВременныхТаблиц);
			ДанныеДляПоиска.Вставить("Объект"					, Выборка.Объект);
			ДанныеДляПоиска.Вставить("ТипДанных"				, ТипДанных);
			
			ТипЭлемента = ТипЗнч(Выборка.Объект);
			Если ТипЭлемента = Тип("СправочникСсылка.Партнеры") Тогда
				
				Если ДеревоПравилКлиентов = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Результат.Добавить(ПроверитьЭлементПоПравиламИдентификации(СтруктураНастроек, ДанныеДляПоиска, ДеревоПравилКлиентов));
				
			ИначеЕсли ТипЭлемента = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
				
				Если ДеревоПравилКонтактныхЛиц = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Результат.Добавить(ПроверитьЭлементПоПравиламИдентификации(СтруктураНастроек, ДанныеДляПоиска, ДеревоПравилКонтактныхЛиц));
				
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьНаличиеРеквизитовПередДобавлениемНовых(СтруктураНастроек, МассивДанных)
	
	Результат = Новый Массив;
	
	ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Реквизит;
	
	ВыгружатьРеквизитыКлиентов 								= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Реквизит", "Контрагенты", "ВыгружатьНаПортал");
	ПравилаПоискаПриВыгрузкеНаПорталРеквизитовКлиентов		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Реквизит", "Контрагенты", "ПравилаПоискаПриВыгрузкеНаПортал");
	
	ВыгружатьРеквизитыОрганизаций 							= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Реквизит", "Организации", "ВыгружатьНаПортал");
	ПравилаПоискаПриВыгрузкеНаПорталРеквизитовОрганизаций 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Реквизит", "Организации", "ПравилаПоискаПриВыгрузкеНаПортал");

	мВыгружаемыеЭлементы 	= Новый Массив;
	Для каждого ТекЭлемент Из МассивДанных Цикл 
		
		ТипЭлемента = ТипЗнч(ТекЭлемент);
		Если ВыгружатьРеквизитыКлиентов = Истина И ПравилаПоискаПриВыгрузкеНаПорталРеквизитовКлиентов <> "" И ТипЭлемента = Тип("СправочникСсылка.Контрагенты") Тогда
			мВыгружаемыеЭлементы.Добавить(ТекЭлемент);
		ИначеЕсли ВыгружатьРеквизитыОрганизаций = Истина И ПравилаПоискаПриВыгрузкеНаПорталРеквизитовОрганизаций <> "" И ТипЭлемента = Тип("СправочникСсылка.Организации") Тогда
			мВыгружаемыеЭлементы.Добавить(ТекЭлемент);
		КонецЕсли;
		
	КонецЦикла;

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
#Область ФормированиеВременныхТаблицДанных
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивДанных"	, мВыгружаемыеЭлементы);
	Запрос.УстановитьПараметр("ТипТелефона"		, Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ТипПочты"		, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ТипДанных"		, ТипДанных);
	Запрос.УстановитьПараметр("Портал"			, СтруктураНастроек.Портал);	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Объект,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное
	|ПОМЕСТИТЬ ВТ_Справочник
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка В(&МассивДанных)
	|	И НЕ Контрагенты.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ИдентификаторыОбъектов.Объект
	|				ИЗ
	|					ВТ_ИдентификаторыОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Организации.Ссылка,
	|	Организации.Наименование,
	|	Организации.ИНН,
	|	Организации.КПП,
	|	Организации.НаименованиеПолное
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка В(&МассивДанных)
	|	И НЕ Организации.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ИдентификаторыОбъектов.Объект
	|				ИЗ
	|					ВТ_ИдентификаторыОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Справочник.Объект КАК Объект
	|ИЗ
	|	ВТ_Справочник КАК ВТ_Справочник";
#КонецОбласти
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		
		ДеревоПравилРеквизитовКлиентов = Неопределено;
		Если ПравилаПоискаПриВыгрузкеНаПорталРеквизитовКлиентов <> "" Тогда
			ДеревоПравилРеквизитовКлиентов = ЗначениеИзСтрокиВнутр(ПравилаПоискаПриВыгрузкеНаПорталРеквизитовКлиентов);
		КонецЕсли;
		
		ДеревоПравилРеквизитовОрганизаций = Неопределено;
		Если ПравилаПоискаПриВыгрузкеНаПорталРеквизитовОрганизаций <> "" Тогда
			ДеревоПравилРеквизитовОрганизаций = ЗначениеИзСтрокиВнутр(ПравилаПоискаПриВыгрузкеНаПорталРеквизитовОрганизаций);
		КонецЕсли;
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Проверка наличия реквизитов перед добавлением новых");
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Наименования"	, Новый Массив);
		СтруктураДанных.Вставить("Фамилии"		, Новый Массив);
		СтруктураДанных.Вставить("Имена"		, Новый Массив);
		СтруктураДанных.Вставить("Отчества"		, Новый Массив);
		СтруктураДанных.Вставить("ИНН"			, Новый Массив);
		СтруктураДанных.Вставить("КПП"			, Новый Массив);
		СтруктураДанных.Вставить("ИННКПП"		, Новый Массив);

		мЗапросы = Новый Массив;
		
#Область ЗаполнениеСтруктурыДанных

		Если (ДеревоПравилРеквизитовКлиентов <> Неопределено И ДеревоПравилРеквизитовКлиентов.Строки.Найти("Наименование компании",,Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилРеквизитовОрганизаций <> Неопределено И ДеревоПравилРеквизитовОрганизаций.Строки.Найти("Наименование компании",,Истина) <> Неопределено) Тогда     
			
			ТелоHTTPЗапроса = "select[]=ID&select[]=RQ_COMPANY_NAME";   //Наименование
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	

			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
			
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ЗначениеЗаполнено(Выборка.Наименование) Тогда
						ЕстьФильтр = Истина;             
						ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("RQ_COMPANY_NAME", Выборка.Наименование, Истина); 
					КонецЕсли;		
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[RQ_COMPANY_NAME]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.list?" + ТелоHTTPЗапроса + "&start=-1"));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		Если (ДеревоПравилРеквизитовКлиентов <> Неопределено И ДеревоПравилРеквизитовКлиентов.Строки.Найти("Фамилия",,Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилРеквизитовОрганизаций <> Неопределено И ДеревоПравилРеквизитовОрганизаций.Строки.Найти("Фамилия",,Истина) <> Неопределено) Тогда     
				
			ТелоHTTPЗапроса = "select[]=ID&select[]=RQ_LAST_NAME";  //фамилия
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	
			
			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
				
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл
					
					лНаименованиеПолное = ?(ЗначениеЗаполнено(Выборка.НаименованиеПолное), Выборка.НаименованиеПолное, Выборка.Наименование); 
					ФИО = Б24_К_ОбщегоНазначенияВызовСервера.РазобратьФИО(лНаименованиеПолное);
					Если ЗначениеЗаполнено(ФИО.Фамилия) Тогда
						ЕстьФильтр = Истина;              
						ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("RQ_LAST_NAME", ФИО.Фамилия, Истина);
					КонецЕсли;
					
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[RQ_LAST_NAME]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.list?" + ТелоHTTPЗапроса + "&start=-1"));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		Если (ДеревоПравилРеквизитовКлиентов <> Неопределено И ДеревоПравилРеквизитовКлиентов.Строки.Найти("Имя",,Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилРеквизитовОрганизаций <> Неопределено И ДеревоПравилРеквизитовОрганизаций.Строки.Найти("Имя",,Истина) <> Неопределено) Тогда     
				
			ТелоHTTPЗапроса = "select[]=ID&select[]=RQ_FIRST_NAME";  //имя
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	
			
			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
						
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл
						
					лНаименованиеПолное = ?(ЗначениеЗаполнено(Выборка.НаименованиеПолное), Выборка.НаименованиеПолное, Выборка.Наименование); 
					ФИО = Б24_К_ОбщегоНазначенияВызовСервера.РазобратьФИО(лНаименованиеПолное);
					Если ЗначениеЗаполнено(ФИО.Имя) Тогда
						ЕстьФильтр = Истина;                            
						ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("RQ_FIRST_NAME", ФИО.Имя, Истина);						
					КонецЕсли;	
					
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[RQ_FIRST_NAME]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.list?" + ТелоHTTPЗапроса + "&start=-1"));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		Если (ДеревоПравилРеквизитовКлиентов <> Неопределено И ДеревоПравилРеквизитовКлиентов.Строки.Найти("Отчество",,Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилРеквизитовОрганизаций <> Неопределено И ДеревоПравилРеквизитовОрганизаций.Строки.Найти("Отчество",,Истина) <> Неопределено) Тогда     
			
			ТелоHTTPЗапроса = "select[]=ID&select[]=RQ_SECOND_NAME";  //Отчество
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	
			
			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
				
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл
					
					лНаименованиеПолное = ?(ЗначениеЗаполнено(Выборка.НаименованиеПолное), Выборка.НаименованиеПолное, Выборка.Наименование); 
					ФИО = Б24_К_ОбщегоНазначенияВызовСервера.РазобратьФИО(лНаименованиеПолное);
					Если ЗначениеЗаполнено(ФИО.Отчество) И ФИО.Отчество <> "ИП" Тогда
						ЕстьФильтр = Истина;              
						ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("RQ_SECOND_NAME", ФИО.Отчество, Истина);						
					КонецЕсли;	
					
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[RQ_SECOND_NAME]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.list?" + ТелоHTTPЗапроса + "&start=-1"));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		Если (ДеревоПравилРеквизитовКлиентов <> Неопределено И ДеревоПравилРеквизитовКлиентов.Строки.Найти("ИНН",,Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилРеквизитовОрганизаций <> Неопределено И ДеревоПравилРеквизитовОрганизаций.Строки.Найти("ИНН",,Истина) <> Неопределено) Тогда     
				
			ТелоHTTPЗапроса = "select[]=ID&select[]=ENTITY_ID&select[]=RQ_INN";  //ИНН
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	
			
			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
				
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ЗначениеЗаполнено(Выборка.ИНН) Тогда
						ЕстьФильтр = Истина;           
						ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("RQ_INN", Выборка.ИНН, Истина);						
					КонецЕсли;		
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[INN]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.list?" + ТелоHTTPЗапроса + "&start=-1"));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
			
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		Если (ДеревоПравилРеквизитовКлиентов <> Неопределено И ДеревоПравилРеквизитовКлиентов.Строки.Найти("КПП",,Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилРеквизитовОрганизаций <> Неопределено И ДеревоПравилРеквизитовОрганизаций.Строки.Найти("КПП",,Истина) <> Неопределено) Тогда     
			
			ТелоHTTPЗапроса = "select[]=ID&select[]=ENTITY_ID&select[]=RQ_KPP";   //КПП
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	
			
			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
				
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ЗначениеЗаполнено(Выборка.КПП) Тогда
						ЕстьФильтр = Истина;               
						ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("RQ_KPP", Выборка.КПП, Истина);						
					КонецЕсли;
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[KPP]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.list?" + ТелоHTTPЗапроса + "&start=-1"));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
			
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		Если (ДеревоПравилРеквизитовКлиентов <> Неопределено И ДеревоПравилРеквизитовКлиентов.Строки.Найти("ИНН+КПП",,Истина) <> Неопределено) 
			ИЛИ (ДеревоПравилРеквизитовОрганизаций <> Неопределено И ДеревоПравилРеквизитовОрганизаций.Строки.Найти("ИНН+КПП",,Истина) <> Неопределено) Тогда     

			ТелоHTTPЗапроса = "select[]=ID&select[]=ENTITY_ID&select[]=RQ_INN&select[]=RQ_KPP";   //ИНН+КПП
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	
			
			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
				
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл    
					
					Если ЗначениеЗаполнено(Выборка.ИНН) Тогда
						ЕстьФильтр = Истина;     
						ТелоHTTPЗапроса = ТелоHTTPЗапроса  + СформироватьФильтрПоКлючу("RQ_INN", Выборка.ИНН, Истина);
						ТелоHTTPЗапроса = ТелоHTTPЗапроса  + СформироватьФильтрПоКлючу("RQ_KPP", Выборка.КПП, Истина);
					КонецЕсли;   
					
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[INNKPP]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.list?" + ТелоHTTPЗапроса + "&start=-1"));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		ОбработатьЗапросыДляИдентификацииНаПортале(СтруктураНастроек, мЗапросы, СтруктураДанных);
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
#КонецОбласти
		
		ДеревоПравилРеквизитовКлиентов = Неопределено;
		Если ПравилаПоискаПриВыгрузкеНаПорталРеквизитовКлиентов <> "" Тогда
			ДеревоПравилРеквизитовКлиентов = ЗначениеИзСтрокиВнутр(ПравилаПоискаПриВыгрузкеНаПорталРеквизитовКлиентов);
		КонецЕсли;
		
		ДеревоПравилРеквизитовОрганизаций = Неопределено;
		Если ПравилаПоискаПриВыгрузкеНаПорталРеквизитовОрганизаций <> "" Тогда
			ДеревоПравилРеквизитовОрганизаций = ЗначениеИзСтрокиВнутр(ПравилаПоискаПриВыгрузкеНаПорталРеквизитовОрганизаций);
		КонецЕсли;

		Выборка = ВыполненныйЗапрос.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ДанныеДляПоиска = Новый Структура;
			ДанныеДляПоиска.Вставить("СтруктураДанных"			, СтруктураДанных);
			ДанныеДляПоиска.Вставить("МенеджерВременныхТаблиц"	, МенеджерВременныхТаблиц);
			ДанныеДляПоиска.Вставить("Объект"					, Выборка.Объект);
			ДанныеДляПоиска.Вставить("ТипДанных"				, ТипДанных);
			
			ТипЭлемента = ТипЗнч(Выборка.Объект);
			Если ТипЭлемента = Тип("СправочникСсылка.Контрагенты") Тогда
				
				Если ДеревоПравилРеквизитовКлиентов = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Результат.Добавить(ПроверитьЭлементПоПравиламИдентификации(СтруктураНастроек, ДанныеДляПоиска, ДеревоПравилРеквизитовКлиентов));
				
			ИначеЕсли ТипЭлемента = Тип("СправочникСсылка.Организации") Тогда
				
				Если ДеревоПравилРеквизитовОрганизаций = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Результат.Добавить(ПроверитьЭлементПоПравиламИдентификации(СтруктураНастроек, ДанныеДляПоиска, ДеревоПравилРеквизитовОрганизаций));
				
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьНаличиеБанкСчетовПередДобавлениемНовых(СтруктураНастроек, МассивДанных)
	
	Результат = Новый Массив;
	
	ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.БанковскийСчетРеквизита;
	
	ВыгружатьБанкСчетКлиентов 						= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Банковский счет", "БанковскиеСчетаКонтрагентов", "ВыгружатьНаПортал");
	ПравилаПоискаПриВыгрузкеНаПорталБанкСчетов		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Банковский счет", "БанковскиеСчетаКонтрагентов", "ПравилаПоискаПриВыгрузкеНаПортал");
	
	ВыгружатьБанкСчетОрганизаций 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Банковский счет", "БанковскиеСчетаОрганизаций"	, "ВыгружатьНаПортал");
	ПравилаПоискаПриВыгрузкеНаПорталБанкСчетовОрг	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Банковский счет", "БанковскиеСчетаОрганизаций"	, "ПравилаПоискаПриВыгрузкеНаПортал");

	мВыгружаемыеЭлементы 	= Новый Массив;
	Для каждого ТекЭлемент Из МассивДанных Цикл 
		
		ТипЭлемента = ТипЗнч(ТекЭлемент);
		Если ВыгружатьБанкСчетКлиентов = Истина И ПравилаПоискаПриВыгрузкеНаПорталБанкСчетов <> "" И ТипЭлемента = Тип("СправочникСсылка.БанковскиеСчетаКонтрагентов") Тогда
			мВыгружаемыеЭлементы.Добавить(ТекЭлемент);
		ИначеЕсли ВыгружатьБанкСчетОрганизаций = Истина И ПравилаПоискаПриВыгрузкеНаПорталБанкСчетовОрг <> "" И ТипЭлемента = Тип("СправочникСсылка.БанковскиеСчетаОрганизаций") Тогда
			мВыгружаемыеЭлементы.Добавить(ТекЭлемент);
		КонецЕсли;
		
	КонецЦикла;

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
#Область ФормированиеВременныхТаблицДанных
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивДанных"	, мВыгружаемыеЭлементы);
	Запрос.УстановитьПараметр("ТипТелефона"		, Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ТипПочты"		, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ТипДанных"		, ТипДанных);
	Запрос.УстановитьПараметр("Портал"			, СтруктураНастроек.Портал);	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БанковскиеСчетаКонтрагентов.Ссылка КАК Объект,
	|	БанковскиеСчетаКонтрагентов.НомерСчета КАК НомерСчета,
	|	Банки.Код КАК БикБанка
	|ПОМЕСТИТЬ ВТ_Справочник
	|ИЗ
	|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК Банки
	|		ПО БанковскиеСчетаКонтрагентов.Банк = Банки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО БанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств = Валюты.Ссылка
	|ГДЕ
	|	БанковскиеСчетаКонтрагентов.Ссылка В(&МассивДанных)
	|	И НЕ БанковскиеСчетаКонтрагентов.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ИдентификаторыОбъектов.Объект
	|				ИЗ
	|					ВТ_ИдентификаторыОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БанковскиеСчетаОрганизаций.Ссылка,
	|	БанковскиеСчетаОрганизаций.НомерСчета,
	|	Банки.Код
	|ИЗ
	|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК Банки
	|		ПО БанковскиеСчетаОрганизаций.Банк = Банки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО БанковскиеСчетаОрганизаций.ВалютаДенежныхСредств = Валюты.Ссылка
	|ГДЕ
	|	БанковскиеСчетаОрганизаций.Ссылка В(&МассивДанных)
	|	И НЕ БанковскиеСчетаОрганизаций.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ИдентификаторыОбъектов.Объект
	|				ИЗ
	|					ВТ_ИдентификаторыОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Справочник.Объект КАК Объект
	|ИЗ
	|	ВТ_Справочник КАК ВТ_Справочник";
#КонецОбласти
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		
		ДеревоПравилРеквизитовБанкСчетов = Неопределено;
		Если ПравилаПоискаПриВыгрузкеНаПорталБанкСчетов <> "" Тогда
			ДеревоПравилРеквизитовБанкСчетов = ЗначениеИзСтрокиВнутр(ПравилаПоискаПриВыгрузкеНаПорталБанкСчетов);
		КонецЕсли;
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Проверка наличия банковских счетов перед добавлением новых");
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("НомераСчетов"	, Новый Массив);
		СтруктураДанных.Вставить("БИК"			, Новый Массив);

		мЗапросы = Новый Массив;
		
#Область ЗаполнениеСтруктурыДанных   

	Если (ДеревоПравилРеквизитовБанкСчетов <> Неопределено И ДеревоПравилРеквизитовБанкСчетов.Строки.Найти("Номер счета",,Истина) <> Неопределено) Тогда	
		
			ТелоHTTPЗапроса = "select[]=ID&select[]=RQ_ACC_NUM";   //Номер счета
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	

			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
			
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ЗначениеЗаполнено(Выборка.НомерСчета) Тогда
						ЕстьФильтр = Истина;                 
						ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("RQ_ACC_NUM", Выборка.НомерСчета, Истина);
					КонецЕсли;		
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[RQ_ACC_NUM]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.bankdetail.list?" + ТелоHTTPЗапроса));
				КонецЕсли;
				
			КонецЕсли;
		
	КонецЕсли;
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		Если (ДеревоПравилРеквизитовБанкСчетов <> Неопределено И ДеревоПравилРеквизитовБанкСчетов.Строки.Найти("БИК",,Истина) <> Неопределено) Тогда		
			
			ТелоHTTPЗапроса = "select[]=ID&select[]=RQ_BIK";   //БИК
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Справочник";	

			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				
				ЕстьФильтр = Ложь;
			
				Выборка = ВыполненныйЗапрос.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ЗначениеЗаполнено(Выборка.БикБанка) Тогда
						ЕстьФильтр = Истина;               
						ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("RQ_BIK", Выборка.БикБанка, Истина);
					КонецЕсли;		
				КонецЦикла;
				
				Если ЕстьФильтр Тогда
					мЗапросы.Добавить("cmd[RQ_BIK]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.bankdetail.list?" + ТелоHTTPЗапроса));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		ОбработатьЗапросыДляИдентификацииНаПортале(СтруктураНастроек, мЗапросы, СтруктураДанных);
		
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
#КонецОбласти

		ДеревоПравилРеквизитовБанкСчетов = Неопределено;
		Если ПравилаПоискаПриВыгрузкеНаПорталБанкСчетов <> "" Тогда
			ДеревоПравилРеквизитовБанкСчетов = ЗначениеИзСтрокиВнутр(ПравилаПоискаПриВыгрузкеНаПорталБанкСчетов);
		КонецЕсли;
		
		ДеревоПравилРеквизитовБанкСчетовОрг = Неопределено;
		Если ПравилаПоискаПриВыгрузкеНаПорталБанкСчетовОрг <> "" Тогда
			ДеревоПравилРеквизитовБанкСчетовОрг = ЗначениеИзСтрокиВнутр(ПравилаПоискаПриВыгрузкеНаПорталБанкСчетовОрг);
		КонецЕсли;

		Выборка = ВыполненныйЗапрос.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ДанныеДляПоиска = Новый Структура;
			ДанныеДляПоиска.Вставить("СтруктураДанных"			, СтруктураДанных);
			ДанныеДляПоиска.Вставить("МенеджерВременныхТаблиц"	, МенеджерВременныхТаблиц);
			ДанныеДляПоиска.Вставить("Объект"					, Выборка.Объект);
			ДанныеДляПоиска.Вставить("ТипДанных"				, ТипДанных);
			
			ТипЭлемента = ТипЗнч(Выборка.Объект);
			Если ТипЭлемента = Тип("СправочникСсылка.БанковскиеСчетаКонтрагентов") Тогда
				
				Если ДеревоПравилРеквизитовБанкСчетов = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Результат.Добавить(ПроверитьЭлементПоПравиламИдентификации(СтруктураНастроек, ДанныеДляПоиска, ДеревоПравилРеквизитовБанкСчетов));
				
			ИначеЕсли ТипЭлемента = Тип("СправочникСсылка.БанковскиеСчетаОрганизаций") Тогда
				
				Если ДеревоПравилРеквизитовБанкСчетовОрг = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Результат.Добавить(ПроверитьЭлементПоПравиламИдентификации(СтруктураНастроек, ДанныеДляПоиска, ДеревоПравилРеквизитовБанкСчетовОрг));
				
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Процедура ОбработатьЗапросыДляИдентификацииНаПортале(СтруктураНастроек, мЗапросы, СтруктураДанных) 
	
	ОбщееТелоHTTPЗапроса= "";
	Для каждого ТекЭлемент Из мЗапросы Цикл
		ОбщееТелоHTTPЗапроса = ОбщееТелоHTTPЗапроса + "&" + ТекЭлемент;	
	КонецЦикла;
	
	СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ОбщееТелоHTTPЗапроса);
	Если СтруктураОтвета = Неопределено Тогда
		СтруктураНастроек.ВыполненоБезОшибок = Ложь;
		Возврат;	
	КонецЕсли;
	
	ВнешниеДанныеКлюча = СтруктураОтвета.Получить("result");
	Если ВнешниеДанныеКлюча = Неопределено Тогда
		СтруктураНастроек.ВыполненоБезОшибок = Ложь;
		Возврат;	
	КонецЕсли;
	
	ВнутренниеДанныеКлюча = ВнешниеДанныеКлюча.Получить("result");
	Если ВнутренниеДанныеКлюча = Неопределено Тогда
		СтруктураНастроек.ВыполненоБезОшибок = Ложь;
		Возврат;	
	КонецЕсли;
	
	МассивОшибок = ВнешниеДанныеКлюча.Получить("result_error");
	Если ТипЗнч(МассивОшибок) = Тип("Массив") Тогда
		Если МассивОшибок.Количество() > 0 Тогда	
			СтруктураНастроек.ВыполненоБезОшибок = Ложь;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ВнутренниеДанныеКлюча) <> Тип("Соответствие") Тогда
		СтруктураНастроек.ВыполненоБезОшибок = Ложь;
		Возврат;	
	КонецЕсли;
	
	ЗаголовкиКомпаний = ВнутренниеДанныеКлюча.Получить("TITLE");
	Если ЗаголовкиКомпаний <> Неопределено Тогда                                             
		Для каждого ТекЭлемент Из ЗаголовкиКомпаний Цикл
			СтруктураДанных.Наименования.Добавить(Новый Структура("Идентификатор, Наименование", Формат(ТекЭлемент.Получить("ID"), "ЧГ=0"), ТекЭлемент.Получить("TITLE")));
		КонецЦикла;
	КонецЕсли;
	
	ФамилииКонтактов = ВнутренниеДанныеКлюча.Получить("LAST_NAME");
	Если ФамилииКонтактов <>Неопределено Тогда                                             
		Для каждого ТекЭлемент Из ФамилииКонтактов Цикл
			СтруктураДанных.Фамилии.Добавить(Новый Структура("Идентификатор, Фамилия", Формат(ТекЭлемент.Получить("ID"), "ЧГ=0"), ТекЭлемент.Получить("LAST_NAME")));
		КонецЦикла;
	КонецЕсли;
	
	ИменаКонтактов = ВнутренниеДанныеКлюча.Получить("NAME");
	Если ИменаКонтактов <> Неопределено Тогда                                             
		Для каждого ТекЭлемент Из ИменаКонтактов Цикл
			СтруктураДанных.Имена.Добавить(Новый Структура("Идентификатор, Имя", Формат(ТекЭлемент.Получить("ID"), "ЧГ=0"), ТекЭлемент.Получить("NAME")));
		КонецЦикла;
	КонецЕсли;
	
	ОтчестваКонтактов = ВнутренниеДанныеКлюча.Получить("SECOND_NAME");
	Если ОтчестваКонтактов <> Неопределено Тогда                                             
		Для каждого ТекЭлемент Из ОтчестваКонтактов Цикл
			СтруктураДанных.Отчества.Добавить(Новый Структура("Идентификатор, Отчество", Формат(ТекЭлемент.Получить("ID"), "ЧГ=0"), ТекЭлемент.Получить("SECOND_NAME")));
		КонецЦикла;
	КонецЕсли;
	
	НаименованияРеквизитов = ВнутренниеДанныеКлюча.Получить("RQ_COMPANY_NAME");
	Если НаименованияРеквизитов <> Неопределено Тогда                                             
		Для каждого ТекЭлемент Из НаименованияРеквизитов Цикл
			СтруктураДанных.Наименования.Добавить(Новый Структура("Идентификатор, Наименование", Формат(ТекЭлемент.Получить("ID"), "ЧГ=0"), ТекЭлемент.Получить("RQ_COMPANY_NAME")));
		КонецЦикла;
	КонецЕсли;
	
	ФамилииРеквизитов = ВнутренниеДанныеКлюча.Получить("RQ_LAST_NAME");
	Если ФамилииРеквизитов <>Неопределено Тогда                                             
		Для каждого ТекЭлемент Из ФамилииРеквизитов Цикл
			СтруктураДанных.Фамилии.Добавить(Новый Структура("Идентификатор, Фамилия", Формат(ТекЭлемент.Получить("ID"), "ЧГ=0"), ТекЭлемент.Получить("RQ_LAST_NAME")));
		КонецЦикла;
	КонецЕсли;
	
	ИменаРеквизитов = ВнутренниеДанныеКлюча.Получить("RQ_FIRST_NAME");
	Если ИменаРеквизитов <> Неопределено Тогда                                             
		Для каждого ТекЭлемент Из ИменаРеквизитов Цикл
			СтруктураДанных.Имена.Добавить(Новый Структура("Идентификатор, Имя", Формат(ТекЭлемент.Получить("ID"), "ЧГ=0"), ТекЭлемент.Получить("RQ_FIRST_NAME")));
		КонецЦикла;
	КонецЕсли;
	
	ОтчестваРеквизитов = ВнутренниеДанныеКлюча.Получить("RQ_SECOND_NAME");
	Если ОтчестваРеквизитов <> Неопределено Тогда                                             
		Для каждого ТекЭлемент Из ОтчестваРеквизитов Цикл
			СтруктураДанных.Отчества.Добавить(Новый Структура("Идентификатор, Отчество", Формат(ТекЭлемент.Получить("ID"), "ЧГ=0"), ТекЭлемент.Получить("RQ_SECOND_NAME")));
		КонецЦикла;
	КонецЕсли;
	
	ИННКомпаний = ВнутренниеДанныеКлюча.Получить("INN");
	Если ИННКомпаний <> Неопределено Тогда
		Для каждого ТекЭлемент Из ИННКомпаний Цикл
			СтруктураДанных.ИНН.Добавить(Новый Структура("Идентификатор, ИдентификаторВладельца, ИНН", Формат(ТекЭлемент.Получить("ID"), "ЧГ=0"), ТекЭлемент.Получить("ENTITY_ID"), ТекЭлемент.Получить("RQ_INN")));
		КонецЦикла;
	КонецЕсли;
	
	КППКомпаний = ВнутренниеДанныеКлюча.Получить("KPP");
	Если КППКомпаний <> Неопределено Тогда
		Для каждого ТекЭлемент Из КППКомпаний Цикл
			СтруктураДанных.КПП.Добавить(Новый Структура("Идентификатор, ИдентификаторВладельца, КПП", Формат(ТекЭлемент.Получить("ID"), "ЧГ=0"), ТекЭлемент.Получить("ENTITY_ID"), ТекЭлемент.Получить("RQ_KPP")));
		КонецЦикла;
	КонецЕсли;
	
	ИННКППКомпаний = ВнутренниеДанныеКлюча.Получить("INNKPP");
	Если ИННКППКомпаний <> Неопределено Тогда
		Для каждого ТекЭлемент Из ИННКППКомпаний Цикл
			СтруктураДанных.ИННКПП.Добавить(Новый Структура("Идентификатор, ИдентификаторВладельца, ИНН, КПП", Формат(ТекЭлемент.Получить("ID"), "ЧГ=0"), ТекЭлемент.Получить("ENTITY_ID"), ТекЭлемент.Получить("RQ_INN"), ТекЭлемент.Получить("RQ_KPP")));
		КонецЦикла;
	КонецЕсли;
	
	НомераСчетов = ВнутренниеДанныеКлюча.Получить("RQ_ACC_NUM");
	Если НомераСчетов <> Неопределено Тогда
		Для каждого ТекЭлемент Из НомераСчетов Цикл
			СтруктураДанных.НомераСчетов.Добавить(Новый Структура("Идентификатор, НомерСчета", Формат(ТекЭлемент.Получить("ID"), "ЧГ=0"), ТекЭлемент.Получить("RQ_ACC_NUM")));
		КонецЦикла;
	КонецЕсли;
	
	БИК = ВнутренниеДанныеКлюча.Получить("RQ_BIK");
	Если БИК <> Неопределено Тогда
		Для каждого ТекЭлемент Из БИК Цикл
			СтруктураДанных.БИК.Добавить(Новый Структура("Идентификатор, БИК", Формат(ТекЭлемент.Получить("ID"), "ЧГ=0"), ТекЭлемент.Получить("RQ_BIK")));
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьДанныеТелефоновЕмейловДляИдентификацииНаПортале(СтруктураНастроек, МенеджерВременныхТаблиц, РестМетод, ВидДанных, СтруктураДанных)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Если ВидДанных = "Почта" Тогда
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Почта";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_Телефоны";
	КонецЕсли;
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		
		
		мЗапросы = Новый Массив;
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ЗначенияКИ = Новый Массив;
			
			Если ВидДанных = "Почта" Тогда
				ЗначенияКИ.Добавить(Выборка.Представление); 
			Иначе
				
				МассивКонтактов = РазбитьТелефоныВМассив(Выборка.Представление);	
				Для каждого ТекЭлемент Из МассивКонтактов Цикл      
					
					НомерТелефона = ТекЭлемент;  
					
					Если СтрДлина(НомерТелефона) > 8 Тогда   
						Если Лев(НомерТелефона, 1) = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьКодТелефонаСтраны() Тогда 
							НомерТелефона = "+"+НомерТелефона;	
						КонецЕсли;
					КонецЕсли;
					
					ЗначенияКИ.Добавить(НомерТелефона); 

				КонецЦикла;
				
			КонецЕсли;
			
			ТелоHTTPЗапроса = "select[]=ID";
			Для каждого ТекЭлемент Из ЗначенияКИ Цикл
				
				Если ВидДанных = "Почта" Тогда   
					ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("EMAIL", ТекЭлемент, Истина, Ложь);
				Иначе           
					ТелоHTTPЗапроса = ТелоHTTPЗапроса + СформироватьФильтрПоКлючу("PHONE", ТекЭлемент, Истина, Ложь);
				КонецЕсли;
				
			КонецЦикла;
			
			мЗапросы.Добавить("cmd["+ТекЭлемент+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(РестМетод + "?" + ТелоHTTPЗапроса + "&start=-1"));
			Если мЗапросы.Количество() = 50 Тогда
				ОбработатьЗапросыТелефоновЕмейловДляИдентификацииНаПортале(СтруктураНастроек, мЗапросы, ВидДанных, СтруктураДанных);
				мЗапросы.Очистить();
			КонецЕсли;
			
		КонецЦикла;
		
		Если мЗапросы.Количество() > 0 Тогда
			ОбработатьЗапросыТелефоновЕмейловДляИдентификацииНаПортале(СтруктураНастроек, мЗапросы, ВидДанных, СтруктураДанных);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработатьЗапросыТелефоновЕмейловДляИдентификацииНаПортале(СтруктураНастроек, мЗапросы, ВидДанных, СтруктураДанных) 
	
	ОбщееТелоHTTPЗапроса= "";
	Для каждого ТекЭлемент Из мЗапросы Цикл
		ОбщееТелоHTTPЗапроса = ОбщееТелоHTTPЗапроса + "&" + ТекЭлемент;	
	КонецЦикла;
	
	СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ОбщееТелоHTTPЗапроса);
	Если СтруктураОтвета = Неопределено Тогда
		СтруктураНастроек.ВыполненоБезОшибок = Ложь;
		Возврат;	
	КонецЕсли;
	
	ВнешниеДанныеКлюча = СтруктураОтвета.Получить("result");
	Если ВнешниеДанныеКлюча = Неопределено Тогда
		СтруктураНастроек.ВыполненоБезОшибок = Ложь;
		Возврат;	
	КонецЕсли;
	
	ВнутренниеДанныеКлюча = ВнешниеДанныеКлюча.Получить("result");
	Если ВнутренниеДанныеКлюча = Неопределено Тогда
		СтруктураНастроек.ВыполненоБезОшибок = Ложь;
		Возврат;	
	КонецЕсли;
	
	Если ТипЗнч(ВнутренниеДанныеКлюча) = Тип("Соответствие") Тогда
		
		Для каждого ТекДанныеКлюча Из ВнутренниеДанныеКлюча Цикл
			
			Если ТипЗнч(ТекДанныеКлюча) = Тип("КлючИЗначение") Тогда
				Если ТипЗнч(ТекДанныеКлюча.Значение) = Тип("Массив") Тогда
					
					Для каждого ТекИдентификатор Из ТекДанныеКлюча.Значение Цикл
						
						Идентификатор = Формат(ТекИдентификатор. Получить("ID"),"ЧГ=0") ;
						Если ВидДанных = "Почта" Тогда
							СтруктураДанных.Почта.Добавить(Новый Структура("Идентификатор, Почта", Идентификатор, ТекДанныеКлюча.Ключ)); 
						Иначе
							СтруктураДанных.Телефоны.Добавить(Новый Структура("Идентификатор, Телефон" ,Идентификатор, ТекДанныеКлюча.Ключ)); 
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


Функция ПроверитьЭлементПоПравиламИдентификации(СтруктураНастроек, ДанныеДляПоиска, ДеревоПравил)
	
	ИдентификаторыБитрикс24 = Новый Массив;
	
	Для каждого ТекСтрока Из ДеревоПравил.Строки Цикл
		Если ТекСтрока.ТипЗаписи = 0 Тогда       
		
			ИдентификаторыБитрикс24 = ПроверитьЭлементПравилаИдентификацииРекурсивно(СтруктураНастроек, ДанныеДляПоиска, ТекСтрока, "Группа И");
			
			РазличныеЭлементы = Новый Соответствие;  
			Для Каждого ТекЭлемент Из ИдентификаторыБитрикс24 Цикл
				РазличныеЭлементы.Вставить(ТекЭлемент, "");	
			КонецЦикла;
			
		КонецЕсли;	
	КонецЦикла;
	
	КоличествоЭлементов = РазличныеЭлементы.Количество();
	Если КоличествоЭлементов = 1 Тогда
		РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеДляПоиска.ТипДанных, ДанныеДляПоиска.Объект, ИдентификаторыБитрикс24[0]);   
		РезультатПоиска = "Сопоставлено";	
	ИначеЕсли КоличествоЭлементов > 1 Тогда 
		РезультатПоиска = "Ошибка";
	Иначе
		РезультатПоиска = "Не найдено";	
	КонецЕсли;
	
	Возврат Новый Структура("Объект, Результат", ДанныеДляПоиска.Объект, РезультатПоиска)
	
КонецФункции

Функция ПроверитьЭлементПравилаИдентификацииРекурсивно(СтруктураНастроек, ДанныеДляПоиска, СтрокаПравил, ТипГруппировки)
	
	ИдентификаторыБитрикс24 = Неопределено;
	
	Для каждого ТекСтрока Из СтрокаПравил.Строки Цикл

		Если ТекСтрока.Использование  Тогда
			
			Если ТекСтрока.ТипЗаписи = 1 Тогда
				ИдентификаторыУсловия = ПроверитьЭлементПравилаИдентификацииРекурсивно(СтруктураНастроек, ДанныеДляПоиска, ТекСтрока, ТекСтрока.ЛевоеЗначение); 
			Иначе
				ИдентификаторыУсловия = ПроверитьУсловиеПравилаИдентификации(СтруктураНастроек, ДанныеДляПоиска, ТекСтрока.ЛевоеЗначение);
			КонецЕсли;
			
			Если ИдентификаторыБитрикс24 = Неопределено Тогда
				ИдентификаторыБитрикс24 = ИдентификаторыУсловия;	
			Иначе
				
				Если ИдентификаторыУсловия <> Неопределено Тогда
			
					ВТ_ИдентификаторыБитрикс24 = Новый Массив;
					
					Если ТипГруппировки = "Группа И" Тогда
						
						Для каждого ТекЭлемент Из ИдентификаторыУсловия Цикл 
							Если ИдентификаторыБитрикс24.Найти(ТекЭлемент) <> Неопределено Тогда
								ВТ_ИдентификаторыБитрикс24.Добавить(ТекЭлемент);	
							КонецЕсли;
						КонецЦикла;
						
					Иначе
						
						ВТ_ИдентификаторыБитрикс24 = ИдентификаторыБитрикс24;
						
						Для каждого ТекЭлемент Из ИдентификаторыУсловия Цикл 
							Если ИдентификаторыБитрикс24.Найти(ТекЭлемент) = Неопределено Тогда
								ВТ_ИдентификаторыБитрикс24.Добавить(ТекЭлемент);	
							КонецЕсли;
						КонецЦикла;
						
					КонецЕсли;
					
					ИдентификаторыБитрикс24 = ВТ_ИдентификаторыБитрикс24;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ?(ИдентификаторыБитрикс24 = Неопределено, Новый Массив, ИдентификаторыБитрикс24);
	
КонецФункции

Функция ПроверитьУсловиеПравилаИдентификации(СтруктураНастроек, ДанныеДляПоиска, Алгоритм)
	
	Результат = Новый Массив;
	
	Если Алгоритм = "Наименование компании" Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = ДанныеДляПоиска.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Объект", ДанныеДляПоиска.Объект); 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_Справочник.Наименование КАК Наименование
		|ИЗ
		|	ВТ_Справочник КАК ВТ_Справочник
		|ГДЕ
		|	ВТ_Справочник.Объект = &Объект"; 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			//Если НЕ ЗначениеЗаполнено(Выборка.Наименование) Тогда
			//	Результат = Неопределено;
			//	Прервать;
			//КонецЕсли;
			
			Для каждого ТекЭлемент Из ДанныеДляПоиска.СтруктураДанных.Наименования Цикл
				Если Выборка.Наименование = ТекЭлемент.Наименование Тогда  	
					Результат.Добавить(ТекЭлемент.Идентификатор);
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	ИначеЕсли Алгоритм = "Фамилия" Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = ДанныеДляПоиска.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Объект", ДанныеДляПоиска.Объект); 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_Справочник.Наименование КАК Наименование,
		|	ВТ_Справочник.Наименование КАК НаименованиеПолное
		|ИЗ
		|	ВТ_Справочник КАК ВТ_Справочник
		|ГДЕ
		|	ВТ_Справочник.Объект = &Объект"; 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			лНаименованиеПолное = ?(ЗначениеЗаполнено(Выборка.НаименованиеПолное), Выборка.НаименованиеПолное, Выборка.Наименование); 
			ФИО = Б24_К_ОбщегоНазначенияВызовСервера.РазобратьФИО(лНаименованиеПолное);
			Если ЗначениеЗаполнено(ФИО.Фамилия) Тогда
				Для каждого ТекЭлемент Из ДанныеДляПоиска.СтруктураДанных.Фамилии Цикл
					Если ФИО.Фамилия = ТекЭлемент.Фамилия Тогда  	
						Результат.Добавить(ТекЭлемент.Идентификатор);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Алгоритм = "Имя" Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = ДанныеДляПоиска.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Объект", ДанныеДляПоиска.Объект); 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_Справочник.Наименование КАК Наименование,
		|	ВТ_Справочник.Наименование КАК НаименованиеПолное
		|ИЗ
		|	ВТ_Справочник КАК ВТ_Справочник
		|ГДЕ
		|	ВТ_Справочник.Объект = &Объект"; 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			лНаименованиеПолное = ?(ЗначениеЗаполнено(Выборка.НаименованиеПолное), Выборка.НаименованиеПолное, Выборка.Наименование); 
			ФИО = Б24_К_ОбщегоНазначенияВызовСервера.РазобратьФИО(лНаименованиеПолное);
			Если ЗначениеЗаполнено(ФИО.Имя) Тогда
				Для каждого ТекЭлемент Из ДанныеДляПоиска.СтруктураДанных.Имена Цикл
					Если ФИО.Имя = ТекЭлемент.Имя Тогда  	
						Результат.Добавить(ТекЭлемент.Идентификатор);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Алгоритм = "Отчество" Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = ДанныеДляПоиска.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Объект", ДанныеДляПоиска.Объект); 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_Справочник.Наименование КАК Наименование,
		|	ВТ_Справочник.Наименование КАК НаименованиеПолное
		|ИЗ
		|	ВТ_Справочник КАК ВТ_Справочник
		|ГДЕ
		|	ВТ_Справочник.Объект = &Объект"; 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			лНаименованиеПолное = ?(ЗначениеЗаполнено(Выборка.НаименованиеПолное), Выборка.НаименованиеПолное, Выборка.Наименование); 
			ФИО = Б24_К_ОбщегоНазначенияВызовСервера.РазобратьФИО(лНаименованиеПолное);
			Если ЗначениеЗаполнено(ФИО.Отчество) И ФИО.Отчество <> "ИП" Тогда
				Для каждого ТекЭлемент Из ДанныеДляПоиска.СтруктураДанных.Отчества Цикл
					Если ФИО.Отчество = ТекЭлемент.Отчество Тогда  	
						Результат.Добавить(ТекЭлемент.Идентификатор);
					КонецЕсли;
				КонецЦикла;
			Иначе
				Результат = Неопределено;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Алгоритм = "Телефон" Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = ДанныеДляПоиска.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Объект", ДанныеДляПоиска.Объект); 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_Телефоны.Представление КАК Представление
		|ИЗ
		|	ВТ_Телефоны КАК ВТ_Телефоны
		|ГДЕ
		|	ВТ_Телефоны.Объект = &Объект";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			МассивКонтактов = РазбитьТелефоныВМассив(Выборка.Представление);   
			Для каждого ТекТелефон Из МассивКонтактов Цикл
			
				Для каждого ТекЭлемент Из ДанныеДляПоиска.СтруктураДанных.Телефоны Цикл
					Если ТекТелефон = ТекЭлемент.Телефон ИЛИ ТекТелефон = "+"+СокрЛП(ТекЭлемент.Телефон) Тогда  	
						Результат.Добавить(ТекЭлемент.Идентификатор);
					КонецЕсли;
				КонецЦикла;     
			
			КонецЦикла;
			
		КонецЦикла;
		
	ИначеЕсли Алгоритм = "Емейл" Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = ДанныеДляПоиска.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Объект", ДанныеДляПоиска.Объект); 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_Почта.Представление КАК Представление
		|ИЗ
		|	ВТ_Почта КАК ВТ_Почта
		|ГДЕ
		|	ВТ_Почта.Объект = &Объект";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Для каждого ТекЭлемент Из ДанныеДляПоиска.СтруктураДанных.Почта Цикл
				Если Выборка.Представление = ТекЭлемент.Почта Тогда  	
					Результат.Добавить(ТекЭлемент.Идентификатор);
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	ИначеЕсли Алгоритм = "ИНН" Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = ДанныеДляПоиска.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Объект", ДанныеДляПоиска.Объект); 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_Справочник.ИНН КАК ИНН
		|ИЗ
		|	ВТ_Справочник КАК ВТ_Справочник
		|ГДЕ
		|	ВТ_Справочник.Объект = &Объект"; 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			//Если НЕ ЗначениеЗаполнено(Выборка.ИНН) Тогда
			//	Результат = Неопределено;
			//	Прервать;
			//КонецЕсли;
			
			Для каждого ТекЭлемент Из ДанныеДляПоиска.СтруктураДанных.ИНН Цикл
				Если Выборка.ИНН = ТекЭлемент.ИНН Тогда  
					Результат.Добавить(?(ДанныеДляПоиска.ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Реквизит, ТекЭлемент.Идентификатор, ТекЭлемент.ИдентификаторВладельца));
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	ИначеЕсли Алгоритм = "КПП" Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = ДанныеДляПоиска.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Объект", ДанныеДляПоиска.Объект); 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_Справочник.КПП КАК КПП
		|ИЗ
		|	ВТ_Справочник КАК ВТ_Справочник
		|ГДЕ
		|	ВТ_Справочник.Объект = &Объект"; 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(Выборка.КПП) Тогда
				Результат = Неопределено;
				Прервать;
			КонецЕсли;
			
			Для каждого ТекЭлемент Из ДанныеДляПоиска.СтруктураДанных.КПП Цикл
				Если Выборка.КПП = ТекЭлемент.КПП Тогда  	
					Результат.Добавить(?(ДанныеДляПоиска.ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Реквизит, ТекЭлемент.Идентификатор, ТекЭлемент.ИдентификаторВладельца));
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	ИначеЕсли Алгоритм = "ИНН+КПП" Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = ДанныеДляПоиска.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Объект", ДанныеДляПоиска.Объект); 
		Запрос.Текст = "ВЫБРАТЬ    
		|	ВТ_Справочник.ИНН КАК ИНН,
		|	ВТ_Справочник.КПП КАК КПП
		|ИЗ
		|	ВТ_Справочник КАК ВТ_Справочник
		|ГДЕ
		|	ВТ_Справочник.Объект = &Объект"; 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(Выборка.ИНН) Тогда
				Результат = Неопределено;
				Прервать;
			КонецЕсли;
			
			Для каждого ТекЭлемент Из ДанныеДляПоиска.СтруктураДанных.ИННКПП Цикл
				Если Выборка.ИНН = ТекЭлемент.ИНН И Выборка.КПП = ТекЭлемент.КПП Тогда  	
					Результат.Добавить(?(ДанныеДляПоиска.ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Реквизит, ТекЭлемент.Идентификатор, ТекЭлемент.ИдентификаторВладельца));
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	ИначеЕсли Алгоритм = "Номер счета" Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = ДанныеДляПоиска.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Объект", ДанныеДляПоиска.Объект); 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_Справочник.НомерСчета КАК НомерСчета
		|ИЗ
		|	ВТ_Справочник КАК ВТ_Справочник
		|ГДЕ
		|	ВТ_Справочник.Объект = &Объект"; 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.НомерСчета) Тогда
				Для каждого ТекЭлемент Из ДанныеДляПоиска.СтруктураДанных.НомераСчетов Цикл
					Если Выборка.НомерСчета = ТекЭлемент.НомерСчета Тогда  	
						Результат.Добавить(ТекЭлемент.Идентификатор);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Алгоритм = "БИК" Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = ДанныеДляПоиска.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Объект", ДанныеДляПоиска.Объект); 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_Справочник.БикБанка КАК БикБанка
		|ИЗ
		|	ВТ_Справочник КАК ВТ_Справочник
		|ГДЕ
		|	ВТ_Справочник.Объект = &Объект"; 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.БикБанка) Тогда
				Для каждого ТекЭлемент Из ДанныеДляПоиска.СтруктураДанных.БИК Цикл
					Если Выборка.БикБанка = ТекЭлемент.БИК Тогда  	
						Результат.Добавить(ТекЭлемент.Идентификатор);
					КонецЕсли;
				КонецЦикла;
			Иначе
				Результат = Неопределено;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции


Функция РазбитьТелефоныВМассив(НомераТелефоновСтрокой)

	МассивКонтактов = Новый Массив;   
	
	ЕстьТочкаЗапятые= Ложь;
	ЕстьЗапятые 	= Ложь;    
	
	Если СтрНайти(НомераТелефоновСтрокой, ",") > 0 Тогда
		ЕстьЗапятые = Истина;
		МассивКонтактов = СтрРазделить(НомераТелефоновСтрокой, ",")
	КонецЕсли;
	
	Если СтрНайти(НомераТелефоновСтрокой, ";") > 0 Тогда
		ЕстьТочкаЗапятые = Истина;
		МассивКонтактов = СтрРазделить(НомераТелефоновСтрокой, ";")
	КонецЕсли;
	
	Если НЕ ЕстьТочкаЗапятые И НЕ ЕстьЗапятые Тогда
		МассивКонтактов.Добавить(НомераТелефоновСтрокой);	
	КонецЕсли;       
	
	Возврат МассивКонтактов;
	
КонецФункции

Функция СформироватьФильтрПоКлючу(ИмяКлюча, ЗначениеКлюча, ЭтоМассив = Ложь, ПолноеСравнение = Истина)  
	
	Если ЭтоМассив Тогда ПараметрМассив = "[]" КонецЕсли;	
	
	Результат = "&filter[" + ?(ПолноеСравнение, "%3D", "") + ИмяКлюча + "]" + ПараметрМассив + "=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ЗначениеКлюча); 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


#Область Компании  

Функция СформироватьДанныеПоКомпаниям(пСтруктураНастроек, МассивДанных) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	РезультатОбработкиПоискаПередДобавлениемНовых = ПроверитьНаличиеКомпанийПередДобавлениемНовых(СтруктураНастроек, МассивДанных);
	
	Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование запросов для компаний");
		
#Область ИдентификаторыСлужебныхСвойств	

	Если пСтруктураНастроек.ОбрабатыватьУдалениеОбъектовВ1С Тогда 
		Если НЕ СтруктураНастроек.ПредопределенныеСвойства.Свойство("ПредопределенноеСвойствоПометкаУдаленияКомпанийИКонтактов") Тогда 	
			СтруктураНастроек.ПредопределенныеСвойства.Вставить("ПредопределенноеСвойствоПометкаУдаленияКомпанийИКонтактов", Неопределено);	
		КонецЕсли;
		ДопИдСвойстваПометкиУдаления	= РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьДопИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоПометкаУдаленияКомпанийИКонтактов, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКомпании); 
		СтруктураНастроек.Вставить("ДопИдПредопределенногоСвойстваПометкиУдаленияКомпании", ДопИдСвойстваПометкиУдаления);
	КонецЕсли;
	
	Если СтруктураНастроек.НастройкиСинхронизацииКлиентов.Свойство("ВыгружатьВзаиморасчетыКлиентов") И СтруктураНастроек.НастройкиСинхронизацииКлиентов.ВыгружатьВзаиморасчетыКлиентов Тогда 
		Если НЕ СтруктураНастроек.ПредопределенныеСвойства.Свойство("ПредопределенноеСвойствоВзаиморасчетКомпанийКонтактов") Тогда 	
			СтруктураНастроек.ПредопределенныеСвойства.Вставить("ПредопределенноеСвойствоВзаиморасчетКомпанийКонтактов", Неопределено);	
		КонецЕсли;
		ДопИдСвойстваВзаиморасчетов	= РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьДопИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоВзаиморасчетКомпанийКонтактов, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКомпании); 
		СтруктураНастроек.Вставить("ДопИдПредопределенногоСвойстваВзаиморасчетов", ДопИдСвойстваВзаиморасчетов);
	КонецЕсли; 
	
#КонецОбласти

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область ФормированиеВременныхТаблицДанных    
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивДанных"	, МассивДанных);  
	Запрос.УстановитьПараметр("Портал"			, СтруктураНастроек.Портал);	
	Запрос.УстановитьПараметр("ТипТелефона"		, Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ТипПочты"		, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ТипДанных"		, СтруктураНастроек.ТипыОбъектовОбмена.Компания);
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.Ссылка КАК Объект,
	|	ПартнерыКонтактнаяИнформация.Представление КАК Представление,
	|	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|	ПартнерыКонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|	ПартнерыКонтактнаяИнформация.Вид КАК Вид
	|ПОМЕСТИТЬ ВТ_Телефоны
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.Тип = &ТипТелефона
	|	И ПартнерыКонтактнаяИнформация.Ссылка В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Ссылка,
	|	ОрганизацииКонтактнаяИнформация.Представление,
	|	ОрганизацииКонтактнаяИнформация.НомерТелефона,
	|	ОрганизацииКонтактнаяИнформация.НомерТелефонаБезКодов,
	|	ОрганизацииКонтактнаяИнформация.Вид
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Тип = &ТипТелефона
	|	И ОрганизацииКонтактнаяИнформация.Ссылка В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.Ссылка КАК Объект,
	|	ПартнерыКонтактнаяИнформация.Представление КАК Представление,
	|	ПартнерыКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|	ПартнерыКонтактнаяИнформация.Вид КАК Вид
	|ПОМЕСТИТЬ ВТ_Почта
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.Тип = &ТипПочты
	|	И ПартнерыКонтактнаяИнформация.Ссылка В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Ссылка,
	|	ОрганизацииКонтактнаяИнформация.Представление,
	|	ОрганизацииКонтактнаяИнформация.АдресЭП,
	|	ОрганизацииКонтактнаяИнформация.Вид
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Тип = &ТипПочты
	|	И ОрганизацииКонтактнаяИнформация.Ссылка В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики,
	|	АналитикаУчетаПоПартнерам.Партнер КАК Партнер
	|ПОМЕСТИТЬ ВТ_АналитикаПоПартнерам
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|ГДЕ
	|	АналитикаУчетаПоПартнерам.Партнер В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючАналитики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АналитикаПоПартнерам.Партнер КАК Клиент,
	|	СУММА(РасчетыСКлиентамиОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыСПокупателями
	|ИЗ
	|	ВТ_АналитикаПоПартнерам КАК ВТ_АналитикаПоПартнерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.ОстаткиИОбороты(, , , , ) КАК РасчетыСКлиентамиОстаткиИОбороты
	|		ПО ВТ_АналитикаПоПартнерам.КлючАналитики = РасчетыСКлиентамиОстаткиИОбороты.АналитикаУчетаПоПартнерам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_АналитикаПоПартнерам.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АналитикаПоПартнерам.Партнер КАК Клиент,
	|	СУММА(РасчетыСПоставщикамиОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыСПоставщиками
	|ИЗ
	|	ВТ_АналитикаПоПартнерам КАК ВТ_АналитикаПоПартнерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.ОстаткиИОбороты(, , , , ) КАК РасчетыСПоставщикамиОстаткиИОбороты
	|		ПО ВТ_АналитикаПоПартнерам.КлючАналитики = РасчетыСПоставщикамиОстаткиИОбороты.АналитикаУчетаПоПартнерам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_АналитикаПоПартнерам.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_АналитикаПоПартнерам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсточникиПервичногоИнтереса.Партнер КАК Партнер,
	|	ИсточникиПервичногоИнтереса.КаналПервичногоИнтереса КАК КаналПервичногоИнтереса
	|ПОМЕСТИТЬ ВТ_ИсточникиПервичногоИнтереса
	|ИЗ
	|	РегистрСведений.ИсточникиПервичногоИнтереса КАК ИсточникиПервичногоИнтереса
	|ГДЕ
	|	ИсточникиПервичногоИнтереса.Партнер В(&МассивДанных)
	|	И ИсточникиПервичногоИнтереса.Проект = ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Партнеры.Ссылка КАК Ссылка,
	|	Партнеры.ПометкаУдаления КАК ПометкаУдаления,
	|	Партнеры.Наименование КАК Наименование,
	|	Партнеры.НаименованиеПолное КАК НаименованиеПолное,
	|	Партнеры.Комментарий КАК Комментарий,
	|	Партнеры.ОсновнойМенеджер КАК Ответственный,
	|	""N"" КАК ЭтоОрганизация,
	|	ЕСТЬNULL(ВТ_РасчетыСПокупателями.СуммаКонечныйОстаток, 0) КАК ДолгПокупателя,
	|	ЕСТЬNULL(ВТ_РасчетыСПоставщиками.СуммаКонечныйОстаток, 0) КАК ДолгПоставщика,
	|	Партнеры.Клиент КАК Клиент,
	|	Партнеры.Конкурент КАК Конкурент,
	|	Партнеры.ПрочиеОтношения КАК ПрочиеОтношения,
	|	Партнеры.Поставщик КАК Поставщик,
	|	ВТ_ИсточникиПервичногоИнтереса.КаналПервичногоИнтереса КАК Канал
	|ПОМЕСТИТЬ ВТ_Компании
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетыСПокупателями КАК ВТ_РасчетыСПокупателями
	|		ПО Партнеры.Ссылка = ВТ_РасчетыСПокупателями.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетыСПоставщиками КАК ВТ_РасчетыСПоставщиками
	|		ПО Партнеры.Ссылка = ВТ_РасчетыСПоставщиками.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсточникиПервичногоИнтереса КАК ВТ_ИсточникиПервичногоИнтереса
	|		ПО Партнеры.Ссылка = ВТ_ИсточникиПервичногоИнтереса.Партнер
	|ГДЕ
	|	Партнеры.Ссылка В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Организации.Ссылка,
	|	Организации.ПометкаУдаления,
	|	Организации.Наименование,
	|	Организации.НаименованиеПолное,
	|	"""",
	|	"""",
	|	""Y"",
	|	0,
	|	0,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_РасчетыСПокупателями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_РасчетыСПоставщиками
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ_Компании.Ссылка КАК Объект,
	|	ВТ_Компании.Ссылка КАК Идентификатор1С,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБ24,
	|	ВТ_Компании.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_Компании.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ(ВТ_Компании.НаименованиеПолное КАК СТРОКА(300)) КАК НаименованиеПолное,
	|	""CUSTOMER"" КАК ТипОбъекта,
	|	ВЫРАЗИТЬ(ВТ_Компании.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	|	ВТ_Компании.Ответственный КАК Ответственный,
	|	ВТ_Компании.ЭтоОрганизация КАК ЭтоОрганизация,
	|	ВТ_Компании.ДолгПокупателя КАК ДолгПокупателя,
	|	ВТ_Компании.ДолгПоставщика КАК ДолгПоставщика,
	|	ВТ_Компании.Клиент КАК Клиент,
	|	ВТ_Компании.Конкурент КАК Конкурент,
	|	ВТ_Компании.ПрочиеОтношения КАК ПрочиеОтношения,
	|	ВТ_Компании.Поставщик КАК Поставщик,
	|	ВТ_Компании.Канал КАК Канал
	|ИЗ
	|	ВТ_Компании КАК ВТ_Компании
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|		ПО ВТ_Компании.Ссылка = ВТ_ИдентификаторыОбъектов.Объект";
#КонецОбласти

	ДобавитьКЗапросуОбъектовДанныеОПользовательскихПолях(СтруктураНастроек, Запрос, "Справочник.Партнеры", СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКомпании, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКомпании);
	
	ДобавитьКЗапросуОбъектовДанныеФайлов(СтруктураНастроек, Запрос);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураИспВидовКИ = Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСтруктуруВидовКИКонтрагентов();
	
	мЭлементы 	=  Новый массив;
	
	ВыгружатьПартнеров 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Компания", "Партнеры"	, "ВыгружатьНаПортал");
	ВыгружатьОрганизации 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Компания", "Организации", "ВыгружатьНаПортал");
	
	АлгоритмПриВыгрузкеДанныхНаПорталПартнеров 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Компания", "Партнеры"	, "АлгоритмПриВыгрузкеДанныхНаПортал");
	АлгоритмПриВыгрузкеДанныхНаПорталОрганизаций	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Компания", "Организации", "АлгоритмПриВыгрузкеДанныхНаПортал");
	
	ПоляПартнеров 			= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Компания", "Партнеры");
	ПоляОрганизаций 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Компания", "Организации");
	
	ОбновлятьНаПорталеПартнеров 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Компания", "Партнеры"	, "ОбновлятьНаПортале");
	ОбновлятьНаПорталеОрганизации 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Компания", "Организации", "ОбновлятьНаПортале");
	
	Пока Выборка.Следующий() Цикл
		
		НеВыгружать = Ложь;
		Для каждого ТекЭлемент Из РезультатОбработкиПоискаПередДобавлениемНовых Цикл
			Если ТекЭлемент.Объект = Выборка.Объект И ТекЭлемент.Результат = "Ошибка" Тогда 	
				Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Ошибка, "Было найдено несколько компаний по алгоритму поиска для клиента: " + Выборка.Наименование + ". Будет пропущен");
				НеВыгружать = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если НеВыгружать Тогда
			Продолжить;
		КонецЕсли;
		
		СформированныйЗапрос = "";
		
		ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(Выборка.ИдентификаторБ24);
		
		Если Выборка.ЭтоОрганизация = "N" И ВыгружатьПартнеров Тогда
			
			Если ЭтоНовыйЭлемент ИЛИ (НЕ ЭтоНовыйЭлемент И ОбновлятьНаПорталеПартнеров) Тогда 
				СформированныйЗапрос = СформироватьСтруктуруДанныхПоКомпании(СтруктураНастроек, ПоляПартнеров, АлгоритмПриВыгрузкеДанныхНаПорталПартнеров, МенеджерВременныхТаблиц, Выборка, СтруктураИспВидовКИ);
			Иначе
				СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(Выборка.Идентификатор1С);
			КонецЕсли;
			
		ИначеЕсли Выборка.ЭтоОрганизация = "Y" И ВыгружатьОрганизации Тогда
			
			Если ЭтоНовыйЭлемент ИЛИ (НЕ ЭтоНовыйЭлемент И ОбновлятьНаПорталеОрганизации) Тогда 
				СформированныйЗапрос = СформироватьСтруктуруДанныхПоКомпании(СтруктураНастроек, ПоляОрганизаций, АлгоритмПриВыгрузкеДанныхНаПорталОрганизаций, МенеджерВременныхТаблиц, Выборка, СтруктураИспВидовКИ);
			Иначе
				СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(Выборка.Идентификатор1С);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов 	= СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	// чтобы лог не затерся.
	пСтруктураНастроек.Логирование.НомерСообщения	 	= СтруктураНастроек.Логирование.НомерСообщения; 	// чтобы лог не затерся.
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоКомпании(СтруктураНастроек, ИнформацияОПолях, АлгоритмПриВыгрузкеДанныхНаПортал, МенеджерВременныхТаблиц, ИнформацияОКомпании, СтруктураИспВидовКИ)
	
	ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(ИнформацияОКомпании.ИдентификаторБ24);
	
	КлючКомпании = XMLСтрока(ИнформацияОКомпании.Идентификатор1С);
	
#Область Компания

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИнформацияОПолях"			, ИнформацияОПолях);
	ДополнительныеПараметры.Вставить("КлючЭлемента"				, КлючКомпании);
	ДополнительныеПараметры.Вставить("МенеджерВременныхТаблиц"	, МенеджерВременныхТаблиц);
	ДополнительныеПараметры.Вставить("ЭтоНовыйЭлемент"			, ЭтоНовыйЭлемент);
	ДополнительныеПараметры.Вставить("ИнформацияОбъекта1С"		, ИнформацияОКомпании);

	Поля = ПолучитьСтруктуруКлючейЭлементаВыгрузки(СтруктураНастроек, ДополнительныеПараметры);
	
	Если СтруктураНастроек.Свойство("ДопИдПредопределенногоСвойстваВзаиморасчетов") И ЗначениеЗаполнено(СтруктураНастроек.ДопИдПредопределенногоСвойстваВзаиморасчетов) Тогда
		Долг = ИнформацияОКомпании.ДолгПокупателя - ИнформацияОКомпании.ДолгПоставщика;
		Поля.Вставить(СтруктураНастроек.ДопИдПредопределенногоСвойстваВзаиморасчетов, Долг)
	КонецЕсли;
		
	Если СтруктураНастроек.ОбрабатыватьУдалениеОбъектовВ1С Тогда
		Если ЗначениеЗаполнено(СтруктураНастроек.ДопИдПредопределенногоСвойстваПометкиУдаленияКомпании) Тогда
			Поля.Вставить(СтруктураНастроек.ДопИдПредопределенногоСвойстваПометкиУдаленияКомпании, ИнформацияОКомпании.ПометкаУдаления)
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияПользовательскихПолей(СтруктураНастроек, МенеджерВременныхТаблиц, ИнформацияОКомпании.Объект, Поля, ИнформацияОПолях);	

	Если ЗначениеЗаполнено(АлгоритмПриВыгрузкеДанныхНаПортал) Тогда
		ВыполнитьАлгоритмПередВыгрузкой(СтруктураНастроек, ИнформацияОКомпании.Объект, Поля, АлгоритмПриВыгрузкеДанныхНаПортал)
	КонецЕсли;
	
	
	ТелоЗапроса = "";
	Для каждого ТекПоле Из Поля Цикл
		Если ТекПоле.Значение <> Неопределено Тогда
			ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
		КонецЕсли;	
	КонецЦикла;    
	
	ЗаполнениеТелефонаИПочтыДляПартнера(СтруктураНастроек, ИнформацияОКомпании.Объект, МенеджерВременныхТаблиц, СтруктураИспВидовКИ, ТелоЗапроса);

	ТелоЗапроса = ТелоЗапроса + ДанныеРестКлючаФайлов(СтруктураНастроек, МенеджерВременныхТаблиц, ИнформацияОКомпании.Объект);
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючКомпании+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.company.add?"  + ТелоЗапроса);	
	Иначе
		СтрокаЗапроса = "cmd["+КлючКомпании+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.company.update?id=" + ИнформацияОКомпании.ИдентификаторБ24 + "&" + ТелоЗапроса);	
	КонецЕсли;
				
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючКомпании, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.Компания, ИнформацияОКомпании.Идентификатор1С));
	
#КонецОбласти
	
	
#Область ДелоКомпании	

	ТелоДела = Б24_К_ВыгрузкаДелВызовСервера.ПолучитьТелоЗапросаДела(СтруктураНастроек, Б24_К_RestApiВызовСервера.ПолучитьТипВладельцаТаймЛайнПоТипуДанных(СтруктураНастроек.ТипыОбъектовОбмена.Компания), ИнформацияОКомпании.Идентификатор1С, Строка(ИнформацияОКомпании.Идентификатор1С), ИнформацияОКомпании.ИдентификаторБ24, КлючКомпании);   

	Если ЗначениеЗаполнено(ТелоДела) Тогда
		
		КлючДела = "D_" + КлючКомпании;
		
		ИдентификаторДела = РегистрыСведений.Б24_К_ИдентификаторыДел.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.ДелоКомпании, ИнформацияОКомпании.Объект);		
		
		СтрокаЗапроса = СтрокаЗапроса + Б24_К_ВыгрузкаДелВызовСервера.ПолучитьЗапросДела(СтруктураНастроек, КлючДела, ИдентификаторДела, ТелоДела);
				
		СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючДела, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.ДелоКомпании, ИнформацияОКомпании.Идентификатор1С));
	
	КонецЕсли;

#КонецОбласти

	Возврат СтрокаЗапроса;
	
КонецФункции

#КонецОбласти


#Область Контакты  

Функция СформироватьДанныеПоКонтактам(пСтруктураНастроек, МассивДанных) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	

	РезультатОбработкиПоискаПередДобавлениемНовых = ПроверитьНаличиеКонтактовПередДобавлениемНовых(СтруктураНастроек, МассивДанных);
	
	Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование запросов для контактов");
	
#Область ИдентификаторыСлужебныхСвойств	

	Если НЕ СтруктураНастроек.ПредопределенныеСвойства.Свойство("ПредопределенноеСвойствоПолКонтактов") Тогда 
		СтруктураНастроек.ПредопределенныеСвойства.Вставить("ПредопределенноеСвойствоПолКонтактов", Неопределено);	
	КонецЕсли;
	ДопИдСвойстваПола = РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьДопИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоПолКонтактов, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКонтакта); 
	СтруктураНастроек.Вставить("ДопИдПредопределенногоСвойстваПолаКонтакта", ДопИдСвойстваПола);
	
	Если пСтруктураНастроек.ОбрабатыватьУдалениеОбъектовВ1С Тогда 	
		Если НЕ СтруктураНастроек.ПредопределенныеСвойства.Свойство("ПредопределенноеСвойствоПометкаУдаленияКомпанийИКонтактов") Тогда 	
			СтруктураНастроек.ПредопределенныеСвойства.Вставить("ПредопределенноеСвойствоПометкаУдаленияКомпанийИКонтактов", Неопределено);	
		КонецЕсли;
		ДопИдСвойстваПометкиУдаления = РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьДопИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоПометкаУдаленияКомпанийИКонтактов, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКонтакта); 
		СтруктураНастроек.Вставить("ДопИдПредопределенногоСвойстваПометкиУдаленияКонтакта", ДопИдСвойстваПометкиУдаления);
	КонецЕсли;
	
	Если СтруктураНастроек.НастройкиСинхронизацииКлиентов.Свойство("ВыгружатьВзаиморасчетыКлиентов") И СтруктураНастроек.НастройкиСинхронизацииКлиентов.ВыгружатьВзаиморасчетыКлиентов Тогда 
		Если НЕ СтруктураНастроек.ПредопределенныеСвойства.Свойство("ПредопределенноеСвойствоВзаиморасчетКомпанийКонтактов") Тогда 	
			СтруктураНастроек.ПредопределенныеСвойства.Вставить("ПредопределенноеСвойствоВзаиморасчетКомпанийКонтактов", Неопределено);	
		КонецЕсли;
		ДопИдСвойстваВзаиморасчетов	= РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьДопИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоВзаиморасчетКомпанийКонтактов, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКонтакта); 
		СтруктураНастроек.Вставить("ДопИдПредопределенногоСвойстваВзаиморасчетов", ДопИдСвойстваВзаиморасчетов);
	КонецЕсли;  
	
#КонецОбласти
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область ФормированиеВременныхТаблицДанных   
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивДанных"	 	, МассивДанных);  
	Запрос.УстановитьПараметр("Портал"				, СтруктураНастроек.Портал);	
	Запрос.УстановитьПараметр("ТипТелефона"		 	, Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ТипПочты"		 	, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ТипДанных"		 	, СтруктураНастроек.ТипыОбъектовОбмена.Контакт);
	Запрос.УстановитьПараметр("ТипДанныхКомпания"	, СтруктураНастроек.ТипыОбъектовОбмена.Компания);
	Запрос.УстановитьПараметр("ТипДанныхЗначениеСвойства"	, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКонтакта);
	Запрос.УстановитьПараметр("СвойствоПол"					, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоПолКонтактов);
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыКомпаний
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхКомпания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.Ссылка КАК Объект,
	|	ПартнерыКонтактнаяИнформация.Представление КАК Представление,
	|	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|	ПартнерыКонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|	ПартнерыКонтактнаяИнформация.Вид КАК Вид
	|ПОМЕСТИТЬ ВТ_Телефоны
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.Тип = &ТипТелефона
	|	И ПартнерыКонтактнаяИнформация.Ссылка В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтактныеЛицаКонтактнаяИнформация.Ссылка,
	|	КонтактныеЛицаКонтактнаяИнформация.Представление,
	|	КонтактныеЛицаКонтактнаяИнформация.НомерТелефона,
	|	КонтактныеЛицаКонтактнаяИнформация.НомерТелефонаБезКодов,
	|	КонтактныеЛицаКонтактнаяИнформация.Вид
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
	|ГДЕ
	|	КонтактныеЛицаКонтактнаяИнформация.Тип = &ТипТелефона
	|	И КонтактныеЛицаКонтактнаяИнформация.Ссылка В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.Ссылка КАК Объект,
	|	ПартнерыКонтактнаяИнформация.Представление КАК Представление,
	|	ПартнерыКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|	ПартнерыКонтактнаяИнформация.Вид КАК Вид
	|ПОМЕСТИТЬ ВТ_Почта
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.Тип = &ТипПочты
	|	И ПартнерыКонтактнаяИнформация.Ссылка В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтактныеЛицаКонтактнаяИнформация.Ссылка,
	|	КонтактныеЛицаКонтактнаяИнформация.Представление,
	|	КонтактныеЛицаКонтактнаяИнформация.АдресЭП,
	|	КонтактныеЛицаКонтактнаяИнформация.Вид
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
	|ГДЕ
	|	КонтактныеЛицаКонтактнаяИнформация.Тип = &ТипПочты
	|	И КонтактныеЛицаКонтактнаяИнформация.Ссылка В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЗначенийСвойств
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЗначениеСвойства
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПолФизическогоЛица.Ссылка = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
	|			ТОГДА ""Мужской""
	|		ИНАЧЕ ""Женский""
	|	КОНЕЦ КАК Наименование,
	|	ПолФизическогоЛица.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Полы
	|ИЗ
	|	Перечисление.ПолФизическогоЛица КАК ПолФизическогоЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Ссылка КАК ЗначениеСвойства,
	|	ВТ_Полы.Ссылка КАК Пол,
	|	ВТ_ИдентификаторыЗначенийСвойств.Идентификатор КАК ИдентификаторБ24Пола
	|ПОМЕСТИТЬ ВТ_ЗначенияСвойствПола
	|ИЗ
	|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Полы КАК ВТ_Полы
	|		ПО ЗначенияСвойствОбъектов.Наименование = ВТ_Полы.Наименование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗначенийСвойств КАК ВТ_ИдентификаторыЗначенийСвойств
	|		ПО ЗначенияСвойствОбъектов.Ссылка = ВТ_ИдентификаторыЗначенийСвойств.Объект
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Владелец = &СвойствоПол
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыЗначенийСвойств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Полы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики,
	|	АналитикаУчетаПоПартнерам.Партнер КАК Партнер
	|ПОМЕСТИТЬ ВТ_АналитикаПоПартнерам
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|ГДЕ
	|	АналитикаУчетаПоПартнерам.Партнер В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючАналитики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АналитикаПоПартнерам.Партнер КАК Клиент,
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиОстаткиИОбороты.СуммаКонечныйОстаток, 0)) КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыСПокупателями
	|ИЗ
	|	ВТ_АналитикаПоПартнерам КАК ВТ_АналитикаПоПартнерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.ОстаткиИОбороты(, , , , ) КАК РасчетыСКлиентамиОстаткиИОбороты
	|		ПО ВТ_АналитикаПоПартнерам.КлючАналитики = РасчетыСКлиентамиОстаткиИОбороты.АналитикаУчетаПоПартнерам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_АналитикаПоПартнерам.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АналитикаПоПартнерам.Партнер КАК Клиент,
	|	СУММА(ЕСТЬNULL(РасчетыСПоставщикамиОстаткиИОбороты.СуммаКонечныйОстаток, 0)) КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыСПоставщиками
	|ИЗ
	|	ВТ_АналитикаПоПартнерам КАК ВТ_АналитикаПоПартнерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.ОстаткиИОбороты(, , , , ) КАК РасчетыСПоставщикамиОстаткиИОбороты
	|		ПО ВТ_АналитикаПоПартнерам.КлючАналитики = РасчетыСПоставщикамиОстаткиИОбороты.АналитикаУчетаПоПартнерам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_АналитикаПоПартнерам.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_АналитикаПоПартнерам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсточникиПервичногоИнтереса.Партнер КАК Партнер,
	|	ИсточникиПервичногоИнтереса.КаналПервичногоИнтереса КАК КаналПервичногоИнтереса
	|ПОМЕСТИТЬ ВТ_ИсточникиПервичногоИнтереса
	|ИЗ
	|	РегистрСведений.ИсточникиПервичногоИнтереса КАК ИсточникиПервичногоИнтереса
	|ГДЕ
	|	ИсточникиПервичногоИнтереса.Партнер В(&МассивДанных)
	|	И ИсточникиПервичногоИнтереса.Проект = ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Партнеры.Ссылка КАК Ссылка,
	|	Партнеры.ПометкаУдаления КАК ПометкаУдаления,
	|	Партнеры.Наименование КАК Наименование,
	|	Партнеры.НаименованиеПолное КАК НаименованиеПолное,
	|	Партнеры.ОсновнойМенеджер КАК Ответственный,
	|	Партнеры.Комментарий КАК Комментарий,
	|	NULL КАК ИдентификаторКомпанииБитрикс24,
	|	ЛОЖЬ КАК ЭтоКонтактноеЛицо,
	|	Партнеры.ДатаРождения КАК ДатаРождения,
	|	"""" КАК Должность,
	|	Партнеры.Пол КАК Пол,
	|	ЕСТЬNULL(ВТ_РасчетыСПокупателями.СуммаКонечныйОстаток, 0) КАК ДолгПокупателя,
	|	ЕСТЬNULL(ВТ_РасчетыСПоставщиками.СуммаКонечныйОстаток, 0) КАК ДолгПоставщика,
	|	Партнеры.Клиент КАК Клиент,
	|	Партнеры.Конкурент КАК Конкурент,
	|	Партнеры.ПрочиеОтношения КАК ПрочиеОтношения,
	|	Партнеры.Поставщик КАК Поставщик,
	|	ВТ_ИсточникиПервичногоИнтереса.КаналПервичногоИнтереса КАК Канал
	|ПОМЕСТИТЬ ВТ_Контрагенты
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетыСПокупателями КАК ВТ_РасчетыСПокупателями
	|		ПО Партнеры.Ссылка = ВТ_РасчетыСПокупателями.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетыСПоставщиками КАК ВТ_РасчетыСПоставщиками
	|		ПО Партнеры.Ссылка = ВТ_РасчетыСПоставщиками.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсточникиПервичногоИнтереса КАК ВТ_ИсточникиПервичногоИнтереса
	|		ПО Партнеры.Ссылка = ВТ_ИсточникиПервичногоИнтереса.Партнер
	|ГДЕ
	|	Партнеры.Ссылка В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтактныеЛицаПартнеров.Ссылка,
	|	КонтактныеЛицаПартнеров.ПометкаУдаления,
	|	КонтактныеЛицаПартнеров.Наименование,
	|	КонтактныеЛицаПартнеров.Наименование,
	|	КонтактныеЛицаПартнеров.Автор,
	|	КонтактныеЛицаПартнеров.Комментарий,
	|	ВТ_ИдентификаторыКомпаний.Идентификатор,
	|	ИСТИНА,
	|	КонтактныеЛицаПартнеров.ДатаРождения,
	|	КонтактныеЛицаПартнеров.ДолжностьПоВизитке,
	|	КонтактныеЛицаПартнеров.Пол,
	|	0,
	|	0,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыКомпаний КАК ВТ_ИдентификаторыКомпаний
	|		ПО КонтактныеЛицаПартнеров.Владелец = ВТ_ИдентификаторыКомпаний.Объект
	|ГДЕ
	|	КонтактныеЛицаПартнеров.Ссылка В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыКомпаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_РасчетыСПокупателями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_РасчетыСПоставщиками
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ_Контрагенты.Ссылка КАК Объект,
	|	ВТ_Контрагенты.Ссылка КАК Идентификатор1С,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБ24,
	|	ВТ_Контрагенты.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_Контрагенты.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ(ВТ_Контрагенты.НаименованиеПолное КАК СТРОКА(300)) КАК НаименованиеПолное,
	|	""CLIENT"" КАК ТипОбъекта,
	|	ВЫРАЗИТЬ(ВТ_Контрагенты.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	|	ВТ_Контрагенты.Ответственный КАК Ответственный,
	|	ВТ_Контрагенты.ИдентификаторКомпанииБитрикс24 КАК ИдентификаторКомпанииБитрикс24,
	|	ВТ_Контрагенты.ЭтоКонтактноеЛицо КАК ЭтоКонтактноеЛицо,
	|	ВТ_Контрагенты.ДатаРождения КАК ДатаРождения,
	|	ВТ_Контрагенты.Должность КАК Должность,
	|	ВТ_Контрагенты.Пол КАК Пол,
	|	ВТ_ЗначенияСвойствПола.ИдентификаторБ24Пола КАК ИдентификаторБ24Пола,
	|	ВТ_Контрагенты.ДолгПокупателя КАК ДолгПокупателя,
	|	ВТ_Контрагенты.ДолгПоставщика КАК ДолгПоставщика,
	|	ВТ_Контрагенты.Клиент КАК Клиент,
	|	ВТ_Контрагенты.Конкурент КАК Конкурент,
	|	ВТ_Контрагенты.ПрочиеОтношения КАК ПрочиеОтношения,
	|	ВТ_Контрагенты.Поставщик КАК Поставщик,
	|	ВТ_Контрагенты.Канал КАК Канал
	|ИЗ
	|	ВТ_Контрагенты КАК ВТ_Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|		ПО ВТ_Контрагенты.Ссылка = ВТ_ИдентификаторыОбъектов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияСвойствПола КАК ВТ_ЗначенияСвойствПола
	|		ПО ВТ_Контрагенты.Пол = ВТ_ЗначенияСвойствПола.Пол";
#КонецОбласти

#Область ФормированиеВременныхТаблицДляДополнительныхДанных

	Запрос.УстановитьПараметр("ТипДанныхЗСК"			, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКонтакта);
	Запрос.УстановитьПараметр("ТипДанныхЗС"				, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКонтакта);
	Запрос.УстановитьПараметр("НеВыгружаемыеСвойства"	, СтруктураНастроек.ПредопределенныеСвойства.НеВыгружаемыеСвойства);	
		
	Запрос.Текст = Запрос.Текст + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБитрикс24,
	|	Б24_К_ИдентификаторыОбъектов.ДополнительныйИдентификатор КАК ДополнительныйИдентификаторБитрикс24,
	|	ДополнительныеРеквизитыИСведения.ДополнительныеЗначенияИспользуются КАК ДополнительныеЗначенияИспользуются,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения КАК ТипЗначения
	|ПОМЕСТИТЬ ВТ_ИдентификаторыПользовательскихПолей
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|		ПО Б24_К_ИдентификаторыОбъектов.Объект = ДополнительныеРеквизитыИСведения.Ссылка
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЗС
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И НЕ ДополнительныеРеквизитыИСведения.Ссылка В (&НеВыгружаемыеСвойства)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЗначенийПользовательскихПолей
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЗСК
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектДополнительныеРеквизиты.Свойство КАК Свойство,
	|	ОбъектДополнительныеРеквизиты.Значение КАК Значение,
	|	ОбъектДополнительныеРеквизиты.Ссылка КАК Объект
	|ПОМЕСТИТЬ ВТ_ЗначенияОбъектов
	|ИЗ
	|	Справочник.Партнеры.ДополнительныеРеквизиты КАК ОбъектДополнительныеРеквизиты
	|ГДЕ
	|	ОбъектДополнительныеРеквизиты.Ссылка В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъектДополнительныеРеквизиты.Свойство,
	|	ОбъектДополнительныеРеквизиты.Значение,
	|	ОбъектДополнительныеРеквизиты.Ссылка
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.ДополнительныеРеквизиты КАК ОбъектДополнительныеРеквизиты
	|ГДЕ
	|	ОбъектДополнительныеРеквизиты.Ссылка В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Свойство,
	|	ДополнительныеСведения.Значение,
	|	ДополнительныеСведения.Объект
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Свойство,
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗначенияОбъектов.Объект КАК Объект,
	|	ВТ_ЗначенияОбъектов.Свойство КАК Свойство,
	|	ВТ_ЗначенияОбъектов.Значение КАК Значение,
	|	ВТ_ИдентификаторыЗначенийПользовательскихПолей.Идентификатор КАК ИдентификаторЗначенияСвойстваБитрикс24
	|ПОМЕСТИТЬ ВТ_ЗначенияОбъектовСИд
	|ИЗ
	|	ВТ_ЗначенияОбъектов КАК ВТ_ЗначенияОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗначенийПользовательскихПолей КАК ВТ_ИдентификаторыЗначенийПользовательскихПолей
	|		ПО ВТ_ЗначенияОбъектов.Значение = ВТ_ИдентификаторыЗначенийПользовательскихПолей.Объект
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗначенияОбъектов";		
#КонецОбласти

	ДобавитьКЗапросуОбъектовДанныеФайлов(СтруктураНастроек, Запрос);   
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураИспВидовКИ = Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСтруктуруВидовКИКонтрагентов();
	
	мЭлементы 	=  Новый массив;
	
	ВыгружатьПартнеров 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Контакт", "Партнеры"				, "ВыгружатьНаПортал");
	ВыгружатьКонтактныхЛиц 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Контакт", "КонтактныеЛицаПартнеров", "ВыгружатьНаПортал");
	
	АлгоритмПриВыгрузкеДанныхНаПорталПартнеров 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Контакт", "Партнеры"				, "АлгоритмПриВыгрузкеДанныхНаПортал");
	АлгоритмПриВыгрузкеДанныхНаПорталКонтактныхЛиц	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Контакт", "КонтактныеЛицаПартнеров", "АлгоритмПриВыгрузкеДанныхНаПортал");
	
	ПоляПартнеров 			= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Контакт", "Партнеры");
	ПоляКонтактныхЛиц 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Контакт", "КонтактныеЛицаПартнеров");
	
	ОбновлятьНаПорталеПартнеров 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Контакт", "Партнеры"				, "ОбновлятьНаПортале");
	ОбновлятьНаПорталеКонтактныхЛиц 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Контакт", "КонтактныеЛицаПартнеров", "ОбновлятьНаПортале");
	
	Пока Выборка.Следующий() Цикл
		
		НеВыгружать = Ложь;
		Для каждого ТекЭлемент Из РезультатОбработкиПоискаПередДобавлениемНовых Цикл
			Если ТекЭлемент.Объект = Выборка.Объект И ТекЭлемент.Результат = "Ошибка" Тогда 	
				Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Ошибка, "Было найдено несколько контактов по алгоритму поиска для клиента: " + Выборка.Наименование + ". Будет пропущен");
				НеВыгружать = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если НеВыгружать Тогда
			Продолжить;
		КонецЕсли;
		
		СформированныйЗапрос = "";
		
		ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(Выборка.ИдентификаторБ24);
		
		Если НЕ Выборка.ЭтоКонтактноеЛицо И ВыгружатьПартнеров Тогда
			
			Если ЭтоНовыйЭлемент ИЛИ (НЕ ЭтоНовыйЭлемент И ОбновлятьНаПорталеПартнеров) Тогда 
				СформированныйЗапрос = СформироватьСтруктуруДанныхПоКонтакту(СтруктураНастроек, ПоляПартнеров, АлгоритмПриВыгрузкеДанныхНаПорталПартнеров, МенеджерВременныхТаблиц, Выборка, СтруктураИспВидовКИ);
			Иначе
				СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(Выборка.Идентификатор1С);
			КонецЕсли;
			
		ИначеЕсли Выборка.ЭтоКонтактноеЛицо И ВыгружатьКонтактныхЛиц Тогда
			
			Если ЭтоНовыйЭлемент ИЛИ (НЕ ЭтоНовыйЭлемент И ОбновлятьНаПорталеКонтактныхЛиц) Тогда 
				СформированныйЗапрос = СформироватьСтруктуруДанныхПоКонтакту(СтруктураНастроек, ПоляКонтактныхЛиц, АлгоритмПриВыгрузкеДанныхНаПорталКонтактныхЛиц, МенеджерВременныхТаблиц, Выборка, СтруктураИспВидовКИ);
			Иначе
				СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(Выборка.Идентификатор1С);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоКонтакту(СтруктураНастроек, ИнформацияОПолях, АлгоритмПриВыгрузкеДанныхНаПортал, МенеджерВременныхТаблиц, ИнформацияОКонтакте, СтруктураИспВидовКИ)
	
	ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(ИнформацияОКонтакте.ИдентификаторБ24);
	
	Если ИнформацияОКонтакте.ЭтоКонтактноеЛицо И НЕ ЗначениеЗаполнено(ИнформацияОКонтакте.ИдентификаторКомпанииБитрикс24) Тогда
		СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(ИнформацияОКонтакте.Идентификатор1С);
		Возврат "";	
	КонецЕсли;
	
	КлючКонтакта = XMLСтрока(ИнформацияОКонтакте.Идентификатор1С);
	
#Область Контакт

	ИдентификаторБ24 = ИнформацияОКонтакте.ИдентификаторБ24;
	Если Лев(ИдентификаторБ24, 1) = "#" Тогда
		ИдентификаторБ24 = Прав(ИдентификаторБ24, СтрДлина(ИдентификаторБ24)-1);		
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИнформацияОПолях"			, ИнформацияОПолях);
	ДополнительныеПараметры.Вставить("КлючЭлемента"				, КлючКонтакта);
	ДополнительныеПараметры.Вставить("МенеджерВременныхТаблиц"	, МенеджерВременныхТаблиц);
	ДополнительныеПараметры.Вставить("ЭтоНовыйЭлемент"			, ЭтоНовыйЭлемент);
	ДополнительныеПараметры.Вставить("ИнформацияОбъекта1С"		, ИнформацияОКонтакте);

	Поля = ПолучитьСтруктуруКлючейЭлементаВыгрузки(СтруктураНастроек, ДополнительныеПараметры);
	
	Если СтруктураНастроек.Свойство("ДопИдПредопределенногоСвойстваВзаиморасчетов") И ЗначениеЗаполнено(СтруктураНастроек.ДопИдПредопределенногоСвойстваВзаиморасчетов) Тогда
		Долг = ИнформацияОКонтакте.ДолгПокупателя - ИнформацияОКонтакте.ДолгПоставщика;
		Поля.Вставить(СтруктураНастроек.ДопИдПредопределенногоСвойстваВзаиморасчетов, Долг)
	КонецЕсли;
		
	Если СтруктураНастроек.ОбрабатыватьУдалениеОбъектовВ1С Тогда
		Если ЗначениеЗаполнено(СтруктураНастроек.ДопИдПредопределенногоСвойстваПометкиУдаленияКонтакта) Тогда
			Поля.Вставить(СтруктураНастроек.ДопИдПредопределенногоСвойстваПометкиУдаленияКонтакта, ИнформацияОКонтакте.ПометкаУдаления)
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураНастроек.ДопИдПредопределенногоСвойстваПолаКонтакта) Тогда
		Поля.Вставить(СтруктураНастроек.ДопИдПредопределенногоСвойстваПолаКонтакта, ИнформацияОКонтакте.ИдентификаторБ24Пола)
	КонецЕсли;         
	
	ЗаполнитьЗначенияПользовательскихПолей(СтруктураНастроек, МенеджерВременныхТаблиц, ИнформацияОКонтакте.Объект, Поля, ИнформацияОПолях);	
	
	
	Если ЗначениеЗаполнено(АлгоритмПриВыгрузкеДанныхНаПортал) Тогда
		ВыполнитьАлгоритмПередВыгрузкой(СтруктураНастроек, ИнформацияОКонтакте.Объект, Поля, АлгоритмПриВыгрузкеДанныхНаПортал)
	КонецЕсли;
	
	
	ТелоЗапроса = "";
	Для каждого ТекПоле Из Поля Цикл
		Если ТекПоле.Значение <> Неопределено Тогда
			ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
		КонецЕсли;	
	КонецЦикла;    
	
	ЗаполнениеТелефонаИПочтыДляПартнера(СтруктураНастроек, ИнформацияОКонтакте.Объект, МенеджерВременныхТаблиц, СтруктураИспВидовКИ, ТелоЗапроса);
	
	ТелоЗапроса = ТелоЗапроса + ДанныеРестКлючаФайлов(СтруктураНастроек, МенеджерВременныхТаблиц, ИнформацияОКонтакте.Объект);
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючКонтакта+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.contact.add?" + ТелоЗапроса);	
	Иначе
		СтрокаЗапроса = "cmd["+КлючКонтакта+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.contact.update?id=" + ИдентификаторБ24 + "&"  + ТелоЗапроса);	
	КонецЕсли;
				
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючКонтакта, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.Контакт, ИнформацияОКонтакте.Идентификатор1С));

#КонецОбласти
	
	
#Область ДелоКонтакта	

	ТелоДела = Б24_К_ВыгрузкаДелВызовСервера.ПолучитьТелоЗапросаДела(СтруктураНастроек, Б24_К_RestApiВызовСервера.ПолучитьТипВладельцаТаймЛайнПоТипуДанных(СтруктураНастроек.ТипыОбъектовОбмена.Контакт), ИнформацияОКонтакте.Идентификатор1С, Строка(ИнформацияОКонтакте.Идентификатор1С), ИдентификаторБ24, КлючКонтакта);   

	Если ЗначениеЗаполнено(ТелоДела) Тогда
		
		КлючДела = "D_" + КлючКонтакта;
		
		ИдентификаторДела = РегистрыСведений.Б24_К_ИдентификаторыДел.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.ДелоКонтакта, ИнформацияОКонтакте.Объект);
		
		СтрокаЗапроса = СтрокаЗапроса + Б24_К_ВыгрузкаДелВызовСервера.ПолучитьЗапросДела(СтруктураНастроек, КлючДела, ИдентификаторДела, ТелоДела);
				
		СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючДела, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.ДелоКонтакта, ИнформацияОКонтакте.Идентификатор1С));
	
	КонецЕсли;

#КонецОбласти
	
	Возврат СтрокаЗапроса;
	
КонецФункции

#КонецОбласти


#Область Реквизиты  

Функция СформироватьДанныеПоРеквизитам(пСтруктураНастроек, МассивДанных) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	РезультатОбработкиПоискаПередДобавлениемНовых = ПроверитьНаличиеРеквизитовПередДобавлениемНовых(СтруктураНастроек, МассивДанных);
	
	Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование запросов для реквизитов");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область ФормированиеВременныхТаблицДанных
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивДанных", МассивДанных);
	Запрос.УстановитьПараметр("ТипДанных"	, СтруктураНастроек.ТипыОбъектовОбмена.Реквизит);
	Запрос.УстановитьПараметр("ТипДанныхКомпания"	, СтруктураНастроек.ТипыОбъектовОбмена.Компания);
	Запрос.УстановитьПараметр("ТипДанныхКонтакт"	, СтруктураНастроек.ТипыОбъектовОбмена.Контакт);
	Запрос.УстановитьПараметр("ТипДанныхАдресЮ"		, СтруктураНастроек.ТипыОбъектовОбмена.ЮрАдресРеквизита);
	Запрос.УстановитьПараметр("ТипДанныхАдресФ"		, СтруктураНастроек.ТипыОбъектовОбмена.ФактАдресРеквизита);
	Запрос.УстановитьПараметр("ТипДанныхАдресД"		, СтруктураНастроек.ТипыОбъектовОбмена.АдресДоставкиРеквизита);
	Запрос.УстановитьПараметр("НазваниеСтраны"		, Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьНазваниеСтраны());
	Запрос.УстановитьПараметр("Портал"			 	, СтруктураНастроек.Портал);	
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыВладельцев
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И (Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхКомпания
	|			ИЛИ Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхКонтакт)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка КАК Объект,
	|	Контрагенты.Ссылка КАК Идентификатор1С,
	|	Контрагенты.ПометкаУдаления КАК ПометкаУдаления,
	|	Контрагенты.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(300)) КАК НаименованиеПолное,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.КодПоОКПО КАК КодПоОКПО,
	|	Контрагенты.СтранаРегистрации.Наименование КАК СтранаРегистрации,
	|	Контрагенты.РегистрационныйНомер КАК РегистрационныйНомер,
	|	Контрагенты.Партнер КАК Владелец,
	|	Контрагенты.ЮрФизЛицо КАК ЮрФизЛицо,
	|	Партнеры.ЮрФизЛицо КАК КомпанияЧастноеЛицо,
	|	ЛОЖЬ КАК ЭтоКомпания
	|ПОМЕСТИТЬ ВТ_Контрагенты
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|		ПО Контрагенты.Партнер = Партнеры.Ссылка
	|ГДЕ
	|	Контрагенты.Ссылка В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Организации.Ссылка,
	|	Организации.Ссылка,
	|	Организации.ПометкаУдаления,
	|	Организации.Наименование,
	|	ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(300)),
	|	Организации.ИНН,
	|	Организации.КПП,
	|	Организации.КодПоОКПО,
	|	&НазваниеСтраны,
	|	Организации.ОГРН,
	|	Организации.Ссылка,
	|	Организации.ЮрФизЛицо,
	|	ЗНАЧЕНИЕ(Перечисление.КомпанияЧастноеЛицо.Компания),
	|	ИСТИНА
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Контрагенты.Идентификатор1С КАК Идентификатор1С,
	|	ВТ_Контрагенты.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_Контрагенты.Наименование КАК Наименование,
	|	ВТ_Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
	|	ВТ_Контрагенты.ИНН КАК ИНН,
	|	ВТ_Контрагенты.КПП КАК КПП,
	|	ВТ_Контрагенты.КодПоОКПО КАК КодПоОКПО,
	|	ВТ_Контрагенты.СтранаРегистрации КАК Страна,
	|	ВТ_Контрагенты.РегистрационныйНомер КАК РегистрационныйНомер,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБ24,
	|	ВТ_ИдентификаторыВладельцев.Идентификатор КАК ИдентификаторБ24Владельца,
	|	ВТ_Контрагенты.ЭтоКомпания КАК ЭтоКомпания,
	|	ВТ_Контрагенты.ЮрФизЛицо КАК ТипКонтрагента,
	|	ВТ_Контрагенты.КомпанияЧастноеЛицо КАК ТипПартнера,
	|	ВТ_Контрагенты.Объект КАК Объект
	|ИЗ
	|	ВТ_Контрагенты КАК ВТ_Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|		ПО ВТ_Контрагенты.Объект = ВТ_ИдентификаторыОбъектов.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыВладельцев КАК ВТ_ИдентификаторыВладельцев
	|		ПО ВТ_Контрагенты.Владелец = ВТ_ИдентификаторыВладельцев.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыВладельцев
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Объект,
	|	КонтрагентыКонтактнаяИнформация.Представление КАК Представление,
	|	КонтрагентыКонтактнаяИнформация.Страна КАК Страна,
	|	КонтрагентыКонтактнаяИнформация.Регион КАК Регион,
	|	КонтрагентыКонтактнаяИнформация.Город КАК Город,
	|	КонтрагентыКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|	КонтрагентыКонтактнаяИнформация.Вид КАК Вид
	|ПОМЕСТИТЬ ВТ_КИ
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Ссылка,
	|	ОрганизацииКонтактнаяИнформация.Представление,
	|	ОрганизацииКонтактнаяИнформация.Страна,
	|	ОрганизацииКонтактнаяИнформация.Регион,
	|	ОрганизацииКонтактнаяИнформация.Город,
	|	ОрганизацииКонтактнаяИнформация.ЗначенияПолей,
	|	ОрганизацииКонтактнаяИнформация.Вид
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Ссылка В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор,
	|	""6"" КАК ТипАдреса
	|ПОМЕСТИТЬ ВТ_ИдентификаторыАдресов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхАдресЮ
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор,
	|	""1""
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхАдресФ
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор,
	|	""11""
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхАдресД
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)";	
#КонецОбласти 

	Выборка = Запрос.Выполнить().Выбрать();
	
	мЭлементы 	=  Новый массив;
	
	ВыгружатьКонтрагентов 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Реквизит", "Контрагенты", "ВыгружатьНаПортал");
	ВыгружатьОрганизации 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Реквизит", "Организации", "ВыгружатьНаПортал");
	
	АлгоритмПриВыгрузкеДанныхНаПорталКонтрагентов 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Реквизит", "Контрагенты", "АлгоритмПриВыгрузкеДанныхНаПортал");
	АлгоритмПриВыгрузкеДанныхНаПорталОрганизаций	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Реквизит", "Организации", "АлгоритмПриВыгрузкеДанныхНаПортал");
	
	ПоляКонтрагентов 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Реквизит", "Контрагенты");
	ПоляОрганизаций 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Реквизит", "Организации");
	
	ОбновлятьНаПорталеКонтрагентов 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Реквизит", "Контрагенты", "ОбновлятьНаПортале");
	ОбновлятьНаПорталеОрганизации 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Реквизит", "Организации", "ОбновлятьНаПортале");
	
	Пока Выборка.Следующий() Цикл
		
		НеВыгружать = Ложь;
		Для каждого ТекЭлемент Из РезультатОбработкиПоискаПередДобавлениемНовых Цикл
			Если ТекЭлемент.Объект = Выборка.Объект И ТекЭлемент.Результат = "Ошибка" Тогда 	
				Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Ошибка, "Было найдено несколько реквизитов по алгоритму поиска для клиента: " + Выборка.Наименование + ". Будет пропущен");
				НеВыгружать = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если НеВыгружать Тогда
			Продолжить;
		КонецЕсли;

		СформированныйЗапрос = "";
		
		ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(Выборка.ИдентификаторБ24);
		
		Если НЕ Выборка.ЭтоКомпания  И ВыгружатьКонтрагентов Тогда
			
			Если ЭтоНовыйЭлемент ИЛИ (НЕ ЭтоНовыйЭлемент И ОбновлятьНаПорталеКонтрагентов) Тогда 
				СформированныйЗапрос = СформироватьСтруктуруДанныхПоРеквизиту(СтруктураНастроек, ПоляКонтрагентов, АлгоритмПриВыгрузкеДанныхНаПорталКонтрагентов, МенеджерВременныхТаблиц, Выборка);
			Иначе
				СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(Выборка.Идентификатор1С);
			КонецЕсли;
			
		ИначеЕсли Выборка.ЭтоКомпания И ВыгружатьОрганизации Тогда
			
			Если ЭтоНовыйЭлемент ИЛИ (НЕ ЭтоНовыйЭлемент И ОбновлятьНаПорталеОрганизации) Тогда 
				СформированныйЗапрос = СформироватьСтруктуруДанныхПоРеквизиту(СтруктураНастроек, ПоляОрганизаций, АлгоритмПриВыгрузкеДанныхНаПорталОрганизаций, МенеджерВременныхТаблиц, Выборка);
			Иначе
				СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(Выборка.Идентификатор1С);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов 	= СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	
	пСтруктураНастроек.Логирование.НомерСообщения	 	= СтруктураНастроек.Логирование.НомерСообщения; 	
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоРеквизиту(СтруктураНастроек, ИнформацияОПолях, АлгоритмПриВыгрузкеДанныхНаПортал, МенеджерВременныхТаблиц, ИнформацияОРеквизите)
	
	ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(ИнформацияОРеквизите.ИдентификаторБ24);
	
#Область Реквизиты	
	
	КлючРеквизита = XMLСтрока(ИнформацияОРеквизите.Идентификатор1С);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИнформацияОПолях"			, ИнформацияОПолях);
	ДополнительныеПараметры.Вставить("КлючЭлемента"				, КлючРеквизита);
	ДополнительныеПараметры.Вставить("МенеджерВременныхТаблиц"	, МенеджерВременныхТаблиц);
	ДополнительныеПараметры.Вставить("ЭтоНовыйЭлемент"			, ЭтоНовыйЭлемент);
	ДополнительныеПараметры.Вставить("ИнформацияОбъекта1С"		, ИнформацияОРеквизите);

	Поля = ПолучитьСтруктуруКлючейЭлементаВыгрузки(СтруктураНастроек, ДополнительныеПараметры);
	
	Если ЗначениеЗаполнено(АлгоритмПриВыгрузкеДанныхНаПортал) Тогда
		ВыполнитьАлгоритмПередВыгрузкой(СтруктураНастроек, ИнформацияОРеквизите.Объект, Поля, АлгоритмПриВыгрузкеДанныхНаПортал)
	КонецЕсли;
	
	ТелоЗапросаРеквизита = "";
	Для каждого ТекПоле Из Поля Цикл
		Если ТекПоле.Значение <> Неопределено Тогда
			ТелоЗапросаРеквизита = ТелоЗапросаРеквизита + ?(СтрДлина(ТелоЗапросаРеквизита) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
		КонецЕсли;	
	КонецЦикла;  
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+ КлючРеквизита + "]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.add?" + ТелоЗапросаРеквизита);	
	Иначе
		СтрокаЗапроса = "cmd["+ КлючРеквизита + "]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.update?id=" + ИнформацияОРеквизите.ИдентификаторБ24 + "&"  + ТелоЗапросаРеквизита);	
	КонецЕсли;
				
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючРеквизита, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.Реквизит, ИнформацияОРеквизите.Идентификатор1С));
	
#КонецОбласти	

#Область Адреса      
	Если НЕ СтруктураНастроек.НеВыгружатьАдресаРеквизитов Тогда    
		
		мАдреса = Новый Массив;
		
		ВидыКонтактнойИнформации = Новый Структура;
		ВидыКонтактнойИнформации.Вставить("ВидКИ"	, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
		ВидыКонтактнойИнформации.Вставить("ВидКИОрг", Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
		ВидыКонтактнойИнформации.Вставить("ТипАдреса", "1");
		ВидыКонтактнойИнформации.Вставить("ТипДанных", СтруктураНастроек.ТипыОбъектовОбмена.ФактАдресРеквизита);
		мАдреса.Добавить(ВидыКонтактнойИнформации);
		
		ВидыКонтактнойИнформации = Новый Структура;
		ВидыКонтактнойИнформации.Вставить("ВидКИ"	, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
		ВидыКонтактнойИнформации.Вставить("ВидКИОрг", Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
		ВидыКонтактнойИнформации.Вставить("ТипАдреса", "6");
		ВидыКонтактнойИнформации.Вставить("ТипДанных", СтруктураНастроек.ТипыОбъектовОбмена.ЮрАдресРеквизита);
		мАдреса.Добавить(ВидыКонтактнойИнформации);	

		ВидыКонтактнойИнформации = Новый Структура;
		ВидыКонтактнойИнформации.Вставить("ВидКИ"	, Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента);
		ВидыКонтактнойИнформации.Вставить("ВидКИОрг", Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
		ВидыКонтактнойИнформации.Вставить("ТипАдреса", "11");
		ВидыКонтактнойИнформации.Вставить("ТипДанных", СтруктураНастроек.ТипыОбъектовОбмена.АдресДоставкиРеквизита);
		мАдреса.Добавить(ВидыКонтактнойИнформации);	

		Для каждого ТекАдрес Из мАдреса Цикл
			                                                    
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.УстановитьПараметр("Объект"		, ИнформацияОРеквизите.Идентификатор1С);
			Запрос.УстановитьПараметр("ВидКИ"		, ТекАдрес.ВидКИ);
			Запрос.УстановитьПараметр("ВидКИОрг"	, ТекАдрес.ВидКИОрг);
			Запрос.УстановитьПараметр("ТипАдреса"	, ТекАдрес.ТипАдреса);
			Запрос.Текст = "ВЫБРАТЬ
			|	ВТ_КИ.Объект КАК Объект,
			|	ВТ_КИ.Представление КАК Представление,
			|	ВТ_КИ.Страна КАК Страна,
			|	ВТ_КИ.Регион КАК Регион,
			|	ВТ_КИ.Город КАК Город,
			|	ВТ_КИ.ЗначенияПолей КАК ЗначенияПолей,
			|	ВТ_ИдентификаторыАдресов.Идентификатор КАК ИдентификаторБ24
			|ИЗ
			|	ВТ_КИ КАК ВТ_КИ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыАдресов КАК ВТ_ИдентификаторыАдресов
			|		ПО ВТ_КИ.Объект = ВТ_ИдентификаторыАдресов.Объект
			|			И (ВТ_ИдентификаторыАдресов.ТипАдреса = &ТипАдреса)
			|ГДЕ
			|	ВТ_КИ.Объект = &Объект
			|	И (ВТ_КИ.Вид = &ВидКИ
			|			ИЛИ ВТ_КИ.Вид = &ВидКИОрг)";
			
			ВыполненныйЗапрос = Запрос.Выполнить();
			Если НЕ ВыполненныйЗапрос.Пустой() Тогда 
				
				Поля = Новый Структура;
				Поля.Вставить("ENTITY_TYPE_ID", "8");
				Поля.Вставить("TYPE_ID", ТекАдрес.ТипАдреса);
				
				ИнформацияОАдресе = ВыполненныйЗапрос.Выбрать();
				Пока ИнформацияОАдресе.Следующий() Цикл
					
					Б24_К_РаботаСАдресамиСервер.ДобавитьПоляАдресаВСтруктуруВыгрузки(Поля, ИнформацияОАдресе); 			
					
					ВремТелоЗапросаАдреса = "";
					Для каждого ТекПоле Из Поля Цикл
						ВремТелоЗапросаАдреса = ВремТелоЗапросаАдреса + ?(СтрДлина(ВремТелоЗапросаАдреса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
					КонецЦикла;  
					
					Если ЭтоНовыйЭлемент Тогда
						ВремТелоЗапросаАдреса = ВремТелоЗапросаАдреса + "&fields[ENTITY_ID]=$result["+ Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(XMLСтрока(КлючРеквизита))+"]";
					Иначе
						ВремТелоЗапросаАдреса = ВремТелоЗапросаАдреса + "&fields[ENTITY_ID]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИнформацияОРеквизите.ИдентификаторБ24);
					КонецЕсли;
					
					КлючАдреса = ТекАдрес.ТипАдреса + "_" + КлючРеквизита;
					Если НЕ ЗначениеЗаполнено(ИнформацияОАдресе.ИдентификаторБ24) Тогда
						СтрокаЗапроса = СтрокаЗапроса + "&" + "cmd["+КлючАдреса+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.address.add?" + ВремТелоЗапросаАдреса);	
					Иначе
						СтрокаЗапроса = СтрокаЗапроса + "&" + "cmd["+КлючАдреса+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.address.update?" + ВремТелоЗапросаАдреса);	
					КонецЕсли;
					
					СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючАдреса, ПолучитьСтруктуруКлючейБатчЗапросов(ТекАдрес.ТипДанных, ИнформацияОРеквизите.Идентификатор1С,,Истина));
						
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
#КонецОбласти

	Возврат СтрокаЗапроса;
	
КонецФункции

#КонецОбласти


#Область БанкСчета  

Функция СформироватьДанныеПоБанковскимСчетамКомпанийКонтактов(пСтруктураНастроек, МассивДанных) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	РезультатОбработкиПоискаПередДобавлениемНовых = ПроверитьНаличиеБанкСчетовПередДобавлениемНовых(СтруктураНастроек, МассивДанных);
	
	Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Формирование запросов для банковских счетов");
	
	МассивВладельцев = Новый Массив;
	
	Для каждого ТекЗначение Из МассивДанных Цикл
		МассивВладельцев.Добавить(ТекЗначение.Владелец);	
	КонецЦикла;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
#Область Реквизиты	
	Запрос.УстановитьПараметр("МассивДанных"	, МассивДанных);
	Запрос.УстановитьПараметр("МассивВладельцев", МассивВладельцев);
	Запрос.УстановитьПараметр("ТипДанных"		, СтруктураНастроек.ТипыОбъектовОбмена.БанковскийСчетРеквизита);
	Запрос.УстановитьПараметр("ТипДанныхРеквизит", СтруктураНастроек.ТипыОбъектовОбмена.Реквизит);
	Запрос.УстановитьПараметр("Портал"			 , СтруктураНастроек.Портал);
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыВладельцев
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхРеквизит
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивВладельцев)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БанковскиеСчетаОрганизаций.Ссылка КАК Объект,
	|	БанковскиеСчетаОрганизаций.Ссылка КАК Идентификатор1С,
	|	БанковскиеСчетаОрганизаций.ПометкаУдаления КАК ПометкаУдаления,
	|	БанковскиеСчетаОрганизаций.Наименование КАК Наименование,
	|	БанковскиеСчетаОрганизаций.НомерСчета КАК НомерСчета,
	|	БанковскиеСчетаОрганизаций.Банк КАК Банк,
	|	КлассификаторБанков.Код КАК КодБанка,
	|	КлассификаторБанков.КоррСчет КАК КоррСчетБанка,
	|	КлассификаторБанков.Адрес КАК АдресБанка,
	|	КлассификаторБанков.Город КАК ГородБанка,
	|	КлассификаторБанков.Наименование КАК НаименованиеБанка,
	|	Валюты.Код КАК ВалютаКод,
	|	КлассификаторБанков.СВИФТБИК КАК СВИФТБИК,
	|	КлассификаторБанков.Код КАК БикБанка,
	|	БанковскиеСчетаОрганизаций.Владелец КАК Владелец,
	|	БанковскиеСчетаОрганизаций.СВИФТБанка КАК СВИФТБанкаВСчете,
	|	БанковскиеСчетаОрганизаций.НаименованиеБанка КАК НаименованиеБанкаВСчете,
	|	ВЫРАЗИТЬ(БанковскиеСчетаОрганизаций.АдресБанка КАК СТРОКА(300)) КАК АдресБанкаВСчете,
	|	БанковскиеСчетаОрганизаций.БИКБанка КАК БИКБанкаВСчете,
	|	ЛОЖЬ КАК ЭтоБанкСчетКлиента
	|ПОМЕСТИТЬ ВТ_БанковскиеСчета
	|ИЗ
	|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|		ПО БанковскиеСчетаОрганизаций.Банк = КлассификаторБанков.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО БанковскиеСчетаОрганизаций.ВалютаДенежныхСредств = Валюты.Ссылка
	|ГДЕ
	|	БанковскиеСчетаОрганизаций.Ссылка В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БанковскиеСчетаКонтрагентов.Ссылка,
	|	БанковскиеСчетаКонтрагентов.Ссылка,
	|	БанковскиеСчетаКонтрагентов.ПометкаУдаления,
	|	БанковскиеСчетаКонтрагентов.Наименование,
	|	БанковскиеСчетаКонтрагентов.НомерСчета,
	|	БанковскиеСчетаКонтрагентов.Банк,
	|	КлассификаторБанков.Код,
	|	КлассификаторБанков.КоррСчет,
	|	КлассификаторБанков.Адрес,
	|	КлассификаторБанков.Город,
	|	КлассификаторБанков.Наименование,
	|	Валюты.Код,
	|	КлассификаторБанков.СВИФТБИК,
	|	КлассификаторБанков.Код,
	|	БанковскиеСчетаКонтрагентов.Владелец,
	|	БанковскиеСчетаКонтрагентов.СВИФТБанка,
	|	БанковскиеСчетаКонтрагентов.НаименованиеБанка,
	|	ВЫРАЗИТЬ(БанковскиеСчетаКонтрагентов.АдресБанка КАК СТРОКА(300)),
	|	БанковскиеСчетаКонтрагентов.БИКБанка,
	|	ИСТИНА
	|ИЗ
	|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|		ПО БанковскиеСчетаКонтрагентов.Банк = КлассификаторБанков.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО БанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств = Валюты.Ссылка
	|ГДЕ
	|	БанковскиеСчетаКонтрагентов.Ссылка В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_БанковскиеСчета.Объект КАК Объект,
	|	ВТ_БанковскиеСчета.Идентификатор1С КАК Идентификатор1С,
	|	ВТ_БанковскиеСчета.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_БанковскиеСчета.НомерСчета КАК НомерСчета,
	|	ВТ_БанковскиеСчета.Банк КАК Банк,
	|	ВТ_ИдентификаторыВладельцев.Идентификатор КАК ИдентификаторБ24Владельца,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБ24,
	|	ВТ_БанковскиеСчета.КодБанка КАК КодБанка,
	|	ВТ_БанковскиеСчета.КоррСчетБанка КАК КоррСчетБанка,
	|	ВТ_БанковскиеСчета.АдресБанка КАК АдресБанка,
	|	ВТ_БанковскиеСчета.ГородБанка КАК ГородБанка,
	|	ВТ_БанковскиеСчета.НаименованиеБанка КАК НаименованиеБанка,
	|	ВТ_БанковскиеСчета.ВалютаКод КАК ВалютаКод,
	|	ВТ_БанковскиеСчета.СВИФТБИК КАК СВИФТБИК,
	|	ВТ_БанковскиеСчета.БикБанка КАК БикБанка,
	|	ВТ_БанковскиеСчета.Наименование КАК Наименование,
	|	ВТ_БанковскиеСчета.СВИФТБанкаВСчете КАК СВИФТБанкаВСчете,
	|	ВТ_БанковскиеСчета.НаименованиеБанкаВСчете КАК НаименованиеБанкаВСчете,
	|	ВТ_БанковскиеСчета.АдресБанкаВСчете КАК АдресБанкаВСчете,
	|	ВТ_БанковскиеСчета.БИКБанкаВСчете КАК БИКБанкаВСчете,
	|	ВТ_БанковскиеСчета.Владелец КАК Владелец,
	|	ВТ_БанковскиеСчета.ЭтоБанкСчетКлиента КАК ЭтоБанкСчетКлиента
	|ИЗ
	|	ВТ_БанковскиеСчета КАК ВТ_БанковскиеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыВладельцев КАК ВТ_ИдентификаторыВладельцев
	|		ПО ВТ_БанковскиеСчета.Владелец = ВТ_ИдентификаторыВладельцев.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|		ПО ВТ_БанковскиеСчета.Объект = ВТ_ИдентификаторыОбъектов.Объект";
#КонецОбласти 

	Выборка = Запрос.Выполнить().Выбрать();
	
	мЭлементы 	=  Новый массив;
	
	ВыгружатьБанкСчетаКлиентов 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Банковский счет", "БанковскиеСчетаКонтрагентов", "ВыгружатьНаПортал");
	ВыгружатьБанкСчетаОрганизаций 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Банковский счет", "БанковскиеСчетаОрганизаций"	, "ВыгружатьНаПортал");
	
	АлгоритмПриВыгрузкеДанныхНаПорталБанкСчетовКлиентов 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Банковский счет", "БанковскиеСчетаКонтрагентов", "АлгоритмПриВыгрузкеДанныхНаПортал");
	АлгоритмПриВыгрузкеДанныхНаПорталБанкСчетовОрганизаций	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Банковский счет", "БанковскиеСчетаОрганизаций"	, "АлгоритмПриВыгрузкеДанныхНаПортал");
	
	ПоляБанкСчетовКлиентов 			= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Банковский счет", "БанковскиеСчетаКонтрагентов");
	ПоляБанкСчетовОрганизаций 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Банковский счет", "БанковскиеСчетаОрганизаций");
	
	ОбновлятьНаПорталеБанкСчетаКлиентов 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Банковский счет", "БанковскиеСчетаКонтрагентов", "ОбновлятьНаПортале");
	ОбновлятьНаПорталеБанкСчетаОрганизаций 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Банковский счет", "БанковскиеСчетаОрганизаций"	, "ОбновлятьНаПортале");
	
	Пока Выборка.Следующий() Цикл
		
		НеВыгружать = Ложь;
		Для каждого ТекЭлемент Из РезультатОбработкиПоискаПередДобавлениемНовых Цикл
			Если ТекЭлемент.Объект = Выборка.Объект И ТекЭлемент.Результат = "Ошибка" Тогда 	
				Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Ошибка, "Было найдено несколько банковских счетов по алгоритму поиска для: " + Выборка.Наименование + ". Будет пропущен");
				НеВыгружать = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если НеВыгружать Тогда
			Продолжить;
		КонецЕсли;
		
		СформированныйЗапрос = "";
		
		ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(Выборка.ИдентификаторБ24);
		
		Если Выборка.ЭтоБанкСчетКлиента И ВыгружатьБанкСчетаКлиентов Тогда
			
			Если ЭтоНовыйЭлемент ИЛИ (НЕ ЭтоНовыйЭлемент И ОбновлятьНаПорталеБанкСчетаКлиентов) Тогда 
				СформированныйЗапрос = СформироватьСтруктуруДанныхПоБанковскомуСчету(СтруктураНастроек, ПоляБанкСчетовКлиентов, АлгоритмПриВыгрузкеДанныхНаПорталБанкСчетовКлиентов, МенеджерВременныхТаблиц, Выборка);
			Иначе
				СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(Выборка.Идентификатор1С);
			КонецЕсли;
			
		ИначеЕсли НЕ Выборка.ЭтоБанкСчетКлиента И ВыгружатьБанкСчетаОрганизаций Тогда
			
			Если ЭтоНовыйЭлемент ИЛИ (НЕ ЭтоНовыйЭлемент И ОбновлятьНаПорталеБанкСчетаОрганизаций) Тогда 
				СформированныйЗапрос = СформироватьСтруктуруДанныхПоБанковскомуСчету(СтруктураНастроек, ПоляБанкСчетовОрганизаций, АлгоритмПриВыгрузкеДанныхНаПорталБанкСчетовОрганизаций, МенеджерВременныхТаблиц, Выборка);
			Иначе
				СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(Выборка.Идентификатор1С);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов 	= СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	
	пСтруктураНастроек.Логирование.НомерСообщения	 	= СтруктураНастроек.Логирование.НомерСообщения; 	
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоБанковскомуСчету(СтруктураНастроек, ИнформацияОПолях, АлгоритмПриВыгрузкеДанныхНаПортал, МенеджерВременныхТаблиц, ИнформацияОБанковскомСчете)
	
	ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(ИнформацияОБанковскомСчете.ИдентификаторБ24);
	
	КлючСчета = XMLСтрока(ИнформацияОБанковскомСчете.Идентификатор1С);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИнформацияОПолях"			, ИнформацияОПолях);
	ДополнительныеПараметры.Вставить("КлючЭлемента"				, КлючСчета);
	ДополнительныеПараметры.Вставить("МенеджерВременныхТаблиц"	, МенеджерВременныхТаблиц);
	ДополнительныеПараметры.Вставить("ЭтоНовыйЭлемент"			, ЭтоНовыйЭлемент);
	ДополнительныеПараметры.Вставить("ИнформацияОбъекта1С"		, ИнформацияОБанковскомСчете);

	Поля = ПолучитьСтруктуруКлючейЭлементаВыгрузки(СтруктураНастроек, ДополнительныеПараметры);
	
	Если ЗначениеЗаполнено(АлгоритмПриВыгрузкеДанныхНаПортал) Тогда
		ВыполнитьАлгоритмПередВыгрузкой(СтруктураНастроек, ИнформацияОБанковскомСчете.Объект, Поля, АлгоритмПриВыгрузкеДанныхНаПортал)
	КонецЕсли;
	
	ТелоЗапроса = "";
	Для каждого ТекПоле Из Поля Цикл
		Если ТекПоле.Значение <> Неопределено Тогда
			ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
		КонецЕсли;	
	КонецЦикла;    
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючСчета+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.bankdetail.add?" + ТелоЗапроса);	
	Иначе
		СтрокаЗапроса = "cmd["+КлючСчета+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.bankdetail.update?id=" + ИнформацияОБанковскомСчете.ИдентификаторБ24 + "&"  + ТелоЗапроса);	
	КонецЕсли;
	
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючСчета, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.БанковскийСчетРеквизита, ИнформацияОБанковскомСчете.Идентификатор1С));
					
	Возврат СтрокаЗапроса;
	
КонецФункции

#КонецОбласти


#Область ГруппыТоваров  

Функция СформироватьДанныеПоГруппамТоваров(пСтруктураНастроек, МассивДанных) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(СтруктураНастроек.НастройкиСинхронизацииТоваров.ДеревоГрупп) Тогда
		лИмяСправочника = "Б24_КС_ПользовательскиеГруппыТоваров";
	Иначе
		лИмяСправочника = "Номенклатура";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДанных"	, МассивДанных);
	Запрос.УстановитьПараметр("ТипДанных"		, СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара);
	Запрос.УстановитьПараметр("Портал"			, СтруктураНастроек.Портал);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыРодителей
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СправочникГрупп.Ссылка КАК Объект,
	|	СправочникГрупп.Родитель КАК Родитель,
	|	СправочникГрупп.Ссылка КАК Идентификатор1С,
	|	СправочникГрупп.ПометкаУдаления КАК ПометкаУдаления,
	|	СправочникГрупп.Наименование КАК Наименование,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБ24,
	|	ВТ_ИдентификаторыРодителей.Идентификатор КАК ИдентификаторБ24Родителя
	|ИЗ
	|	Справочник."+лИмяСправочника+" КАК СправочникГрупп
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|		ПО (ВТ_ИдентификаторыОбъектов.Объект = СправочникГрупп.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыРодителей КАК ВТ_ИдентификаторыРодителей
	|		ПО СправочникГрупп.Родитель = ВТ_ИдентификаторыРодителей.Объект
	|ГДЕ
	|	СправочникГрупп.Ссылка В(&МассивДанных)";
	
	
	тзнГрупп = Запрос.Выполнить().Выгрузить();
		
	мДанные = Новый Массив;
	Для каждого ТекЭлемент Из тзнГрупп Цикл
		
		Если ЗначениеЗаполнено(ТекЭлемент.Родитель) Тогда
			ОтсортироватьГруппыРекурсивно(мДанные, тзнГрупп, ТекЭлемент);
		Иначе
			Если мДанные.Найти(ТекЭлемент) = Неопределено Тогда
				мДанные.Добавить(ТекЭлемент);
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;

	мЭлементы 	= Новый массив;
	мГруппы		= Новый Массив;
	Для каждого ТекЭлемент Из мДанные Цикл
		
		СформированныйЗапрос = СформироватьСтруктуруДанныхПоГруппеНоменклатуры(СтруктураНастроек, ТекЭлемент, НЕ ЗначениеЗаполнено(ТекЭлемент.ИдентификаторБ24), мГруппы);
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	// чтобы лог не затерся.
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоГруппеНоменклатуры(СтруктураНастроек, ИнформацияОГруппаНоменклатуры, ЭтоНовыйЭлемент, мГруппы)
	
	КлючГруппы = XMLСтрока(ИнформацияОГруппаНоменклатуры.Идентификатор1С);	
	
	Поля = Новый Структура;
	
	Поля.Вставить("XML_ID"			, КлючГруппы);  	
	Поля.Вставить("NAME"			, ИнформацияОГруппаНоменклатуры.Наименование);
	
	ТелоЗапроса = "";	
	Для каждого ТекПоле Из Поля Цикл		
		ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
	КонецЦикла; 
	
	
	Если ЗначениеЗаполнено(ИнформацияОГруппаНоменклатуры.Родитель) И НЕ ЗначениеЗаполнено(ИнформацияОГруппаНоменклатуры.ИдентификаторБ24Родителя) Тогда	
		Если мГруппы.Найти(ИнформацияОГруппаНоменклатуры.Родитель) <> Неопределено Тогда
			ТелоЗапроса = ТелоЗапроса + "&fields[SECTION_ID]=" + "$result["+ Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(XMLСтрока(ИнформацияОГруппаНоменклатуры.Родитель))+"]";
		КонецЕсли;	
	Иначе
		ТелоЗапроса = ТелоЗапроса + "&fields[SECTION_ID]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(?(ЗначениеЗаполнено(ИнформацияОГруппаНоменклатуры.ИдентификаторБ24Родителя), ИнформацияОГруппаНоменклатуры.ИдентификаторБ24Родителя, ""));
	КонецЕсли;
	
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючГруппы+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.productsection.add?" + ТелоЗапроса);	
	Иначе
		СтрокаЗапроса = "cmd["+КлючГруппы+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.productsection.update?id=" + ИнформацияОГруппаНоменклатуры.ИдентификаторБ24 + "&"  + ТелоЗапроса);	
	КонецЕсли;

	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючГруппы, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара, ИнформацияОГруппаНоменклатуры.Идентификатор1С));
					
	
	мГруппы.Добавить(ИнформацияОГруппаНоменклатуры.Объект); 	
	
	Возврат СтрокаЗапроса;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////  

Функция СформироватьДанныеПоГруппамТоваров2(пСтруктураНастроек, МассивДанных) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	Если СтруктураНастроек.НастройкиСинхронизацииТоваров.ИсточникИерархии = "Произвольная иерархия" 
		И ЗначениеЗаполнено(СтруктураНастроек.НастройкиСинхронизацииТоваров.ДеревоГрупп) Тогда
		лИмяСправочника = "Б24_КС_ПользовательскиеГруппыТоваров";
	ИначеЕсли СтруктураНастроек.НастройкиСинхронизацииТоваров.ИсточникИерархии = "Категории номенклатуры" Тогда	
		лИмяСправочника = "ВидыНоменклатуры";
	Иначе
		лИмяСправочника = "Номенклатура";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДанных"	, МассивДанных);
	Запрос.УстановитьПараметр("ТипДанных"		, СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара2);
	Запрос.УстановитьПараметр("Портал"			, СтруктураНастроек.Портал);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыРодителей
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СправочникГрупп.Ссылка КАК Объект,
	|	СправочникГрупп.Родитель КАК Родитель,
	|	СправочникГрупп.Ссылка КАК Идентификатор1С,
	|	СправочникГрупп.ПометкаУдаления КАК ПометкаУдаления,
	|	СправочникГрупп.Наименование КАК Наименование,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБ24,
	|	ВТ_ИдентификаторыРодителей.Идентификатор КАК ИдентификаторБ24Родителя
	|ИЗ
	|	Справочник."+лИмяСправочника+" КАК СправочникГрупп
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|		ПО (ВТ_ИдентификаторыОбъектов.Объект = СправочникГрупп.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыРодителей КАК ВТ_ИдентификаторыРодителей
	|		ПО СправочникГрупп.Родитель = ВТ_ИдентификаторыРодителей.Объект
	|ГДЕ
	|	СправочникГрупп.Ссылка В(&МассивДанных)";
	
	тзнГрупп = Запрос.Выполнить().Выгрузить();
		
	мДанные = Новый Массив;
	Для каждого ТекЭлемент Из тзнГрупп Цикл
		
		Если ЗначениеЗаполнено(ТекЭлемент.Родитель) Тогда
			ОтсортироватьГруппыРекурсивно(мДанные, тзнГрупп, ТекЭлемент);
		Иначе
			Если мДанные.Найти(ТекЭлемент) = Неопределено Тогда
				мДанные.Добавить(ТекЭлемент);
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;

	мЭлементы 	= Новый массив;
	мГруппы		= Новый Массив;
	Для каждого ТекЭлемент Из мДанные Цикл
		
		СформированныйЗапрос = СформироватьСтруктуруДанныхПоГруппеНоменклатуры2(СтруктураНастроек, ТекЭлемент, НЕ ЗначениеЗаполнено(ТекЭлемент.ИдентификаторБ24), мГруппы);
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	// чтобы лог не затерся.
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоГруппеНоменклатуры2(СтруктураНастроек, ИнформацияГруппыНоменклатуры, ЭтоНовыйЭлемент, мГруппы)
	
	КлючГруппы = XMLСтрока(ИнформацияГруппыНоменклатуры.Идентификатор1С);	
	
	Поля = Новый Структура;
	Поля.Вставить("iblockId", СтруктураНастроек.НастройкиСинхронизацииТоваров.ИдентификаторКаталогаТоваров);  	
	Поля.Вставить("xmlId"	, КлючГруппы);  	
	Поля.Вставить("name"	, ИнформацияГруппыНоменклатуры.Наименование);
	Поля.Вставить("active"	, ?(ИнформацияГруппыНоменклатуры.ПометкаУдаления, "N", "Y"));
	Поля.Вставить("code"	, СтроковыеФункции.СтрокаЛатиницей(ИнформацияГруппыНоменклатуры.Наименование));
	
	ТелоЗапроса = "";	
	Для каждого ТекПоле Из Поля Цикл		
		ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
	КонецЦикла; 
	
	
	Если ЗначениеЗаполнено(ИнформацияГруппыНоменклатуры.Родитель) И НЕ ЗначениеЗаполнено(ИнформацияГруппыНоменклатуры.ИдентификаторБ24Родителя) Тогда	
		Если мГруппы.Найти(ИнформацияГруппыНоменклатуры.Родитель) <> Неопределено Тогда
			ТелоЗапроса = ТелоЗапроса + "&fields[iblockSectionId]=" + "$result["+ Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(XMLСтрока(ИнформацияГруппыНоменклатуры.Родитель))+"][section][id]";
		Иначе
			ТелоЗапроса = ТелоЗапроса + "&fields[iblockSectionId]=";	
		КонецЕсли;	
	Иначе
		ТелоЗапроса = ТелоЗапроса + "&fields[iblockSectionId]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(?(ЗначениеЗаполнено(ИнформацияГруппыНоменклатуры.ИдентификаторБ24Родителя), ИнформацияГруппыНоменклатуры.ИдентификаторБ24Родителя, ""));
	КонецЕсли;
	
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючГруппы+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.section.add?" + ТелоЗапроса);	
	Иначе
		СтрокаЗапроса = "cmd["+КлючГруппы+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.section.update?id=" + ИнформацияГруппыНоменклатуры.ИдентификаторБ24 + "&"  + ТелоЗапроса);	
	КонецЕсли;

	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючГруппы, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара2, ИнформацияГруппыНоменклатуры.Идентификатор1С));
					
	
	мГруппы.Добавить(ИнформацияГруппыНоменклатуры.Объект); 	
	
	Возврат СтрокаЗапроса;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////  

Процедура ОтсортироватьГруппыРекурсивно(мДанные, тзнГрупп, ЭлементТзн)
	
	Для каждого ТекЭлемент Из тзнГрупп Цикл
		
		Если ТекЭлемент.Объект = ЭлементТзн.Родитель Тогда 
			Если мДанные.Найти(ТекЭлемент) = Неопределено Тогда
				
				Если ЗначениеЗаполнено(ТекЭлемент.Родитель) Тогда
					ОтсортироватьГруппыРекурсивно(мДанные, тзнГрупп, ТекЭлемент);
				Иначе
					мДанные.Добавить(ТекЭлемент);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	мДанные.Добавить(ЭлементТзн);
	
КонецПроцедуры

#КонецОбласти


#Область ЕдиницыИзмерения     

Функция СформироватьДанныеПоЕдиницамИзмеренияТоваров(пСтруктураНастроек, МассивДанных) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДанных"	, МассивДанных);
	Запрос.УстановитьПараметр("ТипДанных"		, СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("Портал"			, СтруктураНастроек.Портал);	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Объект,
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Идентификатор1С,
	|	УпаковкиЕдиницыИзмерения.ПометкаУдаления КАК ПометкаУдаления,
	|	УпаковкиЕдиницыИзмерения.Наименование КАК Наименование,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБ24,
	|	УпаковкиЕдиницыИзмерения.Код КАК Код,
	|	УпаковкиЕдиницыИзмерения.НаименованиеПолное КАК НаименованиеПолное,
	|	УпаковкиЕдиницыИзмерения.МеждународноеСокращение КАК МеждународноеСокращение
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|		ПО (ВТ_ИдентификаторыОбъектов.Объект = УпаковкиЕдиницыИзмерения.Ссылка)
	|ГДЕ
	|	УпаковкиЕдиницыИзмерения.Ссылка В(&МассивДанных)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	мЭлементы 	=  Новый массив;
	
	Пока Выборка.Следующий() Цикл
		
		СформированныйЗапрос = СформироватьСтруктуруДанныхПоЕдиницыИзмеренияНоменклатуры(СтруктураНастроек, Выборка, НЕ ЗначениеЗаполнено(Выборка.ИдентификаторБ24));
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	// чтобы лог не затерся.
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	// чтобы лог не затерся.
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоЕдиницыИзмеренияНоменклатуры(СтруктураНастроек, ИнформацияОЕдиницеИзмерения, ЭтоНовыйЭлемент)
	
	КлючЕдИзм = XMLСтрока(ИнформацияОЕдиницеИзмерения.Идентификатор1С);	
	
	Поля = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(ИнформацияОЕдиницеИзмерения.Код) Тогда
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "У единицы измерения: " + ИнформацияОЕдиницеИзмерения.Наименование + ". Пустой код, единица не будет выгружена в Битрикс24");
		Возврат "";	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИнформацияОЕдиницеИзмерения.Наименование) Тогда
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "У единицы измерения: " + ИнформацияОЕдиницеИзмерения.Наименование + ". Пустое Наименование, единица не будет выгружена в Битрикс24");
		Возврат "";	
	КонецЕсли;
	
	Поля.Вставить("CODE"				, ИнформацияОЕдиницеИзмерения.Код);  	
	Поля.Вставить("SYMBOL_RUS"			, ИнформацияОЕдиницеИзмерения.Наименование);
	Поля.Вставить("MEASURE_TITLE"		, ИнформацияОЕдиницеИзмерения.НаименованиеПолное);   
	
	Поля.Вставить("SYMBOL_INTL"			, ИнформацияОЕдиницеИзмерения.МеждународноеСокращение);
	Поля.Вставить("SYMBOL_LETTER_INTL"	, ИнформацияОЕдиницеИзмерения.МеждународноеСокращение);
	
	ТелоЗапроса = "";
	
	Для каждого ТекПоле Из Поля Цикл
		
		ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
		
	КонецЦикла;  
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючЕдИзм+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.measure.add?" + ТелоЗапроса);	
	Иначе
		СтрокаЗапроса = "cmd["+КлючЕдИзм+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.measure.update?id=" + ИнформацияОЕдиницеИзмерения.ИдентификаторБ24 + "&"  + ТелоЗапроса);	
	КонецЕсли;
	
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючЕдИзм, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения, ИнформацияОЕдиницеИзмерения.Идентификатор1С));
	
	Возврат СтрокаЗапроса;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////  

Функция СформироватьДанныеПоЕдиницамИзмеренияТоваров2(пСтруктураНастроек, МассивДанных) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДанных"	, МассивДанных);
	Запрос.УстановитьПараметр("ТипДанных"		, СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения2);
	Запрос.УстановитьПараметр("Портал"			, СтруктураНастроек.Портал);	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Объект,
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Идентификатор1С,
	|	УпаковкиЕдиницыИзмерения.ПометкаУдаления КАК ПометкаУдаления,
	|	УпаковкиЕдиницыИзмерения.Наименование КАК Наименование,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБ24,
	|	УпаковкиЕдиницыИзмерения.Код КАК Код,
	|	УпаковкиЕдиницыИзмерения.НаименованиеПолное КАК НаименованиеПолное,
	|	УпаковкиЕдиницыИзмерения.МеждународноеСокращение КАК МеждународноеСокращение
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|		ПО (ВТ_ИдентификаторыОбъектов.Объект = УпаковкиЕдиницыИзмерения.Ссылка)
	|ГДЕ
	|	УпаковкиЕдиницыИзмерения.Ссылка В(&МассивДанных)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	мЭлементы 	=  Новый массив;
	
	Пока Выборка.Следующий() Цикл
		
		СформированныйЗапрос = СформироватьСтруктуруДанныхПоЕдиницыИзмеренияНоменклатуры2(СтруктураНастроек, Выборка, НЕ ЗначениеЗаполнено(Выборка.ИдентификаторБ24));
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	// чтобы лог не затерся.
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	// чтобы лог не затерся.
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоЕдиницыИзмеренияНоменклатуры2(СтруктураНастроек, ИнформацияОЕдиницеИзмерения, ЭтоНовыйЭлемент)
	
	КлючЕдИзм = XMLСтрока(ИнформацияОЕдиницеИзмерения.Идентификатор1С);	
	
	Поля = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(ИнформацияОЕдиницеИзмерения.Код) Тогда
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "У единицы измерения: " + ИнформацияОЕдиницеИзмерения.Наименование + ". Пустой код, единица не будет выгружена в Битрикс24");
		Возврат "";	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИнформацияОЕдиницеИзмерения.Наименование) Тогда
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "У единицы измерения: " + ИнформацияОЕдиницеИзмерения.Наименование + ". Пустое Наименование, единица не будет выгружена в Битрикс24");
		Возврат "";	
	КонецЕсли;
	
	Поля.Вставить("code"				, ИнформацияОЕдиницеИзмерения.Код);  	
	Поля.Вставить("symbol"				, ИнформацияОЕдиницеИзмерения.Наименование);
	Поля.Вставить("measureTitle"		, ИнформацияОЕдиницеИзмерения.НаименованиеПолное);   
	Поля.Вставить("symbolIntl"			, ИнформацияОЕдиницеИзмерения.МеждународноеСокращение);
	Поля.Вставить("symbolLetterIntl"	, ИнформацияОЕдиницеИзмерения.МеждународноеСокращение);
	
	ТелоЗапроса = "";
	
	Для каждого ТекПоле Из Поля Цикл
		
		ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
		
	КонецЦикла;  
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючЕдИзм+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.measure.add?" + ТелоЗапроса);	
	Иначе
		СтрокаЗапроса = "cmd["+КлючЕдИзм+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.measure.update?id=" + ИнформацияОЕдиницеИзмерения.ИдентификаторБ24 + "&"  + ТелоЗапроса);	
	КонецЕсли;
	
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючЕдИзм, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения2, ИнформацияОЕдиницеИзмерения.Идентификатор1С));
	
	Возврат СтрокаЗапроса;
	
КонецФункции

#КонецОбласти

 
#Область Прайсы  

Функция СформироватьДанныеПоПрайсам(пСтруктураНастроек, МассивДанных) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДанных"	, МассивДанных);
	Запрос.УстановитьПараметр("ТипДанных"		, СтруктураНастроек.ТипыОбъектовОбмена.Прайс);
	Запрос.УстановитьПараметр("Портал"			, СтруктураНастроек.Портал);	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.ВидыЦен) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыЦен.Ссылка КАК Объект,
	|	ВидыЦен.Ссылка КАК Идентификатор1С,
	|	ВидыЦен.ПометкаУдаления КАК ПометкаУдаления,
	|	ВидыЦен.Наименование КАК Наименование,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБ24,
	|	ВидыЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|		ПО (ВТ_ИдентификаторыОбъектов.Объект = ВидыЦен.Ссылка)
	|ГДЕ
	|	ВидыЦен.Ссылка В(&МассивДанных)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	мЭлементы 	=  Новый массив;
	
	Пока Выборка.Следующий() Цикл
		
		СформированныйЗапрос = СформироватьСтруктуруДанныхПоПрайсу(СтруктураНастроек, Выборка, НЕ ЗначениеЗаполнено(Выборка.ИдентификаторБ24));
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	// чтобы лог не затерся.
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	// чтобы лог не затерся.
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоПрайсу(СтруктураНастроек, ИнформацияПрайса, ЭтоНовыйЭлемент)
	
	КлючЕдИзм = XMLСтрока(ИнформацияПрайса.Идентификатор1С);	
	
	Поля = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(ИнформацияПрайса.Наименование) Тогда
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "У прайса: " + ИнформацияПрайса.Наименование + ". Пустое Наименование, прайс не будет выгружен в Битрикс24");
		Возврат "";	
	КонецЕсли;
	
	Поля.Вставить("name"	, ИнформацияПрайса.Наименование);  	
	Поля.Вставить("xmlId"	, XMLСтрока(ИнформацияПрайса.Объект));
	
	ТелоЗапроса = "";
	Для каждого ТекПоле Из Поля Цикл
		
		ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
		
	КонецЦикла;  
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючЕдИзм+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.pricetype.add?" + ТелоЗапроса);	
	Иначе
		СтрокаЗапроса = "cmd["+КлючЕдИзм+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.pricetype.update?id=" + ИнформацияПрайса.ИдентификаторБ24 + "&"  + ТелоЗапроса);	
	КонецЕсли;
	
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючЕдИзм, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.Прайс, ИнформацияПрайса.Идентификатор1С));
	
	Возврат СтрокаЗапроса;
	
КонецФункции

#КонецОбласти


#Область СвойствоТовара     

Функция СформироватьДанныеПоСвойствамТоваров(пСтруктураНастроек, МассивДанных, Пакет) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
#Область ФормированиеВременныхТаблицДанных
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДанных"			, МассивДанных);
	Запрос.УстановитьПараметр("ТипДанных"				, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара);
	Запрос.УстановитьПараметр("ТипДанныхЗначенийСвойств", СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара);
	Запрос.УстановитьПараметр("Портал"					, СтруктураНастроек.Портал);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор,
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.ЗначенияСвойствОбъектов) КАК Объект
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЗначенийСвойств
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЗначенийСвойств
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка,
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Идентификатор1С,
	|	ДополнительныеРеквизитыИСведения.ПометкаУдаления КАК ПометкаУдаления,
	|	ДополнительныеРеквизитыИСведения.Заголовок КАК Заголовок,
	|	ДополнительныеРеквизитыИСведения.Наименование КАК Наименование,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения КАК ТипЗначения,
	|	ДополнительныеРеквизитыИСведения.ЗаполнятьОбязательно КАК ЗаполнятьОбязательно,
	|	ДополнительныеРеквизитыИСведения.НаборСвойств КАК НаборСвойств
	|ПОМЕСТИТЬ ВТ_Свойства
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Ссылка В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизиты.Ссылка КАК Набор,
	|	ДополнительныеРеквизиты.Свойство КАК Свойство
	|ПОМЕСТИТЬ ВТ_ВсеСвойстваНаборы
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|ГДЕ
	|	ДополнительныеРеквизиты.Свойство В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Ссылка,
	|	ДополнительныеСведения.Свойство
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство В(&МассивДанных)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеСвойстваНаборы.Набор КАК Набор,
	|	ВТ_ВсеСвойстваНаборы.Свойство КАК Свойство
	|ПОМЕСТИТЬ ВТ_СвойстваНаборы
	|ИЗ
	|	ВТ_ВсеСвойстваНаборы КАК ВТ_ВсеСвойстваНаборы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеСвойстваНаборы.Набор,
	|	ВТ_ВсеСвойстваНаборы.Свойство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВсеСвойстваНаборы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Ссылка КАК Объект,
	|	ЗначенияСвойствОбъектов.Ссылка КАК Идентификатор1С,
	|	ЗначенияСвойствОбъектов.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗначенияСвойствОбъектов.Наименование КАК Наименование,
	|	ЗначенияСвойствОбъектов.ПолноеНаименование КАК ПолноеНаименование,
	|	ВТ_ИдентификаторыЗначенийСвойств.Идентификатор КАК ИдентификаторБ24,
	|	ЗначенияСвойствОбъектов.Владелец КАК Свойство
	|ПОМЕСТИТЬ ВТ_ЗначенияСвойств
	|ИЗ
	|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗначенийСвойств КАК ВТ_ИдентификаторыЗначенийСвойств
	|		ПО ЗначенияСвойствОбъектов.Ссылка = ВТ_ИдентификаторыЗначенийСвойств.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Свойства КАК ВТ_Свойства
	|		ПО ЗначенияСвойствОбъектов.Владелец = ВТ_Свойства.Ссылка
	|ГДЕ
	|	ЗначенияСвойствОбъектов.ПометкаУдаления = ЛОЖЬ
	|	И ЗначенияСвойствОбъектов.ЭтоГруппа = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыЗначенийСвойств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Свойства.Ссылка КАК Объект,
	|	ВТ_Свойства.Ссылка КАК Идентификатор1С,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБ24,
	|	ВТ_Свойства.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_Свойства.Заголовок КАК Заголовок,
	|	ВТ_Свойства.Наименование КАК Наименование,
	|	ВТ_Свойства.ТипЗначения КАК ТипЗначения,
	|	ВТ_Свойства.ЗаполнятьОбязательно КАК ЗаполнятьОбязательно,
	|	ВТ_Свойства.НаборСвойств КАК НаборСвойств
	|ИЗ
	|	ВТ_Свойства КАК ВТ_Свойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|		ПО (ВТ_ИдентификаторыОбъектов.Объект = ВТ_Свойства.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Свойства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыОбъектов";
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
#КонецОбласти	
	
	мЭлементы 				=  Новый массив;
	
	Пока Выборка.Следующий() Цикл
		
		СформированныйЗапрос = СформироватьСтруктуруДанныхПоСвойствуНоменклатуры(СтруктураНастроек, Пакет, Выборка, НЕ ЗначениеЗаполнено(Выборка.ИдентификаторБ24), МенеджерВременныхТаблиц);
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	// чтобы лог не затерся.
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	// чтобы лог не затерся.
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоСвойствуНоменклатуры(СтруктураНастроек, Пакет, ИнформацияОСвойствеТовара, ЭтоНовыйЭлемент, МенеджерВременныхТаблиц)
	
	КлючСвойства = XMLСтрока(ИнформацияОСвойствеТовара.Идентификатор1С);	
	
	лЗначенияСвойств = "";
	
	Поля = Новый Структура;
	
	Заголовок = ИнформацияОСвойствеТовара.Заголовок;
	Заголовок = СтрЗаменить(Заголовок, " по данным 1С для Битрикс24", "");
	Заголовок = СтрЗаменить(Заголовок, " для Битрикс24", "");
	
	Справочник_ХарактеристикиНоменклатуры 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНаборСвойств("Справочник_ХарактеристикиНоменклатуры");
	Справочник_Номенклатура 				= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНаборСвойств("Справочник_Номенклатура");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Свойство", ИнформацияОСвойствеТовара.Объект);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВТ_СвойстваНаборы КАК ВТ_СвойстваНаборы
	|ГДЕ
	|	ВТ_СвойстваНаборы.Свойство = &Свойство";
	
	ВыборкаСвойстваНаборы = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаСвойстваНаборы.Следующий() Цикл
		
		Если ВыборкаСвойстваНаборы.Набор.ПринадлежитЭлементу(Справочник_ХарактеристикиНоменклатуры) ИЛИ ВыборкаСвойстваНаборы.Набор = Справочник_ХарактеристикиНоменклатуры Тогда
			Поля.Вставить("XML_ID"	, "H_" + XMLСтрока(ИнформацияОСвойствеТовара.Идентификатор1С));  	
			Поля.Вставить("NAME"	, Б24_КС_ОбщегоНазначенияВызовСервера.ПолучитьПрефиксСвойстваХарактеристики() + Заголовок);
			Прервать;
		ИначеЕсли ВыборкаСвойстваНаборы.Набор.ПринадлежитЭлементу(Справочник_Номенклатура) ИЛИ ВыборкаСвойстваНаборы.Набор = Справочник_Номенклатура Тогда
			Поля.Вставить("XML_ID"	, ИнформацияОСвойствеТовара.Идентификатор1С);  
			Поля.Вставить("NAME"	, Заголовок);
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Поля.Вставить("ACTIVE"			, ?(ИнформацияОСвойствеТовара.ПометкаУдаления,"N","Y"));  	
	Поля.Вставить("IS_REQUIRED"		, ?(ИнформацияОСвойствеТовара.ЗаполнятьОбязательно,"Y","N"));  	
	Поля.Вставить("MULTIPLE"		, "N");  	
	
	ТипЗначенияСвойства = ИнформацияОСвойствеТовара.ТипЗначения;	
	
	Если ТипЗначенияСвойства.СодержитТип(Тип("Строка")) Тогда
		
		Если ИнформацияОСвойствеТовара.ТипЗначения.КвалификаторыСтроки.Длина = 0 Тогда
			Поля.Вставить("PROPERTY_TYPE"	, "S");  
			Поля.Вставить("USER_TYPE"		, "HTML");  
		Иначе
			Поля.Вставить("PROPERTY_TYPE"	, "S");  
			Поля.Вставить("USER_TYPE"		, "");  
		КонецЕсли;
		
	ИначеЕсли ТипЗначенияСвойства.СодержитТип(Тип("Число")) Тогда
		Поля.Вставить("PROPERTY_TYPE", "N");  
	ИначеЕсли ТипЗначенияСвойства.СодержитТип(Тип("Дата")) Тогда
		Поля.Вставить("PROPERTY_TYPE"	, "S");
		
		Если ИнформацияОСвойствеТовара.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.ДатаВремя Тогда 
			Поля.Вставить("USER_TYPE", "DateTime"); 
		Иначе
			Поля.Вставить("USER_TYPE", "Date"); 
		КонецЕсли;
	ИначеЕсли ТипЗначенияСвойства.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда
		Поля.Вставить("USER_TYPE", "employee"); 
	ИначеЕсли ТипЗначенияСвойства.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) Тогда
		Поля.Вставить("PROPERTY_TYPE"	, "L"); 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Свойство", ?(ИнформацияОСвойствеТовара.Объект.ВладелецДополнительныхЗначений.Пустая(), ИнформацияОСвойствеТовара.Объект,  ИнформацияОСвойствеТовара.Объект.ВладелецДополнительныхЗначений));
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Запрос.Текст = "ВЫБРАТЬ *
		|ИЗ
		|	ВТ_ЗначенияСвойств КАК ВТ_ЗначенияСвойств
		|ГДЕ
		|	ВТ_ЗначенияСвойств.Свойство = &Свойство";
		
		Итератор 	= 999999999;
		Выборка 	= Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Итератор 		= Итератор+1;
			ИтераторСтрокой = Формат(Итератор, "ЧГ=0");  
			
			Если ЗначениеЗаполнено(Выборка.ИдентификаторБ24) И ТипЗнч(Выборка.ИдентификаторБ24) = Тип("Строка") Тогда
				ИдЗначенияСвойства = Выборка.ИдентификаторБ24;	
			Иначе        
				ИдЗначенияСвойства = ИтераторСтрокой;	
			КонецЕсли;
			
			лЗначенияСвойств = лЗначенияСвойств +  "&fields[VALUES]["+ИдЗначенияСвойства+"][XML_ID]=" + XMLСтрока(Выборка.Объект) + "&fields[VALUES]["+ИдЗначенияСвойства+"][VALUE]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Выборка.Наименование); 
			
		КонецЦикла;
		
	Иначе
		УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара, Пакет, ИнформацияОСвойствеТовара.Объект);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Ошибка, "В свойствах не поддерживается тип: " + Строка(ТипЗначенияСвойства) + " в свойстве - " + ИнформацияОСвойствеТовара.Заголовок);
		Возврат "";		
	КонецЕсли;
	
	ТелоЗапроса = "";
	
	Для каждого ТекПоле Из Поля Цикл
		ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
	КонецЦикла;  
	
	ТелоЗапроса = ТелоЗапроса +  лЗначенияСвойств;
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючСвойства+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.product.property.add?" + ТелоЗапроса);	
	Иначе
		СтрокаЗапроса = "cmd["+КлючСвойства+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.product.property.update?id=" + ИнформацияОСвойствеТовара.ИдентификаторБ24 + "&"  + ТелоЗапроса);	
	КонецЕсли;
	
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючСвойства, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара, ИнформацияОСвойствеТовара.Идентификатор1С));	
	
	Возврат СтрокаЗапроса;
	
КонецФункции

Функция СформироватьЗапросПолученияIDЗначенийСвойствТоваров(СтруктураНастроек, МассивДанных, Пакет) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивДанных"	, МассивДанных);
	Запрос.УстановитьПараметр("ТипДанных"		, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара);
	Запрос.УстановитьПараметр("Портал"			, СтруктураНастроек.Портал);
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Объект,
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Идентификатор1С,
	|	ДополнительныеРеквизитыИСведения.ПометкаУдаления КАК ПометкаУдаления,
	|	ДополнительныеРеквизитыИСведения.Заголовок КАК Заголовок,
	|	ДополнительныеРеквизитыИСведения.Наименование КАК Наименование,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения КАК ТипЗначения,
	|	ДополнительныеРеквизитыИСведения.ЗаполнятьОбязательно КАК ЗаполнятьОбязательно
	|ПОМЕСТИТЬ ВТ_Свойства
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Ссылка В(&МассивДанных)
	|	И ДополнительныеРеквизитыИСведения.ДополнительныеЗначенияИспользуются
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Свойства.Объект КАК Идентификатор1С,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБ24
	|ИЗ
	|	ВТ_Свойства КАК ВТ_Свойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|		ПО ВТ_Свойства.Объект = ВТ_ИдентификаторыОбъектов.Объект";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	мЭлементы 	=  Новый массив;
	
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.ИдентификаторБ24) Тогда
				
				КлючЗначенияСвойства = XMLСтрока(Выборка.Идентификатор1С);	
				
				мЭлементы.Добавить("cmd["+КлючЗначенияСвойства+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.product.property.list?filter[ID]="  + Выборка.ИдентификаторБ24));
				
				СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючЗначенияСвойства, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара, Выборка.Идентификатор1С));				
				
			Иначе
				УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара, Пакет, Выборка.Идентификатор1С);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат мЭлементы;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////  
 
Функция СформироватьДанныеПоСвойствамТоваровПредложений(пСтруктураНастроек, ТипДанных, МассивДанных, Пакет) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
#Область ФормированиеВременныхТаблицДанных
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДанных"			, МассивДанных);
	Запрос.УстановитьПараметр("ТипДанных"				, ТипДанных);
	Запрос.УстановитьПараметр("Портал"					, СтруктураНастроек.Портал);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка,
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Идентификатор1С,
	|	ДополнительныеРеквизитыИСведения.ПометкаУдаления КАК ПометкаУдаления,
	|	ДополнительныеРеквизитыИСведения.Заголовок КАК Заголовок,
	|	ДополнительныеРеквизитыИСведения.Наименование КАК Наименование,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения КАК ТипЗначения,
	|	ДополнительныеРеквизитыИСведения.ЗаполнятьОбязательно КАК ЗаполнятьОбязательно,
	|	ДополнительныеРеквизитыИСведения.НаборСвойств КАК НаборСвойств
	|ПОМЕСТИТЬ ВТ_Свойства
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Ссылка В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Свойства.Ссылка КАК Объект,
	|	ВТ_Свойства.Ссылка КАК Идентификатор1С,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБ24,
	|	ВТ_Свойства.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_Свойства.Заголовок КАК Заголовок,
	|	ВТ_Свойства.Наименование КАК Наименование,
	|	ВТ_Свойства.ТипЗначения КАК ТипЗначения,
	|	ВТ_Свойства.ЗаполнятьОбязательно КАК ЗаполнятьОбязательно,
	|	ВТ_Свойства.НаборСвойств КАК НаборСвойств
	|ИЗ
	|	ВТ_Свойства КАК ВТ_Свойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|		ПО (ВТ_ИдентификаторыОбъектов.Объект = ВТ_Свойства.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Свойства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыОбъектов";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
#КонецОбласти	
	
	мЭлементы = Новый массив;
	
	Пока Выборка.Следующий() Цикл
		
		СформированныйЗапрос = СформироватьСтруктуруДанныхПоСвойствуТовараНоменклатуры(СтруктураНастроек, ТипДанных, Пакет, Выборка, НЕ ЗначениеЗаполнено(Выборка.ИдентификаторБ24));
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	// чтобы лог не затерся.
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	// чтобы лог не затерся.
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоСвойствуТовараНоменклатуры(СтруктураНастроек, ТипДанных, Пакет, ИнформацияОСвойствеТовара, ЭтоНовыйЭлемент)
	
	КлючСвойства = XMLСтрока(ИнформацияОСвойствеТовара.Идентификатор1С);	
	
	Заголовок = ИнформацияОСвойствеТовара.Заголовок;
	Заголовок = СтрЗаменить(Заголовок, " по данным 1С для Битрикс24", "");
	Заголовок = СтрЗаменить(Заголовок, " для Битрикс24", "");
	
	Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара2 Тогда
		ИдИнфоблока = СтруктураНастроек.НастройкиСинхронизацииТоваров.ИдентификаторКаталогаТоваров;	
	Иначе
		ИдИнфоблока = СтруктураНастроек.НастройкиСинхронизацииТоваров.ИдентификаторКаталогаПредложений;	
	КонецЕсли;
	
	Поля = Новый Структура;
	Поля.Вставить("iblockId"	, ИдИнфоблока);
	Поля.Вставить("xmlId"		, ИнформацияОСвойствеТовара.Идентификатор1С);
	Поля.Вставить("name"		, Заголовок);
	Поля.Вставить("multiple"	, "N");
	Поля.Вставить("isRequired"	, ?(ИнформацияОСвойствеТовара.ЗаполнятьОбязательно,"Y","N"));
	Поля.Вставить("active"		, ?(ИнформацияОСвойствеТовара.ПометкаУдаления,"N","Y"));  	
	Поля.Вставить("listType"	, "L");    
	Поля.Вставить("propertyType", "S");  

	ТипЗначенияСвойства = ИнформацияОСвойствеТовара.ТипЗначения;	
	Если ТипЗначенияСвойства.СодержитТип(Тип("Строка")) Тогда
		Если ИнформацияОСвойствеТовара.ТипЗначения.КвалификаторыСтроки.Длина = 0 Тогда
			Поля.Вставить("userType", "HTML");  
		Иначе
			Поля.Вставить("userType", "");  
		КонецЕсли;
	ИначеЕсли ТипЗначенияСвойства.СодержитТип(Тип("Число")) Тогда
		Поля.Вставить("propertyType", "N");  
	ИначеЕсли ТипЗначенияСвойства.СодержитТип(Тип("Дата")) Тогда
		Если ИнформацияОСвойствеТовара.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.ДатаВремя Тогда 
			Поля.Вставить("userType", "DateTime"); 
		Иначе
			Поля.Вставить("userType", "Date"); 
		КонецЕсли;
	ИначеЕсли ТипЗначенияСвойства.СодержитТип(Тип("Булево")) Тогда
		Поля.Вставить("listType"	, "C");                         
		Поля.Вставить("propertyType", "L"); 
		Поля.Вставить("userType"	, "BoolEnum"); 
	ИначеЕсли ТипЗначенияСвойства.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) Тогда
		Поля.Вставить("propertyType", "L"); 
	Иначе
		УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ТипДанных, Пакет, ИнформацияОСвойствеТовара.Объект);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Ошибка, "В свойствах не поддерживается тип: " + Строка(ТипЗначенияСвойства) + " в свойстве - " + ИнформацияОСвойствеТовара.Заголовок);
		Возврат "";		
	КонецЕсли;
	
	ТелоЗапроса = "";
	
	Для каждого ТекПоле Из Поля Цикл
		ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
	КонецЦикла;  
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючСвойства+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.productProperty.add?" + ТелоЗапроса);	
	Иначе
		СтрокаЗапроса = "cmd["+КлючСвойства+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.productProperty.update?id=" + ИнформацияОСвойствеТовара.ИдентификаторБ24 + "&"  + ТелоЗапроса);	
	КонецЕсли;
	
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючСвойства, ПолучитьСтруктуруКлючейБатчЗапросов(ТипДанных, ИнформацияОСвойствеТовара.Идентификатор1С));	
	
	Возврат СтрокаЗапроса;
	
КонецФункции

  
Функция СформироватьДанныеПоЗначениямСвойствТоваровПредложений(пСтруктураНастроек, ТипДанных, МассивДанных, Пакет) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	тзнДанных = Новый ТаблицаЗначений;
	тзнДанных.Колонки.Добавить("Объект", Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов"));
	
	КС = Новый КвалификаторыСтроки(50);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	тзнДанных.Колонки.Добавить("ПодчиненныйОбъект", ОписаниеТиповС);
	
	Для Каждого ТекЭлемент Из МассивДанных Цикл
		НоваяСтрока = тзнДанных.Добавить();  
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекЭлемент);
	КонецЦикла;
	
#Область ФормированиеВременныхТаблицДанных
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тзнДанных"	, тзнДанных);
	Запрос.УстановитьПараметр("ТипДанных"	, ТипДанных);
	Запрос.УстановитьПараметр("Портал"		, СтруктураНастроек.Портал);
	Запрос.Текст = "ВЫБРАТЬ
	|	Данные.Объект КАК Объект,
	|	Данные.ПодчиненныйОбъект КАК ПодчиненныйОбъект
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&тзнДанных КАК Данные
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	ПодчиненныйОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Объект КАК Объект,
	|	ВТ_Данные.ПодчиненныйОбъект КАК ИдентификаторСвойства,
	|	ЗначенияСвойствОбъектов.Ссылка КАК Идентификатор1С,
	|	ЗначенияСвойствОбъектов.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗначенияСвойствОбъектов.Наименование КАК Наименование,
	|	ЗначенияСвойствОбъектов.ПолноеНаименование КАК ПолноеНаименование
	|ПОМЕСТИТЬ ВТ_ЗначенияСвойствСвойства
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ВТ_Данные.Объект = ЗначенияСвойствОбъектов.Ссылка  
	|ГДЕ
	|	ЗначенияСвойствОбъектов.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.ЗначенияСвойствОбъектов) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор,
	|	Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект КАК ИдентификаторСвойства
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЗначенийСвойств
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В
	|			(ВЫБРАТЬ
	|				ВТ_ЗначенияСвойствСвойства.Объект
	|			ИЗ
	|				ВТ_ЗначенияСвойствСвойства)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗначенияСвойств.Объект КАК Объект,
	|	ВТ_ЗначенияСвойств.Идентификатор1С КАК Идентификатор1С,
	|	ВТ_ИдентификаторыЗначенийСвойств.Идентификатор КАК ИдентификаторБ24,
	|	ВТ_ЗначенияСвойств.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_ЗначенияСвойств.Наименование КАК Наименование,
	|	ВТ_ЗначенияСвойств.ПолноеНаименование КАК ПолноеНаименование,
	|	ВТ_ЗначенияСвойств.ИдентификаторСвойства КАК ИдентификаторСвойства
	|ИЗ
	|	ВТ_ЗначенияСвойствСвойства КАК ВТ_ЗначенияСвойств
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗначенийСвойств КАК ВТ_ИдентификаторыЗначенийСвойств
	|		ПО ВТ_ЗначенияСвойств.Объект = ВТ_ИдентификаторыЗначенийСвойств.Объект
	|			И ВТ_ЗначенияСвойств.ИдентификаторСвойства = ВТ_ИдентификаторыЗначенийСвойств.ИдентификаторСвойства";
	Выборка = Запрос.Выполнить().Выбрать();
	
#КонецОбласти	

	мЭлементы 	=  Новый массив;
	
	Пока Выборка.Следующий() Цикл
		
		СформированныйЗапрос = СформироватьСтруктуруДанныхПоЗначениюСвойстваТовараПредложения(СтруктураНастроек, ТипДанных, Пакет, Выборка, НЕ ЗначениеЗаполнено(Выборка.ИдентификаторБ24));
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	// чтобы лог не затерся.
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	// чтобы лог не затерся.
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоЗначениюСвойстваТовараПредложения(СтруктураНастроек, ТипДанных, Пакет, ИнформацияОСвойствеТовара, ЭтоНовыйЭлемент)

	Если НЕ ЗначениеЗаполнено(ИнформацияОСвойствеТовара.Идентификатор1С) Тогда
		Возврат "";
	КонецЕсли;
	
	КлючЭлемента = ИнформацияОСвойствеТовара.ИдентификаторСвойства+"#"+XMLСтрока(ИнформацияОСвойствеТовара.Идентификатор1С);	
	
	Поля = Новый Структура;
	Поля.Вставить("propertyId"	, ИнформацияОСвойствеТовара.ИдентификаторСвойства);
	Поля.Вставить("xmlId"		, КлючЭлемента);
	Поля.Вставить("value"		, ИнформацияОСвойствеТовара.Наименование);
	
	ТелоЗапроса = "";
	
	Для каждого ТекПоле Из Поля Цикл
		ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
	КонецЦикла;  
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючЭлемента+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.productPropertyEnum.add?" + ТелоЗапроса);	
	Иначе
		СтрокаЗапроса = "cmd["+КлючЭлемента+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.productPropertyEnum.update?id=" + ИнформацияОСвойствеТовара.ИдентификаторБ24 + "&"  + ТелоЗапроса);	
	КонецЕсли;
	
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючЭлемента, ПолучитьСтруктуруКлючейБатчЗапросов(ТипДанных, ИнформацияОСвойствеТовара.Идентификатор1С, ИнформацияОСвойствеТовара.ИдентификаторСвойства));	
	
	Возврат СтрокаЗапроса;
	
КонецФункции

#КонецОбласти


#Область Товары  

Функция СформироватьДанныеПоТоварам(пСтруктураНастроек, МассивДанных) Экспорт
	
	УстановитьПривилегированныйРежим(Истина); //У некоторых ролей нет прав на тома, поэтому пока привилегированный режим. 
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	мСвойстваИсключения = Новый Массив;
	Если СтруктураНастроек.ПредопределенныеСвойства.Свойство("ПредопределенноеСвойствоВидаНоменклатуры") Тогда 
		мСвойстваИсключения.Добавить(СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоВидаНоменклатуры);	
	КонецЕсли;
	
#Область ИдентификаторыСлужебныхСвойств		

	Если НЕ СтруктураНастроек.ПредопределенныеСвойства.Свойство("ПредопределенноеСвойствоВидаНоменклатуры") Тогда 	
		СтруктураНастроек.ПредопределенныеСвойства.Вставить("ПредопределенноеСвойствоВидаНоменклатуры", Неопределено);	
	КонецЕсли;
	ИдСвойстваВидаНоменклатуры 	= РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоВидаНоменклатуры); 
	СтруктураНастроек.Вставить("ИдПредопределенногоСвойстваВидаНоменклатуры", ИдСвойстваВидаНоменклатуры);
	
	Если НЕ СтруктураНастроек.ПредопределенныеСвойства.Свойство("ПредопределенноеСвойствоАртикулНоменклатуры") Тогда 	
		СтруктураНастроек.ПредопределенныеСвойства.Вставить("ПредопределенноеСвойствоАртикулНоменклатуры", Неопределено);	
	КонецЕсли;
	ИдСвойстваАртикулаНоменклатуры 	= РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоАртикулНоменклатуры); 
	СтруктураНастроек.Вставить("ИдПредопределенногоСвойстваАртикулаНоменклатуры", ИдСвойстваАртикулаНоменклатуры);
	
	Если НЕ СтруктураНастроек.ПредопределенныеСвойства.Свойство("ПредопределенноеСвойствоОстатокНоменклатуры") Тогда 	
		СтруктураНастроек.ПредопределенныеСвойства.Вставить("ПредопределенноеСвойствоОстатокНоменклатуры", Неопределено);	
	КонецЕсли;
	ИдСвойстваОстатокНоменклатуры 	= РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоОстатокНоменклатуры); 
	СтруктураНастроек.Вставить("ИдПредопределенногоСвойстваОстатокНоменклатуры", ИдСвойстваОстатокНоменклатуры);
	
#КонецОбласти
	
	ТипЦены = Неопределено;
	СтруктураНастроек.НастройкиСинхронизацииТоваров.Свойство("ТипЦены", ТипЦены);
	
	Склад = Неопределено;
	СтруктураНастроек.НастройкиСинхронизацииТоваров.Свойство("Склад", Склад);

	СтруктураНастроек.Вставить("КодВалюты", ?(ТипЦены = Неопределено, "", ТипЦены.ВалютаЦены.Код)); 
	
	тзнДанных = Новый ТаблицаЗначений;
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив);
	тзнДанных.Колонки.Добавить("Объект", ОписаниеТипов);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив);
	тзнДанных.Колонки.Добавить("ПодчиненныйОбъект", ОписаниеТипов);
	
	Для Каждого ТекЭлемент Из МассивДанных Цикл
		НоваяСтрока = тзнДанных.Добавить();
		НоваяСтрока.Объект 				= ТекЭлемент.Объект;
		НоваяСтрока.ПодчиненныйОбъект 	= ТекЭлемент.ПодчиненныйОбъект;
	КонецЦикла;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область ФормированиеВременныхТаблицДанных
	                         
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТоварыСХарактеристикамиПакета", тзнДанных);
	Запрос.УстановитьПараметр("ТипДанных"					, СтруктураНастроек.ТипыОбъектовОбмена.Товар);
	Запрос.УстановитьПараметр("ТипДанныхСвойство"			, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара);
	Запрос.УстановитьПараметр("ТипДанныхЗначениеСвойства"	, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара);
	Запрос.УстановитьПараметр("ТипДанныхЕдиницаИзмерения"	, СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("ТипДанныхКартинкаФайлТовара"	, СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлТовара);
	Запрос.УстановитьПараметр("СвойствоВидНоменклатуры"		, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоВидаНоменклатуры);
	Запрос.УстановитьПараметр("Портал"			 			, СтруктураНастроек.Портал);
	Запрос.УстановитьПараметр("НастройкаПодключения"		, СтруктураНастроек.НастройкаПодключения);
	
	Запрос.УстановитьПараметр("ВыгружатьКартинкиИФайлы"		, СтруктураНастроек.НастройкиСинхронизацииТоваров.ВыгружатьКартинкиИФайлы);
	Запрос.УстановитьПараметр("ВыгружатьВсеКартинкиИФайлы"	, СтруктураНастроек.НастройкиСинхронизацииТоваров.ВыгружатьКартинкиИФайлы И СтруктураНастроек.ПолнаяВыгрузка);
	
	Запрос.УстановитьПараметр("Период"						, СтруктураНастроек.ДатаФормирования);
	Запрос.УстановитьПараметр("СписокРасширенийКартинок"	, Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьМассивРазрешенныхРасширенийКартинок());
	Запрос.УстановитьПараметр("СписокСвойствИсключений"		, мСвойстваИсключения);
	
	Запрос.УстановитьПараметр("Справочник_НоменклатураОбщие", Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНаборСвойств("Справочник_Номенклатура_Общие"));
	
	Запрос.УстановитьПараметр("ТипЦены"	, ТипЦены);
	Запрос.УстановитьПараметр("Склад"	, Склад);
	
	Запрос.УстановитьПараметр("Ценообразование20"	, СтруктураНастроек.ИспользуетсяЦенообразование20);
	Запрос.УстановитьПараметр("Ценообразование25"	, СтруктураНастроек.ИспользуетсяЦенообразование25);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ТоварыСХарактеристикамиПакета.Объект КАК Объект,
	|	ВЫРАЗИТЬ(ТоварыСХарактеристикамиПакета.ПодчиненныйОбъект КАК Справочник.ХарактеристикиНоменклатуры) КАК ПодчиненныйОбъект
	|ПОМЕСТИТЬ ВТ_НоменклатураСХарактеристиками
	|ИЗ
	|	&ТоварыСХарактеристикамиПакета КАК ТоварыСХарактеристикамиПакета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	ПодчиненныйОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.Номенклатура) КАК Объект,
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект КАК Справочник.ХарактеристикиНоменклатуры) КАК ПодчиненныйОбъект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НоменклатураСХарактеристиками КАК ВТ_НоменклатураСХарактеристиками
	|		ПО Б24_К_ИдентификаторыОбъектов.Объект = ВТ_НоменклатураСХарактеристиками.Объект
	|			И Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект = ВТ_НоменклатураСХарактеристиками.ПодчиненныйОбъект
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	ПодчиненныйОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЕдиницИзмерения
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЕдиницаИзмерения
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЗначенийСвойств
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЗначениеСвойства
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Ссылка КАК ЗначениеСвойства,
	|	ВидыНоменклатуры.Ссылка КАК ВидНоменклатуры,
	|	ВТ_ИдентификаторыЗначенийСвойств.Идентификатор КАК ИдентификаторБ24ВидаНоменклатуры
	|ПОМЕСТИТЬ ВТ_ЗначенияСвойствВидаНоменклатуры
	|ИЗ
	|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО ЗначенияСвойствОбъектов.Наименование = ВидыНоменклатуры.Наименование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗначенийСвойств КАК ВТ_ИдентификаторыЗначенийСвойств
	|		ПО ЗначенияСвойствОбъектов.Ссылка = ВТ_ИдентификаторыЗначенийСвойств.Объект
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Владелец = &СвойствоВидНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НоменклатураСХарактеристиками.Объект КАК Объект,
	|	ВТ_НоменклатураСХарактеристиками.ПодчиненныйОбъект КАК ПодчиненныйОбъект,
	|	Номенклатура.ПометкаУдаления КАК ПометкаУдаленияНоменклатуры,
	|	ХарактеристикиНоменклатуры.ПометкаУдаления КАК ПометкаУдаленияХарактеристикиНоменклатуры,
	|	Номенклатура.Родитель КАК Родитель,
	|	Номенклатура.Наименование КАК НаименованиеНоменклатуры,
	|	ХарактеристикиНоменклатуры.Наименование КАК НаименованиеХарактеристикиНоменклатуры,
	|	Номенклатура.Описание КАК НаименованиеПолноеНоменклатуры,
	|	ХарактеристикиНоменклатуры.НаименованиеПолное КАК НаименованиеПолноеХарактеристикиНоменклатуры,
	|	Номенклатура.Артикул КАК Артикул,
	|	Номенклатура.Производитель КАК Производитель,
	|	Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	Номенклатура.ФайлКартинки КАК ФайлКартинкиНоменклатуры,
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВТ_ЗначенияСвойствВидаНоменклатуры.ИдентификаторБ24ВидаНоменклатуры КАК ИдентификаторБ24ВидаНоменклатуры,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)) КАК ХарактеристикаЦО
	|ПОМЕСТИТЬ ВТ_ИнформацияНоменклатурыСХарактеристиками
	|ИЗ
	|	ВТ_НоменклатураСХарактеристиками КАК ВТ_НоменклатураСХарактеристиками
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ_НоменклатураСХарактеристиками.Объект = Номенклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ВТ_НоменклатураСХарактеристиками.ПодчиненныйОбъект = ХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияСвойствВидаНоменклатуры КАК ВТ_ЗначенияСвойствВидаНоменклатуры
	|		ПО (Номенклатура.ВидНоменклатуры = ВТ_ЗначенияСвойствВидаНоменклатуры.ВидНоменклатуры)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	ПодчиненныйОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗначенияСвойствВидаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.Объект КАК Объект,
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.ПодчиненныйОбъект КАК ПодчиненныйОбъект,
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.ХарактеристикаЦО КАК ХарактеристикаЦО,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБ24,
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.ПометкаУдаленияНоменклатуры КАК ПометкаУдаленияНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.ПометкаУдаленияХарактеристикиНоменклатуры КАК ПометкаУдаленияХарактеристикиНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.Родитель КАК Родитель,
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.НаименованиеНоменклатуры КАК НаименованиеНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.НаименованиеХарактеристикиНоменклатуры КАК НаименованиеХарактеристикиНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.НаименованиеПолноеНоменклатуры КАК НаименованиеПолноеНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.НаименованиеПолноеХарактеристикиНоменклатуры КАК НаименованиеПолноеХарактеристикиНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.ЕдиницаИзмерения КАК ИдентификаторЕдиницыИзмерения1С,
	|	ВТ_ИдентификаторыЕдиницИзмерения.Идентификатор КАК ИдентификаторЕдиницыИзмеренияБ24,
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.Артикул КАК Артикул,
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.Производитель КАК Производитель,
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.ФайлКартинкиНоменклатуры КАК ФайлКартинкиНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками.ИдентификаторБ24ВидаНоменклатуры КАК ИдентификаторБ24ВидаНоменклатуры
	|ПОМЕСТИТЬ ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами
	|ИЗ
	|	ВТ_ИнформацияНоменклатурыСХарактеристиками КАК ВТ_ИнформацияНоменклатурыСХарактеристиками
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|		ПО ВТ_ИнформацияНоменклатурыСХарактеристиками.Объект = ВТ_ИдентификаторыОбъектов.Объект
	|			И ВТ_ИнформацияНоменклатурыСХарактеристиками.ПодчиненныйОбъект = ВТ_ИдентификаторыОбъектов.ПодчиненныйОбъект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЕдиницИзмерения КАК ВТ_ИдентификаторыЕдиницИзмерения
	|		ПО ВТ_ИнформацияНоменклатурыСХарактеристиками.ЕдиницаИзмерения = ВТ_ИдентификаторыЕдиницИзмерения.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыЕдиницИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
	|	РаспределениеЗапасов.Характеристика КАК Характеристика,
	|	СУММА(РаспределениеЗапасов.ВНаличии) КАК ВНаличииОстаток,
	|	СУММА(РаспределениеЗапасов.Свободно) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|ГДЕ
	|	РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|	И (РаспределениеЗапасов.Номенклатура, РаспределениеЗапасов.Характеристика) В
	|			(ВЫБРАТЬ
	|				ВТ_ИнформацияНоменклатурыСХарактеристиками.Объект,
	|				ВТ_ИнформацияНоменклатурыСХарактеристиками.ПодчиненныйОбъект
	|			ИЗ
	|				ВТ_ИнформацияНоменклатурыСХарактеристиками КАК ВТ_ИнформацияНоменклатурыСХарактеристиками)
	|	И РаспределениеЗапасов.Склад = &Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспределениеЗапасов.Номенклатура,
	|	РаспределениеЗапасов.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИнформацияНоменклатурыСХарактеристиками
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ВТ_СрезЦеныНоменклатуры20
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Период,
	|			&Ценообразование20
	|				И ВидЦены = &ТипЦены
	|				И (Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.Объект,
	|						ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.ПодчиненныйОбъект
	|					ИЗ
	|						ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами)) КАК ЦеныНоменклатурыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО КАК ХарактеристикаЦО,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ВТ_СрезЦеныНоменклатуры25
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
	|			&Период,
	|			&Ценообразование25
	|				И ВидЦены = &ТипЦены
	|				И (Номенклатура, ХарактеристикаЦО) В
	|					(ВЫБРАТЬ
	|						ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.Объект,
	|						ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.ХарактеристикаЦО
	|					ИЗ
	|						ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами)) КАК ЦеныНоменклатурыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СрезЦеныНоменклатуры20.Номенклатура КАК Номенклатура,
	|	ВТ_СрезЦеныНоменклатуры20.Характеристика КАК Характеристика,
	|	ВТ_СрезЦеныНоменклатуры20.Цена КАК Цена,
	|	ВТ_СрезЦеныНоменклатуры20.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
	|ИЗ
	|	ВТ_СрезЦеныНоменклатуры20 КАК ВТ_СрезЦеныНоменклатуры20
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СрезЦеныНоменклатуры25.Номенклатура,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.ПодчиненныйОбъект,
	|	ВТ_СрезЦеныНоменклатуры25.Цена,
	|	ВТ_СрезЦеныНоменклатуры25.ВидЦены
	|ИЗ
	|	ВТ_СрезЦеныНоменклатуры25 КАК ВТ_СрезЦеныНоменклатуры25
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами КАК ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами
	|		ПО ВТ_СрезЦеныНоменклатуры25.Номенклатура = ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.Объект
	|			И ВТ_СрезЦеныНоменклатуры25.ХарактеристикаЦО = ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.ХарактеристикаЦО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СрезЦеныНоменклатуры25
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СрезЦеныНоменклатуры20
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.Объект КАК Объект,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.ПодчиненныйОбъект КАК ПодчиненныйОбъект,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.ИдентификаторБ24 КАК ИдентификаторБ24,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.ПометкаУдаленияНоменклатуры КАК ПометкаУдаленияНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.ПометкаУдаленияХарактеристикиНоменклатуры КАК ПометкаУдаленияХарактеристикиНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.Родитель КАК Родитель,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.НаименованиеНоменклатуры КАК НаименованиеНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.НаименованиеХарактеристикиНоменклатуры КАК НаименованиеХарактеристикиНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.НаименованиеПолноеНоменклатуры КАК НаименованиеПолноеНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.НаименованиеПолноеХарактеристикиНоменклатуры КАК НаименованиеПолноеХарактеристикиНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.ИдентификаторЕдиницыИзмерения1С КАК ИдентификаторЕдиницыИзмерения1С,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.ИдентификаторЕдиницыИзмеренияБ24 КАК ИдентификаторЕдиницыИзмеренияБ24,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.Артикул КАК Артикул,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.Производитель КАК Производитель,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.ФайлКартинкиНоменклатуры КАК ФайлКартинкиНоменклатуры,
	|	ВТ_ЦеныНоменклатуры.Цена КАК Цена,
	|	ВидыЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.ИдентификаторБ24ВидаНоменклатуры КАК ИдентификаторБ24ВидаНоменклатуры,
	|	ВТ_Остатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ВалютыСправочник.Код КАК ВалютаКод
	|ИЗ
	|	ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами КАК ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыСправочник
	|				ПО ВидыЦен.ВалютаЦены = ВалютыСправочник.Ссылка
	|			ПО ВТ_ЦеныНоменклатуры.ВидЦены = ВидыЦен.Ссылка
	|		ПО ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.Объект = ВТ_ЦеныНоменклатуры.Номенклатура
	|			И ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.ПодчиненныйОбъект = ВТ_ЦеныНоменклатуры.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.Объект = ВТ_Остатки.Номенклатура
	|			И ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами.ПодчиненныйОбъект = ВТ_Остатки.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЦеныНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИнформацияНоменклатурыСХарактеристикамиСИдентификаторами";
	
	ТекстЗапроса = ТекстЗапроса + "	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапроса = ТекстЗапроса +"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_НоменклатураСХарактеристиками.Объект КАК Номенклатура,
	|	ВидыНоменклатуры.НаборСвойств КАК НаборСвойств
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	ВТ_НоменклатураСХарактеристиками КАК ВТ_НоменклатураСХарактеристиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|		ПО ВТ_НоменклатураСХарактеристиками.Объект = Номенклатура.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыСвойств
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхСвойство
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НоменклатураСХарактеристиками.Объект КАК Номенклатура,
	|	ВТ_НоменклатураСХарактеристиками.ПодчиненныйОбъект КАК Характеристика,
	|	ВидыНоменклатуры.НаборСвойствХарактеристик КАК НаборСвойствХарактеристик
	|ПОМЕСТИТЬ ВТ_НоменклатураСХарактеристикамиИНаборами
	|ИЗ
	|	ВТ_НоменклатураСХарактеристиками КАК ВТ_НоменклатураСХарактеристиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|		ПО ВТ_НоменклатураСХарактеристиками.Объект = Номенклатура.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК СвойствоНоменклатуры
	|ПОМЕСТИТЬ ВТ_Свойства
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	НЕ ДополнительныеРеквизитыИСведения.Ссылка В (&СписокСвойствИсключений)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СвойствоНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство КАК Свойство
	|ПОМЕСТИТЬ ВТ_ДопРеквизитыТовара
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = ВТ_Номенклатура.НаборСвойств
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура,
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО (НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = &Справочник_НоменклатураОбщие)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство КАК Свойство
	|ПОМЕСТИТЬ ВТ_ДопСвойстваТовара
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = ВТ_Номенклатура.НаборСвойств
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура,
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО (НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = &Справочник_НоменклатураОбщие)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДопРеквизиты.Номенклатура КАК Номенклатура,
	|	ДопРеквизиты.Свойство КАК Свойство,
	|	ЗначенияДопРеквизитов.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ЗначенияСвойствТовараВрем
	|ИЗ
	|	ВТ_ДопРеквизитыТовара КАК ДопРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ЗначенияДопРеквизитов
	|		ПО ДопРеквизиты.Свойство = ЗначенияДопРеквизитов.Свойство
	|			И ДопРеквизиты.Номенклатура = ЗначенияДопРеквизитов.Ссылка
	|ГДЕ
	|	ДопРеквизиты.Свойство В
	|			(ВЫБРАТЬ
	|				ВТ_Свойства.СвойствоНоменклатуры
	|			ИЗ
	|				ВТ_Свойства)
	|	И НЕ ДопРеквизиты.Свойство ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДопСведения.Номенклатура,
	|	ДопСведения.Свойство,
	|	ЗначенияДопСведений.Значение
	|ИЗ
	|	ВТ_ДопСвойстваТовара КАК ДопСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияДопСведений
	|		ПО ДопСведения.Свойство = ЗначенияДопСведений.Свойство
	|			И ДопСведения.Номенклатура = ЗначенияДопСведений.Объект
	|ГДЕ
	|	ДопСведения.Свойство В
	|			(ВЫБРАТЬ
	|				ВТ_Свойства.СвойствоНоменклатуры
	|			ИЗ
	|				ВТ_Свойства)
	|	И НЕ ДопСведения.Свойство ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДопРеквизитыТовара
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДопСвойстваТовара
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗначенияСвойствТовараВрем.Свойство КАК Свойство,
	|	ВТ_ЗначенияСвойствТовараВрем.Свойство КАК Идентификатор1С,
	|	ИдентификаторыСвойств.Идентификатор КАК ИдентификаторСвойстваБ24,
	|	ВТ_ЗначенияСвойствТовараВрем.Значение КАК Значение,
	|	ВТ_ИдентификаторыЗначенийСвойств.Идентификатор КАК ИдентификаторЗначенияСвойстваБ24,
	|	ВТ_ЗначенияСвойствТовараВрем.Номенклатура КАК Номенклатура,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения КАК ТипЗначения,
	|	ДополнительныеРеквизитыИСведения.ДополнительныеЗначенияИспользуются КАК ДополнительныеЗначенияИспользуются
	|ПОМЕСТИТЬ ВТ_ЗначенияСвойствНоменклатуры
	|ИЗ
	|	ВТ_ЗначенияСвойствТовараВрем КАК ВТ_ЗначенияСвойствТовараВрем
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыСвойств КАК ИдентификаторыСвойств
	|		ПО ВТ_ЗначенияСвойствТовараВрем.Свойство = ИдентификаторыСвойств.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗначенийСвойств КАК ВТ_ИдентификаторыЗначенийСвойств
	|		ПО ВТ_ЗначенияСвойствТовараВрем.Значение = ВТ_ИдентификаторыЗначенийСвойств.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|		ПО ВТ_ЗначенияСвойствТовараВрем.Свойство = ДополнительныеРеквизитыИСведения.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗначенияСвойствТовараВрем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство КАК Свойство,
	|	ВТ_НоменклатураСХарактеристикамиИНаборами.Номенклатура КАК Номенклатура,
	|	ВТ_НоменклатураСХарактеристикамиИНаборами.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ДопРеквизитыХарактеристик
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НоменклатураСХарактеристикамиИНаборами КАК ВТ_НоменклатураСХарактеристикамиИНаборами
	|		ПО НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = ВТ_НоменклатураСХарактеристикамиИНаборами.НаборСвойствХарактеристик
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Характеристика,
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство КАК Свойство,
	|	ВТ_НоменклатураСХарактеристикамиИНаборами.Номенклатура КАК Номенклатура,
	|	ВТ_НоменклатураСХарактеристикамиИНаборами.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ДопСвойстваХарактеристик
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НоменклатураСХарактеристикамиИНаборами КАК ВТ_НоменклатураСХарактеристикамиИНаборами
	|		ПО НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = ВТ_НоменклатураСХарактеристикамиИНаборами.НаборСвойствХарактеристик
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Характеристика,
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДопРеквизиты.Номенклатура КАК Номенклатура,
	|	ДопРеквизиты.Свойство КАК Свойство,
	|	ЗначенияДопРеквизитов.Значение КАК Значение,
	|	ДопРеквизиты.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ЗначенияСвойствХарактеристикВрем
	|ИЗ
	|	ВТ_ДопРеквизитыХарактеристик КАК ДопРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ЗначенияДопРеквизитов
	|		ПО ДопРеквизиты.Свойство = ЗначенияДопРеквизитов.Свойство
	|			И ДопРеквизиты.Характеристика = ЗначенияДопРеквизитов.Ссылка
	|ГДЕ
	|	ДопРеквизиты.Свойство В
	|			(ВЫБРАТЬ
	|				ВТ_Свойства.СвойствоНоменклатуры
	|			ИЗ
	|				ВТ_Свойства)
	|	И НЕ ДопРеквизиты.Свойство ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДопСведения.Номенклатура,
	|	ДопСведения.Свойство,
	|	ЗначенияДопСведений.Значение,
	|	ДопСведения.Характеристика
	|ИЗ
	|	ВТ_ДопСвойстваХарактеристик КАК ДопСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияДопСведений
	|		ПО ДопСведения.Свойство = ЗначенияДопСведений.Свойство
	|			И ДопСведения.Характеристика = ЗначенияДопСведений.Объект
	|ГДЕ
	|	ДопСведения.Свойство В
	|			(ВЫБРАТЬ
	|				ВТ_Свойства.СвойствоНоменклатуры
	|			ИЗ
	|				ВТ_Свойства)
	|	И НЕ ДопСведения.Свойство ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Характеристика,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДопРеквизитыХарактеристик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДопСвойстваХарактеристик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗначенияСвойствХарактеристикВрем.Свойство КАК Свойство,
	|	ВТ_ЗначенияСвойствХарактеристикВрем.Свойство КАК Идентификатор1С,
	|	ИдентификаторыСвойств.Идентификатор КАК ИдентификаторСвойстваБ24,
	|	ВТ_ЗначенияСвойствХарактеристикВрем.Значение КАК Значение,
	|	ВТ_ИдентификаторыЗначенийСвойств.Идентификатор КАК ИдентификаторЗначенияСвойстваБ24,
	|	ВТ_ЗначенияСвойствХарактеристикВрем.Номенклатура КАК Номенклатура,
	|	ВТ_ЗначенияСвойствХарактеристикВрем.Характеристика КАК Характеристика,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения КАК ТипЗначения,
	|	ДополнительныеРеквизитыИСведения.ДополнительныеЗначенияИспользуются КАК ДополнительныеЗначенияИспользуются
	|ПОМЕСТИТЬ ВТ_ЗначенияСвойствХарактеристикНоменклатуры
	|ИЗ
	|	ВТ_ЗначенияСвойствХарактеристикВрем КАК ВТ_ЗначенияСвойствХарактеристикВрем
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗначенийСвойств КАК ВТ_ИдентификаторыЗначенийСвойств
	|		ПО ВТ_ЗначенияСвойствХарактеристикВрем.Значение = ВТ_ИдентификаторыЗначенийСвойств.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыСвойств КАК ИдентификаторыСвойств
	|		ПО ВТ_ЗначенияСвойствХарактеристикВрем.Свойство = ИдентификаторыСвойств.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|		ПО ВТ_ЗначенияСвойствХарактеристикВрем.Свойство = ДополнительныеРеквизитыИСведения.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Характеристика,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗначенияСвойствХарактеристикВрем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Свойства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_НоменклатураСХарактеристикамиИНаборами";
	
	
	ТекстЗапроса = ТекстЗапроса + "	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла,
	|	ИСТИНА КАК ЭтоНоменклатуры,
	|	НоменклатураПрисоединенныеФайлы.Ссылка КАК Файл,
	|	НоменклатураПрисоединенныеФайлы.Наименование КАК Наименование,
	|	НоменклатураПрисоединенныеФайлы.Описание КАК Описание,
	|	НоменклатураПрисоединенныеФайлы.ТипХраненияФайла КАК ТипХраненияФайла,
	|	НоменклатураПрисоединенныеФайлы.Расширение КАК Расширение,
	|	НоменклатураПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
	|	ТомаХраненияФайлов.ПолныйПутьWindows КАК ТомПолныйПутьWindows,
	|	ТомаХраненияФайлов.ПолныйПутьLinux КАК ТомПолныйПутьLinux,
	|	НоменклатураПрисоединенныеФайлы.ПутьКФайлу КАК ПутьКФайлу
	|ПОМЕСТИТЬ ВТ_НоменклатураСВсемиПрисоединеннымиФайлами
	|ИЗ
	|	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТомаХраненияФайлов КАК ТомаХраненияФайлов
	|		ПО НоменклатураПрисоединенныеФайлы.Том = ТомаХраненияФайлов.Ссылка
	|ГДЕ
	|	&ВыгружатьКартинкиИФайлы = ИСТИНА
	|	И НЕ НоменклатураПрисоединенныеФайлы.ПометкаУдаления
	|	И НоменклатураПрисоединенныеФайлы.ВладелецФайла В
	|			(ВЫБРАТЬ
	|				ВТ_НоменклатураСХарактеристиками.Объект
	|			ИЗ
	|				ВТ_НоменклатураСХарактеристиками)
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.Файл КАК Файл
	|ПОМЕСТИТЬ ВТ_НоменклатураСНужнымиПрисоединеннымиФайлами
	|ИЗ
	|	ВТ_НоменклатураСВсемиПрисоединеннымиФайлами КАК ВТ_НоменклатураСВсемиПрисоединеннымиФайлами
	|ГДЕ
	|	&ВыгружатьВсеКартинкиИФайлы = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.Файл
	|ИЗ
	|	РегистрСведений.Б24_КС_ТаблицаИзменений КАК Б24_КС_ТаблицаИзменений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НоменклатураСВсемиПрисоединеннымиФайлами КАК ВТ_НоменклатураСВсемиПрисоединеннымиФайлами
	|		ПО Б24_КС_ТаблицаИзменений.Объект = ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.Файл
	|ГДЕ
	|	Б24_КС_ТаблицаИзменений.НастройкаПодключения = &НастройкаПодключения
	|	И Б24_КС_ТаблицаИзменений.ТипДанных = &ТипДанныхКартинкаФайлТовара
	|	И &ВыгружатьВсеКартинкиИФайлы = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.Файл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_НоменклатураСНужнымиПрисоединеннымиФайлами.Файл КАК Файл,
	|	ДвоичныеДанныеФайлов.Файл КАК ХранимыйФайл,
	|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла
	|ПОМЕСТИТЬ ВТ_НужныеФайлыНоменклатуры
	|ИЗ
	|	ВТ_НоменклатураСНужнымиПрисоединеннымиФайлами КАК ВТ_НоменклатураСНужнымиПрисоединеннымиФайлами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
	|		ПО ВТ_НоменклатураСНужнымиПрисоединеннымиФайлами.Файл = ДвоичныеДанныеФайлов.Файл
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Файл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_НоменклатураСНужнымиПрисоединеннымиФайлами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.ВладелецФайла КАК ВладелецФайла,
	|	ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.Файл КАК Файл,
	|	ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.Наименование КАК Наименование,
	|	ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.Описание КАК Описание,
	|	ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.ТипХраненияФайла КАК ТипХраненияФайла,
	|	ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.Расширение КАК Расширение,
	|	ВТ_НужныеФайлыНоменклатуры.ХранимыйФайл КАК ХранимыйФайл,
	|	ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.ДатаСоздания КАК ДатаСоздания,
	|	ВЫБОР
	|		КОГДА ВТ_НужныеФайлыНоменклатуры.Файл ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НадоВыгружать,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.Расширение В (&СписокРасширенийКартинок)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКартинка,
	|	ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.ТомПолныйПутьWindows КАК ТомПолныйПутьWindows,
	|	ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.ТомПолныйПутьLinux КАК ТомПолныйПутьLinux,
	|	ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.ПутьКФайлу КАК ПутьКФайлу,
	|	ВТ_НужныеФайлыНоменклатуры.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла,
	|	ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.ЭтоНоменклатуры КАК ЭтоНоменклатуры
	|ПОМЕСТИТЬ ВТ_ФайлыНоменклатуры
	|ИЗ
	|	ВТ_НоменклатураСВсемиПрисоединеннымиФайлами КАК ВТ_НоменклатураСВсемиПрисоединеннымиФайлами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НужныеФайлыНоменклатуры КАК ВТ_НужныеФайлыНоменклатуры
	|		ПО ВТ_НоменклатураСВсемиПрисоединеннымиФайлами.Файл = ВТ_НужныеФайлыНоменклатуры.Файл
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВладелецФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_НоменклатураСВсемиПрисоединеннымиФайлами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_НужныеФайлыНоменклатуры";
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
#КонецОбласти
	
	тзнПривязкаНоменклатурыКГруппам = ПолучитьПривязкуНоменклатурыКГруппам(СтруктураНастроек, тзнДанных.ВыгрузитьКолонку("Объект"));
	
	мЭлементы = Новый массив;
	
	ВыгружатьТовары 			= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Товар", "Номенклатура", "ВыгружатьНаПортал");
	ПоляТоваров 				= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Товар", "Номенклатура");
	ОбновлятьНаПорталеТовары 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Товар", "Номенклатура", "ОбновлятьНаПортале");
	
	АлгоритмПриВыгрузкеДанныхНаПорталТоваров = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Товар", "Номенклатура", "АлгоритмПриВыгрузкеДанныхНаПортал");
	
	Пока Выборка.Следующий() Цикл
		
		СформированныйЗапрос = "";
		
		ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(Выборка.ИдентификаторБ24);
		
		Если ВыгружатьТовары Тогда
			
			Если ЭтоНовыйЭлемент ИЛИ (НЕ ЭтоНовыйЭлемент И ОбновлятьНаПорталеТовары) Тогда 
				СформированныйЗапрос = СформироватьСтруктуруДанныхПоТовару(СтруктураНастроек, ПоляТоваров, АлгоритмПриВыгрузкеДанныхНаПорталТоваров, МенеджерВременныхТаблиц, Выборка, тзнПривязкаНоменклатурыКГруппам);
			Иначе
				
				НеобновляемыеДанныеНаПортале = Новый Структура;
				НеобновляемыеДанныеНаПортале.Вставить("Объект"				, Выборка.Объект);
				НеобновляемыеДанныеНаПортале.Вставить("ПодчиненныйОбъект"	, Выборка.ПодчиненныйОбъект);
				
				СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(НеобновляемыеДанныеНаПортале);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов 	= СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	
	пСтруктураНастроек.Логирование.НомерСообщения	 	= СтруктураНастроек.Логирование.НомерСообщения; 	
	
	Возврат мЭлементы;	
	
КонецФункции

Функция ПолучитьПривязкуНоменклатурыКГруппам(СтруктураНастроек, МассивДанных)
	
	ТипДанныхГруппы = ?(СтруктураНастроек.ВерсияТоваров = "v.2", СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара2, СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара); 
	
	Если ((СтруктураНастроек.ВерсияТоваров = "v.2" И СтруктураНастроек.НастройкиСинхронизацииТоваров.ИсточникИерархии = "Произвольная иерархия")
		ИЛИ НЕ СтруктураНастроек.ВерсияТоваров = "v.2") И ЗначениеЗаполнено(СтруктураНастроек.НастройкиСинхронизацииТоваров.ДеревоГрупп) Тогда
	
		ТаблицаТоваровДереваГрупп = Новый ТаблицаЗначений;
		ТаблицаТоваровДереваГрупп.Колонки.Добавить("Идентификатор");
		ТаблицаТоваровДереваГрупп.Колонки.Добавить("Номенклатура");
		ТаблицаТоваровДереваГрупп.Индексы.Добавить("Номенклатура");
		
		ЗапросГрупп = Новый Запрос;
		ЗапросГрупп.УстановитьПараметр("ТипДанныхГруппы", ТипДанныхГруппы);
		ЗапросГрупп.УстановитьПараметр("Инфоблок"		, СтруктураНастроек.НастройкиСинхронизацииТоваров.ДеревоГрупп); 
		ЗапросГрупп.УстановитьПараметр("Портал"			, СтруктураНастроек.Портал);

		ЗапросГрупп.Текст = "ВЫБРАТЬ
		|	Б24_К_ИдентификаторыОбъектов.Объект КАК Группа,
		|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ ВТ_ИдентификаторыГрупп
		|ИЗ
		|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
		|ГДЕ
		|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхГруппы
		|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Б24_КС_ПользовательскиеГруппыТоваровТовары.Номенклатура КАК Номенклатура,
		|	Б24_КС_ПользовательскиеГруппыТоваровТовары.Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
		|	ВТ_ИдентификаторыГрупп.Идентификатор КАК ИдентификаторРаздела
		|ИЗ
		|	Справочник.Б24_КС_ПользовательскиеГруппыТоваров.Товары КАК Б24_КС_ПользовательскиеГруппыТоваровТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыГрупп КАК ВТ_ИдентификаторыГрупп
		|		ПО Б24_КС_ПользовательскиеГруппыТоваровТовары.Ссылка = ВТ_ИдентификаторыГрупп.Группа
		|ГДЕ
		|	Б24_КС_ПользовательскиеГруппыТоваровТовары.Ссылка В ИЕРАРХИИ(&Инфоблок)";
		
		ВыборкаГрупп = ЗапросГрупп.Выполнить().Выбрать();
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		ЗапросТоваров = Новый Запрос;
		ЗапросТоваров.УстановитьПараметр("МассивДанных"	, МассивДанных);
		ЗапросТоваров.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросТоваров.Текст = "ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&МассивДанных)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура";	
		ЗапросТоваров.Выполнить();
		
		ЗапросТоваров = Новый Запрос;
		ЗапросТоваров.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Пока ВыборкаГрупп.Следующий() Цикл
			
			Если ВыборкаГрупп.ЭтоГруппа = Истина Тогда
				ЗапросТоваров.Текст = 
				"ВЫБРАТЬ
				|	ВТ_Номенклатура.Номенклатура
				|ИЗ
				|	ВТ_Номенклатура КАК ВТ_Номенклатура
				|ГДЕ
				|	ВТ_Номенклатура.Номенклатура В ИЕРАРХИИ(&Группа)";
				ЗапросТоваров.УстановитьПараметр("Группа", ВыборкаГрупп.Номенклатура);
			Иначе
				ЗапросТоваров.Текст = 
				"ВЫБРАТЬ
				|	ВТ_Номенклатура.Номенклатура
				|ИЗ
				|	ВТ_Номенклатура КАК ВТ_Номенклатура
				|ГДЕ
				|	ВТ_Номенклатура.Номенклатура = &Номенклатура";
				ЗапросТоваров.УстановитьПараметр("Номенклатура", ВыборкаГрупп.Номенклатура);
			КонецЕсли;
			
			Результат = ЗапросТоваров.Выполнить();
			Если Результат.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
			ВыборкаТоваров = Результат.Выбрать();
			
			Пока ВыборкаТоваров.Следующий() Цикл
				
				НовСтрока = ТаблицаТоваровДереваГрупп.Добавить();
				НовСтрока.Идентификатор = ВыборкаГрупп.ИдентификаторРаздела; 
				НовСтрока.Номенклатура 	= ВыборкаТоваров.Номенклатура; 
				
			КонецЦикла;
			
		КонецЦикла;
		
	ИначеЕсли СтруктураНастроек.ВерсияТоваров = "v.2" И СтруктураНастроек.НастройкиСинхронизацииТоваров.ИсточникИерархии = "Категории номенклатуры" Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивДанных"	, МассивДанных);
		Запрос.УстановитьПараметр("ТипДанныхГруппы"	, ТипДанныхГруппы);
		Запрос.УстановитьПараметр("Портал"			, СтруктураНастроек.Портал);
		Запрос.Текст = "ВЫБРАТЬ
		|	Б24_К_ИдентификаторыОбъектов.Объект КАК Группа,
		|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ ВТ_ИдентификаторыГрупп
		|ИЗ
		|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
		|ГДЕ
		|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхГруппы
		|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.ВидНоменклатуры КАК Родитель
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&МассивДанных)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Родитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|	ВТ_ИдентификаторыГрупп.Идентификатор КАК Идентификатор
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыГрупп КАК ВТ_ИдентификаторыГрупп
		|		ПО (ВТ_ИдентификаторыГрупп.Группа = ВТ_Номенклатура.Родитель)"; 
		ТаблицаТоваровДереваГрупп = Запрос.Выполнить().Выгрузить();     
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивДанных"	, МассивДанных);
		Запрос.УстановитьПараметр("ТипДанныхГруппы"	, ТипДанныхГруппы);
		Запрос.УстановитьПараметр("Портал"			, СтруктураНастроек.Портал);
		Запрос.Текст = "ВЫБРАТЬ
		|	Б24_К_ИдентификаторыОбъектов.Объект КАК Группа,
		|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ ВТ_ИдентификаторыГрупп
		|ИЗ
		|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
		|ГДЕ
		|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхГруппы
		|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.Родитель КАК Родитель
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&МассивДанных)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Родитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|	ВТ_ИдентификаторыГрупп.Идентификатор КАК Идентификатор
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыГрупп КАК ВТ_ИдентификаторыГрупп
		|		ПО (ВТ_ИдентификаторыГрупп.Группа = ВТ_Номенклатура.Родитель)"; 
		ТаблицаТоваровДереваГрупп = Запрос.Выполнить().Выгрузить();     
		
	КонецЕсли;
	
	ТаблицаТоваровДереваГрупп.Свернуть("Идентификатор, Номенклатура");
	
	Возврат ТаблицаТоваровДереваГрупп;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоТовару(СтруктураНастроек, ИнформацияОПолях, АлгоритмПриВыгрузкеДанныхНаПортал, МенеджерВременныхТаблиц, ИнформацияОНоменклатуре, тзнПривязкаТовараКРазделам)
	
	ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(ИнформацияОНоменклатуре.ИдентификаторБ24);
	
	Поля = Новый Структура;
	
	ЕстьХарактеристика = ЗначениеЗаполнено(ИнформацияОНоменклатуре.ПодчиненныйОбъект);
	
	Если НЕ ЕстьХарактеристика Тогда
		КлючТовара 			 = XMLСтрока(ИнформацияОНоменклатуре.Объект);
		Активный 			 = НЕ ИнформацияОНоменклатуре.ПометкаУдаленияНоменклатуры;	
		
		Наименование 		 = ИнформацияОНоменклатуре.НаименованиеНоменклатуры;
		НаименованиеПолное 	 = ИнформацияОНоменклатуре.НаименованиеПолноеНоменклатуры;		
	Иначе
		КлючТовара 			 = XMLСтрока(ИнформацияОНоменклатуре.Объект) + "#" + XMLСтрока(ИнформацияОНоменклатуре.ПодчиненныйОбъект);	
		Активный 			 = НЕ ИнформацияОНоменклатуре.ПометкаУдаленияХарактеристикиНоменклатуры;	
		
		Наименование 		 = ИнформацияОНоменклатуре.НаименованиеНоменклатуры + " :: " + ИнформацияОНоменклатуре.НаименованиеХарактеристикиНоменклатуры;
		НаименованиеПолное 	 = ИнформацияОНоменклатуре.НаименованиеПолноеНоменклатуры + " :: " + ИнформацияОНоменклатуре.НаименованиеПолноеХарактеристикиНоменклатуры;
		
	КонецЕсли;                                                
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИнформацияОПолях"			, ИнформацияОПолях);
	ДополнительныеПараметры.Вставить("КлючЭлемента"				, КлючТовара);
	ДополнительныеПараметры.Вставить("МенеджерВременныхТаблиц"	, МенеджерВременныхТаблиц);
	ДополнительныеПараметры.Вставить("ЭтоНовыйЭлемент"			, ЭтоНовыйЭлемент);
	ДополнительныеПараметры.Вставить("ИнформацияОбъекта1С"		, ИнформацияОНоменклатуре);

	ДополнительныеПараметры.Вставить("Активный"					, Активный);
	ДополнительныеПараметры.Вставить("НаименованиеТовара"		, Наименование);
	ДополнительныеПараметры.Вставить("НаименованиеПолноеТовара"	, НаименованиеПолное);
	ДополнительныеПараметры.Вставить("ПривязкаТовараКРазделам"	, тзнПривязкаТовараКРазделам);
	
	ДополнительныеПараметры.Вставить("Номенклатура"				, ИнформацияОНоменклатуре.Объект);
	ДополнительныеПараметры.Вставить("Характеристика"			, ИнформацияОНоменклатуре.ПодчиненныйОбъект);
	
	
	Поля = ПолучитьСтруктуруКлючейЭлементаВыгрузки(СтруктураНастроек, ДополнительныеПараметры);
	
	Если ЗначениеЗаполнено(СтруктураНастроек.ИдПредопределенногоСвойстваВидаНоменклатуры) Тогда
		Поля.Вставить("PROPERTY_" + СтруктураНастроек.ИдПредопределенногоСвойстваВидаНоменклатуры, ИнформацияОНоменклатуре.ИдентификаторБ24ВидаНоменклатуры)
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураНастроек.ИдПредопределенногоСвойстваАртикулаНоменклатуры) Тогда
		Поля.Вставить("PROPERTY_" + СтруктураНастроек.ИдПредопределенногоСвойстваАртикулаНоменклатуры, ИнформацияОНоменклатуре.Артикул)
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураНастроек.ИдПредопределенногоСвойстваОстатокНоменклатуры) Тогда
		Остаток = ?(ЗначениеЗаполнено(ИнформацияОНоменклатуре.КоличествоОстаток), ИнформацияОНоменклатуре.КоличествоОстаток, 0);
		Поля.Вставить("PROPERTY_" + СтруктураНастроек.ИдПредопределенногоСвойстваОстатокНоменклатуры, Остаток)
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойствТовара(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Товар, МенеджерВременныхТаблиц, "ВТ_ЗначенияСвойствНоменклатуры", ИнформацияОПолях, Поля, ИнформацияОНоменклатуре.Объект);
	
	Если ЕстьХарактеристика Тогда
		ЗаполнитьЗначенияСвойствТовара(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Товар , МенеджерВременныхТаблиц, "ВТ_ЗначенияСвойствХарактеристикНоменклатуры", ИнформацияОПолях, Поля, ИнформацияОНоменклатуре.Объект, ИнформацияОНоменклатуре.ПодчиненныйОбъект);
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(АлгоритмПриВыгрузкеДанныхНаПортал) Тогда
		ВыполнитьАлгоритмПередВыгрузкой(СтруктураНастроек, ИнформацияОНоменклатуре.Объект, Поля, АлгоритмПриВыгрузкеДанныхНаПортал)
	КонецЕсли;
	 	
	ТелоЗапроса = "";
	
	Для каждого ТекПоле Из Поля Цикл
		Если ТекПоле.Значение <> Неопределено Тогда
			Если Лев(ТекПоле.Ключ, 9) = "PROPERTY_" Тогда
				ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "][value]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
			Иначе
				ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;  
	
	ПараметрыКартинки 	= "";
	ЗначенияСвойств 	= "";
#Область КартинкиТовара	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТ_ФайлыНоменклатуры ГДЕ ВТ_ФайлыНоменклатуры.ВладелецФайла В (&ВладелецФайла)"; 
	
	ВладелецФайла = Новый Массив;
	ВладелецФайла.Добавить(ИнформацияОНоменклатуре.Объект);
	Если ЕстьХарактеристика Тогда
		ВладелецФайла.Добавить(ИнформацияОНоменклатуре.ПодчиненныйОбъект);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВладелецФайла", ВладелецФайла);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаименованиеФайла = Выборка.Наименование + ?(Лев(Выборка.Расширение, 1) = ".",Выборка.Расширение, "." + Выборка.Расширение);
		
		Если Выборка.НадоВыгружать И ((НЕ ЕстьХарактеристика И Выборка.Файл = ИнформацияОНоменклатуре.ФайлКартинкиНоменклатуры)
			ИЛИ (ЕстьХарактеристика И Выборка.Файл = ИнформацияОНоменклатуре.ФайлКартинкиНоменклатуры)) Тогда 
			
			Если Выборка.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
				
				Если ЗначениеЗаполнено(Выборка.ДвоичныеДанныеФайла) Тогда
					ДвоичныеДанныеФайла = Выборка.ДвоичныеДанныеФайла.Получить();
					ПараметрыКартинки = ПараметрыКартинки + "&fields[PREVIEW_PICTURE][fileData][0]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(НаименованиеФайла) + "&fields[PREVIEW_PICTURE][fileData][1]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Base64Строка(ДвоичныеДанныеФайла));  
					ПараметрыКартинки = ПараметрыКартинки + "&fields[DETAIL_PICTURE][fileData][0]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(НаименованиеФайла) + "&fields[DETAIL_PICTURE][fileData][1]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Base64Строка(ДвоичныеДанныеФайла));  
				КонецЕсли;		
			Иначе        
				
				ИмяФайла = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьАдресФайлаТома(СтруктураНастроек.ПлатформаWindows, Выборка); 
				Если ЗначениеЗаполнено(ИмяФайла) И Б24_К_ОбщегоНазначенияВызовСервера.СуществуетФайл(ИмяФайла) Тогда
					ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ИмяФайла);
					ПараметрыКартинки = ПараметрыКартинки + "&fields[PREVIEW_PICTURE][fileData][0]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(НаименованиеФайла) + "&fields[PREVIEW_PICTURE][fileData][1]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Base64Строка(ДвоичныеДанныеФайла));  
					ПараметрыКартинки = ПараметрыКартинки + "&fields[DETAIL_PICTURE][fileData][0]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(НаименованиеФайла) + "&fields[DETAIL_PICTURE][fileData][1]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Base64Строка(ДвоичныеДанныеФайла));  
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		СтруктураНастроек.КартинкиИФайлы.Добавить(Выборка.Файл);
		
	КонецЦикла;
#КонецОбласти
	
	ТелоЗапроса = ТелоЗапроса + ПараметрыКартинки;
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючТовара+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.product.add?" + ТелоЗапроса);	
	Иначе
		СтрокаЗапроса = "cmd["+КлючТовара+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.product.update?id=" + ИнформацияОНоменклатуре.ИдентификаторБ24 + "&"  + ТелоЗапроса);	
	КонецЕсли;
	
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючТовара, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.Товар, ИнформацияОНоменклатуре.Объект, ИнформацияОНоменклатуре.ПодчиненныйОбъект));	
	
	Возврат СтрокаЗапроса;
	  
КонецФункции

Процедура УдалениеРегистрацииКартинокИФайлов(СтруктураНастроек, МассивДанных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КартинкиФайлы", МассивДанных);
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_КС_ТаблицаИзменений.Объект КАК Объект,
	|	Б24_КС_ТаблицаИзменений.ТипДанных КАК ТипДанных,
	|	Б24_КС_ТаблицаИзменений.ПодчиненныйОбъект КАК ПодчиненныйОбъект,
	|	Б24_КС_ТаблицаИзменений.НастройкаПодключения КАК НастройкаПодключения
	|ИЗ
	|	РегистрСведений.Б24_КС_ТаблицаИзменений КАК Б24_КС_ТаблицаИзменений
	|ГДЕ
	|	Б24_КС_ТаблицаИзменений.Объект В(&КартинкиФайлы)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		Запись.Удалить();
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////  


Функция СформироватьДанныеПоТоварам2(пСтруктураНастроек, МассивДанных) Экспорт
	
	УстановитьПривилегированныйРежим(Истина); //У некоторых ролей нет прав на тома, поэтому пока привилегированный режим. 
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	мСвойстваИсключения = Новый Массив;
	Если СтруктураНастроек.ПредопределенныеСвойства.Свойство("ПредопределенноеСвойствоВидаНоменклатуры") Тогда 
		мСвойстваИсключения.Добавить(СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоВидаНоменклатуры);	
	КонецЕсли;
	
#Область ИдентификаторыСлужебныхСвойств		

	Если НЕ СтруктураНастроек.ПредопределенныеСвойства.Свойство("ПредопределенноеСвойствоВидаНоменклатуры") Тогда 	
		СтруктураНастроек.ПредопределенныеСвойства.Вставить("ПредопределенноеСвойствоВидаНоменклатуры", Неопределено);	
	КонецЕсли;
	ИдСвойстваВидаНоменклатуры 	= РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара2, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоВидаНоменклатуры); 
	СтруктураНастроек.Вставить("ИдПредопределенногоСвойстваВидаНоменклатуры", ИдСвойстваВидаНоменклатуры);
	
	Если НЕ СтруктураНастроек.ПредопределенныеСвойства.Свойство("ПредопределенноеСвойствоАртикулНоменклатуры") Тогда 	
		СтруктураНастроек.ПредопределенныеСвойства.Вставить("ПредопределенноеСвойствоАртикулНоменклатуры", Неопределено);	
	КонецЕсли;
	ИдСвойстваАртикулаНоменклатуры 	= РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара2, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоАртикулНоменклатуры); 
	СтруктураНастроек.Вставить("ИдПредопределенногоСвойстваАртикулаНоменклатуры", ИдСвойстваАртикулаНоменклатуры);
	
#КонецОбласти    

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
#Область ФормированиеВременныхТаблицДанных
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивДанных", МассивДанных);
	Запрос.УстановитьПараметр("ТипДанных"					, СтруктураНастроек.ТипыОбъектовОбмена.Товар2);
	Запрос.УстановитьПараметр("ТипДанныхСвойство"			, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара2);
	Запрос.УстановитьПараметр("ТипДанныхЗначениеСвойства"	, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара2);
	Запрос.УстановитьПараметр("ТипДанныхЕдиницаИзмерения"	, СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения2);
	Запрос.УстановитьПараметр("ТипДанныхКартинкаФайлТовара"	, СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлТовара2);
	Запрос.УстановитьПараметр("СвойствоВидНоменклатуры"		, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоВидаНоменклатуры);
	Запрос.УстановитьПараметр("Портал"			 			, СтруктураНастроек.Портал);
	Запрос.УстановитьПараметр("НастройкаПодключения"		, СтруктураНастроек.НастройкаПодключения);
	
	Запрос.УстановитьПараметр("ВыгружатьКартинкиИФайлы"		, СтруктураНастроек.НастройкиСинхронизацииТоваров.ВыгружатьКартинкиИФайлы);
	Запрос.УстановитьПараметр("ВыгружатьВсеКартинкиИФайлы"	, СтруктураНастроек.НастройкиСинхронизацииТоваров.ВыгружатьКартинкиИФайлы И СтруктураНастроек.ПолнаяВыгрузка);
	
	Запрос.УстановитьПараметр("Период"						, СтруктураНастроек.ДатаФормирования);
	Запрос.УстановитьПараметр("СписокРасширенийКартинок"	, Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьМассивРазрешенныхРасширенийКартинок());
	Запрос.УстановитьПараметр("СписокСвойствИсключений"		, мСвойстваИсключения);
	
	Запрос.УстановитьПараметр("Справочник_Номенклатура_Общие", Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНаборСвойств("Справочник_Номенклатура_Общие"));
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Объект,
	|	ВидыНоменклатуры.НаборСвойств КАК НаборСвойств
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|ГДЕ
	|	Номенклатура.Ссылка В(&МассивДанных)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.Номенклатура) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО Б24_К_ИдентификаторыОбъектов.Объект = ВТ_Номенклатура.Объект
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЕдиницИзмерения
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЕдиницаИзмерения
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЗначенийСвойств
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЗначениеСвойства
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Ссылка КАК ЗначениеСвойства,
	|	ВидыНоменклатуры.Ссылка КАК ВидНоменклатуры,
	|	ВТ_ИдентификаторыЗначенийСвойств.Идентификатор КАК ИдентификаторБ24ВидаНоменклатуры
	|ПОМЕСТИТЬ ВТ_ЗначенияСвойствВидыНоменклатуры
	|ИЗ
	|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО ЗначенияСвойствОбъектов.Наименование = ВидыНоменклатуры.Наименование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗначенийСвойств КАК ВТ_ИдентификаторыЗначенийСвойств
	|		ПО ЗначенияСвойствОбъектов.Ссылка = ВТ_ИдентификаторыЗначенийСвойств.Объект
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Владелец = &СвойствоВидНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	УпаковкиЕдиницыИзмерения.Вес КАК Вес,
	|	УпаковкиЕдиницыИзмерения.Ширина КАК Ширина,
	|	УпаковкиЕдиницыИзмерения.Высота КАК Высота,
	|	УпаковкиЕдиницыИзмерения.Глубина КАК Глубина
	|ПОМЕСТИТЬ ВТ_Размеры
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|			ПО ((Номенклатура.НаборУпаковок = УпаковкиЕдиницыИзмерения.Владелец
	|						И НЕ Номенклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
	|					ИЛИ Номенклатура.Ссылка = УпаковкиЕдиницыИзмерения.Владелец
	|						И Номенклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры))
	|					И Номенклатура.ЕдиницаИзмерения = УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения)
	|		ПО ВТ_Номенклатура.Объект = Номенклатура.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Объект КАК Объект,
	|	СправочникНоменклатура.ПометкаУдаления КАК ПометкаУдаленияНоменклатуры,
	|	СправочникНоменклатура.Родитель КАК Родитель,
	|	СправочникНоменклатура.Наименование КАК НаименованиеНоменклатуры,
	|	СправочникНоменклатура.НаименованиеПолное КАК НаименованиеПолноеНоменклатуры,
	|	СправочникНоменклатура.Артикул КАК Артикул,
	|	СправочникНоменклатура.Производитель КАК Производитель,
	|	СправочникНоменклатура.СтавкаНДС КАК СтавкаНДС,
	|	СправочникНоменклатура.ФайлКартинки КАК ФайлКартинкиНоменклатуры,
	|	СправочникНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВТ_ЗначенияСвойствВидыНоменклатуры.ИдентификаторБ24ВидаНоменклатуры КАК ИдентификаторБ24ВидаНоменклатуры,
	|	СправочникНоменклатура.Описание КАК Описание,
	|	ЕСТЬNULL(ВТ_Размеры.Высота, 0) КАК Высота,
	|	ЕСТЬNULL(ВТ_Размеры.Глубина, 0) КАК Длина,
	|	ЕСТЬNULL(ВТ_Размеры.Ширина, 0) КАК Ширина,
	|	ЕСТЬNULL(ВТ_Размеры.Вес, 0) КАК Вес
	|ПОМЕСТИТЬ ВТ_ИнформацияНоменклатуры
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ВТ_Номенклатура.Объект = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияСвойствВидыНоменклатуры КАК ВТ_ЗначенияСвойствВидыНоменклатуры
	|		ПО (СправочникНоменклатура.ВидНоменклатуры = ВТ_ЗначенияСвойствВидыНоменклатуры.ВидНоменклатуры)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Размеры КАК ВТ_Размеры
	|		ПО ВТ_Номенклатура.Объект = ВТ_Размеры.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗначенияСвойствВидыНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Размеры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИнформацияНоменклатуры.Объект КАК Объект,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБ24,
	|	ВТ_ИнформацияНоменклатуры.ПометкаУдаленияНоменклатуры КАК ПометкаУдаленияНоменклатуры,
	|	ВТ_ИнформацияНоменклатуры.Родитель КАК Родитель,
	|	ВТ_ИнформацияНоменклатуры.НаименованиеНоменклатуры КАК НаименованиеНоменклатуры,
	|	ВТ_ИнформацияНоменклатуры.НаименованиеПолноеНоменклатуры КАК НаименованиеПолноеНоменклатуры,
	|	ВТ_ИнформацияНоменклатуры.ЕдиницаИзмерения КАК ИдентификаторЕдиницыИзмерения1С,
	|	ВТ_ИдентификаторыЕдиницИзмерения.Идентификатор КАК ИдентификаторЕдиницыИзмеренияБ24,
	|	ВТ_ИнформацияНоменклатуры.Артикул КАК Артикул,
	|	ВТ_ИнформацияНоменклатуры.Производитель КАК Производитель,
	|	ВТ_ИнформацияНоменклатуры.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ИнформацияНоменклатуры.ФайлКартинкиНоменклатуры КАК ФайлКартинкиНоменклатуры,
	|	ВТ_ИнформацияНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВТ_ИнформацияНоменклатуры.ИдентификаторБ24ВидаНоменклатуры КАК ИдентификаторБ24ВидаНоменклатуры,
	|	ВТ_ИнформацияНоменклатуры.Описание КАК Описание,
	|	ВТ_ИнформацияНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_ИнформацияНоменклатуры.Высота КАК Высота,
	|	ВТ_ИнформацияНоменклатуры.Длина КАК Длина,
	|	ВТ_ИнформацияНоменклатуры.Ширина КАК Ширина,
	|	ВТ_ИнформацияНоменклатуры.Вес КАК Вес
	|ПОМЕСТИТЬ ВТ_ИнформацияНоменклатурыСИдентификаторами
	|ИЗ
	|	ВТ_ИнформацияНоменклатуры КАК ВТ_ИнформацияНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|		ПО ВТ_ИнформацияНоменклатуры.Объект = ВТ_ИдентификаторыОбъектов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЕдиницИзмерения КАК ВТ_ИдентификаторыЕдиницИзмерения
	|		ПО ВТ_ИнформацияНоменклатуры.ЕдиницаИзмерения = ВТ_ИдентификаторыЕдиницИзмерения.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыЕдиницИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.Объект КАК Объект,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.ИдентификаторБ24 КАК ИдентификаторБ24,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.ПометкаУдаленияНоменклатуры КАК ПометкаУдаленияНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.Родитель КАК Родитель,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.НаименованиеНоменклатуры КАК НаименованиеНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.НаименованиеПолноеНоменклатуры КАК НаименованиеПолноеНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.ИдентификаторЕдиницыИзмерения1С КАК ИдентификаторЕдиницыИзмерения1С,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.ИдентификаторЕдиницыИзмеренияБ24 КАК ИдентификаторЕдиницыИзмеренияБ24,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.Артикул КАК Артикул,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.Производитель КАК Производитель,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.ФайлКартинкиНоменклатуры КАК ФайлКартинкиНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.ИдентификаторБ24ВидаНоменклатуры КАК ИдентификаторБ24ВидаНоменклатуры,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.Описание КАК Описание,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.Высота КАК Высота,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.Длина КАК Длина,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.Ширина КАК Ширина,
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами.Вес КАК Вес
	|ИЗ
	|	ВТ_ИнформацияНоменклатурыСИдентификаторами КАК ВТ_ИнформацияНоменклатурыСИдентификаторами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИнформацияНоменклатурыСИдентификаторами";
	
	ТекстЗапроса = ТекстЗапроса + "	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапроса = ТекстЗапроса +"ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыСвойств
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхСвойство
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК СвойствоНоменклатуры
	|ПОМЕСТИТЬ ВТ_Свойства
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	НЕ ДополнительныеРеквизитыИСведения.Ссылка В (&СписокСвойствИсключений)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СвойствоНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Объект КАК Номенклатура,
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство КАК Свойство
	|ПОМЕСТИТЬ ВТ_ДопРеквизитыТовара
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = ВТ_Номенклатура.НаборСвойств
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Объект,
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО (НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = &Справочник_Номенклатура_Общие)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Объект КАК Номенклатура,
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство КАК Свойство
	|ПОМЕСТИТЬ ВТ_ДопСвойстваТовара
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = ВТ_Номенклатура.НаборСвойств
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Объект,
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО (НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = &Справочник_Номенклатура_Общие)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДопРеквизиты.Номенклатура КАК Номенклатура,
	|	ДопРеквизиты.Свойство КАК Свойство,
	|	ЗначенияДопРеквизитов.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ЗначенияСвойствТовара_ПРОМ
	|ИЗ
	|	ВТ_ДопРеквизитыТовара КАК ДопРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ЗначенияДопРеквизитов
	|		ПО ДопРеквизиты.Свойство = ЗначенияДопРеквизитов.Свойство
	|			И ДопРеквизиты.Номенклатура = ЗначенияДопРеквизитов.Ссылка
	|ГДЕ
	|	ДопРеквизиты.Свойство В
	|			(ВЫБРАТЬ
	|				ВТ_Свойства.СвойствоНоменклатуры
	|			ИЗ
	|				ВТ_Свойства)
	|	И НЕ ДопРеквизиты.Свойство ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДопСведения.Номенклатура,
	|	ДопСведения.Свойство,
	|	ЗначенияДопСведений.Значение
	|ИЗ
	|	ВТ_ДопСвойстваТовара КАК ДопСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияДопСведений
	|		ПО ДопСведения.Свойство = ЗначенияДопСведений.Свойство
	|			И ДопСведения.Номенклатура = ЗначенияДопСведений.Объект
	|ГДЕ
	|	ДопСведения.Свойство В
	|			(ВЫБРАТЬ
	|				ВТ_Свойства.СвойствоНоменклатуры
	|			ИЗ
	|				ВТ_Свойства)
	|	И НЕ ДопСведения.Свойство ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДопРеквизитыТовара
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДопСвойстваТовара
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗначенияСвойствТовара_ПРОМ.Свойство КАК Свойство,
	|	ВТ_ЗначенияСвойствТовара_ПРОМ.Свойство КАК Идентификатор1С,
	|	ИдентификаторыСвойств.Идентификатор КАК ИдентификаторСвойстваБ24,
	|	ВТ_ЗначенияСвойствТовара_ПРОМ.Значение КАК Значение,
	|	ВТ_ИдентификаторыЗначенийСвойств.Идентификатор КАК ИдентификаторЗначенияСвойстваБ24,
	|	ВТ_ЗначенияСвойствТовара_ПРОМ.Номенклатура КАК Номенклатура,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения КАК ТипЗначения,
	|	ДополнительныеРеквизитыИСведения.ДополнительныеЗначенияИспользуются КАК ДополнительныеЗначенияИспользуются
	|ПОМЕСТИТЬ ВТ_ЗначенияСвойствНоменклатуры
	|ИЗ
	|	ВТ_ЗначенияСвойствТовара_ПРОМ КАК ВТ_ЗначенияСвойствТовара_ПРОМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыСвойств КАК ИдентификаторыСвойств
	|		ПО ВТ_ЗначенияСвойствТовара_ПРОМ.Свойство = ИдентификаторыСвойств.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗначенийСвойств КАК ВТ_ИдентификаторыЗначенийСвойств
	|		ПО ВТ_ЗначенияСвойствТовара_ПРОМ.Значение = ВТ_ИдентификаторыЗначенийСвойств.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|		ПО ВТ_ЗначенияСвойствТовара_ПРОМ.Свойство = ДополнительныеРеквизитыИСведения.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;         
	|           
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗначенияСвойствТовара_ПРОМ
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Свойства";
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
#КонецОбласти
	
	тзнПривязкаНоменклатурыКГруппам = ПолучитьПривязкуНоменклатурыКГруппам(СтруктураНастроек, МассивДанных);
	
	мЭлементы = Новый массив;
	
	ВыгружатьТовары 			= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Товар2", "Номенклатура", "ВыгружатьНаПортал");
	ПоляТоваров 				= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Товар2", "Номенклатура");
	ОбновлятьНаПорталеТовары 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Товар2", "Номенклатура", "ОбновлятьНаПортале");
	
	АлгоритмПриВыгрузкеДанныхНаПорталТоваров = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Товар2", "Номенклатура", "АлгоритмПриВыгрузкеДанныхНаПортал");
	
	Пока Выборка.Следующий() Цикл
		
		СформированныйЗапрос = "";
		
		ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(Выборка.ИдентификаторБ24);
		
		Если ВыгружатьТовары Тогда
			
			Если ЭтоНовыйЭлемент ИЛИ (НЕ ЭтоНовыйЭлемент И ОбновлятьНаПорталеТовары) Тогда 
				СформированныйЗапрос = СформироватьСтруктуруДанныхПоТовару2(СтруктураНастроек, ПоляТоваров, АлгоритмПриВыгрузкеДанныхНаПорталТоваров, МенеджерВременныхТаблиц, Выборка, тзнПривязкаНоменклатурыКГруппам);
			Иначе
				
				СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(Выборка.Объект);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов 	= СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	
	пСтруктураНастроек.Логирование.НомерСообщения	 	= СтруктураНастроек.Логирование.НомерСообщения; 	
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоТовару2(СтруктураНастроек, ИнформацияОПолях, АлгоритмПриВыгрузкеДанныхНаПортал, МенеджерВременныхТаблиц, ИнформацияОНоменклатуре, тзнПривязкаТовараКРазделам)
	
	ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(ИнформацияОНоменклатуре.ИдентификаторБ24);
	
	КлючТовара 		 = XMLСтрока(ИнформацияОНоменклатуре.Объект);
	Активный 		 = НЕ ИнформацияОНоменклатуре.ПометкаУдаленияНоменклатуры;	
	ЦенаВключаетНДС  = Ложь;  
	Прайсы			 = Новый Массив;
	
	Если СтруктураНастроек.НастройкиСинхронизацииТоваров.Свойство("Прайсы") Тогда
		Прайсы = СтруктураНастроек.НастройкиСинхронизацииТоваров.Прайсы;
	КонецЕсли; 
	
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИнформацияОПолях"			, ИнформацияОПолях);
	ДополнительныеПараметры.Вставить("КлючЭлемента"				, КлючТовара);
	ДополнительныеПараметры.Вставить("МенеджерВременныхТаблиц"	, МенеджерВременныхТаблиц);
	ДополнительныеПараметры.Вставить("ЭтоНовыйЭлемент"			, ЭтоНовыйЭлемент);
	ДополнительныеПараметры.Вставить("ИнформацияОбъекта1С"		, ИнформацияОНоменклатуре);
	ДополнительныеПараметры.Вставить("Активный"					, Активный);
	ДополнительныеПараметры.Вставить("Номенклатура"				, ИнформацияОНоменклатуре.Объект);
	ДополнительныеПараметры.Вставить("ПривязкаТовараКРазделам"	, тзнПривязкаТовараКРазделам); 
	ДополнительныеПараметры.Вставить("ЦенаВключаетНДС"			, ЦенаВключаетНДС); 
	
	Поля = ПолучитьСтруктуруКлючейЭлементаВыгрузки(СтруктураНастроек, ДополнительныеПараметры);
	
	Поля.Вставить("iblockId", СтруктураНастроек.НастройкиСинхронизацииТоваров.ИдентификаторКаталогаТоваров);
	
	Если ЗначениеЗаполнено(СтруктураНастроек.ИдПредопределенногоСвойстваВидаНоменклатуры) Тогда
		Поля.Вставить("property" + СтруктураНастроек.ИдПредопределенногоСвойстваВидаНоменклатуры, ИнформацияОНоменклатуре.ИдентификаторБ24ВидаНоменклатуры)
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураНастроек.ИдПредопределенногоСвойстваАртикулаНоменклатуры) Тогда
		Поля.Вставить("property" + СтруктураНастроек.ИдПредопределенногоСвойстваАртикулаНоменклатуры, ИнформацияОНоменклатуре.Артикул)
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойствТовара(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Товар2, МенеджерВременныхТаблиц, "ВТ_ЗначенияСвойствНоменклатуры", ИнформацияОПолях, Поля, ИнформацияОНоменклатуре.Объект);
	
	Если ЗначениеЗаполнено(АлгоритмПриВыгрузкеДанныхНаПортал) Тогда
		ВыполнитьАлгоритмПередВыгрузкой(СтруктураНастроек, ИнформацияОНоменклатуре.Объект, Поля, АлгоритмПриВыгрузкеДанныхНаПортал)
	КонецЕсли;
	 	
	ТелоЗапроса = "";
	
	Для каждого ТекПоле Из Поля Цикл
		Если ТекПоле.Значение <> Неопределено Тогда
			Если Лев(ТекПоле.Ключ, 8) = "property" Тогда
				ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "][value]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
			Иначе
				ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;  

	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючТовара+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.product.add?" + ТелоЗапроса);	
	Иначе
		СтрокаЗапроса = "cmd["+КлючТовара+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.product.update?id=" + ИнформацияОНоменклатуре.ИдентификаторБ24 + "&"  + ТелоЗапроса);	
	КонецЕсли;
	
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючТовара, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.Товар2, ИнформацияОНоменклатуре.Объект, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()));	
	
	Возврат СтрокаЗапроса;
	
КонецФункции

Процедура ЗаполнитьЗначенияСвойствТовара(СтруктураНастроек, ТипДанных, МенеджерВременныхТаблиц, НазваниеТаблицы, ИнформацияОПолях, СтруктураПолей, Номенклатура, Характеристика = Неопределено)

	КлючИмениСвойства = "property";
	Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Товар Тогда   
		КлючИмениСвойства = "PROPERTY_";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура"	, Номенклатура);
	Запрос.УстановитьПараметр("Характеристика"	, Характеристика);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ТекстЗапроса = "ВЫБРАТЬ *
	|ИЗ
	|	"+НазваниеТаблицы+" КАК ВТ_ЗначенияСвойств
	|ГДЕ
	|	ВТ_ЗначенияСвойств.Номенклатура=&Номенклатура";
	
	Если ЗначениеЗаполнено(Характеристика) Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		| И ВТ_ЗначенияСвойств.Характеристика=&Характеристика";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ИдентификаторСвойстваБ24) Тогда
			
			КлючСвойства = КлючИмениСвойства + Выборка.ИдентификаторСвойстваБ24;
			
			Если СтруктураПолей.Свойство(КлючСвойства) = Истина Тогда
				Продолжить;	
			КонецЕсли;
			
			НеИзменять = Ложь;
			Для каждого ТекЭлемент Из ИнформацияОПолях Цикл
				Если ТекЭлемент.КлючЗапроса = КлючСвойства И ТекЭлемент.ИсточникДанных = "Не изменять" Тогда
					НеИзменять = Истина;
					Прервать;	
				КонецЕсли;
			КонецЦикла;       
			
			Если НеИзменять Тогда Продолжить КонецЕсли;          
			
			Если Выборка.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда	
				
				НайденнаяСтрока = СтруктураНастроек.ТаблицаСопоставленияПользователей.Найти(Выборка.Значение, "Пользователь1С");	
				Если НайденнаяСтрока <> Неопределено Тогда
					СтруктураПолей.Вставить(КлючСвойства, НайденнаяСтрока.ИдПользователя);
				Иначе
					СтруктураПолей.Вставить(КлючСвойства, "");
				КонецЕсли;
				
			Иначе
				
				Если Выборка.ДополнительныеЗначенияИспользуются Тогда
					Если ЗначениеЗаполнено(Выборка.ИдентификаторЗначенияСвойстваБ24) Тогда    
						СтруктураПолей.Вставить(КлючСвойства, XMLСтрока(Выборка.ИдентификаторЗначенияСвойстваБ24));
					Иначе
						СтруктураПолей.Вставить(КлючСвойства, "");
					КонецЕсли;     
					
				ИначеЕсли ТипЗнч(Выборка.Значение) = Тип("Булево") И ТипДанных <> СтруктураНастроек.ТипыОбъектовОбмена.Товар Тогда 
					СтруктураПолей.Вставить(КлючСвойства, ?(Выборка.Значение = Истина, "Y", "N"));   
				Иначе                      
					СтруктураПолей.Вставить(КлючСвойства, XMLСтрока(Выборка.Значение));  
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти  


#Область Предложения  

Функция СформироватьДанныеПоПредложениям(пСтруктураНастроек, МассивДанных) Экспорт
	
	УстановитьПривилегированныйРежим(Истина); //У некоторых ролей нет прав на тома, поэтому пока привилегированный режим. 
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	тзнДанных = Новый ТаблицаЗначений;
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив);
	тзнДанных.Колонки.Добавить("Объект", ОписаниеТипов);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив);
	тзнДанных.Колонки.Добавить("ПодчиненныйОбъект", ОписаниеТипов);
	
	Для Каждого ТекЭлемент Из МассивДанных Цикл
		НоваяСтрока = тзнДанных.Добавить();  
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекЭлемент);
	КонецЦикла;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
#Область ФормированиеВременныхТаблицДанных
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Данные"						, тзнДанных);
	Запрос.УстановитьПараметр("ТипДанныхВладелец"			, СтруктураНастроек.ТипыОбъектовОбмена.Товар2);
	Запрос.УстановитьПараметр("ТипДанных"					, СтруктураНастроек.ТипыОбъектовОбмена.Предложение);
	Запрос.УстановитьПараметр("ТипДанныхСвойство"			, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоПредложения);
	Запрос.УстановитьПараметр("ТипДанныхЗначениеСвойства"	, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваПредложения);
	Запрос.УстановитьПараметр("ТипДанныхЕдиницаИзмерения"	, СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения2);
	Запрос.УстановитьПараметр("ТипДанныхКартинкаФайлТовара"	, СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлПредложения);
	Запрос.УстановитьПараметр("Портал"			 			, СтруктураНастроек.Портал);
	Запрос.УстановитьПараметр("НастройкаПодключения"		, СтруктураНастроек.НастройкаПодключения);
	
	Запрос.УстановитьПараметр("ВыгружатьКартинкиИФайлы"		, СтруктураНастроек.НастройкиСинхронизацииТоваров.ВыгружатьКартинкиИФайлы);
	Запрос.УстановитьПараметр("ВыгружатьВсеКартинкиИФайлы"	, СтруктураНастроек.НастройкиСинхронизацииТоваров.ВыгружатьКартинкиИФайлы И СтруктураНастроек.ПолнаяВыгрузка);
	
	Запрос.УстановитьПараметр("Период"						, СтруктураНастроек.ДатаФормирования);
	Запрос.УстановитьПараметр("СписокРасширенийКартинок"	, Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьМассивРазрешенныхРасширенийКартинок());
	
	Запрос.УстановитьПараметр("Справочник_ХарактеристикиНоменклатуры", Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНаборСвойств("Справочник_ХарактеристикиНоменклатуры"));
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Данные.Объект КАК Объект,
	|	Данные.ПодчиненныйОбъект КАК ПодчиненныйОбъект
	|ПОМЕСТИТЬ ВТ_НоменклатураХарактеристики
	|ИЗ
	|	&Данные КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.Номенклатура) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыТоваров
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхВладелец
	|	И Б24_К_ИдентификаторыОбъектов.Объект В
	|			(ВЫБРАТЬ
	|				ВТ_НоменклатураХарактеристики.Объект
	|			ИЗ
	|				ВТ_НоменклатураХарактеристики)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект КАК ПодчиненныйОбъект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыПредложений
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И (Б24_К_ИдентификаторыОбъектов.Объект, Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект) В
	|			(ВЫБРАТЬ
	|				ВТ_НоменклатураХарактеристики.Объект,
	|				ВТ_НоменклатураХарактеристики.ПодчиненныйОбъект
	|			ИЗ
	|				ВТ_НоменклатураХарактеристики)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НоменклатураХарактеристики.Объект КАК Номенклатура,
	|	ВТ_ИдентификаторыТоваров.Идентификатор КАК ИдентификаторТовараБ24,
	|	ВТ_ИдентификаторыПредложений.Идентификатор КАК ИдентификаторПредложенияБ24,
	|	ВТ_НоменклатураХарактеристики.ПодчиненныйОбъект КАК Характеристика
	|ПОМЕСТИТЬ ВТ_НоменклатураХарактеристикиИд
	|ИЗ
	|	ВТ_НоменклатураХарактеристики КАК ВТ_НоменклатураХарактеристики
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыПредложений КАК ВТ_ИдентификаторыПредложений
	|		ПО ВТ_НоменклатураХарактеристики.Объект = ВТ_ИдентификаторыПредложений.Объект
	|			И ВТ_НоменклатураХарактеристики.ПодчиненныйОбъект = ВТ_ИдентификаторыПредложений.ПодчиненныйОбъект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыТоваров КАК ВТ_ИдентификаторыТоваров
	|		ПО (ВТ_ИдентификаторыТоваров.Объект = ВТ_НоменклатураХарактеристики.Объект)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыПредложений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЕдиницИзмерения
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЕдиницаИзмерения
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	УпаковкиЕдиницыИзмерения.Вес КАК Вес,
	|	УпаковкиЕдиницыИзмерения.Ширина КАК Ширина,
	|	УпаковкиЕдиницыИзмерения.Высота КАК Высота,
	|	УпаковкиЕдиницыИзмерения.Глубина КАК Длина
	|ПОМЕСТИТЬ ВТ_ИнформацияТовара
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|		ПО (Номенклатура.НаборУпаковок = УпаковкиЕдиницыИзмерения.Владелец
	|					И НЕ Номенклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
	|				ИЛИ Номенклатура.Ссылка = УпаковкиЕдиницыИзмерения.Владелец
	|					И Номенклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры))
	|			И Номенклатура.ЕдиницаИзмерения = УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения
	|ГДЕ
	|	Номенклатура.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_НоменклатураХарактеристики.Объект
	|			ИЗ
	|				ВТ_НоменклатураХарактеристики)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_НоменклатураХарактеристики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НоменклатураХарактеристикиИд.Номенклатура КАК Номенклатура,
	|	ВТ_НоменклатураХарактеристикиИд.ИдентификаторТовараБ24 КАК ИдентификаторВладельцаБ24,
	|	ВТ_НоменклатураХарактеристикиИд.ИдентификаторПредложенияБ24 КАК ИдентификаторБ24,
	|	ВТ_НоменклатураХарактеристикиИд.Характеристика КАК Характеристика,
	|	НоменклатураСправочник.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВТ_ИнформацияТовара.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_ИнформацияТовара.СтавкаНДС КАК СтавкаНДС,
	|	ЕСТЬNULL(ВТ_ИнформацияТовара.Высота, 0) КАК Высота,
	|	ЕСТЬNULL(ВТ_ИнформацияТовара.Длина, 0) КАК Длина,
	|	ЕСТЬNULL(ВТ_ИнформацияТовара.Ширина, 0) КАК Ширина,
	|	ЕСТЬNULL(ВТ_ИнформацияТовара.Вес, 0) КАК Вес,
	|	ХарактеристикиНоменклатуры.Наименование КАК НаименованиеПредложения,
	|	ХарактеристикиНоменклатуры.НаименованиеПолное КАК НаименованиеПолное,
	|	ВТ_ИдентификаторыЕдиницИзмерения.Идентификатор КАК ИдентификаторЕдиницыИзмеренияБ24,
	|	НоменклатураСправочник.Производитель КАК Производитель,
	|	ВидыНоменклатуры.НаборСвойствХарактеристик КАК НаборСвойствХарактеристик,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.ПометкаУдаления, НоменклатураСправочник.ПометкаУдаления) КАК ПометкаУдаления,
	|	НоменклатураСправочник.Наименование КАК НаименованиеТовара,
	|	НоменклатураСправочник.НаименованиеПолное КАК НаименованиеПолноеТовара,
	|	НоменклатураСправочник.Описание КАК ОписаниеТовара,
	|	ВЫБОР
	|		КОГДА ВТ_НоменклатураХарактеристикиИд.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоНоменклатура
	|ПОМЕСТИТЬ ВТ_ТоварыПредложения
	|ИЗ
	|	ВТ_НоменклатураХарактеристикиИд КАК ВТ_НоменклатураХарактеристикиИд
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ВТ_НоменклатураХарактеристикиИд.Характеристика = ХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЕдиницИзмерения КАК ВТ_ИдентификаторыЕдиницИзмерения
	|			ПО НоменклатураСправочник.ЕдиницаИзмерения = ВТ_ИдентификаторыЕдиницИзмерения.Объект
	|		ПО ВТ_НоменклатураХарактеристикиИд.Номенклатура = НоменклатураСправочник.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО (НоменклатураСправочник.ВидНоменклатуры = ВидыНоменклатуры.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнформацияТовара КАК ВТ_ИнформацияТовара
	|		ПО ВТ_НоменклатураХарактеристикиИд.Номенклатура = ВТ_ИнформацияТовара.Номенклатура
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ НоменклатураСправочник.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать) И ВТ_НоменклатураХарактеристикиИд.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИнформацияТовара
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыЕдиницИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_НоменклатураХарактеристикиИд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыПредложения.Номенклатура КАК Номенклатура,
	|	ВТ_ТоварыПредложения.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ВТ_ТоварыПредложения.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ВТ_ТоварыПредложения.Номенклатура
	|		ИНАЧЕ ВТ_ТоварыПредложения.Характеристика
	|	КОНЕЦ КАК Объект,
	|	ВТ_ТоварыПредложения.ИдентификаторВладельцаБ24 КАК ИдентификаторВладельцаБ24,
	|	ВТ_ТоварыПредложения.ИдентификаторБ24 КАК ИдентификаторБ24,
	|	ВТ_ТоварыПредложения.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВТ_ТоварыПредложения.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_ТоварыПредложения.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ТоварыПредложения.Высота КАК Высота,
	|	ВТ_ТоварыПредложения.Длина КАК Длина,
	|	ВТ_ТоварыПредложения.Ширина КАК Ширина,
	|	ВТ_ТоварыПредложения.Вес КАК Вес,
	|	ВТ_ТоварыПредложения.НаименованиеПредложения КАК НаименованиеПредложения,
	|	ВТ_ТоварыПредложения.НаименованиеПолное КАК НаименованиеПолное,
	|	ВТ_ТоварыПредложения.ИдентификаторЕдиницыИзмеренияБ24 КАК ИдентификаторЕдиницыИзмеренияБ24,
	|	ВТ_ТоварыПредложения.Производитель КАК Производитель,
	|	ВТ_ТоварыПредложения.НаборСвойствХарактеристик КАК НаборСвойствХарактеристик,
	|	ВТ_ТоварыПредложения.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_ТоварыПредложения.НаименованиеТовара КАК НаименованиеТовара,
	|	ВТ_ТоварыПредложения.НаименованиеПолноеТовара КАК НаименованиеПолноеТовара,
	|	ВТ_ТоварыПредложения.ОписаниеТовара КАК ОписаниеТовара,
	|	ВТ_ТоварыПредложения.ЭтоНоменклатура КАК ЭтоНоменклатура
	|ИЗ
	|	ВТ_ТоварыПредложения КАК ВТ_ТоварыПредложения";
	
	ТекстЗапроса = ТекстЗапроса + "	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапроса = ТекстЗапроса +"ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыСвойств
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхСвойство
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыПредложения.Номенклатура КАК Номенклатура,
	|	ВТ_ТоварыПредложения.Характеристика КАК Характеристика,
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство КАК Свойство
	|ПОМЕСТИТЬ ВТ_ДопРеквизитыПредложений
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТоварыПредложения КАК ВТ_ТоварыПредложения
	|		ПО НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = ВТ_ТоварыПредложения.НаборСвойствХарактеристик
	|ГДЕ
	|	ВТ_ТоварыПредложения.ЭтоНоменклатура = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТоварыПредложения.Номенклатура,
	|	ВТ_ТоварыПредложения.Характеристика,
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТоварыПредложения КАК ВТ_ТоварыПредложения
	|		ПО (НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = &Справочник_ХарактеристикиНоменклатуры)
	|ГДЕ
	|	ВТ_ТоварыПредложения.ЭтоНоменклатура = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Характеристика,
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыПредложения.Номенклатура КАК Номенклатура,
	|	ВТ_ТоварыПредложения.Характеристика КАК Характеристика,
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство КАК Свойство
	|ПОМЕСТИТЬ ВТ_ДопСвойстваПредложений
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТоварыПредложения КАК ВТ_ТоварыПредложения
	|		ПО НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = ВТ_ТоварыПредложения.НаборСвойствХарактеристик
	|ГДЕ
	|	ВТ_ТоварыПредложения.ЭтоНоменклатура = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТоварыПредложения.Номенклатура,
	|	ВТ_ТоварыПредложения.Характеристика,
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТоварыПредложения КАК ВТ_ТоварыПредложения
	|		ПО (НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = &Справочник_ХарактеристикиНоменклатуры)
	|ГДЕ
	|	ВТ_ТоварыПредложения.ЭтоНоменклатура = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Характеристика,
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДопРеквизиты.Номенклатура КАК Номенклатура,
	|	ДопРеквизиты.Характеристика КАК Характеристика,
	|	ДопРеквизиты.Свойство КАК Свойство,
	|	ЗначенияДопРеквизитов.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ЗначенияСвойствПредложений_ПРОМ
	|ИЗ
	|	ВТ_ДопРеквизитыПредложений КАК ДопРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ЗначенияДопРеквизитов
	|		ПО ДопРеквизиты.Свойство = ЗначенияДопРеквизитов.Свойство
	|			И ДопРеквизиты.Характеристика = ЗначенияДопРеквизитов.Ссылка
	|ГДЕ
	|	НЕ ДопРеквизиты.Свойство ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДопСведения.Номенклатура,
	|	ДопСведения.Характеристика,
	|	ДопСведения.Свойство,
	|	ЗначенияДопСведений.Значение
	|ИЗ
	|	ВТ_ДопСвойстваПредложений КАК ДопСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияДопСведений
	|		ПО ДопСведения.Свойство = ЗначенияДопСведений.Свойство
	|			И ДопСведения.Характеристика = ЗначенияДопСведений.Объект
	|ГДЕ
	|	НЕ ДопСведения.Свойство ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДопРеквизитыПредложений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЗначенийСвойств
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЗначениеСвойства
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДопСвойстваПредложений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗначенияСвойствПредложений_ПРОМ.Свойство КАК Свойство,
	|	ВТ_ЗначенияСвойствПредложений_ПРОМ.Номенклатура КАК Номенклатура,
	|	ВТ_ЗначенияСвойствПредложений_ПРОМ.Характеристика КАК Характеристика,
	|	ВТ_ЗначенияСвойствПредложений_ПРОМ.Свойство КАК Идентификатор1С,
	|	ИдентификаторыСвойств.Идентификатор КАК ИдентификаторСвойстваБ24,
	|	ВТ_ЗначенияСвойствПредложений_ПРОМ.Значение КАК Значение,
	|	ВТ_ИдентификаторыЗначенийСвойств.Идентификатор КАК ИдентификаторЗначенияСвойстваБ24,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения КАК ТипЗначения,
	|	ДополнительныеРеквизитыИСведения.ДополнительныеЗначенияИспользуются КАК ДополнительныеЗначенияИспользуются
	|ПОМЕСТИТЬ ВТ_ЗначенияСвойствПредложений
	|ИЗ
	|	ВТ_ЗначенияСвойствПредложений_ПРОМ КАК ВТ_ЗначенияСвойствПредложений_ПРОМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыСвойств КАК ИдентификаторыСвойств
	|		ПО ВТ_ЗначенияСвойствПредложений_ПРОМ.Свойство = ИдентификаторыСвойств.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗначенийСвойств КАК ВТ_ИдентификаторыЗначенийСвойств
	|		ПО ВТ_ЗначенияСвойствПредложений_ПРОМ.Значение = ВТ_ИдентификаторыЗначенийСвойств.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|		ПО ВТ_ЗначенияСвойствПредложений_ПРОМ.Свойство = ДополнительныеРеквизитыИСведения.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыЗначенийСвойств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗначенияСвойствПредложений_ПРОМ";
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
#КонецОбласти
	
	мЭлементы = Новый массив;
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ИдентификаторВладельцаБ24) Тогда
			
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Не найден ид у товара: " + Выборка.НаименованиеТовара + ". Будет зарегистрирован к выгрузке");
			РегистрыСведений.Б24_КС_ТаблицаИзменений.ДобавитьОбъектВТаблицуИзменений(СтруктураНастроек.НастройкаПодключения, СтруктураНастроек.ТипыОбъектовОбмена.Товар2
			, Выборка.Номенклатура, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), СтруктураНастроек.ВремяЗапускаВМиллисекундах);  
			
			Продолжить;  
			
		КонецЕсли;
		
		Если Выборка.ЭтоНоменклатура Тогда
			ВыгружатьНаПортал		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Предложение", "Номенклатура", "ВыгружатьНаПортал");
			ПоляПредложений 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Предложение", "Номенклатура");
			ОбновлятьНаПортале 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Предложение", "Номенклатура", "ОбновлятьНаПортале");
			АлгоритмПриВыгрузке 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Предложение", "Номенклатура", "АлгоритмПриВыгрузкеДанныхНаПортал");
		Иначе
			ВыгружатьНаПортал		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Предложение", "ХарактеристикиНоменклатуры", "ВыгружатьНаПортал");
			ПоляПредложений 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Предложение", "ХарактеристикиНоменклатуры");
			ОбновлятьНаПортале 		= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Предложение", "ХарактеристикиНоменклатуры", "ОбновлятьНаПортале");
			АлгоритмПриВыгрузке 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Предложение", "ХарактеристикиНоменклатуры", "АлгоритмПриВыгрузкеДанныхНаПортал");
		КонецЕсли;
		
		СформированныйЗапрос = "";
		
		ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(Выборка.ИдентификаторБ24);
		
		Если ВыгружатьНаПортал Тогда
			                                                                                                
			Если ЭтоНовыйЭлемент ИЛИ (НЕ ЭтоНовыйЭлемент И ОбновлятьНаПортале) Тогда   
				СформированныйЗапрос = СформироватьСтруктуруДанныхПоПредложению(СтруктураНастроек, ПоляПредложений, АлгоритмПриВыгрузке, МенеджерВременныхТаблиц, Выборка);
			Иначе       
				
				НеобновляемыеДанныеНаПортале = Новый Структура;
				НеобновляемыеДанныеНаПортале.Вставить("Объект"				, Выборка.Номенклатура);
				НеобновляемыеДанныеНаПортале.Вставить("ПодчиненныйОбъект"	, Выборка.Характеристика);
				
				СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(НеобновляемыеДанныеНаПортале);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов 	= СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	
	пСтруктураНастроек.Логирование.НомерСообщения	 	= СтруктураНастроек.Логирование.НомерСообщения; 	
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоПредложению(СтруктураНастроек, ИнформацияОПолях, АлгоритмПриВыгрузкеДанныхНаПортал, МенеджерВременныхТаблиц, ИнформацияПредложения)
	
	ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(ИнформацияПредложения.ИдентификаторБ24);
	
	КлючТовара = XMLСтрока(ИнформацияПредложения.Номенклатура)+"#"+XMLСтрока(ИнформацияПредложения.Характеристика);  

	Активный 		= ИнформацияПредложения.ПометкаУдаления = Ложь;	
	ЦенаВключаетНДС = Ложь;  
	Прайсы 			= Новый Массив;
	
	Если СтруктураНастроек.НастройкиСинхронизацииТоваров.Свойство("Прайсы") Тогда
		Прайсы = СтруктураНастроек.НастройкиСинхронизацииТоваров.Прайсы; 
	КонецЕсли;
	
	Если Прайсы.Количество() > 0 Тогда
		ЦенаВключаетНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Прайсы[0].Значение, "ЦенаВключаетНДС");
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИнформацияОПолях"			, ИнформацияОПолях);
	ДополнительныеПараметры.Вставить("КлючЭлемента"				, КлючТовара);
	ДополнительныеПараметры.Вставить("МенеджерВременныхТаблиц"	, МенеджерВременныхТаблиц);
	ДополнительныеПараметры.Вставить("ЭтоНовыйЭлемент"			, ЭтоНовыйЭлемент);
	ДополнительныеПараметры.Вставить("ИнформацияОбъекта1С"		, ИнформацияПредложения);
	ДополнительныеПараметры.Вставить("Активный"					, Активный);             
	ДополнительныеПараметры.Вставить("Номенклатура"				, ИнформацияПредложения.Номенклатура);
	ДополнительныеПараметры.Вставить("Характеристика"			, ИнформацияПредложения.Характеристика);
	ДополнительныеПараметры.Вставить("ЦенаВключаетНДС"			, ЦенаВключаетНДС); 
	
	Поля = ПолучитьСтруктуруКлючейЭлементаВыгрузки(СтруктураНастроек, ДополнительныеПараметры);
	
	Поля.Вставить("iblockId", СтруктураНастроек.НастройкиСинхронизацииТоваров.ИдентификаторКаталогаПредложений);
	Поля.Вставить("parentId", ИнформацияПредложения.ИдентификаторВладельцаБ24);
	
	ЗаполнитьЗначенияСвойствТовара(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Предложение, МенеджерВременныхТаблиц, "ВТ_ЗначенияСвойствПредложений", ИнформацияОПолях, Поля, ИнформацияПредложения.Номенклатура, ИнформацияПредложения.Характеристика);
	
	Если ЗначениеЗаполнено(АлгоритмПриВыгрузкеДанныхНаПортал) Тогда
		ВыполнитьАлгоритмПередВыгрузкой(СтруктураНастроек, ИнформацияПредложения.Характеристика, Поля, АлгоритмПриВыгрузкеДанныхНаПортал)
	КонецЕсли;
	 	
	ТелоЗапроса = "";
	               
	Для каждого ТекПоле Из Поля Цикл
		Если ТекПоле.Значение <> Неопределено Тогда 
			
			НачалоКлюча = Лев(ТекПоле.Ключ, 8);
			Если НачалоКлюча = "property" ИЛИ НачалоКлюча = "parentId" Тогда
				ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "][value]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
			Иначе
				ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
			КонецЕсли; 
			
		КонецЕсли;	
	КонецЦикла;  
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючТовара+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.product.offer.add?" + ТелоЗапроса);	
	Иначе
		СтрокаЗапроса = "cmd["+КлючТовара+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.product.offer.update?id=" + ИнформацияПредложения.ИдентификаторБ24 + "&"  + ТелоЗапроса);	
	КонецЕсли;
	
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючТовара, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.Предложение, ИнформацияПредложения.Номенклатура, ИнформацияПредложения.Характеристика));	
	
	Возврат СтрокаЗапроса;
	
КонецФункции

#КонецОбласти  


#Область КартинкиФайлы  

Функция СформироватьДанныеПоКартинкамФайламТоваровПредложений(пСтруктураНастроек, ТипДанных, МассивДанных) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	

	Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлТовара2 Тогда
		ТипДанныхВладельца = СтруктураНастроек.ТипыОбъектовОбмена.Товар2;		
	Иначе
		ТипДанныхВладельца = СтруктураНастроек.ТипыОбъектовОбмена.Предложение;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДанных"		, МассивДанных);
	Запрос.УстановитьПараметр("ТипДанных"			, ТипДанных);          
	Запрос.УстановитьПараметр("ТипДанныхВладельца"	, ТипДанныхВладельца);
	Запрос.УстановитьПараметр("Портал"				, СтруктураНастроек.Портал);	
	Запрос.УстановитьПараметр("СписокРасширенийКартинок", Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьМассивРазрешенныхРасширенийКартинок());  
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыВладельцев
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхВладельца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла,
	|	НоменклатураПрисоединенныеФайлы.Ссылка КАК Файл,
	|	НоменклатураПрисоединенныеФайлы.Наименование КАК Наименование,
	|	НоменклатураПрисоединенныеФайлы.Описание КАК Описание,
	|	НоменклатураПрисоединенныеФайлы.ТипХраненияФайла КАК ТипХраненияФайла,
	|	НоменклатураПрисоединенныеФайлы.Расширение КАК Расширение,
	|	НоменклатураПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
	|	ТомаХраненияФайлов.ПолныйПутьWindows КАК ТомПолныйПутьWindows,
	|	ТомаХраненияФайлов.ПолныйПутьLinux КАК ТомПолныйПутьLinux,
	|	НоменклатураПрисоединенныеФайлы.ПутьКФайлу КАК ПутьКФайлу,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторФайла,
	|	ВТ_ИдентификаторыВладельцев.Идентификатор КАК ИдентификаторВладельца
	|ПОМЕСТИТЬ ВТ_ПрисоединенныеФайлы
	|ИЗ
	|	ВТ_ИдентификаторыВладельцев КАК ВТ_ИдентификаторыВладельцев
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТомаХраненияФайлов КАК ТомаХраненияФайлов
	|			ПО НоменклатураПрисоединенныеФайлы.Том = ТомаХраненияФайлов.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|			ПО (ВТ_ИдентификаторыОбъектов.Объект = НоменклатураПрисоединенныеФайлы.Ссылка)
	|		ПО ВТ_ИдентификаторыВладельцев.Объект = НоменклатураПрисоединенныеФайлы.ВладелецФайла
	|ГДЕ
	|	&ТипДанных = ЗНАЧЕНИЕ(Перечисление.Б24_К_ТипыДанныхДляОбменаСПорталом.КартинкаФайлТовара2)
	|	И НЕ НоменклатураПрисоединенныеФайлы.ПометкаУдаления
	|	И НоменклатураПрисоединенныеФайлы.Ссылка В(&МассивДанных)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыВладельцев
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвоичныеДанныеФайлов.Файл КАК Файл,
	|	ДвоичныеДанныеФайлов.Файл КАК ХранимыйФайл,
	|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла
	|ПОМЕСТИТЬ ВТ_ДвоичныеДанныеФайлов
	|ИЗ    
	|	РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
	|ГДЕ 
	|   ДвоичныеДанныеФайлов.Файл В(ВЫБРАТЬ ВТ_ПрисоединенныеФайлы.Файл ИЗ ВТ_ПрисоединенныеФайлы)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Файл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла,
	|	ВТ_ПрисоединенныеФайлы.Файл КАК Идентификатор1С,
	|	ВТ_ПрисоединенныеФайлы.ИдентификаторФайла КАК ИдентификаторБ24,
	|	ВТ_ПрисоединенныеФайлы.ИдентификаторВладельца КАК ИдентификаторВладельцаБ24,
	|	ВТ_ПрисоединенныеФайлы.Файл КАК Файл,
	|	ВТ_ПрисоединенныеФайлы.Наименование КАК Наименование,
	|	ВТ_ПрисоединенныеФайлы.Описание КАК Описание,
	|	ВТ_ПрисоединенныеФайлы.ТипХраненияФайла КАК ТипХраненияФайла,
	|	ВТ_ПрисоединенныеФайлы.Расширение КАК Расширение,
	|	ВТ_ДвоичныеДанныеФайлов.ХранимыйФайл КАК ХранимыйФайл,
	|	ВТ_ПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
	|	ВЫБОР
	|		КОГДА ВТ_ПрисоединенныеФайлы.Расширение В (&СписокРасширенийКартинок)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКартинка,
	|	ВТ_ПрисоединенныеФайлы.ТомПолныйПутьWindows КАК ТомПолныйПутьWindows,
	|	ВТ_ПрисоединенныеФайлы.ТомПолныйПутьLinux КАК ТомПолныйПутьLinux,
	|	ВТ_ПрисоединенныеФайлы.ПутьКФайлу КАК ПутьКФайлу,
	|	ВТ_ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла
	|ИЗ
	|	ВТ_ПрисоединенныеФайлы КАК ВТ_ПрисоединенныеФайлы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДвоичныеДанныеФайлов КАК ВТ_ДвоичныеДанныеФайлов
	|		ПО ВТ_ПрисоединенныеФайлы.Файл = ВТ_ДвоичныеДанныеФайлов.Файл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПрисоединенныеФайлы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДвоичныеДанныеФайлов";
	Выборка = Запрос.Выполнить().Выбрать();
	
	мЭлементы 	=  Новый массив;
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ИдентификаторБ24) Тогда
    		СформированныйЗапрос = "cmd[]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.productImage.delete?id="+Выборка.ИдентификаторБ24+"&productId="+Выборка.ИдентификаторВладельцаБ24); 
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
		СформированныйЗапрос = СформироватьСтруктуруДанныхПоФайламТоваровПредложений(СтруктураНастроек, ТипДанных, Выборка, НЕ ЗначениеЗаполнено(Выборка.ИдентификаторБ24));
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	// чтобы лог не затерся.
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	// чтобы лог не затерся.
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоФайламТоваровПредложений(СтруктураНастроек, ТипДанных, ИнформацияФайла, ЭтоНовыйЭлемент)
	
	КлючФайла = XMLСтрока(ИнформацияФайла.Идентификатор1С);	
	
	ТелоЗапроса = "&fields[productId]="+ИнформацияФайла.ИдентификаторВладельцаБ24; 
	ТелоЗапроса = ТелоЗапроса + "&fields[type]=MORE_PHOTO";	
	
	НаименованиеФайла = ИнформацияФайла.Наименование + ?(Лев(ИнформацияФайла.Расширение, 1) = ".",ИнформацияФайла.Расширение, "." + ИнформацияФайла.Расширение);
	
	ТелоЗапроса = ТелоЗапроса + "&fileContent[1]="+Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(НаименованиеФайла); 
			
	Если ИнформацияФайла.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
		Если ЗначениеЗаполнено(ИнформацияФайла.ДвоичныеДанныеФайла) Тогда
			ДвоичныеДанныеФайла = ИнформацияФайла.ДвоичныеДанныеФайла.Получить();   
			
			Если ТипЗнч(ДвоичныеДанныеФайла) = Тип("ДвоичныеДанные") Тогда
				ТелоЗапроса = ТелоЗапроса + "&fileContent[2]="+Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Base64Строка(ДвоичныеДанныеФайла));
			Иначе    
				ТекстИнформации = "У владельца картинки '" + Строка(ИнформацияФайла.ВладелецФайла) + "' Картинка '"+ИнформацияФайла.Наименование+"' записана не в двоичных данных";	
				Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, ТекстИнформации);
				Возврат "";	
			КонецЕсли; 
			
		КонецЕсли;		
	ИначеЕсли ИнформацияФайла.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВТомахНаДиске Тогда           
		ИмяФайла = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьАдресФайлаТома(СтруктураНастроек.ПлатформаWindows, ИнформацияФайла);
		Если ЗначениеЗаполнено(ИмяФайла) И Б24_К_ОбщегоНазначенияВызовСервера.СуществуетФайл(ИмяФайла) Тогда
			ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ИмяФайла);
			ТелоЗапроса = ТелоЗапроса + "&fileContent[2]="+Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Base64Строка(ДвоичныеДанныеФайла)); 
		КонецЕсли;
	Иначе
		Возврат "";	
	КонецЕсли;       
	
	СтрокаЗапроса = "cmd["+КлючФайла+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.productImage.add?" + ТелоЗапроса); 	
	
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючФайла, ПолучитьСтруктуруКлючейБатчЗапросов(ТипДанных, ИнформацияФайла.Идентификатор1С));
	
	Возврат СтрокаЗапроса;
	
КонецФункции

#КонецОбласти


#Область Цены
 
Функция СформироватьДанныеПоЦенам(пСтруктураНастроек, МассивДанных, Пакет) Экспорт
	            
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	тзнДанных = Новый ТаблицаЗначений;  
	тзнДанных.Колонки.Добавить("Объект"				, Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));	
	тзнДанных.Колонки.Добавить("ПодчиненныйОбъект"	, Новый ОписаниеТипов("Неопределено, СправочникСсылка.ХарактеристикиНоменклатуры"));	
	
	Для каждого ТекСтрока Из МассивДанных Цикл 
		НоваяСтрока = тзнДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;
	
	Прайсы = Новый Массив;
	Если СтруктураНастроек.НастройкиСинхронизацииТоваров.Свойство("Прайсы") Тогда
		Прайсы = СтруктураНастроек.НастройкиСинхронизацииТоваров.Прайсы; 
	КонецЕсли;   
	
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;      
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Данные"	, тзнДанных);
	Запрос.УстановитьПараметр("Портал"	, СтруктураНастроек.Портал);	
	Запрос.УстановитьПараметр("Прайсы"	, Прайсы);	
	Запрос.УстановитьПараметр("Период"	, СтруктураНастроек.ДатаФормирования);	
	Запрос.УстановитьПараметр("ТипДанныхТовар"		, СтруктураНастроек.ТипыОбъектовОбмена.Товар2);
	Запрос.УстановитьПараметр("ТипДанныхПредложение", СтруктураНастроек.ТипыОбъектовОбмена.Предложение);
	Запрос.УстановитьПараметр("ТипДанныхПрайс"		, СтруктураНастроек.ТипыОбъектовОбмена.Прайс); 
	Запрос.УстановитьПараметр("Ценообразование20"	, СтруктураНастроек.ИспользуетсяЦенообразование20);
	Запрос.УстановитьПараметр("Ценообразование25"	, СтруктураНастроек.ИспользуетсяЦенообразование25);
	Запрос.Текст = "ВЫБРАТЬ
	|	Данные.Объект КАК Объект,
	|	Данные.ПодчиненныйОбъект КАК ПодчиненныйОбъект
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&Данные КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Объект КАК Номенклатура,
	|	ВТ_Данные.ПодчиненныйОбъект КАК Характеристика,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)) КАК ХарактеристикаЦО
	|ПОМЕСТИТЬ ВТ_ДанныеДляЗапросаЦО
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ВТ_Данные.ПодчиненныйОбъект = ХарактеристикиНоменклатуры.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект,
	|	Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор     
	|ПОМЕСТИТЬ ВТ_ИдентификаторыВладельца
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхПредложение
	|	И (Б24_К_ИдентификаторыОбъектов.Объект, Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект) В
	|			(ВЫБРАТЬ
	|				ВТ_Данные.Объект,
	|				ВТ_Данные.ПодчиненныйОбъект
	|			ИЗ
	|				ВТ_Данные)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Объект КАК Номенклатура,
	|	ВТ_Данные.ПодчиненныйОбъект КАК Характеристика,
	|	ВТ_ИдентификаторыВладельца.Идентификатор КАК ИдентификаторВладельцаБ24
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыВладельца КАК ВТ_ИдентификаторыВладельца
	|		ПО ВТ_Данные.Объект = ВТ_ИдентификаторыВладельца.Объект
	|			И ВТ_Данные.ПодчиненныйОбъект = ВТ_ИдентификаторыВладельца.ПодчиненныйОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыВладельца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ВТ_СрезЦеныНоменклатуры20
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Период,
	|			&Ценообразование20
	|				И ВидЦены В (&Прайсы)
	|				И (Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						ВТ_Данные.Объект,
	|						ВТ_Данные.ПодчиненныйОбъект
	|					ИЗ
	|						ВТ_Данные)) КАК ЦеныНоменклатурыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО КАК ХарактеристикаЦО,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ВТ_СрезЦеныНоменклатуры25
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
	|			&Период,
	|			&Ценообразование25
	|				И ВидЦены В (&Прайсы)
	|				И (Номенклатура, ХарактеристикаЦО) В
	|					(ВЫБРАТЬ
	|						ВТ_ДанныеДляЗапросаЦО.Номенклатура,
	|						ВТ_ДанныеДляЗапросаЦО.ХарактеристикаЦО
	|					ИЗ
	|						ВТ_ДанныеДляЗапросаЦО)) КАК ЦеныНоменклатурыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СрезЦеныНоменклатуры20.Номенклатура КАК Номенклатура,
	|	ВТ_СрезЦеныНоменклатуры20.Характеристика КАК Характеристика,
	|	ВТ_СрезЦеныНоменклатуры20.Цена КАК Цена,
	|	ВТ_СрезЦеныНоменклатуры20.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ВТ_Цены_ПРОМ
	|ИЗ
	|	ВТ_СрезЦеныНоменклатуры20 КАК ВТ_СрезЦеныНоменклатуры20
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СрезЦеныНоменклатуры25.Номенклатура,
	|	ВТ_ДанныеДляЗапросаЦО.Характеристика,
	|	ВТ_СрезЦеныНоменклатуры25.Цена,
	|	ВТ_СрезЦеныНоменклатуры25.ВидЦены
	|ИЗ
	|	ВТ_СрезЦеныНоменклатуры25 КАК ВТ_СрезЦеныНоменклатуры25
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеДляЗапросаЦО КАК ВТ_ДанныеДляЗапросаЦО
	|		ПО ВТ_СрезЦеныНоменклатуры25.Номенклатура = ВТ_ДанныеДляЗапросаЦО.Номенклатура
	|			И ВТ_СрезЦеныНоменклатуры25.ХарактеристикаЦО = ВТ_ДанныеДляЗапросаЦО.ХарактеристикаЦО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДанныеДляЗапросаЦО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СрезЦеныНоменклатуры25
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СрезЦеныНоменклатуры20
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыПрайсов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхПрайс
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&Прайсы)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Цены_ПРОМ.Номенклатура КАК Номенклатура,
	|	ВТ_Цены_ПРОМ.Характеристика КАК Характеристика,
	|	ВТ_Цены_ПРОМ.Цена КАК Цена,
	|	ВТ_Цены_ПРОМ.ВидЦены КАК ВидЦены,
	|	ВТ_ИдентификаторыПрайсов.Идентификатор КАК ИдентификаторПрайсаБ24,
	|	СправочникВалюты.Код КАК КодВалюты
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	ВТ_Цены_ПРОМ КАК ВТ_Цены_ПРОМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыПрайсов КАК ВТ_ИдентификаторыПрайсов
	|		ПО ВТ_Цены_ПРОМ.ВидЦены = ВТ_ИдентификаторыПрайсов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК СправочникВалюты
	|			ПО ВидыЦен.ВалютаЦены = СправочникВалюты.Ссылка
	|		ПО ВТ_Цены_ПРОМ.ВидЦены = ВидыЦен.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыПрайсов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Цены_ПРОМ"; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	мЭлементы = Новый массив;
	
	Пока Выборка.Следующий() Цикл
		
		СформированныйЗапрос = СформироватьСтруктуруДанныхПоЦене(СтруктураНастроек, МенеджерВременныхТаблиц, Пакет, Выборка);
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	// чтобы лог не затерся.
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	// чтобы лог не затерся.
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоЦене(СтруктураНастроек, МенеджерВременныхТаблиц, Пакет, ИнформацияЦены)
	
	ЕстьОшибка = Ложь;     
	ЕстьДанные = Ложь;     
	
	Если НЕ ЗначениеЗаполнено(ИнформацияЦены.ИдентификаторВладельцаБ24) Тогда
		ЕстьОшибка = Истина;
	КонецЕсли;
	
	Если ЕстьОшибка Тогда 
		
		ДанныеКлюча = Новый Структура;
		ДанныеКлюча.Вставить("Объект"			, ИнформацияЦены.Номенклатура);
		ДанныеКлюча.Вставить("ПодчиненныйОбъект", ИнформацияЦены.Характеристика);
		
		УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, СтруктураНастроек.ТипыОбъектовОбмена.Цена, Пакет, ДанныеКлюча);    
		
		Возврат ""; 
		
	КонецЕсли;
	
	Если ЕстьОшибка Тогда Возврат "" КонецЕсли;
	
	КлючЦены = XMLСтрока(ИнформацияЦены.Номенклатура)+"#"+XMLСтрока(ИнформацияЦены.Характеристика);	
	
	ТелоЗапроса = "fields[product][id]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИнформацияЦены.ИдентификаторВладельцаБ24);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц; 
	Запрос.УстановитьПараметр("Номенклатура"	, ИнформацияЦены.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика"	, ИнформацияЦены.Характеристика);
	Запрос.Текст = 	"ВЫБРАТЬ
	|	ВТ_Цены.Цена КАК Цена,
	|	ВТ_Цены.КодВалюты КАК КодВалюты,             
	|	ВТ_Цены.ВидЦены КАК ВидЦены,             
	|	ВТ_Цены.ИдентификаторПрайсаБ24 КАК ИдентификаторПрайсаБ24
	|ИЗ
	|	ВТ_Цены КАК ВТ_Цены
	|ГДЕ
	|	ВТ_Цены.Номенклатура = &Номенклатура
	|	И ВТ_Цены.Характеристика = &Характеристика"; 
	ВыполненныйЗапрос = Запрос.Выполнить();
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		
		Итератор = 0;
		ВыборкаДанных = ВыполненныйЗапрос.Выбрать();
		Пока ВыборкаДанных.Следующий() Цикл  
			
			Итератор 	= Итератор + 1;
			ЕстьДанные	= Истина;
			
			Если НЕ ЗначениеЗаполнено(ВыборкаДанных.ИдентификаторПрайсаБ24) Тогда             
				Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Не найден ид у прайсы: " + ВыборкаДанных.ВидЦены + ". Будет зарегистрирован к выгрузке");
				РегистрыСведений.Б24_КС_ТаблицаИзменений.ДобавитьОбъектВТаблицуИзменений(СтруктураНастроек.НастройкаПодключения, СтруктураНастроек.ТипыОбъектовОбмена.Прайс
				, ВыборкаДанных.ВидЦены,, СтруктураНастроек.ВремяЗапускаВМиллисекундах);  
				ЕстьОшибка = Истина;
			КонецЕсли;      
			
			ИтераторСтрокой = Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Формат(Итератор, "ЧГ=0"));
			КодВалюты = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьВалютуПоКоду(Лев(ВыборкаДанных.КодВалюты, 3));
			
			ТелоЗапроса = ТелоЗапроса + "&fields[product][prices]["+ИтераторСтрокой+"][catalogGroupId]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ВыборкаДанных.ИдентификаторПрайсаБ24);
			ТелоЗапроса = ТелоЗапроса + "&fields[product][prices]["+ИтераторСтрокой+"][currency]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(КодВалюты);
			ТелоЗапроса = ТелоЗапроса + "&fields[product][prices]["+ИтераторСтрокой+"][price]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ВыборкаДанных.Цена);
			
		КонецЦикла;
	
	КонецЕсли;
	
	Если ЕстьОшибка Тогда Возврат "" КонецЕсли;
	
	Если ЕстьДанные Тогда
		СтрокаЗапроса = "cmd["+КлючЦены+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.price.modify?" + ТелоЗапроса);	 
		СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючЦены, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.Цена, ИнформацияЦены.Номенклатура, ИнформацияЦены.Характеристика));
	Иначе           
		
		ДанныеКлюча = Новый Структура;
		ДанныеКлюча.Вставить("Объект"			, ИнформацияЦены.Номенклатура);
		ДанныеКлюча.Вставить("ПодчиненныйОбъект", ИнформацияЦены.Характеристика);
		
		УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, СтруктураНастроек.ТипыОбъектовОбмена.Цена, Пакет, ДанныеКлюча);    
		
	КонецЕсли;
	
	
	Возврат СтрокаЗапроса;
	
КонецФункции

#КонецОбласти


#Область Остатки
 
Функция СформироватьДанныеПоОстаткам(пСтруктураНастроек, МассивДанных, Пакет) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	тзнДанных = Новый ТаблицаЗначений;
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив);
	тзнДанных.Колонки.Добавить("Объект", ОписаниеТипов);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив);
	тзнДанных.Колонки.Добавить("ПодчиненныйОбъект", ОписаниеТипов);
	
	Для Каждого ТекЭлемент Из МассивДанных Цикл
		НоваяСтрока = тзнДанных.Добавить();  
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекЭлемент);
	КонецЦикла;
	
	Склады = Новый Массив;
	Если СтруктураНастроек.НастройкиСинхронизацииТоваров.Свойство("Склады") Тогда
		Склады = СтруктураНастроек.НастройкиСинхронизацииТоваров.Склады; 
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;      
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Данные"		, тзнДанных);
	Запрос.УстановитьПараметр("ТипДанных"	, СтруктураНастроек.ТипыОбъектовОбмена.Остаток);
	Запрос.УстановитьПараметр("Портал"		, СтруктураНастроек.Портал);	
	Запрос.УстановитьПараметр("Склады"		, Склады);	
	Запрос.УстановитьПараметр("Период"		, СтруктураНастроек.ДатаФормирования);	
	Запрос.УстановитьПараметр("ТипДанныхТовар"		, СтруктураНастроек.ТипыОбъектовОбмена.Товар2);
	Запрос.УстановитьПараметр("ТипДанныхПредложение", СтруктураНастроек.ТипыОбъектовОбмена.Предложение);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Данные.Объект КАК Объект,
	|	Данные.ПодчиненныйОбъект КАК ПодчиненныйОбъект
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&Данные КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект,
	|	Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор   
	|ПОМЕСТИТЬ ВТ_ИдентификаторыВладельца
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхПредложение
	|	И (Б24_К_ИдентификаторыОбъектов.Объект, Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект) В
	|			(ВЫБРАТЬ
	|				ВТ_Данные.Объект,
	|				ВТ_Данные.ПодчиненныйОбъект
	|			ИЗ
	|				ВТ_Данные)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Данные.Объект КАК Номенклатура,
	|	ВТ_Данные.ПодчиненныйОбъект КАК Характеристика,
	|	ВТ_ИдентификаторыВладельца.Идентификатор КАК ИдентификаторВладельцаБ24
	|ПОМЕСТИТЬ ВТ_СопоставленныеДанные
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыВладельца КАК ВТ_ИдентификаторыВладельца
	|		ПО ВТ_Данные.Объект = ВТ_ИдентификаторыВладельца.Объект
	|			И ВТ_Данные.ПодчиненныйОбъект = ВТ_ИдентификаторыВладельца.ПодчиненныйОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыВладельца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Данные
	|;
	|      
	| ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
	|	РаспределениеЗапасов.Характеристика КАК Характеристика,
	|	СУММА(РаспределениеЗапасов.Свободно) КАК ВНаличииОстаток
	|ПОМЕСТИТЬ ВТ_Запасы
	|ИЗ
	|	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|ГДЕ
	|	РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|	И РаспределениеЗапасов.Склад В(&Склады)  
	|				И (Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						ВТ_СопоставленныеДанные.Номенклатура,
	|						ВТ_СопоставленныеДанные.Характеристика
	|					ИЗ
	|						ВТ_СопоставленныеДанные)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспределениеЗапасов.Номенклатура,
	|	РаспределениеЗапасов.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СопоставленныеДанные.Номенклатура КАК Номенклатура,
	|	ВТ_СопоставленныеДанные.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ВТ_Запасы.ВНаличииОстаток, 0) КАК ВНаличииОстаток,
	|	ВТ_СопоставленныеДанные.ИдентификаторВладельцаБ24 КАК ИдентификаторВладельцаБ24
	|ИЗ
	|	ВТ_СопоставленныеДанные КАК ВТ_СопоставленныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Запасы КАК ВТ_Запасы
	|		ПО ВТ_СопоставленныеДанные.Номенклатура = ВТ_Запасы.Номенклатура
	|			И ВТ_СопоставленныеДанные.Характеристика = ВТ_Запасы.Характеристика";
	Выборка = Запрос.Выполнить().Выбрать();
	
	мЭлементы 	=  Новый массив;
	
	Пока Выборка.Следующий() Цикл
		
		СформированныйЗапрос = СформироватьСтруктуруДанныхПоОстатку(СтруктураНастроек, Пакет, Выборка);
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	// чтобы лог не затерся.
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	// чтобы лог не затерся.
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоОстатку(СтруктураНастроек, Пакет, ИнформацияОстатка)        
	
	ЕстьОшибка = Ложь;     
	
	Если НЕ ЗначениеЗаполнено(ИнформацияОстатка.ИдентификаторВладельцаБ24) Тогда
		ЕстьОшибка = Истина;
	КонецЕсли;
	
	Если ЕстьОшибка Тогда
		
		ДанныеКлюча = Новый Структура;
		ДанныеКлюча.Вставить("Объект"			, ИнформацияОстатка.Номенклатура);
		ДанныеКлюча.Вставить("ПодчиненныйОбъект", ИнформацияОстатка.Характеристика);
		
		УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, СтруктураНастроек.ТипыОбъектовОбмена.Остаток, Пакет, ДанныеКлюча);    
		
		Возврат "";
		
	КонецЕсли;
	
	КлючОстатка = XMLСтрока(ИнформацияОстатка.Номенклатура)+"#"+XMLСтрока(ИнформацияОстатка.Характеристика);	
	
	ТелоЗапроса = "&fields[iblockId]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(СтруктураНастроек.НастройкиСинхронизацииТоваров.ИдентификаторКаталогаПредложений);
	ТелоЗапроса = ТелоЗапроса + "&fields[quantity]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИнформацияОстатка.ВНаличииОстаток);
	
	СтрокаЗапроса = "cmd["+КлючОстатка+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.product.offer.update?id=" + ИнформацияОстатка.ИдентификаторВладельцаБ24 + "&" + ТелоЗапроса);	
	
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючОстатка, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.Остаток, ИнформацияОстатка.Номенклатура, ИнформацияОстатка.Характеристика));
	
	Возврат СтрокаЗапроса;
	
КонецФункции

#КонецОбласти


#Область ПользовательскиеПоля  

Функция СформироватьДанныеПоПользовательскимПолям(пСтруктураНастроек, ТипДанных, МассивДанных, Пакет) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКомпании Тогда
		ТипЗначенияСвойств 	= СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКомпании; 
		ИдВладельца = "CRM_COMPANY";
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКонтакта Тогда
		ТипЗначенияСвойств 	= СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКонтакта;
		ИдВладельца = "CRM_CONTACT";
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСделки Тогда
		ТипЗначенияСвойств 	= СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСделки; 
		ИдВладельца = "CRM_DEAL";
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета Тогда
		ТипЗначенияСвойств 	= СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСчета;
		ИдВладельца = "CRM_INVOICE";
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета2 Тогда
		ТипЗначенияСвойств 	= СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСчета2;
		ИдВладельца = "CRM_SMART_INVOICE";
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоЗаказа Тогда
		ТипЗначенияСвойств 	= СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваЗаказа;
		ИдВладельца = "";
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
#Область ФормированиеВременныхТаблицДанных		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДанных"			, МассивДанных);
	Запрос.УстановитьПараметр("ТипДанных"				, ТипДанных);
	Запрос.УстановитьПараметр("ТипДанныхЗначенийСвойств", ТипЗначенияСвойств);
	Запрос.УстановитьПараметр("Портал"			 		, СтруктураНастроек.Портал);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор,
	|	Б24_К_ИдентификаторыОбъектов.ДополнительныйИдентификатор КАК ДополнительныйИдентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Владелец КАК Владелец,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор,
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЗначенийСвойствВрем
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО Б24_К_ИдентификаторыОбъектов.Объект = ЗначенияСвойствОбъектов.Ссылка
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЗначенийСвойств
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИдентификаторыЗначенийСвойствВрем.Объект КАК Объект,
	|	ВТ_ИдентификаторыЗначенийСвойствВрем.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЗначенийСвойств
	|ИЗ
	|	ВТ_ИдентификаторыЗначенийСвойствВрем КАК ВТ_ИдентификаторыЗначенийСвойствВрем
	|ГДЕ
	|	ВТ_ИдентификаторыЗначенийСвойствВрем.Владелец В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыЗначенийСвойствВрем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Объект,
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Идентификатор1С,
	|	ДополнительныеРеквизитыИСведения.ПометкаУдаления КАК ПометкаУдаления,
	|	ДополнительныеРеквизитыИСведения.Заголовок КАК Заголовок,
	|	ДополнительныеРеквизитыИСведения.Наименование КАК Наименование,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения КАК ТипЗначения,
	|	ДополнительныеРеквизитыИСведения.ЗаполнятьОбязательно КАК ЗаполнятьОбязательно,
	|	ДополнительныеРеквизитыИСведения.НаборСвойств КАК НаборСвойств
	|ПОМЕСТИТЬ ВТ_Свойства
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Ссылка В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Ссылка КАК Объект,
	|	ЗначенияСвойствОбъектов.Ссылка КАК Идентификатор1С,
	|	ЗначенияСвойствОбъектов.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗначенияСвойствОбъектов.Наименование КАК Наименование,
	|	ЗначенияСвойствОбъектов.ПолноеНаименование КАК ПолноеНаименование,
	|	ВТ_ИдентификаторыЗначенийСвойств.Идентификатор КАК ИдентификаторБ24,
	|	ЗначенияСвойствОбъектов.Владелец КАК Свойство
	|ПОМЕСТИТЬ ВТ_ЗначенияСвойств
	|ИЗ
	|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗначенийСвойств КАК ВТ_ИдентификаторыЗначенийСвойств
	|		ПО ЗначенияСвойствОбъектов.Ссылка = ВТ_ИдентификаторыЗначенийСвойств.Объект
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Владелец В
	|			(ВЫБРАТЬ
	|				ВТ_Свойства.Объект
	|			ИЗ
	|				ВТ_Свойства)
	|	И ЗначенияСвойствОбъектов.ПометкаУдаления = ЛОЖЬ
	|	И ЗначенияСвойствОбъектов.ЭтоГруппа = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Свойства.Объект КАК Объект,
	|	ВТ_Свойства.Идентификатор1С КАК Идентификатор1С,
	|	ВТ_Свойства.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_Свойства.Заголовок КАК Заголовок,
	|	ВТ_Свойства.Наименование КАК Наименование,
	|	ВТ_Свойства.ТипЗначения КАК ТипЗначения,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБ24,
	|	ВТ_Свойства.ЗаполнятьОбязательно КАК ЗаполнятьОбязательно,
	|	ВТ_Свойства.НаборСвойств КАК НаборСвойств,
	|	ВТ_ИдентификаторыОбъектов.ДополнительныйИдентификатор КАК ИмяПоля
	|ИЗ
	|	ВТ_Свойства КАК ВТ_Свойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|		ПО ВТ_Свойства.Объект = ВТ_ИдентификаторыОбъектов.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыЗначенийСвойств";
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
#КонецОбласти
	
	мЭлементы 	=  Новый массив;
	
	Пока Выборка.Следующий() Цикл
		
		СформированныйЗапрос = СформироватьСтруктуруДанныхПоПользовательскомуПолю(СтруктураНастроек, ТипДанных, ИдВладельца, МенеджерВременныхТаблиц, Пакет, Выборка, НЕ ЗначениеЗаполнено(Выборка.ИдентификаторБ24));
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	// чтобы лог не затерся.
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	// чтобы лог не затерся.
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоПользовательскомуПолю(СтруктураНастроек, ТипДанных, ИдВладельца, МенеджерВременныхТаблиц, Пакет, ИнформацияОПользовательскомПоле, ЭтоНовыйЭлемент)
	
	КлючПоля = XMLСтрока(ИнформацияОПользовательскомПоле.Идентификатор1С);	
	
	лЗначенияСвойств = "";
	
	Поля = Новый Структура;
	
	Поля.Вставить("entityId", ИдВладельца); 
	Поля.Вставить("xmlId "	, КлючПоля); 
	
	Если ЭтоНовыйЭлемент Тогда
		
		Если ЗначениеЗаполнено(ИнформацияОПользовательскомПоле.ИмяПоля) И ЗначениеЗаполнено(ИнформацияОПользовательскомПоле.ИдентификаторБ24) Тогда
			Поля.Вставить("fieldName", ИнформацияОПользовательскомПоле.ИмяПоля); 
		Иначе
			Поля.Вставить("fieldName", "UF_" + ИдВладельца + "_" + Прав(Формат(ТекущаяУниверсальнаяДатаВМиллисекундах(),"ЧГ=0"),13)); 
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ТипДанных, ИнформацияОПользовательскомПоле.Объект, "", Поля.fieldName);
		КонецЕсли;
		
	Иначе
		Поля.Вставить("fieldName", ИнформацияОПользовательскомПоле.ИмяПоля); 
	КонецЕсли;
	
	НаименованиеСвойства = ИнформацияОПользовательскомПоле.Заголовок;
	НаименованиеСвойства = СтрЗаменить(НаименованиеСвойства, " по данным 1С для Битрикс24", "");
	НаименованиеСвойства = СтрЗаменить(НаименованиеСвойства, " для Битрикс24", "");
	
	Поля.Вставить("mandatory"		 , ?(ИнформацияОПользовательскомПоле.ЗаполнятьОбязательно,"Y","N"));  	
	Поля.Вставить("multiple"		 , "N");  	
	
	ТипЗначенияСвойства = ИнформацияОПользовательскомПоле.ТипЗначения;	
	
	Если ТипЗначенияСвойства.СодержитТип(Тип("Строка")) Тогда
		
		Если ИнформацияОПользовательскомПоле.ТипЗначения.КвалификаторыСтроки.Длина = 777 Тогда
			Поля.Вставить("userTypeId", "url");  
		Иначе
			Поля.Вставить("userTypeId", "string");  
		КонецЕсли;
		
	ИначеЕсли ТипЗначенияСвойства.СодержитТип(Тип("Булево")) Тогда
		Поля.Вставить("userTypeId", "boolean");  
	ИначеЕсли ТипЗначенияСвойства.СодержитТип(Тип("Дата")) Тогда
		Если ИнформацияОПользовательскомПоле.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.ДатаВремя Тогда 
			Поля.Вставить("userTypeId", "datetime"); 
		Иначе
			Поля.Вставить("userTypeId", "date"); 
		КонецЕсли;
	ИначеЕсли ТипЗначенияСвойства.СодержитТип(Тип("Число")) Тогда
		Если ИнформацияОПользовательскомПоле.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти  = 0 Тогда 
			Поля.Вставить("userTypeId", "integer"); 
		Иначе
			Поля.Вставить("userTypeId", "double"); 
		КонецЕсли;
	ИначеЕсли ТипЗначенияСвойства.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда
		Поля.Вставить("userTypeId", "employee"); 
	ИначеЕсли ТипЗначенияСвойства.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) Тогда
		Поля.Вставить("userTypeId"	, "enumeration"); 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Свойство", ?(ИнформацияОПользовательскомПоле.Объект.ВладелецДополнительныхЗначений.Пустая(), ИнформацияОПользовательскомПоле.Объект,  ИнформацияОПользовательскомПоле.Объект.ВладелецДополнительныхЗначений));
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Запрос.Текст = "ВЫБРАТЬ *
		|ИЗ
		|	ВТ_ЗначенияСвойств КАК ВТ_ЗначенияСвойств
		|ГДЕ
		|	ВТ_ЗначенияСвойств.Свойство = &Свойство";
		
		мИменаЗначений = Новый Массив;
		Выборка = Запрос.Выполнить().Выбрать();
		Итератор = 1;
		Пока Выборка.Следующий() Цикл
			
			Если мИменаЗначений.Найти(Выборка.Наименование) = Неопределено Тогда
				
				Если ЗначениеЗаполнено(Выборка.ИдентификаторБ24) И НЕ ЭтоНовыйЭлемент Тогда
					лЗначенияСвойств = лЗначенияСвойств +  "&field[enum]["+(Формат(Итератор, "ЧГ=0"))+"][id]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Выборка.ИдентификаторБ24); 
				КонецЕсли;	
				лЗначенияСвойств = лЗначенияСвойств +  "&field[enum]["+(Формат(Итератор, "ЧГ=0"))+"][xmlId]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Выборка.Объект); 
				лЗначенияСвойств = лЗначенияСвойств +  "&field[enum]["+(Формат(Итератор, "ЧГ=0"))+"][value]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Выборка.Наименование); 
				
				Итератор = Итератор+1;	
				
				мИменаЗначений.Добавить(Выборка.Наименование);
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ТипДанных, Пакет, ИнформацияОПользовательскомПоле.Объект);
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Ошибка, "В свойствах не поддерживается тип: " + Строка(ТипЗначенияСвойства) + " в свойстве - " + ИнформацияОПользовательскомПоле.Заголовок);
		Возврат "";		
	КонецЕсли;
	
	ТелоЗапроса = "";
	
	Для каждого ТекПоле Из Поля Цикл
		ТелоЗапроса = ТелоЗапроса + "&field["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
	КонецЦикла;  
	
	ЗначениеКлючаНаименованиеСвойства = "&field[editFormLabel]["+Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЛокализациюБитрикс24()+"]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(НаименованиеСвойства);
	
	ТелоЗапроса = ТелоЗапроса + ЗначениеКлючаНаименованиеСвойства + лЗначенияСвойств;
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючПоля+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("userfieldconfig.add?moduleId=crm" + ТелоЗапроса);	
	Иначе
		СтрокаЗапроса = "cmd["+КлючПоля+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("userfieldconfig.update?moduleId=crm&id=" + ИнформацияОПользовательскомПоле.ИдентификаторБ24 + "&"  + ТелоЗапроса);	
	КонецЕсли;
	
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючПоля, ПолучитьСтруктуруКлючейБатчЗапросов(ТипДанных, ИнформацияОПользовательскомПоле.Идентификатор1С));
	
	Возврат СтрокаЗапроса;
	
КонецФункции


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


Функция СформироватьЗапросПолученияIDЗначенийПользовательскихПолей(СтруктураНастроек, ТипДанных, МассивДанных, Пакет) Экспорт
	
	Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКомпании Тогда
		ТипСвойства 	= СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКомпании; 
		ИдВладельца = "CRM_COMPANY";
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКонтакта Тогда
		ТипСвойства 	= СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКонтакта;
		ИдВладельца = "CRM_CONTACT";
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСделки Тогда
		ТипСвойства 	= СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСделки;         
		ИдВладельца = "CRM_DEAL";
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСчета Тогда
		ТипСвойства 	= СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета;
		ИдВладельца = "CRM_INVOICE";
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСчета2 Тогда
		ТипСвойства 	= СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета2;
		ИдВладельца = "CRM_SMART_INVOICE";
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоЗаказа Тогда
		ТипСвойства 	= СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета;
		ОбъектБитрикс24 = "";
	КонецЕсли;                                                       
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивДанных", МассивДанных);
	Запрос.УстановитьПараметр("ТипДанных"	, ТипСвойства);
	Запрос.УстановитьПараметр("Портал"		, СтруктураНастроек.Портал);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыОбъектов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Объект,
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Идентификатор1С,
	|	ДополнительныеРеквизитыИСведения.Заголовок КАК Заголовок,
	|	ДополнительныеРеквизитыИСведения.Наименование КАК Наименование
	|ПОМЕСТИТЬ ВТ_Свойства
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Ссылка В(&МассивДанных)
	|	И ДополнительныеРеквизитыИСведения.ДополнительныеЗначенияИспользуются
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Свойства.Объект КАК Идентификатор1С,
	|	ВТ_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБ24
	|ИЗ
	|	ВТ_Свойства КАК ВТ_Свойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОбъектов КАК ВТ_ИдентификаторыОбъектов
	|		ПО ВТ_Свойства.Объект = ВТ_ИдентификаторыОбъектов.Объект";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	мЭлементы 	=  Новый массив;
	
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.ИдентификаторБ24) Тогда
				мЭлементы.Добавить("cmd["+ XMLСтрока(Выборка.Идентификатор1С) + "]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("userfieldconfig.get?moduleId=crm&id=" + Выборка.ИдентификаторБ24));
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат мЭлементы;
	
КонецФункции

Процедура ОбработатьЗапросПолученияIDЗначенийПользовательскихПолей(СтруктураНастроек, ТипДанных, СтруктураОтвета, Пакет) Экспорт
	
	Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКомпании Тогда
		ТипСвойства 	= СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКомпании; 
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКонтакта Тогда
		ТипСвойства 	= СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКонтакта;
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСделки Тогда
		ТипСвойства 	= СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСделки;         
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСчета Тогда
		ТипСвойства 	= СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета;
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСчета2 Тогда
		ТипСвойства 	= СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета2;
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваЗаказа Тогда
		ТипСвойства 	= СтруктураНастроек.ТипыОбъектовОбмена.СвойствоЗаказа;
	КонецЕсли;                                                       
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Владелец КАК Владелец,
	|	ЗначенияСвойствОбъектов.Наименование КАК Наименование,
	|	ЗначенияСвойствОбъектов.Ссылка КАК Объект
	|ПОМЕСТИТЬ ВТ_ЗначенияСвойств
	|ИЗ
	|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.ЭтоГруппа = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Владелец,
	|	Наименование";
	Запрос.Выполнить();
	
	result1 = СтруктураОтвета.Получить("result");
	Если result1 <> Неопределено Тогда
		
		result2 = result1.Получить("result");  			
		Если result2 <> Неопределено Тогда
			
			Для каждого ТекСвойство Из result2 Цикл
				
				Свойство = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоXML(Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"), ТекСвойство.Ключ);	
				
				field = ТекСвойство.Значение.Получить("field");
				Если field = Неопределено Тогда
					Продолжить;	
				КонецЕсли;
				
				enum = field.Получить("enum");
				
				Если enum <> Неопределено Тогда
					
					Для Каждого ТекЗначение Из enum Цикл
						
						ИдОбъекта 	= Формат(ТекЗначение.Получить("id"), "ЧГ=0");
						Значение 	= ТекЗначение.Получить("value");
						
						Запрос = Новый Запрос;
						Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
						Запрос.УстановитьПараметр("Владелец", Свойство);
						Запрос.УстановитьПараметр("Наименование", Значение);
						Запрос.Текст = "ВЫБРАТЬ
						|	ВТ_ЗначенияСвойств.Объект КАК Объект
						|ИЗ
						|	ВТ_ЗначенияСвойств КАК ВТ_ЗначенияСвойств
						|ГДЕ
						|	ВТ_ЗначенияСвойств.Владелец = &Владелец
						|	И ВТ_ЗначенияСвойств.Наименование = &Наименование";
						
						Выборка = Запрос.Выполнить().Выбрать();
						
						Пока Выборка.Следующий() Цикл
							РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ТипДанных, Выборка.Объект, ИдОбъекта);  
							Прервать;
						КонецЦикла;
					КонецЦикла;	
					
				КонецЕсли;
				
				УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ТипДанных, Пакет, Свойство);
				
			КонецЦикла;	
		КонецЕсли;
		
		Если result1.Получить("result_error") <> Неопределено Тогда
			
			Для каждого ТекСтрока Из result1.Получить("result_error") Цикл
				
				лОписаниеОшибки = ТекСтрока.Значение.Получить("error_description");
				
				лОбъект = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоXML(Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"), ТекСтрока.Ключ);	
				
				Если НЕ ЗначениеЗаполнено(лОбъект) Тогда
					Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, лОписаниеОшибки + " у не найденного объекта с ид:" + Строка(ТекСтрока.Ключ));   
				Иначе           
					Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, лОписаниеОшибки + " у объекта:" + Строка(лОбъект));  
					//Б24_КС_РегистрацияИзмененийВызовСервера.ЗарегистрироватьДопРеквизит(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена, лОбъект);
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


Процедура ЗаполнитьЗначенияПользовательскихПолей(СтруктураНастроек, МенеджерВременныхТаблиц, Объект, СтруктураПолей, ИнформацияОПолях)
	
	ЗапросПользовательскихПолей = Новый Запрос;
	ЗапросПользовательскихПолей.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросПользовательскихПолей.Текст = "ВЫБРАТЬ *
	|ИЗ
	|	ВТ_ИдентификаторыПользовательскихПолей";
	ВыполненныйЗапросПользовательскихПолей = ЗапросПользовательскихПолей.Выполнить();	
	Если ВыполненныйЗапросПользовательскихПолей.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	мНеиспользуемыеКлючи = Новый Массив;
	Для каждого ТекЭлемент Из ИнформацияОПолях Цикл   
		Если ТекЭлемент.ИсточникДанных = "Не изменять" Тогда    
			
			КлючЗапроса = ТекЭлемент.КлючЗапроса;
			КлючЗапроса1 = СтрЗаменить(КлючЗапроса, "UF_CRM_SMART_INVOICE_", "ufCrm_SMART_INVOICE_");
			КлючЗапроса2 = СтрЗаменить(КлючЗапроса, "ufCrmSmartInvoice", "ufCrm_SMART_INVOICE_"); 
			
			мНеиспользуемыеКлючи.Добавить(КлючЗапроса1);	 
			мНеиспользуемыеКлючи.Добавить(КлючЗапроса2);	 
			
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаПользовательскихПолей = ВыполненныйЗапросПользовательскихПолей.Выбрать();
	Пока ВыборкаПользовательскихПолей.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаПользовательскихПолей.ДополнительныйИдентификаторБитрикс24) Тогда
			Продолжить;	
		КонецЕсли;     
		
		Если СтруктураПолей.Свойство(ВыборкаПользовательскихПолей.ДополнительныйИдентификаторБитрикс24) = Истина Тогда
			Продолжить;	
		КонецЕсли;
		
		Если мНеиспользуемыеКлючи.Найти(ВыборкаПользовательскихПолей.ДополнительныйИдентификаторБитрикс24) <> Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		ЗапросЗначенийСвойств = Новый Запрос;
		ЗапросЗначенийСвойств.УстановитьПараметр("Объект"	, Объект);
		ЗапросЗначенийСвойств.УстановитьПараметр("Свойство"	, ВыборкаПользовательскихПолей.Объект);
		
		ЗапросЗначенийСвойств.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросЗначенийСвойств.Текст = "ВЫБРАТЬ *
		|ИЗ
		|	ВТ_ЗначенияОбъектовСИд
		| ГДЕ
		| ВТ_ЗначенияОбъектовСИд.Объект = &Объект
		| И ВТ_ЗначенияОбъектовСИд.Свойство = &Свойство";
		ВыполненныйЗапросЗначенийСвойств = ЗапросЗначенийСвойств.Выполнить();	
		Если ВыполненныйЗапросЗначенийСвойств.Пустой() Тогда
			СтруктураПолей.Вставить(ВыборкаПользовательскихПолей.ДополнительныйИдентификаторБитрикс24, "");
		Иначе
			
			ВыборкаЗначенийСвойств = ВыполненныйЗапросЗначенийСвойств.Выбрать();
			Пока ВыборкаЗначенийСвойств.Следующий() Цикл
				
				Если ВыборкаПользовательскихПолей.ДополнительныеЗначенияИспользуются Тогда
					
					Если ЗначениеЗаполнено(ВыборкаЗначенийСвойств.ИдентификаторЗначенияСвойстваБитрикс24) Тогда
						СтруктураПолей.Вставить(ВыборкаПользовательскихПолей.ДополнительныйИдентификаторБитрикс24, ВыборкаЗначенийСвойств.ИдентификаторЗначенияСвойстваБитрикс24);
					Иначе
						СтруктураПолей.Вставить(ВыборкаПользовательскихПолей.ДополнительныйИдентификаторБитрикс24, "");
					КонецЕсли;
					
				Иначе
					
					Если ВыборкаПользовательскихПолей.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда	
						
						НайденнаяСтрока = СтруктураНастроек.ТаблицаСопоставленияПользователей.Найти(ВыборкаЗначенийСвойств.Значение, "Пользователь1С");	
						
						Если НайденнаяСтрока <> Неопределено Тогда
							СтруктураПолей.Вставить(ВыборкаПользовательскихПолей.ДополнительныйИдентификаторБитрикс24, НайденнаяСтрока.ИдПользователя);
						Иначе
							СтруктураПолей.Вставить(ВыборкаПользовательскихПолей.ДополнительныйИдентификаторБитрикс24, "");
						КонецЕсли;
					ИначеЕсли ВыборкаПользовательскихПолей.ТипЗначения.СодержитТип(Тип("Булево")) Тогда	
						СтруктураПолей.Вставить(ВыборкаПользовательскихПолей.ДополнительныйИдентификаторБитрикс24, ?(ВыборкаЗначенийСвойств.Значение =Истина, "Y", "N"));
					Иначе        
						СтруктураПолей.Вставить(ВыборкаПользовательскихПолей.ДополнительныйИдентификаторБитрикс24, XMLСтрока(ВыборкаЗначенийСвойств.Значение));
					КонецЕсли;
					
				КонецЕсли;
				
				Прервать;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьКЗапросуОбъектовДанныеОПользовательскихПолях(СтруктураНастроек, Запрос, НазваниеТаблицы ,ТипПользовательскихПолей, ТипЗначенийПользовательскихПолей)
	
	ТекстЗапроса = Запрос.Текст; 
	
	Запрос.УстановитьПараметр("ТипДанныхЗСК"			, ТипЗначенийПользовательскихПолей);
	Запрос.УстановитьПараметр("ТипДанныхЗС"				, ТипПользовательскихПолей);
	Запрос.УстановитьПараметр("Портал"					, СтруктураНастроек.Портал);	
	Запрос.УстановитьПараметр("НеВыгружаемыеСвойства"	, СтруктураНастроек.ПредопределенныеСвойства.НеВыгружаемыеСвойства);	
	
	
	ТекстЗапроса = ТекстЗапроса + "	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторБитрикс24,
	|	Б24_К_ИдентификаторыОбъектов.ДополнительныйИдентификатор КАК ДополнительныйИдентификаторБитрикс24,
	|	ДополнительныеРеквизитыИСведения.ДополнительныеЗначенияИспользуются КАК ДополнительныеЗначенияИспользуются,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения КАК ТипЗначения
	|ПОМЕСТИТЬ ВТ_ИдентификаторыПользовательскихПолей
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|		ПО Б24_К_ИдентификаторыОбъектов.Объект = ДополнительныеРеквизитыИСведения.Ссылка
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЗС
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И НЕ ДополнительныеРеквизитыИСведения.Ссылка В(&НеВыгружаемыеСвойства)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЗначенийПользовательскихПолей
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЗСК
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектДополнительныеРеквизиты.Свойство КАК Свойство,
	|	ОбъектДополнительныеРеквизиты.Значение КАК Значение,
	|	ОбъектДополнительныеРеквизиты.Ссылка КАК Объект
	|ПОМЕСТИТЬ ВТ_ЗначенияОбъектов
	|ИЗ
	|	&ТаблицаСвойствОбъекта КАК ОбъектДополнительныеРеквизиты
	|ГДЕ
	|	ОбъектДополнительныеРеквизиты.Ссылка В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Свойство,
	|	ДополнительныеСведения.Значение,
	|	ДополнительныеСведения.Объект
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Свойство,
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗначенияОбъектов.Объект КАК Объект,
	|	ВТ_ЗначенияОбъектов.Свойство КАК Свойство,
	|	ВТ_ЗначенияОбъектов.Значение КАК Значение,
	|	ВТ_ИдентификаторыЗначенийПользовательскихПолей.Идентификатор КАК ИдентификаторЗначенияСвойстваБитрикс24
	|ПОМЕСТИТЬ ВТ_ЗначенияОбъектовСИд
	|ИЗ
	|	ВТ_ЗначенияОбъектов КАК ВТ_ЗначенияОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗначенийПользовательскихПолей КАК ВТ_ИдентификаторыЗначенийПользовательскихПолей
	|		ПО ВТ_ЗначенияОбъектов.Значение = ВТ_ИдентификаторыЗначенийПользовательскихПолей.Объект
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗначенияОбъектов";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаСвойствОбъекта", НазваниеТаблицы+".ДополнительныеРеквизиты");
	Запрос.Текст = ТекстЗапроса;
	
КонецПроцедуры


Функция ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, НазваниеВременнойТаблицы, Объект, Свойство)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Объект"	, Объект);
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_ТаблицаСвойств.Значение КАК Значение
	|ИЗ
	|	"+НазваниеВременнойТаблицы+" КАК ВТ_ТаблицаСвойств
	|ГДЕ
	|	ВТ_ТаблицаСвойств.Объект = &Объект
	|И ВТ_ТаблицаСвойств.Свойство = &Свойство";
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		Выборка = ВыполненныйЗапрос.Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат = Выборка.Значение;
			Прервать;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

#КонецОбласти

#КонецОбласти


#Область CRM

Функция СформироватьДанныеПоСчетам(пСтруктураНастроек, МассивДанных) Экспорт
	
	мЭлементы 	=  Новый массив;
	
	Возврат мЭлементы;	
	
КонецФункции


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


Функция СформироватьДанныеПоСчетам2(пСтруктураНастроек, МассивДанных, Пакет) Экспорт
	
	мЭлементы 	=  Новый массив;
	
	Возврат мЭлементы;	
	
КонецФункции


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


Функция СформироватьДанныеПоСделкам(пСтруктураНастроек, МассивДанных, Пакет) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
#Область ИдентификаторыСлужебныхСвойств	

	ДопИдСвойстваОрганизации 	= РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьДопИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоОрганизацияСделки, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСделки); 
	СтруктураНастроек.Вставить("ДопИдПредопределенногоСвойстваОрганизацииСделки", ДопИдСвойстваОрганизации);
	
	ДопИдСвойстваНомер1С	= РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьДопИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоНомер1ССделки, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСделки); 
	СтруктураНастроек.Вставить("ДопИдПредопределенногоСвойстваНомерСделки1С", ДопИдСвойстваНомер1С);
	
	Если пСтруктураНастроек.ОбрабатыватьУдалениеОбъектовВ1С Тогда 	
		ДопИдСвойстваПометкиУдаления	= РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьДопИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоПометкаУдаленияСделок, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСделки); 
		СтруктураНастроек.Вставить("ДопИдПредопределенногоСвойстваПометкиУдаленияСделки", ДопИдСвойстваПометкиУдаления);
	КонецЕсли;	
	
#КонецОбласти
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область ФормированиеВременныхТаблицДанных	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивДанных"		, МассивДанных);  
	Запрос.УстановитьПараметр("АктуальнаяДатаСеанса", СтруктураНастроек.ДатаФормирования);
	Запрос.УстановитьПараметр("Портал"			 	, СтруктураНастроек.Портал);
	Запрос.УстановитьПараметр("СвойствоОрганизации"	, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоОрганизацияСделки);
	Запрос.УстановитьПараметр("ТипДанныхЗаказов"	, СтруктураНастроек.ТипыОбъектовОбмена.Заказ);
	Запрос.УстановитьПараметр("ТипДанныхКомпаний"	, СтруктураНастроек.ТипыОбъектовОбмена.Компания);
	Запрос.УстановитьПараметр("ТипДанныхКонтактов"	, СтруктураНастроек.ТипыОбъектовОбмена.Контакт);	
	Запрос.УстановитьПараметр("ТипДанныхРеквизитов"	, СтруктураНастроек.ТипыОбъектовОбмена.Реквизит);
	Запрос.УстановитьПараметр("ТипДанныхБанкСчетов"	, СтруктураНастроек.ТипыОбъектовОбмена.БанковскийСчетРеквизита);	
	Запрос.УстановитьПараметр("ТипДанныхТоваров"	, СтруктураНастроек.ТипыОбъектовОбмена.Товар);			
	Запрос.УстановитьПараметр("ТипДанныхЗначениеСвойства", СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСделки);
	Запрос.УстановитьПараметр("ТипДанныхТоваров2"	, СтруктураНастроек.ТипыОбъектовОбмена.Товар2);
	Запрос.УстановитьПараметр("ТипДанныхПредложений", СтруктураНастроек.ТипыОбъектовОбмена.Предложение);
	Запрос.УстановитьПараметр("ЭтоТовар2"			, СтруктураНастроек.ВерсияТоваров = "v.2");
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка,
	|	ЗаказКлиента.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗаказКлиента.Партнер КАК Партнер,
	|	ЗаказКлиента.Контрагент КАК Контрагент,
	|	ЗаказКлиента.Организация КАК Организация,
	|	ЗаказКлиента.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ЗаказКлиента.БанковскийСчет КАК БанковскийСчет,
	|	ЗаказКлиента.Менеджер КАК Ответственный,
	|	ЗаказКлиента.Номер КАК Номер,
	|	ЗаказКлиента.Дата КАК Дата,
	|	ЗаказКлиента.Проведен КАК Проведен,
	|	ЗаказКлиента.Комментарий КАК Комментарий,
	|	ЗаказКлиента.Валюта КАК Валюта,
	|	Валюты.Код КАК ВалютаКод,
	|	ЗаказКлиента.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказКлиента.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ЗаказКлиента.Статус КАК Статус,
	|	Партнеры.ЮрФизЛицо КАК ТипПартнера,
	|	ЗаказКлиента.ДатаОтгрузки КАК ДатаОтгрузки
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ЗаказКлиента.Валюта = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|		ПО ЗаказКлиента.Партнер = Партнеры.Ссылка
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Документ.ЗаказКлиента) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЗаказов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЗаказов
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыПартнеровОрганизаций
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И (Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхКомпаний
	|			ИЛИ Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхКонтактов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыБанкСчетов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхБанкСчетов
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыРеквизитов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхРеквизитов
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект КАК Объект,
	|	ДополнительныеСведения.Свойство КАК Свойство,
	|	ДополнительныеСведения.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ТаблицаСвойств
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаДополнительныеРеквизиты.Ссылка,
	|	ЗаказКлиентаДополнительныеРеквизиты.Свойство,
	|	ЗаказКлиентаДополнительныеРеквизиты.Значение
	|ИЗ
	|	Документ.ЗаказКлиента.ДополнительныеРеквизиты КАК ЗаказКлиентаДополнительныеРеквизиты
	|ГДЕ
	|	ЗаказКлиентаДополнительныеРеквизиты.Ссылка В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЗначенийСвойств
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЗначениеСвойства
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Ссылка КАК ЗначениеСвойства,
	|	Организации.Ссылка КАК Организация,
	|	ВТ_ИдентификаторыЗначенийСвойств.Идентификатор КАК ИдентификаторБ24Организации
	|ПОМЕСТИТЬ ВТ_ЗначенияСвойствОрганизаций
	|ИЗ
	|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ЗначенияСвойствОбъектов.Наименование = Организации.Наименование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗначенийСвойств КАК ВТ_ИдентификаторыЗначенийСвойств
	|		ПО ЗначенияСвойствОбъектов.Ссылка = ВТ_ИдентификаторыЗначенийСвойств.Объект
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Владелец = &СвойствоОрганизации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыЗначенийСвойств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Ссылка КАК Объект,
	|	ВТ_Заказы.Ссылка КАК Идентификатор1С,
	|	ВТ_Заказы.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_Заказы.Партнер КАК Партнер,
	|	ВТ_Заказы.Контрагент КАК Контрагент,
	|	ВТ_Заказы.Организация КАК Организация,
	|	ВТ_Заказы.Ответственный КАК Ответственный,
	|	ВТ_Заказы.Номер КАК Номер,
	|	ВТ_Заказы.Дата КАК Дата,
	|	ВТ_Заказы.Проведен КАК Проведен,
	|	ВТ_Заказы.Комментарий КАК Комментарий,
	|	СостоянияЗаказовКлиентов.Состояние КАК Состояние,
	|	ВТ_Заказы.ВалютаКод КАК ВалютаКод,
	|	ВТ_Заказы.СуммаДокумента КАК СуммаДокумента,
	|	ВТ_Заказы.ЦенаВключаетНДС КАК СуммаВключаетНДС,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_Заказы.Ссылка) КАК СделкаСтрокой,
	|	ВТ_ИдентификаторыПартнеровОрганизаций.Идентификатор КАК ИдентификаторБ24Партнера,
	|	ВТ_Заказы.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ВТ_Заказы.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ВТ_Заказы.Статус КАК Статус,
	|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОплаты, 0) КАК ПроцентОплаты,
	|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОтгрузки, 0) КАК ПроцентОтгрузки,
	|	ВТ_ЗначенияСвойствОрганизаций.ИдентификаторБ24Организации КАК ИдентификаторБ24Организации,
	|	ВТ_ИдентификаторыРеквизитовКонтрагентов.Идентификатор КАК ИдентификаторБ24РеквизитаКонтрагента,
	|	ВТ_ИдентификаторыБанкСчетовОрганизаций.Идентификатор КАК ИдентификаторБанковскогоСчетаОрганизацииБ24,
	|	ВТ_ИдентификаторыБанкСчетовРеквизитов.Идентификатор КАК ИдентификаторБанковскогоСчетаКонтрагентаБ24,
	|	ВТ_ИдентификаторыРеквизитовОрганизаций.Идентификатор КАК ИдентификаторРеквизитаОрганизацииБ24,
	|	ВТ_ИдентификаторыЗаказов.Идентификатор КАК ИдентификаторЗаказа,
	|	ВТ_Заказы.ТипПартнера КАК ТипПартнера
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО ВТ_Заказы.Ссылка = СостоянияЗаказовКлиентов.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыПартнеровОрганизаций КАК ВТ_ИдентификаторыПартнеровОрганизаций
	|		ПО ВТ_Заказы.Партнер = ВТ_ИдентификаторыПартнеровОрганизаций.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияСвойствОрганизаций КАК ВТ_ЗначенияСвойствОрганизаций
	|		ПО ВТ_Заказы.Организация = ВТ_ЗначенияСвойствОрганизаций.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗаказов КАК ВТ_ИдентификаторыЗаказов
	|		ПО ВТ_Заказы.Ссылка = ВТ_ИдентификаторыЗаказов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыРеквизитов КАК ВТ_ИдентификаторыРеквизитовКонтрагентов
	|		ПО ВТ_Заказы.Контрагент = ВТ_ИдентификаторыРеквизитовКонтрагентов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыБанкСчетов КАК ВТ_ИдентификаторыБанкСчетовРеквизитов
	|		ПО ВТ_Заказы.БанковскийСчетКонтрагента = ВТ_ИдентификаторыБанкСчетовРеквизитов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыБанкСчетов КАК ВТ_ИдентификаторыБанкСчетовОрганизаций
	|		ПО ВТ_Заказы.БанковскийСчет = ВТ_ИдентификаторыБанкСчетовОрганизаций.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыРеквизитов КАК ВТ_ИдентификаторыРеквизитовОрганизаций
	|		ПО ВТ_Заказы.Организация = ВТ_ИдентификаторыРеквизитовОрганизаций.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыБанкСчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыРеквизитов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗначенияСвойствОрганизаций
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор,
	|	Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект КАК ПодчиненныйОбъект
	|ПОМЕСТИТЬ ВТ_ИдентификаторыТоваров
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	НЕ &ЭтоТовар2
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхТоваров
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор,
	|	Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	&ЭтоТовар2
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхТоваров2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор,
	|	Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект КАК ПодчиненныйОбъект
	|ПОМЕСТИТЬ ВТ_ИдентификаторыПредложений
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	&ЭтоТовар2
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхПредложений
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Б24_К_ИдентификаторыОбъектов.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Ссылка КАК Проект,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.Содержание КАК Содержание,
	|	ЗаказКлиентаТовары.Количество КАК Количество,
	|	ЗаказКлиентаТовары.Цена КАК Цена,
	|	ЗаказКлиентаТовары.Сумма КАК Сумма,
	|	ЗаказКлиентаТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ЗаказКлиентаТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
	|	ИнформацияОТоваре.Наименование КАК НаименованиеТовара,
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК ЕдиницаИзмерения,
	|	ПРЕДСТАВЛЕНИЕ(УпаковкиЕдиницыИзмерения.Ссылка) КАК НаименованиеЕдиницыИзмерения,
	|	ВТ_ИдентификаторыТоваров.Идентификатор КАК ИдентификаторБ24Товара,
	|	ИнформацияОТоваре.НаименованиеПолное КАК НаименованиеПолноеНоменклатуры,
	|	ИнформацияОТоваре.Наименование КАК НаименованиеНоменклатуры,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаТовары.Характеристика) КАК НаименованиеХарактеристики,
	|	УпаковкиЕдиницыИзмерения.Код КАК КодЕдИзм,
	|	ИнформацияОТоваре.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ЗаказКлиентаТовары.Б24_К_ИдентификаторПозиции КАК Б24_К_ИдентификаторПозиции,
	|	ЗаказКлиентаТовары.КлючСвязи КАК КлючСвязи,  
	|	ВТ_ИдентификаторыПредложений.Идентификатор КАК ИдентификаторБ24Предложения
	|ПОМЕСТИТЬ ВТ_ТоварыСделок
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ИнформацияОТоваре
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|			ПО ИнформацияОТоваре.ЕдиницаИзмерения = УпаковкиЕдиницыИзмерения.Ссылка
	|		ПО ЗаказКлиентаТовары.Номенклатура = ИнформацияОТоваре.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыТоваров КАК ВТ_ИдентификаторыТоваров
	|		ПО ЗаказКлиентаТовары.Номенклатура = ВТ_ИдентификаторыТоваров.Объект
	|			И ЗаказКлиентаТовары.Характеристика = ВТ_ИдентификаторыТоваров.ПодчиненныйОбъект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО ЗаказКлиентаТовары.Ссылка = ВТ_Заказы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыПредложений КАК ВТ_ИдентификаторыПредложений
	|		ПО ЗаказКлиентаТовары.Номенклатура = ВТ_ИдентификаторыПредложений.Объект
	|			И ЗаказКлиентаТовары.Характеристика = ВТ_ИдентификаторыПредложений.ПодчиненныйОбъект
	|ГДЕ
	|	ЗаказКлиентаТовары.Количество > 0
	|	И ЗаказКлиентаТовары.Отменено = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыПредложений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Заказы";
	
#КонецОбласти
	
	ДобавитьКЗапросуОбъектовДанныеОПользовательскихПолях(СтруктураНастроек, Запрос, "Документ.ЗаказКлиента", СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСделки, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСделки);
	
	ДобавитьКЗапросуОбъектовДанныеФайлов(СтруктураНастроек, Запрос);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	мЭлементы 	=  Новый массив;
	
	ВыгружатьСделки 			= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Проект", "ЗаказКлиента", "ВыгружатьНаПортал");
	ОбновлятьНаПортале 			= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Проект", "ЗаказКлиента", "ОбновлятьНаПортале");
	
	Пока Выборка.Следующий() Цикл
		
		СформированныйЗапрос = "";
		
		ИдентификаторБ24 = ИдБ24ПоСсылке(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.Проект, Выборка.Объект);
		
		ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(ИдентификаторБ24);
		
		Если ВыгружатьСделки Тогда
			
			Если ЗначениеЗаполнено(Выборка.ИдентификаторЗаказа) Тогда
				СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(Выборка.Идентификатор1С);
				Продолжить;
			КонецЕсли;
			
			Если ЭтоНовыйЭлемент ИЛИ (НЕ ЭтоНовыйЭлемент И ОбновлятьНаПортале) Тогда 
				СформированныйЗапрос = СформироватьСтруктуруДанныхПоСделке(СтруктураНастроек,  МенеджерВременныхТаблиц, Выборка, ИдентификаторБ24, Пакет);
			Иначе
				СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(Выборка.Идентификатор1С);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов 	= СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	
	пСтруктураНастроек.Логирование.НомерСообщения	 	= СтруктураНастроек.Логирование.НомерСообщения; 	
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоСделке(СтруктураНастроек, МенеджерВременныхТаблиц, ИнформацияОСделке, ИдентификаторБ24, Пакет)
	
	ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(ИдентификаторБ24);
	
	ИнформацияОПолях 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Проект", "ЗаказКлиента");
	ИнформацияОПоляхТЧ 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностейТЧ(СтруктураНастроек.НастройкаПодключения, "Проект", "ЗаказКлиента");
	АлгоритмПриВыгрузкеДанныхНаПортал 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Проект", "ЗаказКлиента", "АлгоритмПриВыгрузкеДанныхНаПортал");
	
	КлючСделки = XMLСтрока(ИнформацияОСделке.Идентификатор1С); 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Проект", ИнформацияОСделке.Объект);
	Запрос.Текст = " ВЫБРАТЬ *
	|ИЗ
	|	ВТ_ТоварыСделок КАК ВТ_ТоварыСделок
	|ГДЕ
	|	ВТ_ТоварыСделок.Проект = &Проект";
	
	ТоварыСделки = Запрос.Выполнить().Выгрузить();
	
	ИдСделки = Прав(ИдентификаторБ24, СтрДлина(ИдентификаторБ24)-2);	
	
#Область Сделка

	ИдНаправленияСделки = Неопределено;
	НаправлениеСделки = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойств", ИнформацияОСделке.Объект, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоНаправлениеСделки);
	Если ЗначениеЗаполнено(НаправлениеСделки) Тогда
		ИдНаправленияСделки = РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСделки, НаправлениеСделки); 
		ИдНаправленияСделки = Прав(ИдНаправленияСделки, СтрДлина(ИдНаправленияСделки)-3);
	КонецЕсли;	
	
	Если СтруктураНастроек.НастройкиСинхронизацииСделок.Свойство("ИнформацияОСтатусах") Тогда  
		
		ИнформацияОСтатусах = СтруктураНастроек.НастройкиСинхронизацииСделок.ИнформацияОСтатусах;
		Если ЭтоНовыйЭлемент И ИдНаправленияСделки = Неопределено И ИнформацияОСтатусах.Свойство("СтатусПоУмолчанию") Тогда
			ДанныеСтатусаПоУм = СтрРазделить(ИнформацияОСтатусах.СтатусПоУмолчанию, "#"); 
			Если ДанныеСтатусаПоУм.Количество() > 1 Тогда
				ИдНаправленияСделки = ДанныеСтатусаПоУм[0];	
			КонецЕсли;
		КонецЕсли; 
		
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИнформацияОПолях"				, ИнформацияОПолях);
	ДополнительныеПараметры.Вставить("КлючЭлемента"					, КлючСделки);
	ДополнительныеПараметры.Вставить("МенеджерВременныхТаблиц"		, МенеджерВременныхТаблиц);
	ДополнительныеПараметры.Вставить("ЭтоНовыйЭлемент"				, ЭтоНовыйЭлемент);
	ДополнительныеПараметры.Вставить("ИнформацияОбъекта1С"			, ИнформацияОСделке);
	ДополнительныеПараметры.Вставить("ИдНаправленияСделки"			, ИдНаправленияСделки);
	ДополнительныеПараметры.Вставить("ТоварыСделки"					, ТоварыСделки);

	Поля = ПолучитьСтруктуруКлючейЭлементаВыгрузки(СтруктураНастроек, ДополнительныеПараметры);
	
	Если ЗначениеЗаполнено(СтруктураНастроек.ДопИдПредопределенногоСвойстваНомерСделки1С) Тогда
		Поля.Вставить(СтруктураНастроек.ДопИдПредопределенногоСвойстваНомерСделки1С, ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ИнформацияОСделке.Номер));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураНастроек.ДопИдПредопределенногоСвойстваОрганизацииСделки) И ЗначениеЗаполнено(ИнформацияОСделке.ИдентификаторБ24Организации) Тогда
		Поля.Вставить(СтруктураНастроек.ДопИдПредопределенногоСвойстваОрганизацииСделки, ИнформацияОСделке.ИдентификаторБ24Организации)
	КонецЕсли;
	
	Если СтруктураНастроек.ОбрабатыватьУдалениеОбъектовВ1С Тогда
		Если ЗначениеЗаполнено(СтруктураНастроек.ДопИдПредопределенногоСвойстваПометкиУдаленияСделки) Тогда
			Поля.Вставить(СтруктураНастроек.ДопИдПредопределенногоСвойстваПометкиУдаленияСделки, ИнформацияОСделке.ПометкаУдаления)
		КонецЕсли;
	КонецЕсли;      
	
	ЗаполнитьЗначенияПользовательскихПолей(СтруктураНастроек, МенеджерВременныхТаблиц, ИнформацияОСделке.Объект, Поля, ИнформацияОПолях);	
	
	Если ЗначениеЗаполнено(АлгоритмПриВыгрузкеДанныхНаПортал) Тогда
		ВыполнитьАлгоритмПередВыгрузкой(СтруктураНастроек, ИнформацияОСделке.Объект, Поля, АлгоритмПриВыгрузкеДанныхНаПортал)
	КонецЕсли;

	
	ТелоЗапроса = "";
	Для каждого ТекПоле Из Поля Цикл
		Если ТекПоле.Значение <> Неопределено Тогда
			ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) > 0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
		КонецЕсли;		
	КонецЦикла;  
	
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючСделки+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.deal.add?" + ТелоЗапроса);	
	Иначе
		СтрокаЗапроса = "cmd["+КлючСделки+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.deal.update?id=" + ИдСделки + "&"  + ТелоЗапроса);	
	КонецЕсли;
				
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючСделки, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.Проект, ИнформацияОСделке.Идентификатор1С));
	
#КонецОбласти	


#Область ТоварыСделки

	ЗапросПоТоварамСделки 	= "";
	НомерСтроки 			= 1;	
	Для каждого ТоварСделки Из ТоварыСделки Цикл

		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИнформацияОПолях"			, ИнформацияОПоляхТЧ);
		ДополнительныеПараметры.Вставить("КлючЭлемента"				, КлючСделки);
		ДополнительныеПараметры.Вставить("МенеджерВременныхТаблиц"	, МенеджерВременныхТаблиц);
		ДополнительныеПараметры.Вставить("ЭтоНовыйЭлемент"			, ЭтоНовыйЭлемент);
		ДополнительныеПараметры.Вставить("ИнформацияОбъекта1С"		, ИнформацияОСделке);
		ДополнительныеПараметры.Вставить("Товары"					, ТоварыСделки);
		ДополнительныеПараметры.Вставить("ИнформацияСтрокиТЧ"		, ТоварСделки);
		ДополнительныеПараметры.Вставить("КлючСвязи"				, ТоварСделки.КлючСвязи);
		ДополнительныеПараметры.Вставить("ИмяТЧ"					, "Товары");

		ПоляТЧ = ПолучитьСтруктуруКлючейТЧЭлементаВыгрузки(СтруктураНастроек, ДополнительныеПараметры);

		Для каждого ТекПоле Из ПоляТЧ Цикл
			Если ТекПоле.Значение <> Неопределено Тогда
				ЗапросПоТоварамСделки = ЗапросПоТоварамСделки + "&rows["+Формат(НомерСтроки, "ЧГ=0")+"]["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
			КонецЕсли;	
		КонецЦикла;  
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(ЗапросПоТоварамСделки) Тогда
		
		Если НЕ ЗначениеЗаполнено(ИдСделки) Тогда
			ЗапросПоТоварамСделки = "id=$result["+ Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(КлючСделки)+"]"+ ЗапросПоТоварамСделки;
		Иначе
			ЗапросПоТоварамСделки = "id=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИдСделки) + ЗапросПоТоварамСделки;	
		КонецЕсли;		
		
		СтрокаЗапроса = СтрокаЗапроса + "&" + "cmd[]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.deal.productrows.set?" + ЗапросПоТоварамСделки);	

	КонецЕсли;

#КонецОбласти


#Область РеквизитыСделки
	
	Если ЗначениеЗаполнено(ИнформацияОСделке.ИдентификаторБ24РеквизитаКонтрагента) Тогда
		
		Поля = Новый Структура;
		
		Поля.Вставить("ENTITY_TYPE_ID"		, 2);
		Поля.Вставить("REQUISITE_ID"		, ИнформацияОСделке.ИдентификаторБ24РеквизитаКонтрагента);
		Поля.Вставить("BANK_DETAIL_ID"		, ?(ЗначениеЗаполнено(ИнформацияОСделке.ИдентификаторБанковскогоСчетаКонтрагентаБ24), ИнформацияОСделке.ИдентификаторБанковскогоСчетаКонтрагентаБ24, 0));
		
		Поля.Вставить("MC_BANK_DETAIL_ID"	, 0);	
		Поля.Вставить("MC_REQUISITE_ID"		, 0);  
			
		ВремТелоРеквизитовСделки = "";
		Для каждого ТекПоле Из Поля Цикл
			ВремТелоРеквизитовСделки = ВремТелоРеквизитовСделки + ?(СтрДлина(ВремТелоРеквизитовСделки) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
		КонецЦикла;  
		
		Если НЕ ЗначениеЗаполнено(ИдСделки) Тогда
			ВремТелоРеквизитовСделки = ВремТелоРеквизитовСделки + "&fields[ENTITY_ID]=$result["+ Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(КлючСделки)+"]";
		Иначе
			ВремТелоРеквизитовСделки = ВремТелоРеквизитовСделки + "&fields[ENTITY_ID]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИдСделки);	
		КонецЕсли;
		
		СтрокаЗапроса = СтрокаЗапроса + "&" + "cmd[]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.requisite.link.register?" + ВремТелоРеквизитовСделки);	

	КонецЕсли;			

#КонецОбласти

	
#Область ДелоСделки	

	ТелоДела = Б24_К_ВыгрузкаДелВызовСервера.ПолучитьТелоЗапросаДела(СтруктураНастроек, Б24_К_RestApiВызовСервера.ПолучитьТипВладельцаТаймЛайнПоТипуДанных(СтруктураНастроек.ТипыОбъектовОбмена.Проект), ИнформацияОСделке.Идентификатор1С, Строка(ИнформацияОСделке.Идентификатор1С), ИдСделки, КлючСделки);   

	Если ЗначениеЗаполнено(ТелоДела) Тогда
		
		КлючДела = "D_" + КлючСделки;                            
		
		ИдентификаторДела = РегистрыСведений.Б24_К_ИдентификаторыДел.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.ДелоСделки, ИнформацияОСделке.Объект);
		
		СтрокаЗапроса = СтрокаЗапроса + Б24_К_ВыгрузкаДелВызовСервера.ПолучитьЗапросДела(СтруктураНастроек, КлючДела, ИдентификаторДела, ТелоДела);
				
		СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючДела, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.ДелоСделки, ИнформацияОСделке.Идентификатор1С));
	
	КонецЕсли;

#КонецОбласти


	Возврат СтрокаЗапроса;
	
КонецФункции

Процедура ОбновитьСтатусДокумента(СтруктураНастроек, Документ, МенеджерВременныхТаблиц, ИнформацияОСтатусах, ИдСтатуса, ИдНаправления = "")
	
	Если СтруктураНастроек.Операция = "Проекты" Тогда 
		
		Если ИнформацияОСтатусах.ИсточникСтатусов1С = "СвойствоЗаказов" Тогда
		
			УстановленныйСтатус = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойств", Документ, ИнформацияОСтатусах.СвойствоЗаказов);
						
			НайденныеСтрокиСтатуса = ИнформацияОСтатусах.СтатусыНаправленийЗначенийСвойств.НайтиСтроки(Новый Структура("ИдНаправления, ИдСтатуса", ИдНаправления, ИдСтатуса));
			Для Каждого ТекСтрока Из НайденныеСтрокиСтатуса Цикл
				НовыйСтатус = ТекСтрока.Статус; 	
			КонецЦикла;
			
			Если ЗначениеЗаполнено(НовыйСтатус) Тогда
				
				Если УстановленныйСтатус <> НовыйСтатус Тогда
					ЗаказОбъект =  Документ.ПолучитьОбъект();
					ЗаказОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
					НайденныеДанныеСтатуса = ЗаказОбъект.ДополнительныеРеквизиты.Найти(ИнформацияОСтатусах.СвойствоЗаказов);
					Если НайденныеДанныеСтатуса = неопределено Тогда
						НовоеЗначениеСвойств = ЗаказОбъект.ДополнительныеРеквизиты.Добавить(); 
						НовоеЗначениеСвойств.Свойство = ИнформацияОСтатусах.СвойствоЗаказов;
						НовоеЗначениеСвойств.Значение = НовыйСтатус;
					Иначе
						НайденныеДанныеСтатуса.Значение = НовыйСтатус; 	
					КонецЕсли;
					ЗаказОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
							
		КонецЕсли;
		
	ИначеЕсли  СтруктураНастроек.Операция = "Счета" Тогда 
		
		Если ИнформацияОСтатусах.ИсточникСтатусов1С = "СвойствоСчета" Тогда
		
			УстановленныйСтатус = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойств", Документ, ИнформацияОСтатусах.СвойствоСчета);
						
			НайденнаяСтрокаСтатуса = ИнформацияОСтатусах.СоответствияЗначенийСвойств.Найти(ИдСтатуса);
			
			Если НайденнаяСтрокаСтатуса = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			НовыйСтатус = НайденнаяСтрокаСтатуса.Статус;
			
			Если ЗначениеЗаполнено(НовыйСтатус) Тогда
				
				Если УстановленныйСтатус <> НовыйСтатус Тогда
					ЗаказОбъект =  Документ.ПолучитьОбъект();
					ЗаказОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
					НайденныеДанныеСтатуса = ЗаказОбъект.ДополнительныеРеквизиты.Найти(ИнформацияОСтатусах.СвойствоСчета);
					Если НайденныеДанныеСтатуса = неопределено Тогда
						НовоеЗначениеСвойств = ЗаказОбъект.ДополнительныеРеквизиты.Добавить(); 
						НовоеЗначениеСвойств.Свойство = ИнформацияОСтатусах.СвойствоСчета;
						НовоеЗначениеСвойств.Значение = НовыйСтатус;
					Иначе
						НайденныеДанныеСтатуса.Значение = НовыйСтатус; 	
					КонецЕсли;
					ЗаказОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
							
		КонецЕсли;
		
	ИначеЕсли  СтруктураНастроек.Операция = "Заказы" Тогда 
		
		Если ИнформацияОСтатусах.ИсточникСтатусовЗаказов = "СвойствоЗаказов" Тогда
		
			УстановленныйСтатус = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойств", Документ, ИнформацияОСтатусах.СвойствоЗаказа);
						
			НайденнаяСтрокаСтатуса = ИнформацияОСтатусах.СоответствияСЗначениямиСвойствЗаказа.Найти(ИдСтатуса);
			
			Если НайденнаяСтрокаСтатуса = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			НовыйСтатус = НайденнаяСтрокаСтатуса.Статус;
			
			Если ЗначениеЗаполнено(НовыйСтатус) Тогда
				
				Если УстановленныйСтатус <> НовыйСтатус Тогда
					ЗаказОбъект =  Документ.ПолучитьОбъект();
					ЗаказОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
					НайденныеДанныеСтатуса = ЗаказОбъект.ДополнительныеРеквизиты.Найти(ИнформацияОСтатусах.СвойствоЗаказа);
					Если НайденныеДанныеСтатуса = неопределено Тогда
						НовоеЗначениеСвойств = ЗаказОбъект.ДополнительныеРеквизиты.Добавить(); 
						НовоеЗначениеСвойств.Свойство = ИнформацияОСтатусах.СвойствоЗаказа;
						НовоеЗначениеСвойств.Значение = НовыйСтатус;
					Иначе
						НайденныеДанныеСтатуса.Значение = НовыйСтатус; 	
					КонецЕсли;
					ЗаказОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
							
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ИнтернетМагазин

Функция СформироватьДанныеПоЗаказам(пСтруктураНастроек, МассивДанных, Пакет) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
#Область ФормированиеВременныхТаблицДанных
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДанных"			, МассивДанных);
	Запрос.УстановитьПараметр("АктуальнаяДатаСеанса"	, СтруктураНастроек.ДатаФормирования);
	Запрос.УстановитьПараметр("Портал"					, СтруктураНастроек.Портал);
	Запрос.УстановитьПараметр("ТипДанныхЗаказов"		, СтруктураНастроек.ТипыОбъектовОбмена.Заказ);
	Запрос.УстановитьПараметр("ТипДанныхКомпаний"		, СтруктураНастроек.ТипыОбъектовОбмена.Компания);
	Запрос.УстановитьПараметр("ТипДанныхКонтактов"		, СтруктураНастроек.ТипыОбъектовОбмена.Контакт);
	Запрос.УстановитьПараметр("ТипДанныхРеквизитов"		, СтруктураНастроек.ТипыОбъектовОбмена.Реквизит);
	Запрос.УстановитьПараметр("ТипДанныхБанкСчетов"		, СтруктураНастроек.ТипыОбъектовОбмена.БанковскийСчетРеквизита);
	Запрос.УстановитьПараметр("ТоварыЗаказа"			, СтруктураНастроек.ТипыОбъектовОбмена.ТоварыЗаказа);
	Запрос.УстановитьПараметр("ТипДанныхТоваров"		, СтруктураНастроек.ТипыОбъектовОбмена.Товар);
	Запрос.УстановитьПараметр("ТипДанныхТоваров2"		, СтруктураНастроек.ТипыОбъектовОбмена.Товар2);
	Запрос.УстановитьПараметр("ТипДанныхПредложений"	, СтруктураНастроек.ТипыОбъектовОбмена.Предложение); 
	Запрос.УстановитьПараметр("ТипДанныхЕдИзм"			, СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("ТипДанныхЕдИзм2"			, СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения2);
	Запрос.УстановитьПараметр("ЭтоТовар2"				, СтруктураНастроек.ВерсияТоваров = "v.2");
	ТекстЗапроса = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Документ.ЗаказКлиента) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЗаказов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЗаказов
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыКомпанийКонтактов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И (Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхКомпаний
	|			ИЛИ Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхКонтактов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыРеквизитов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхРеквизитов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыБанкСчетов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхБанкСчетов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка,
	|	ЗаказКлиента.Номер КАК Номер,
	|	ЗаказКлиента.Дата КАК Дата,
	|	ЗаказКлиента.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЗаказКлиента.Проведен КАК Проведен,
	|	ЗаказКлиента.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗаказКлиента.Статус КАК Статус,
	|	ЗаказКлиента.Подразделение КАК Подразделение,
	|	ЗаказКлиента.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ЗаказКлиента.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказКлиента.Комментарий КАК Комментарий,
	|	ЗаказКлиента.Менеджер КАК Менеджер,
	|	ЗаказКлиента.Валюта КАК Валюта,
	|	Валюты.Код КАК ВалютаКод,
	|	ЗаказКлиента.Партнер КАК Партнер,
	|	ЗаказКлиента.Контрагент КАК Контрагент,
	|	ЗаказКлиента.Организация КАК Организация,
	|	ЗаказКлиента.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ЗаказКлиента.БанковскийСчет КАК БанковскийСчет,
	|	ЗаказКлиента.СпособДоставки КАК СпособДоставки,
	|	ЗаказКлиента.ПеревозчикПартнер КАК ПеревозчикПартнер
	|ПОМЕСТИТЬ ВТ_ЗаказыПакет
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ЗаказКлиента.Валюта = Валюты.Ссылка
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаказыПакет.Ссылка КАК Объект,
	|	ВТ_ЗаказыПакет.Ссылка КАК Идентификатор1С,
	|	ВТ_ИдентификаторыЗаказов.Идентификатор КАК ИдентификаторБ24,
	|	ВТ_ЗаказыПакет.Номер КАК Номер,
	|	ВТ_ЗаказыПакет.Дата КАК Дата,
	|	ВТ_ЗаказыПакет.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ВТ_ЗаказыПакет.Проведен КАК Проведен,
	|	ВТ_ЗаказыПакет.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_ЗаказыПакет.Статус КАК Статус,
	|	ВТ_ЗаказыПакет.Подразделение КАК Подразделение,
	|	ВТ_ЗаказыПакет.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ВТ_ЗаказыПакет.СуммаДокумента КАК СуммаДокумента,
	|	ВТ_ЗаказыПакет.Комментарий КАК Комментарий,
	|	ВТ_ЗаказыПакет.Менеджер КАК Менеджер,
	|	ВТ_ЗаказыПакет.Валюта КАК Валюта,
	|	ВТ_ЗаказыПакет.ВалютаКод КАК КодВалютыДокумента,
	|	ВТ_ЗаказыПакет.Контрагент КАК Контрагент,
	|	ВТ_ЗаказыПакет.Партнер КАК Партнер,
	|	ВТ_ИдентификаторыКомпанийКонтактов.Идентификатор КАК ИдентификаторБ24КомпанииКонтакта,
	|	ВТ_ИдентификаторыРеквизитовКонтрагентов.Идентификатор КАК ИдентификаторБ24РеквизитаКонтрагента,
	|	ВТ_ЗаказыПакет.Организация КАК Организация,
	|	ВТ_ИдентификаторыОрганизаций.Идентификатор КАК ИдентификаторБ24Организации,
	|	ВТ_ИдентификаторыРеквизитовОрганизаций.Идентификатор КАК ИдентификаторБ24РеквизитаОрганизации,
	|	ВТ_ЗаказыПакет.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ВТ_ИдентификаторыБанкСчетовКонтрагентов.Идентификатор КАК ИдентификаторБ24БанковскогоСчетаКонтрагента,
	|	ВТ_ЗаказыПакет.БанковскийСчет КАК БанковскийСчет,
	|	ВТ_ИдентификаторыБанкСчетовОрганизаций.Идентификатор КАК ИдентификаторБ24БанковскогоСчетаОрганизации,
	|	Контрагенты.ЮрФизЛицо КАК ТипКонтрагента,
	|	ВТ_ЗаказыПакет.СпособДоставки КАК СпособДоставки,
	|	ВТ_ЗаказыПакет.ПеревозчикПартнер КАК СлужбаДоставки,
	|	Б24_КС_ИнформацияОЗаказах.ДополнительныеДанные КАК ДополнительныеДанныеОЗаказе
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	ВТ_ЗаказыПакет КАК ВТ_ЗаказыПакет
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ВТ_ЗаказыПакет.Валюта = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_ЗаказыПакет.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыРеквизитов КАК ВТ_ИдентификаторыРеквизитовКонтрагентов
	|		ПО ВТ_ЗаказыПакет.Контрагент = ВТ_ИдентификаторыРеквизитовКонтрагентов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыРеквизитов КАК ВТ_ИдентификаторыРеквизитовОрганизаций
	|		ПО ВТ_ЗаказыПакет.Организация = ВТ_ИдентификаторыРеквизитовОрганизаций.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыКомпанийКонтактов КАК ВТ_ИдентификаторыКомпанийКонтактов
	|		ПО ВТ_ЗаказыПакет.Партнер = ВТ_ИдентификаторыКомпанийКонтактов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыКомпанийКонтактов КАК ВТ_ИдентификаторыОрганизаций
	|		ПО ВТ_ЗаказыПакет.Организация = ВТ_ИдентификаторыОрганизаций.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыБанкСчетов КАК ВТ_ИдентификаторыБанкСчетовКонтрагентов
	|		ПО ВТ_ЗаказыПакет.БанковскийСчетКонтрагента = ВТ_ИдентификаторыБанкСчетовКонтрагентов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыБанкСчетов КАК ВТ_ИдентификаторыБанкСчетовОрганизаций
	|		ПО ВТ_ЗаказыПакет.БанковскийСчет = ВТ_ИдентификаторыБанкСчетовОрганизаций.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗаказов КАК ВТ_ИдентификаторыЗаказов
	|		ПО ВТ_ЗаказыПакет.Ссылка = ВТ_ИдентификаторыЗаказов.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Б24_КС_ИнформацияОЗаказах КАК Б24_КС_ИнформацияОЗаказах
	|		ПО ВТ_ЗаказыПакет.Ссылка = Б24_КС_ИнформацияОЗаказах.Заказ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗаказыПакет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект КАК Объект,
	|	ДополнительныеСведения.Свойство КАК Свойство,
	|	ДополнительныеСведения.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ТаблицаСвойств
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект В(&МассивДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаДополнительныеРеквизиты.Ссылка,
	|	ЗаказКлиентаДополнительныеРеквизиты.Свойство,
	|	ЗаказКлиентаДополнительныеРеквизиты.Значение
	|ИЗ
	|	Документ.ЗаказКлиента.ДополнительныеРеквизиты КАК ЗаказКлиентаДополнительныеРеквизиты
	|ГДЕ
	|	ЗаказКлиентаДополнительныеРеквизиты.Ссылка В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Свойство,
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыРеквизитов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыБанкСчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиента.Объект) КАК ЗаказСтрокой,
	|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОплаты, 0) КАК ПроцентОплаты,
	|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОтгрузки, 0) КАК ПроцентОтгрузки,
	|	СостоянияЗаказовКлиентов.Состояние КАК Состояние,
	|	ЗаказКлиента.Объект КАК Объект,
	|	ЗаказКлиента.Идентификатор1С КАК Идентификатор1С,
	|	ЗаказКлиента.ИдентификаторБ24 КАК ИдентификаторБ24,
	|	ЗаказКлиента.Номер КАК Номер,
	|	ЗаказКлиента.Дата КАК Дата,
	|	ЗаказКлиента.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЗаказКлиента.Проведен КАК Проведен,
	|	ЗаказКлиента.Статус КАК Статус,
	|	ЗаказКлиента.Подразделение КАК Подразделение,
	|	ЗаказКлиента.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ЗаказКлиента.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказКлиента.Комментарий КАК Комментарий,
	|	ЗаказКлиента.Менеджер КАК Ответственный,
	|	ЗаказКлиента.Валюта КАК Валюта,
	|	ЗаказКлиента.КодВалютыДокумента КАК ВалютаКод,
	|	ЗаказКлиента.Контрагент КАК Контрагент,
	|	ЗаказКлиента.Партнер КАК Партнер,
	|	ЗаказКлиента.ИдентификаторБ24КомпанииКонтакта КАК ИдентификаторБ24КомпанииКонтакта,
	|	ЗаказКлиента.ИдентификаторБ24РеквизитаКонтрагента КАК ИдентификаторБ24РеквизитаКонтрагента,
	|	ЗаказКлиента.Организация КАК Организация,
	|	ЗаказКлиента.ИдентификаторБ24Организации КАК ИдентификаторБ24Организации,
	|	ЗаказКлиента.ИдентификаторБ24РеквизитаОрганизации КАК ИдентификаторБ24РеквизитаОрганизации,
	|	ЗаказКлиента.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ЗаказКлиента.ИдентификаторБ24БанковскогоСчетаКонтрагента КАК ИдентификаторБ24БанковскогоСчетаКонтрагента,
	|	ЗаказКлиента.БанковскийСчет КАК БанковскийСчет,
	|	ЗаказКлиента.ИдентификаторБ24БанковскогоСчетаОрганизации КАК ИдентификаторБ24БанковскогоСчетаОрганизации,
	|	ЗаказКлиента.ТипКонтрагента КАК ТипКонтрагента,
	|	ЗаказКлиента.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗаказКлиента.СпособДоставки КАК СпособДоставки,
	|	ЗаказКлиента.СлужбаДоставки КАК СлужбаДоставки,
	|	ЗаказКлиента.ДополнительныеДанныеОЗаказе КАК ДополнительныеДанныеОЗаказе
	|ИЗ
	|	ВТ_Заказы КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО ЗаказКлиента.Объект = СостоянияЗаказовКлиентов.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Документ.ЗаказКлиента) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК ИдКорзины,
	|	Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект КАК КлючСвязи
	|ПОМЕСТИТЬ ВТ_ИдентификаторыПозицийЗаказов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТоварыЗаказа
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.Номенклатура) КАК Объект,
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект КАК Справочник.ХарактеристикиНоменклатуры) КАК ПодчиненныйОбъект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыТоваров
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхТоваров
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И НЕ &ЭтоТовар2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Б24_К_ИдентификаторыОбъектов.Объект,
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект КАК Справочник.ХарактеристикиНоменклатуры),
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхТоваров2
	|	И &ЭтоТовар2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	ПодчиненныйОбъект   
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.Номенклатура) КАК Объект,
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект КАК Справочник.ХарактеристикиНоменклатуры) КАК ПодчиненныйОбъект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыПредложений
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхПредложений
	|	И &ЭтоТовар2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	ПодчиненныйОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЕдИзм
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЕдИзм
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал   
	|	И НЕ &ЭтоТовар2   
	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЕдИзм2
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал   
	|	И &ЭтоТовар2   
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Объект КАК Объект,
	|	ВТ_Заказы.ИдентификаторБ24 КАК ИдентификаторБ24,
	|	ЗаказКлиентаТовары.КлючСвязи КАК КлючСвязи,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.Содержание КАК Содержание,
	|	ЗаказКлиентаТовары.Количество КАК Количество,
	|	ЗаказКлиентаТовары.Цена КАК Цена,
	|	ЗаказКлиентаТовары.Сумма КАК Сумма,
	|	ЗаказКлиентаТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ЗаказКлиентаТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
	|	Товары.Наименование КАК НаименованиеТовара,
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК ЕдиницаИзмерения,
	|	ПРЕДСТАВЛЕНИЕ(УпаковкиЕдиницыИзмерения.Ссылка) КАК НаименованиеЕдиницыИзмерения,
	|	ВТ_ИдентификаторыТоваров.Идентификатор КАК ИдентификаторБ24Товара,
	|	Товары.НаименованиеПолное КАК НаименованиеПолноеНоменклатуры,
	|	Товары.Наименование КАК НаименованиеНоменклатуры,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаТовары.Характеристика) КАК НаименованиеХарактеристики,
	|	УпаковкиЕдиницыИзмерения.Код КАК КодЕдИзм,
	|	ВТ_ИдентификаторыЕдИзм.Идентификатор КАК ИдЕдИзм,
	|	ЗаказКлиентаТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ЗаказКлиентаТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	ВТ_ИдентификаторыПозицийЗаказов.ИдКорзины КАК ИдКорзины,
	|	ВТ_ИдентификаторыПредложений.Идентификатор КАК ИдентификаторБ24Предложения
	|ПОМЕСТИТЬ ВТ_ТоварыЗаказов
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|			ПО Товары.ЕдиницаИзмерения = УпаковкиЕдиницыИзмерения.Ссылка
	|		ПО ЗаказКлиентаТовары.Номенклатура = Товары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыТоваров КАК ВТ_ИдентификаторыТоваров
	|		ПО ЗаказКлиентаТовары.Номенклатура = ВТ_ИдентификаторыТоваров.Объект
	|			И ЗаказКлиентаТовары.Характеристика = ВТ_ИдентификаторыТоваров.ПодчиненныйОбъект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО ЗаказКлиентаТовары.Ссылка = ВТ_Заказы.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЕдИзм КАК ВТ_ИдентификаторыЕдИзм
	|		ПО (Товары.ЕдиницаИзмерения = ВТ_ИдентификаторыЕдИзм.Объект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыПозицийЗаказов КАК ВТ_ИдентификаторыПозицийЗаказов
	|		ПО ЗаказКлиентаТовары.Ссылка = ВТ_ИдентификаторыПозицийЗаказов.Объект
	|			И ЗаказКлиентаТовары.КлючСвязи = ВТ_ИдентификаторыПозицийЗаказов.КлючСвязи   
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыПредложений КАК ВТ_ИдентификаторыПредложений
	|		ПО ЗаказКлиентаТовары.Номенклатура = ВТ_ИдентификаторыПредложений.Объект
	|			И ЗаказКлиентаТовары.Характеристика = ВТ_ИдентификаторыПредложений.ПодчиненныйОбъект
	|ГДЕ
	|	ЗаказКлиентаТовары.Количество > 0
	|	И ЗаказКлиентаТовары.Отменено = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыПозицийЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыПредложений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыЕдИзм
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_КС_СвойстваПозицийЗаказов.Объект КАК Заказ,
	|	Б24_КС_СвойстваПозицийЗаказов.ИдентификаторПозиции КАК ИдентификаторПозиции,
	|	Б24_КС_СвойстваПозицийЗаказов.ИдентификаторСвойства КАК ИдентификаторСвойства,
	|	Б24_КС_СвойстваПозицийЗаказов.Значение КАК Значение,
	|	Б24_КС_СвойстваПозицийЗаказов.Характеристика КАК Характеристика,
	|	Б24_КС_СвойстваПозицийЗаказов.Номенклатура КАК Номенклатура,
	|	Б24_КС_СвойстваПозицийЗаказов.КлючСвязи КАК КлючСвязи,
	|	Б24_КС_СвойстваПозицийЗаказов.НаименованиеСвойства КАК НаименованиеСвойства,
	|	Б24_КС_СвойстваПозицийЗаказов.КодСвойства КАК КодСвойства
	|ПОМЕСТИТЬ ВТ_СвойстваПозицийЗаказов
	|ИЗ
	|	РегистрСведений.Б24_КС_СвойстваПозицийЗаказов КАК Б24_КС_СвойстваПозицийЗаказов
	|ГДЕ
	|	Б24_КС_СвойстваПозицийЗаказов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ,
	|	КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Заказы";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
#КонецОбласти	
	
	мЭлементы 	=  Новый массив;
	
	ВыгружатьЗаказы 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Заказ", "ЗаказКлиента", "ВыгружатьНаПортал");
	ОбновлятьНаПортале 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Заказ", "ЗаказКлиента", "ОбновлятьНаПортале");
	
	Пока Выборка.Следующий() Цикл
		
		ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(Выборка.ИдентификаторБ24);
		
		Если ВыгружатьЗаказы Тогда
			
			Если ЭтоНовыйЭлемент ИЛИ (НЕ ЭтоНовыйЭлемент И ОбновлятьНаПортале) Тогда 
				СформированныйЗапрос = СформироватьСтруктуруДанныхПоЗаказу(СтруктураНастроек,  МенеджерВременныхТаблиц, Выборка, Пакет);
			Иначе
				СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(Выборка.Идентификатор1С);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоЗаказу(СтруктураНастроек, МенеджерВременныхТаблиц, ИнформацияОЗаказе, Пакет)
	
	ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(ИнформацияОЗаказе.ИдентификаторБ24);
	
	ИнформацияОПолях 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Заказ", "ЗаказКлиента");
	ИнформацияОПоляхТЧ 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностейТЧ(СтруктураНастроек.НастройкаПодключения, "Заказ", "ЗаказКлиента");
	АлгоритмПриВыгрузкеДанныхНаПортал 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Заказ", "ЗаказКлиента", "АлгоритмПриВыгрузкеДанныхНаПортал");
	
	КлючЗаказа = XMLСтрока(ИнформацияОЗаказе.Идентификатор1С);	
	
#Область Заказ	
	ПрефиксВнешнихКодовБитрикс24 	= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьПрефиксВнешнихКодовБитрикс24();
	ИдентификаторБ24 				= Прав(ИнформацияОЗаказе.ИдентификаторБ24, СтрДлина(ИнформацияОЗаказе.ИдентификаторБ24)-СтрДлина(ПрефиксВнешнихКодовБитрикс24.Заказы));	
	
	ДополнительныеДанныеОЗаказе 	= ИнформацияОЗаказе.ДополнительныеДанныеОЗаказе.Получить();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИнформацияОПолях"				, ИнформацияОПолях);
	ДополнительныеПараметры.Вставить("КлючЭлемента"					, КлючЗаказа);
	ДополнительныеПараметры.Вставить("МенеджерВременныхТаблиц"		, МенеджерВременныхТаблиц);
	ДополнительныеПараметры.Вставить("ЭтоНовыйЭлемент"				, ЭтоНовыйЭлемент);
	ДополнительныеПараметры.Вставить("ИнформацияОбъекта1С"			, ИнформацияОЗаказе);
	ДополнительныеПараметры.Вставить("ИдентификаторБ24"				, ИдентификаторБ24);
	ДополнительныеПараметры.Вставить("ДополнительныеДанныеОЗаказе"	, ДополнительныеДанныеОЗаказе);

	Поля = ПолучитьСтруктуруКлючейЭлементаВыгрузки(СтруктураНастроек, ДополнительныеПараметры);
	
	Если ЗначениеЗаполнено(АлгоритмПриВыгрузкеДанныхНаПортал) Тогда
		ВыполнитьАлгоритмПередВыгрузкой(СтруктураНастроек, ИнформацияОЗаказе.Объект, Поля, АлгоритмПриВыгрузкеДанныхНаПортал)
	КонецЕсли;

	ТелоЗапроса = "";
	
	Для каждого ТекПоле Из Поля Цикл
		Если ТекПоле.Значение <> Неопределено Тогда
			ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
		КонецЕсли;		
	КонецЦикла;  
	
	лКлиенты	= "";
	лРеквизиты 	= "";
#Область Реквизиты	
	Если ЗначениеЗаполнено(ИнформацияОЗаказе.ИдентификаторБ24РеквизитаКонтрагента) Тогда
		лРеквизиты = лРеквизиты + "&fields[requisiteLink][requisiteId]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИнформацияОЗаказе.ИдентификаторБ24РеквизитаКонтрагента);	
	КонецЕсли;
	Если ЗначениеЗаполнено(ИнформацияОЗаказе.ИдентификаторБ24РеквизитаОрганизации) Тогда
		лРеквизиты = лРеквизиты + "&fields[requisiteLink][mcRequisiteId]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИнформацияОЗаказе.ИдентификаторБ24РеквизитаОрганизации);	
	КонецЕсли;
	Если ЗначениеЗаполнено(ИнформацияОЗаказе.ИдентификаторБ24БанковскогоСчетаКонтрагента) Тогда
		лРеквизиты = лРеквизиты + "&fields[requisiteLink][bankDetailId]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИнформацияОЗаказе.ИдентификаторБ24БанковскогоСчетаКонтрагента);	
	КонецЕсли;
	Если ЗначениеЗаполнено(ИнформацияОЗаказе.ИдентификаторБ24БанковскогоСчетаОрганизации) Тогда
		лРеквизиты = лРеквизиты + "&fields[requisiteLink][mcBankDetailId]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИнформацияОЗаказе.ИдентификаторБ24БанковскогоСчетаОрганизации);	
	КонецЕсли;
#КонецОбласти	

	ТелоЗапроса = ТелоЗапроса +  лКлиенты;
	ТелоЗапроса = ТелоЗапроса +  лРеквизиты;
	
	Если ЭтоНовыйЭлемент Тогда
		СтрокаЗапроса = "cmd["+КлючЗаказа+"]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("sale.order.add?"  + ТелоЗапроса);  
	Иначе
		СтрокаЗапроса = "cmd["+КлючЗаказа+"]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("sale.order.update?id=" + ИдентификаторБ24 + "&"  + ТелоЗапроса);  
	КонецЕсли;

	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючЗаказа, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.Заказ, ИнформацияОЗаказе.Объект));
	
#КонецОбласти


#Область ТоварыЗаказа
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Объект", ИнформацияОЗаказе.Объект);
	Запрос.Текст = " ВЫБРАТЬ *
	|ИЗ
	|	ВТ_ТоварыЗаказов КАК ВТ_ТоварыЗаказов
	|ГДЕ
	|	ВТ_ТоварыЗаказов.Объект = &Объект";
	
	ТоварыЗаказа = Запрос.Выполнить().Выгрузить();
	
	ЗапросПоТоварамЗаказа 	= "";
	НомерСтроки 			= 0;	
	
	НомерСтроки = 1;
	Для каждого ТоварЗаказа Из ТоварыЗаказа Цикл
		
		Если ТоварЗаказа.Номенклатура = СтруктураНастроек.НастройкиСинхронизацииЗаказов.НоменклатураДоставка Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТоварЗаказа.ИдКорзины) Тогда
			ИдентификаторПозиции = ТоварЗаказа.ИдКорзины;
		Иначе
			ИдентификаторПозиции = "n"+Формат(ТоварЗаказа.КлючСвязи, "ЧГ=0");
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИнформацияОПолях"			, ИнформацияОПоляхТЧ);
		ДополнительныеПараметры.Вставить("КлючЭлемента"				, КлючЗаказа);
		ДополнительныеПараметры.Вставить("МенеджерВременныхТаблиц"	, МенеджерВременныхТаблиц);
		ДополнительныеПараметры.Вставить("ЭтоНовыйЭлемент"			, ЭтоНовыйЭлемент);
		ДополнительныеПараметры.Вставить("ИнформацияОбъекта1С"		, ИнформацияОЗаказе);
		ДополнительныеПараметры.Вставить("Товары"					, ТоварыЗаказа);
		ДополнительныеПараметры.Вставить("ИнформацияСтрокиТЧ"		, ТоварЗаказа);
		ДополнительныеПараметры.Вставить("КлючСвязи"				, ТоварЗаказа.КлючСвязи);
		ДополнительныеПараметры.Вставить("ИдентификаторПозиции"		, ИдентификаторПозиции);
		ДополнительныеПараметры.Вставить("ИмяТЧ"					, "Товары");

		ПоляТЧ = ПолучитьСтруктуруКлючейТЧЭлементаВыгрузки(СтруктураНастроек, ДополнительныеПараметры);
		
		НомерСтрокиСтрокой = Формат(НомерСтроки, "ЧГ=0");
		
		Для каждого ТекПоле Из ПоляТЧ Цикл
			Если ТекПоле.Значение <> Неопределено Тогда
				ЗапросПоТоварамЗаказа = ЗапросПоТоварамЗаказа + "&fields[order][basketItems]["+НомерСтрокиСтрокой+"]["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
			КонецЕсли;		
		КонецЦикла;  
		
		лСвойстваПоСвойствамПозицийЗаказа 	= "";
#Область ЗаполнениеСвойствПозицийЗаказа
		ЗапросПоСвойствамПозицийЗаказа = Новый Запрос;
		ЗапросПоСвойствамПозицийЗаказа.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросПоСвойствамПозицийЗаказа.УстановитьПараметр("Заказ", ИнформацияОЗаказе.Объект);	
		ЗапросПоСвойствамПозицийЗаказа.УстановитьПараметр("КлючСвязи", ТоварЗаказа.КлючСвязи);	
		ЗапросПоСвойствамПозицийЗаказа.Текст = "ВЫБРАТЬ * ИЗ ВТ_СвойстваПозицийЗаказов ГДЕ ВТ_СвойстваПозицийЗаказов.Заказ = &Заказ И ВТ_СвойстваПозицийЗаказов.КлючСвязи = &КлючСвязи";

		ВыполненныйЗапросПоСвойствамПозицийЗаказа = ЗапросПоСвойствамПозицийЗаказа.Выполнить();
		
		Если НЕ ВыполненныйЗапросПоСвойствамПозицийЗаказа.Пустой() Тогда
			
			ВыборкаПоСвойствамПозицийЗаказа = ВыполненныйЗапросПоСвойствамПозицийЗаказа.Выбрать();
			НомерСтрокиПоСвойствам = 1;                                                                                
			
			Пока ВыборкаПоСвойствамПозицийЗаказа.Следующий() Цикл
				
				НомерСтрокиСвойстваСтрокой = Формат(НомерСтрокиПоСвойствам, "ЧГ=0");

				лСвойстваПоСвойствамПозицийЗаказа = лСвойстваПоСвойствамПозицийЗаказа +  "&fields[order][basketItems]["+НомерСтрокиСтрокой+"][properties]["+НомерСтрокиСвойстваСтрокой+"][id]="+ Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ВыборкаПоСвойствамПозицийЗаказа.ИдентификаторСвойства);
				лСвойстваПоСвойствамПозицийЗаказа = лСвойстваПоСвойствамПозицийЗаказа +  "&fields[order][basketItems]["+НомерСтрокиСтрокой+"][properties]["+НомерСтрокиСвойстваСтрокой+"][basketId]="+ Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИдентификаторПозиции);
				лСвойстваПоСвойствамПозицийЗаказа = лСвойстваПоСвойствамПозицийЗаказа +  "&fields[order][basketItems]["+НомерСтрокиСтрокой+"][properties]["+НомерСтрокиСвойстваСтрокой+"][value]="+ Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ВыборкаПоСвойствамПозицийЗаказа.Значение);
				лСвойстваПоСвойствамПозицийЗаказа = лСвойстваПоСвойствамПозицийЗаказа +  "&fields[order][basketItems]["+НомерСтрокиСтрокой+"][properties]["+НомерСтрокиСвойстваСтрокой+"][name]="+ Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ВыборкаПоСвойствамПозицийЗаказа.НаименованиеСвойства);
				лСвойстваПоСвойствамПозицийЗаказа = лСвойстваПоСвойствамПозицийЗаказа +  "&fields[order][basketItems]["+НомерСтрокиСтрокой+"][properties]["+НомерСтрокиСвойстваСтрокой+"][code]="+ Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ВыборкаПоСвойствамПозицийЗаказа.КодСвойства);
				
				НомерСтрокиПоСвойствам = НомерСтрокиПоСвойствам + 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
#КонецОбласти	

		ЗапросПоТоварамЗаказа = ЗапросПоТоварамЗаказа +  лСвойстваПоСвойствамПозицийЗаказа;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
#КонецОбласти	
	
	Если ЗначениеЗаполнено(ЗапросПоТоварамЗаказа) Тогда
		
		КлючТоваровЗаказа = ПрефиксВнешнихКодовБитрикс24.Заказы + КлючЗаказа;

		Если НЕ ЗначениеЗаполнено(ИдентификаторБ24) Тогда
			ЗапросПоТоварамЗаказа = "fields[order][id]=$result["+ Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(КлючЗаказа)+"]"+ ЗапросПоТоварамЗаказа;
		Иначе
			ЗапросПоТоварамЗаказа = "fields[order][id]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИдентификаторБ24) + ЗапросПоТоварамЗаказа;
		КонецЕсли;		
		
		СтрокаЗапроса = СтрокаЗапроса + "&" + "cmd["+КлючТоваровЗаказа+"]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("sale.basketitem.modify?" + ЗапросПоТоварамЗаказа);	
		
		СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючТоваровЗаказа, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.ТоварыЗаказа, ИнформацияОЗаказе.Объект));

	КонецЕсли;
	
	Возврат СтрокаЗапроса;
	
КонецФункции

Функция СформироватьДанныеПоУстановленнымЗначениямСвойствЗаказов(пСтруктураНастроек, МассивДанных, Пакет) Экспорт
	
	мЭлементы 	=  Новый массив;
	
	Возврат мЭлементы;	
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция СформироватьДанныеПоОплатам(пСтруктураНастроек, МассивДанных, Пакет) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
#Область ФормированиеВременныхТаблицДанных
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДанных"			, МассивДанных);
	Запрос.УстановитьПараметр("Портал"					, СтруктураНастроек.Портал);
	
	Запрос.УстановитьПараметр("ТипДанныхЗаказов"		, СтруктураНастроек.ТипыОбъектовОбмена.Заказ);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Документ.ЗаказКлиента) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЗаказов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЗаказов
	|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыОплат.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_ЗаказыОплат
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступлениеНаСчетРасшифровка.ОснованиеПлатежа КАК Заказ
	|	ИЗ
	|		Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеНаСчетРасшифровка
	|	ГДЕ
	|		ПоступлениеНаСчетРасшифровка.Ссылка В(&МассивДанных)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеВКассуРасшифровка.ОснованиеПлатежа
	|	ИЗ
	|		Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПоступлениеВКассуРасшифровка
	|	ГДЕ
	|		ПоступлениеВКассуРасшифровка.Ссылка В(&МассивДанных)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОперацияПоПлатежнымКартамРасшифровка.ОснованиеПлатежа
	|	ИЗ
	|		Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнымКартамРасшифровка
	|	ГДЕ
	|		ОперацияПоПлатежнымКартамРасшифровка.Ссылка В(&МассивДанных)) КАК ЗаказыОплат
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыОплат.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаказыОплат.Заказ КАК Заказ,
	|	ВТ_ИдентификаторыЗаказов.Идентификатор КАК ИдентификаторЗаказаБитрикс24,
	|	Б24_КС_ИнформацияОЗаказах.ДополнительныеДанные КАК ДополнительныеДанные
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	ВТ_ЗаказыОплат КАК ВТ_ЗаказыОплат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗаказов КАК ВТ_ИдентификаторыЗаказов
	|		ПО ВТ_ЗаказыОплат.Заказ = ВТ_ИдентификаторыЗаказов.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Б24_КС_ИнформацияОЗаказах КАК Б24_КС_ИнформацияОЗаказах
	|		ПО ВТ_ЗаказыОплат.Заказ = Б24_КС_ИнформацияОЗаказах.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗаказыОплат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОперацияПоПлатежнымКартамРасшифровкаПлатежа.Ссылка КАК Оплата,
	|	ВТ_Заказы.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_ВыгружаемыеОплатыПром
	|ИЗ
	|	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнымКартамРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО ОперацияПоПлатежнымКартамРасшифровкаПлатежа.ОснованиеПлатежа = ВТ_Заказы.Заказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеВКассуРасшифровкаПлатежа.Ссылка,
	|	ВТ_Заказы.Заказ
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПоступлениеВКассуРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО ПоступлениеВКассуРасшифровкаПлатежа.ОснованиеПлатежа = ВТ_Заказы.Заказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка,
	|	ВТ_Заказы.Заказ
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеНаСчетРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО ПоступлениеНаСчетРасшифровкаПлатежа.ОснованиеПлатежа = ВТ_Заказы.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыгружаемыеОплатыПром.Оплата КАК Оплата,
	|	ВТ_ВыгружаемыеОплатыПром.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_ВыгружаемыеОплаты
	|ИЗ
	|	ВТ_ВыгружаемыеОплатыПром КАК ВТ_ВыгружаемыеОплатыПром
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыгружаемыеОплатыПром.Заказ,
	|	ВТ_ВыгружаемыеОплатыПром.Оплата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВыгружаемыеОплатыПром
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыгружаемыеОплаты.Оплата КАК Оплата,
	|	ВТ_ВыгружаемыеОплаты.Заказ КАК Заказ,
	|	ПоступлениеНаСчет.Дата КАК Дата,
	|	ПоступлениеНаСчет.Номер КАК Номер,
	|	ПоступлениеНаСчет.Проведен КАК Проведен,
	|	ПоступлениеНаСчет.ПометкаУдаления КАК ПометкаУдаления,
	|	ПоступлениеНаСчет.ВерсияДанных КАК ВерсияДанных,
	|	ПоступлениеНаСчет.Комментарий КАК Комментарий,
	|	ПоступлениеНаСчет.СуммаДокумента КАК СуммаДокумента,
	|	ПоступлениеНаСчет.Валюта КАК ВалютаДенежныхСредств,
	|	ПоступлениеНаСчет.БанковскийСчет КАК БанковскийСчет,
	|	NULL КАК Касса,
	|	NULL КАК ЭквайринговыйТерминал,
	|	NULL КАК ДоговорЭквайринга
	|ПОМЕСТИТЬ ВТ_Оплаты
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеНаСчет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВыгружаемыеОплаты КАК ВТ_ВыгружаемыеОплаты
	|		ПО ПоступлениеНаСчет.Ссылка = ВТ_ВыгружаемыеОплаты.Оплата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВыгружаемыеОплаты.Оплата,
	|	ВТ_ВыгружаемыеОплаты.Заказ,
	|	ПоступлениеВКассу.Дата,
	|	ПоступлениеВКассу.Номер,
	|	ПоступлениеВКассу.Проведен,
	|	ПоступлениеВКассу.ПометкаУдаления,
	|	ПоступлениеВКассу.ВерсияДанных,
	|	ПоступлениеВКассу.Комментарий,
	|	ПоступлениеВКассу.СуммаДокумента,
	|	ПоступлениеВКассу.Валюта,
	|	NULL,
	|	ПоступлениеВКассу.Касса,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПоступлениеВКассу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВыгружаемыеОплаты КАК ВТ_ВыгружаемыеОплаты
	|		ПО ПоступлениеВКассу.Ссылка = ВТ_ВыгружаемыеОплаты.Оплата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВыгружаемыеОплаты.Оплата,
	|	ВТ_ВыгружаемыеОплаты.Заказ,
	|	ОперацияПоПлатежнымКартам.Дата,
	|	ОперацияПоПлатежнымКартам.Номер,
	|	ОперацияПоПлатежнымКартам.Проведен,
	|	ОперацияПоПлатежнымКартам.ПометкаУдаления,
	|	ОперацияПоПлатежнымКартам.ВерсияДанных,
	|	ОперацияПоПлатежнымКартам.Комментарий,
	|	ОперацияПоПлатежнымКартам.СуммаДокумента,
	|	ОперацияПоПлатежнымКартам.Валюта,
	|	NULL,
	|	NULL,
	|	ОперацияПоПлатежнымКартам.ЭквайринговыйТерминал,
	|	ОперацияПоПлатежнымКартам.ДоговорЭквайринга
	|ИЗ
	|	Документ.ОперацияПоПлатежнойКарте КАК ОперацияПоПлатежнымКартам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВыгружаемыеОплаты КАК ВТ_ВыгружаемыеОплаты
	|		ПО ОперацияПоПлатежнымКартам.Ссылка = ВТ_ВыгружаемыеОплаты.Оплата
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Оплата,
	|	ВалютаДенежныхСредств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Оплаты.Оплата КАК Оплата,
	|	Оплаты.Оплата КАК Идентификатор1С,
	|	Оплаты.Заказ КАК Заказ,
	|	Оплаты.Номер КАК Номер,
	|	Оплаты.Дата КАК Дата,
	|	Оплаты.Проведен КАК Проведен,
	|	Оплаты.ПометкаУдаления КАК ПометкаУдаления,
	|	Оплаты.ВерсияДанных КАК ВерсияДанных,
	|	Оплаты.Комментарий КАК Комментарий,
	|	Оплаты.СуммаДокумента КАК СуммаДокумента,
	|	Оплаты.ВалютаДенежныхСредств КАК ВалютаДокумента,
	|	Валюты.Код КАК ВалютаКод,
	|	Оплаты.БанковскийСчет КАК БанковскийСчет,
	|	Оплаты.Касса КАК Касса,
	|	Оплаты.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	Оплаты.Оплата КАК Объект,
	|	Оплаты.ДоговорЭквайринга КАК ДоговорЭквайринга
	|ПОМЕСТИТЬ ВТ_ИнформацияВыгружаемыхОплат
	|ИЗ
	|	ВТ_Оплаты КАК Оплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО Оплаты.ВалютаДенежныхСредств = Валюты.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Оплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ КАК Заказ,
	|	ВТ_Заказы.ИдентификаторЗаказаБитрикс24 КАК ИдентификаторЗаказаБитрикс24,
	|	ВТ_Заказы.ДополнительныеДанные КАК ДополнительныеДанныеОЗаказе
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВыгружаемыеОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Заказы";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
#КонецОбласти	
	
	мЭлементы 	=  Новый массив;
	
	Пока Выборка.Следующий() Цикл
		
		СформированныйЗапрос = СформироватьСтруктуруДанныхПоОплате(СтруктураНастроек, Пакет, Выборка, МенеджерВременныхТаблиц);
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
		
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоОплате(СтруктураНастроек, Пакет, ИнформацияОЗаказе, МенеджерВременныхТаблиц)
	
	ДополнительныеДанныеОЗаказе 	= ИнформацияОЗаказе.ДополнительныеДанныеОЗаказе.Получить();
	
	ПрефиксВнешнихКодовБитрикс24 	= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьПрефиксВнешнихКодовБитрикс24();
	ПрефиксВнешнихКодов1С 			= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьОписаниеПрефиксовВнешнихКодов1С();
	
	ИдентификаторЗаказаБ24 	= Прав(ИнформацияОЗаказе.ИдентификаторЗаказаБитрикс24, СтрДлина(ИнформацияОЗаказе.ИдентификаторЗаказаБитрикс24)-СтрДлина(ПрефиксВнешнихКодовБитрикс24.Заказы));
	ТелоЗапроса = "fields[order][id]=" + ИдентификаторЗаказаБ24;
	
	КлючЗаказа 	= XMLСтрока(ИнформацияОЗаказе.Заказ);
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Заказ", ИнформацияОЗаказе.Заказ);
	Запрос.Текст = " ВЫБРАТЬ *
	|ИЗ
	|	ВТ_ИнформацияВыгружаемыхОплат КАК ВТ_ИнформацияВыгружаемыхОплат
	|ГДЕ
	|	ВТ_ИнформацияВыгружаемыхОплат.Заказ = &Заказ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	ВыборкаОплат = ВыполненныйЗапрос.Выбрать();
	
	НомерОплаты = 1;
	Пока ВыборкаОплат.Следующий() Цикл
		
		ИнформацияООплате 	= ВыборкаОплат;           
		
		ИдентификаторБ24 = ИдБ24ПоСсылке(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.Оплата, ВыборкаОплат.Оплата);
		
		ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(ИдентификаторБ24);
		
		Если ТипЗнч(ИнформацияООплате.Оплата) = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте") Тогда
			ВыгружатьОплаты 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Оплата", "ОперацияПоПлатежнойКарте", "ВыгружатьНаПортал");
			ОбновлятьНаПортале 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Оплата", "ОперацияПоПлатежнойКарте", "ОбновлятьНаПортале");	
			ИнформацияОПолях 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Оплата", "ОперацияПоПлатежнойКарте");
			АлгоритмПриВыгрузкеДанныхНаПортал 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Оплата", "ОперацияПоПлатежнойКарте", "АлгоритмПриВыгрузкеДанныхНаПортал");
			КлючОплаты 							= ПрефиксВнешнихКодовБитрикс24.ОперацияПоПлатежнымКартам + XMLСтрока(ИнформацияООплате.Оплата);
		ИначеЕсли ТипЗнч(ИнформацияООплате.Оплата) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
			ВыгружатьОплаты 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Оплата", "ПриходныйКассовыйОрдер", "ВыгружатьНаПортал");
			ОбновлятьНаПортале 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Оплата", "ПриходныйКассовыйОрдер", "ОбновлятьНаПортале");	
			ИнформацияОПолях 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Оплата", "ПриходныйКассовыйОрдер");
			АлгоритмПриВыгрузкеДанныхНаПортал 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Оплата", "ПриходныйКассовыйОрдер", "АлгоритмПриВыгрузкеДанныхНаПортал");
			КлючОплаты 							= ПрефиксВнешнихКодовБитрикс24.ПоступлениеВКассу + XMLСтрока(ИнформацияООплате.Оплата);
		ИначеЕсли ТипЗнч(ИнформацияООплате.Оплата) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда
			ВыгружатьОплаты 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Оплата", "ПоступлениеБезналичныхДенежныхСредств", "ВыгружатьНаПортал");
			ОбновлятьНаПортале 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Оплата", "ПоступлениеБезналичныхДенежныхСредств", "ОбновлятьНаПортале");	
			ИнформацияОПолях 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Оплата", "ПоступлениеБезналичныхДенежныхСредств");
			АлгоритмПриВыгрузкеДанныхНаПортал 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Оплата", "ПоступлениеБезналичныхДенежныхСредств", "АлгоритмПриВыгрузкеДанныхНаПортал");
			КлючОплаты 							= ПрефиксВнешнихКодовБитрикс24.ПоступлениеНаСчет + XMLСтрока(ИнформацияООплате.Оплата);
		КонецЕсли;
		
		Если НЕ ВыгружатьОплаты ИЛИ (НЕ ЭтоНовыйЭлемент И НЕ ОбновлятьНаПортале) Тогда
			СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(ИнформацияООплате.Оплата);
			Продолжить;
		КонецЕсли;
		
		ДополнительныеДанныеОплате = Неопределено;
		Если ЗначениеЗаполнено(ИдентификаторБ24) Тогда
			Если ТипЗнч(ДополнительныеДанныеОЗаказе.Получить("payments")) = Тип("Массив") Тогда
				Для каждого ТекОплатаИстория Из ДополнительныеДанныеОЗаказе.Получить("payments") Цикл
					
					Если Формат(ТекОплатаИстория.Получить("id"),"ЧГ=0") = ИдентификаторБ24 Тогда
						ДополнительныеДанныеОплате = ТекОплатаИстория;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктураНастроек.НастройкиСинхронизацииЗаказов.Свойство("ИнформацияОПлатежныхСистемах") Тогда
			СоответствияПлатежныхСистем = СтруктураНастроек.НастройкиСинхронизацииЗаказов.ИнформацияОПлатежныхСистемах.СоответствияПлатежныхСистем;		
		Иначе
			СоответствияПлатежныхСистем = Неопределено;	
		КонецЕсли;
		
		ДополнительнаяИнформация = Новый Структура;
		
		ТипОбъекта = ТипЗнч(ИнформацияООплате.Оплата);
		Если ТипОбъекта =  Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда 
			Идентификатор1С = ПрефиксВнешнихКодов1С.ПоступлениеНаСчет + XMLСтрока(ИнформацияООплате.Идентификатор1С);	
			ДополнительнаяИнформация.Вставить("РасчетныйСчет", ИнформацияООплате.БанковскийСчет);
			ИнформацияОПлатежнойСистеме = ПолучитьИнформациюОПлатежнойСистемеПоСоответствию(2, СоответствияПлатежныхСистем, ДополнительнаяИнформация);
		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
			Идентификатор1С = ПрефиксВнешнихКодов1С.ПоступлениеВКассу + XMLСтрока(ИнформацияООплате.Идентификатор1С);	
			ДополнительнаяИнформация.Вставить("Касса", ИнформацияООплате.Касса);
			ИнформацияОПлатежнойСистеме = ПолучитьИнформациюОПлатежнойСистемеПоСоответствию(1, СоответствияПлатежныхСистем, ДополнительнаяИнформация);
		Иначе
			Идентификатор1С = ПрефиксВнешнихКодов1С.ОперацияПоПлатежнымКартам + XMLСтрока(ИнформацияООплате.Идентификатор1С);
			ДополнительнаяИнформация.Вставить("Терминал"		 , ИнформацияООплате.ЭквайринговыйТерминал);
			ДополнительнаяИнформация.Вставить("ВидПлатежнойКарты", ИнформацияООплате.ДоговорЭквайринга);
			ИнформацияОПлатежнойСистеме = ПолучитьИнформациюОПлатежнойСистемеПоСоответствию(3, СоответствияПлатежныхСистем, ДополнительнаяИнформация);
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИнформацияОПолях"				, ИнформацияОПолях);
		ДополнительныеПараметры.Вставить("КлючЭлемента"					, КлючОплаты);
		ДополнительныеПараметры.Вставить("МенеджерВременныхТаблиц"		, МенеджерВременныхТаблиц);
		ДополнительныеПараметры.Вставить("ЭтоНовыйЭлемент"				, ЭтоНовыйЭлемент);
		ДополнительныеПараметры.Вставить("ИнформацияОбъекта1С"			, ИнформацияООплате);
		ДополнительныеПараметры.Вставить("ИдентификаторБ24"				, ИдентификаторБ24);
		ДополнительныеПараметры.Вставить("ИдентификаторЗаказаБ24"		, ИдентификаторЗаказаБ24);
		ДополнительныеПараметры.Вставить("ДополнительныеДанныеОплате"	, ДополнительныеДанныеОплате);
		ДополнительныеПараметры.Вставить("ИнформацияОПлатежнойСистеме"	, ИнформацияОПлатежнойСистеме);

		Поля = ПолучитьСтруктуруКлючейЭлементаВыгрузки(СтруктураНастроек, ДополнительныеПараметры);
		
		Если ЗначениеЗаполнено(АлгоритмПриВыгрузкеДанныхНаПортал) Тогда
			ВыполнитьАлгоритмПередВыгрузкой(СтруктураНастроек, ИнформацияООплате.Оплата, Поля, АлгоритмПриВыгрузкеДанныхНаПортал)
		КонецЕсли;

		Для каждого ТекПоле Из Поля Цикл
			Если ТекПоле.Значение <> Неопределено Тогда
				ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields[order][payments]["+Строка(НомерОплаты)+"]["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
			КонецЕсли;
		КонецЦикла;  
		
		НомерОплаты = НомерОплаты + 1;
		
	КонецЦикла;
	
	СтрокаЗапроса = "cmd["+КлючЗаказа+"]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("sale.payment.modify?"  + ТелоЗапроса);  
	
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючЗаказа, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.Оплата, ИнформацияОЗаказе.Заказ));
	
	Возврат СтрокаЗапроса;
	
КонецФункции

// Функция - Получить информацию о платежной системе по соответствию
//
// Параметры:
//  ТипДокумента				 - 	 1- нал, 2- безнал, 3 эквайринг 
//  СоответствияПлатежныхСистем	 - 	 таблица соответствий 
//  ДополнительнаяИнформация	 - 	 Переменные для поиска 
// 
// Возвращаемое значение:
//   Структура с наименованием и ид платежной системы 
//
Функция ПолучитьИнформациюОПлатежнойСистемеПоСоответствию(ТипДокумента, СоответствияПлатежныхСистем, ДополнительнаяИнформация)  
	
	РасчетныйСчет 		= Неопределено;
	Касса 				= Неопределено;
	Терминал 			= Неопределено;
	ВидПлатежнойКарты 	= Неопределено;
	
	ДополнительнаяИнформация.Свойство("РасчетныйСчет"	 , РасчетныйСчет);
	ДополнительнаяИнформация.Свойство("Касса"			 , Касса);
	ДополнительнаяИнформация.Свойство("Терминал"		 , Терминал);
	ДополнительнаяИнформация.Свойство("ВидПлатежнойКарты", ВидПлатежнойКарты);
	
	Результат = Неопределено;
	
	Если СоответствияПлатежныхСистем <> Неопределено Тогда
		
		Для каждого ТекПозицияСоответствия Из СоответствияПлатежныхСистем Цикл
			
			Если (ТипДокумента = 1 И ТекПозицияСоответствия.Касса = Касса)
				ИЛИ (ТипДокумента = 3 И ТекПозицияСоответствия.Терминал = Терминал И ТекПозицияСоответствия.ВидПлатежнойКарты = ВидПлатежнойКарты)
				ИЛИ (ТипДокумента = 2 И ТекПозицияСоответствия.РасчетныйСчет = РасчетныйСчет) Тогда
				
					Для каждого ТекПС Из ТекПозицияСоответствия.ПлатежнаяСистема Цикл 							
						Результат = Новый Структура;
						Результат.Вставить("Ид"				, ТекПС.Значение);
						Результат.Вставить("Наименование"	, ТекПС.Представление);
						Возврат Результат;
					КонецЦикла;
				
				КонецЕсли;	
				
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция СформироватьДанныеПоОтгрузкам(пСтруктураНастроек, МассивДанных, Пакет) Экспорт
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ЭлементСтруктуры Из пСтруктураНастроек Цикл
		СтруктураНастроек.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
#Область ФормированиеВременныхТаблицДанных
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДанных"			, МассивДанных);
	Запрос.УстановитьПараметр("АктуальнаяДатаСеанса"	, СтруктураНастроек.ДатаФормирования);
	Запрос.УстановитьПараметр("Портал"					, СтруктураНастроек.Портал);
	
	Запрос.УстановитьПараметр("ТипДанныхЗаказов"		, СтруктураНастроек.ТипыОбъектовОбмена.Заказ);
	Запрос.УстановитьПараметр("ТоварыЗаказа"			, СтруктураНастроек.ТипыОбъектовОбмена.ТоварыЗаказа);
	Запрос.УстановитьПараметр("ТоварыОтгрузки"			, СтруктураНастроек.ТипыОбъектовОбмена.ТоварыОтгрузки);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Документ.ЗаказКлиента) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ИдентификаторыЗаказов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхЗаказов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивДанных)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслуг.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ КАК Заказ,
	|	РеализацияТоваровУслуг.Ссылка КАК Отгрузка
	|ПОМЕСТИТЬ ВТ_ОтгрузкиПакет
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Заказы.Заказ = РеализацияТоваровУслуг.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Заказы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ОтгрузкиПакет.Отгрузка КАК Отгрузка,
	|	ВТ_ИдентификаторыЗаказов.Объект КАК Заказ,
	|	ВТ_ИдентификаторыЗаказов.Идентификатор КАК ИдентификаторЗаказаБитрикс24,
	|	ЗаказКлиента.СпособДоставки КАК СпособДоставки,
	|	ЗаказКлиента.ПеревозчикПартнер КАК ПеревозчикПартнер
	|ПОМЕСТИТЬ ВТ_ВыгружаемыеОтгрузки
	|ИЗ
	|	ВТ_ОтгрузкиПакет КАК ВТ_ОтгрузкиПакет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗаказов КАК ВТ_ИдентификаторыЗаказов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|			ПО ВТ_ИдентификаторыЗаказов.Объект = ЗаказКлиента.Ссылка
	|		ПО ВТ_ОтгрузкиПакет.Заказ = ВТ_ИдентификаторыЗаказов.Объект
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ОтгрузкиПакет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыгружаемыеОтгрузки.Заказ КАК Заказ,
	|	ВТ_ВыгружаемыеОтгрузки.ИдентификаторЗаказаБитрикс24 КАК ИдентификаторЗаказаБитрикс24,
	|	ВТ_ВыгружаемыеОтгрузки.СпособДоставки КАК СпособДоставки,
	|	ВТ_ВыгружаемыеОтгрузки.ПеревозчикПартнер КАК ПеревозчикПартнер
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	ВТ_ВыгружаемыеОтгрузки КАК ВТ_ВыгружаемыеОтгрузки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыгружаемыеОтгрузки.Заказ,
	|	ВТ_ВыгружаемыеОтгрузки.ИдентификаторЗаказаБитрикс24,
	|	ВТ_ВыгружаемыеОтгрузки.СпособДоставки,
	|	ВТ_ВыгружаемыеОтгрузки.ПеревозчикПартнер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Отгрузка,
	|	РеализацияТоваровУслуг.Ссылка КАК Объект,
	|	РеализацияТоваровУслуг.Ссылка КАК Идентификатор1С,
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК Заказ,
	|	ВТ_ВыгружаемыеОтгрузки.ИдентификаторЗаказаБитрикс24 КАК ИдентификаторЗаказаБитрикс24,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Проведен КАК Проведен,
	|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
	|	РеализацияТоваровУслуг.Подразделение КАК СтруктурнаяЕдиница,
	|	РеализацияТоваровУслуг.Комментарий КАК Комментарий,
	|	РеализацияТоваровУслуг.ЦенаВключаетНДС КАК СуммаВключаетНДС,
	|	РеализацияТоваровУслуг.НалогообложениеНДС КАК НалогообложениеНДС,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваровУслуг.Менеджер КАК Ответственный,
	|	РеализацияТоваровУслуг.ПометкаУдаления КАК ПометкаУдаления,
	|	РеализацияТоваровУслуг.ВерсияДанных КАК ВерсияДанных,
	|	Валюты.Ссылка КАК ВалютаДокумента,
	|	Валюты.Код КАК ВалютаКод
	|ПОМЕСТИТЬ ВТ_ИнформацияВыгружаемыхОтгрузках
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВыгружаемыеОтгрузки КАК ВТ_ВыгружаемыеОтгрузки
	|		ПО РеализацияТоваровУслуг.Ссылка = ВТ_ВыгружаемыеОтгрузки.Отгрузка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО РеализацияТоваровУслуг.Валюта = Валюты.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект КАК Объект,
	|	ДополнительныеСведения.Свойство КАК Свойство,
	|	ДополнительныеСведения.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ТаблицаСвойствЗаказов
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВыгружаемыеОтгрузки КАК ВТ_ВыгружаемыеОтгрузки
	|		ПО ДополнительныеСведения.Объект = ВТ_ВыгружаемыеОтгрузки.Заказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаДополнительныеРеквизиты.Ссылка,
	|	ЗаказКлиентаДополнительныеРеквизиты.Свойство,
	|	ЗаказКлиентаДополнительныеРеквизиты.Значение
	|ИЗ
	|	ВТ_ВыгружаемыеОтгрузки КАК ВТ_ВыгружаемыеОтгрузки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ДополнительныеРеквизиты КАК ЗаказКлиентаДополнительныеРеквизиты
	|		ПО ВТ_ВыгружаемыеОтгрузки.Заказ = ЗаказКлиентаДополнительныеРеквизиты.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Свойство,
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект КАК Объект,
	|	ДополнительныеСведения.Свойство КАК Свойство,
	|	ДополнительныеСведения.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ТаблицаСвойствОтгрузок
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВыгружаемыеОтгрузки КАК ВТ_ВыгружаемыеОтгрузки
	|		ПО ДополнительныеСведения.Объект = ВТ_ВыгружаемыеОтгрузки.Отгрузка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугДополнительныеРеквизиты.Ссылка,
	|	РеализацияТоваровУслугДополнительныеРеквизиты.Свойство,
	|	РеализацияТоваровУслугДополнительныеРеквизиты.Значение
	|ИЗ
	|	ВТ_ВыгружаемыеОтгрузки КАК ВТ_ВыгружаемыеОтгрузки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ДополнительныеРеквизиты КАК РеализацияТоваровУслугДополнительныеРеквизиты
	|		ПО ВТ_ВыгружаемыеОтгрузки.Отгрузка = РеализацияТоваровУслугДополнительныеРеквизиты.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Свойство,
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Документ.ЗаказКлиента) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК ИдКорзины,
	|	Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект КАК КлючСвязи
	|ПОМЕСТИТЬ ВТ_ИдентификаторыПозицийЗаказов
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТоварыЗаказа
	|	И Б24_К_ИдентификаторыОбъектов.Объект В
	|			(ВЫБРАТЬ
	|				ВТ_ВыгружаемыеОтгрузки.Заказ
	|			ИЗ
	|				ВТ_ВыгружаемыеОтгрузки)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Документ.РеализацияТоваровУслуг) КАК Объект,
	|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК ИдентификаторПозиции,
	|	Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект КАК КлючСвязи
	|ПОМЕСТИТЬ ВТ_ИдентификаторыПозицийОтгрузок
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
	|ГДЕ
	|	Б24_К_ИдентификаторыОбъектов.Портал = &Портал
	|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТоварыОтгрузки
	|	И Б24_К_ИдентификаторыОбъектов.Объект В(&МассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Отгрузка,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|	РеализацияТоваровУслугТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	|	РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	|	РеализацияТоваровУслугТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	РеализацияТоваровУслугТовары.КлючСвязи КАК КлючСвязи,
	|	ВТ_ИдентификаторыПозицийОтгрузок.ИдентификаторПозиции КАК ИдПозицииОтгрузки
	|ПОМЕСТИТЬ ВТ_ТоварыОтгрузок
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РеализацияТоваровУслугТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыПозицийОтгрузок КАК ВТ_ИдентификаторыПозицийОтгрузок
	|		ПО РеализацияТоваровУслугТовары.Ссылка = ВТ_ИдентификаторыПозицийОтгрузок.Объект
	|			И РеализацияТоваровУслугТовары.КлючСвязи = ВТ_ИдентификаторыПозицийОтгрузок.КлючСвязи
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ВыгружаемыеОтгрузки.Отгрузка
	|			ИЗ
	|				ВТ_ВыгружаемыеОтгрузки)
	|	И РеализацияТоваровУслугТовары.Количество > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Отгрузка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыПозицийОтгрузок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ КАК Заказ,
	|	ЗаказКлиентаТовары.КлючСвязи КАК КлючСвязи,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.Количество КАК Количество,
	|	ЗаказКлиентаТовары.Цена КАК Цена,
	|	ЗаказКлиентаТовары.Сумма КАК Сумма,
	|	ЗаказКлиентаТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
	|	ЗаказКлиентаТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки
	|ПОМЕСТИТЬ ВТ_ТоварыЗаказов
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО ЗаказКлиентаТовары.Ссылка = ВТ_Заказы.Заказ
	|ГДЕ
	|	ЗаказКлиентаТовары.Количество > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИдентификаторыПозицийЗаказов.ИдКорзины КАК ИдКорзины,
	|	ВТ_ИдентификаторыПозицийЗаказов.КлючСвязи КАК КлючСвязи,
	|	ВТ_ТоварыЗаказов.Заказ КАК Заказ,
	|	ВТ_ТоварыЗаказов.Номенклатура КАК Номенклатура,
	|	ВТ_ТоварыЗаказов.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ПозицииЗаказа
	|ИЗ
	|	ВТ_ИдентификаторыПозицийЗаказов КАК ВТ_ИдентификаторыПозицийЗаказов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТоварыЗаказов КАК ВТ_ТоварыЗаказов
	|		ПО ВТ_ИдентификаторыПозицийЗаказов.Объект = ВТ_ТоварыЗаказов.Заказ
	|			И ВТ_ИдентификаторыПозицийЗаказов.КлючСвязи = ВТ_ТоварыЗаказов.КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИдентификаторыПозицийЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Б24_КС_ИнформацияОЗаказах.ДополнительныеДанные КАК ДополнительныеДанныеОЗаказе,
	|	ВТ_Заказы.Заказ КАК Заказ,
	|	ВТ_Заказы.ИдентификаторЗаказаБитрикс24 КАК ИдентификаторЗаказаБитрикс24,
	|	ВТ_Заказы.СпособДоставки КАК СпособДоставки,
	|	ВТ_Заказы.ПеревозчикПартнер КАК СлужбаДоставки
	|ИЗ
	|	РегистрСведений.Б24_КС_ИнформацияОЗаказах КАК Б24_КС_ИнформацияОЗаказах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО Б24_КС_ИнформацияОЗаказах.Заказ = ВТ_Заказы.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВыгружаемыеОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Заказы";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
#КонецОбласти	
	
	мЭлементы 	=  Новый массив;
	
	Пока Выборка.Следующий() Цикл
		
		СформированныйЗапрос = СформироватьСтруктуруДанныхПоОтгрузке(СтруктураНастроек, Пакет, Выборка, МенеджерВременныхТаблиц);
		
		Если ЗначениеЗаполнено(СформированныйЗапрос) Тогда
			мЭлементы.Добавить(СформированныйЗапрос);
		КонецЕсли;
	КонецЦикла;
	
	пСтруктураНастроек.КлючиПодчиненныхБатчЗапросов = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов; 	
	пСтруктураНастроек.Логирование.НомерСообщения 	= СтруктураНастроек.Логирование.НомерСообщения; 	
	
	Возврат мЭлементы;	
	
КонецФункции

Функция СформироватьСтруктуруДанныхПоОтгрузке(СтруктураНастроек, Пакет, ИнформацияОЗаказе, МенеджерВременныхТаблиц)
	
	ВыгружатьОтгрузки 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Отгрузка", "РеализацияТоваровУслуг", "ВыгружатьНаПортал");
	ОбновлятьНаПортале 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Отгрузка", "РеализацияТоваровУслуг", "ОбновлятьНаПортале");	
	ИнформацияОПолях 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностей(СтруктураНастроек.НастройкаПодключения, "Отгрузка", "РеализацияТоваровУслуг");
	ИнформацияОПоляхТЧ 					= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВыгружаемыеПоляСущностейТЧ(СтруктураНастроек.НастройкаПодключения, "Отгрузка", "РеализацияТоваровУслуг");
	АлгоритмПриВыгрузкеДанныхНаПортал 	= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиСущностей(СтруктураНастроек.НастройкаПодключения, "Отгрузка", "РеализацияТоваровУслуг", "АлгоритмПриВыгрузкеДанныхНаПортал");
	
	
	ДополнительныеДанныеОЗаказе 	= ИнформацияОЗаказе.ДополнительныеДанныеОЗаказе.Получить();
	
	ПрефиксВнешнихКодовБитрикс24 	= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьПрефиксВнешнихКодовБитрикс24();
	ПрефиксВнешнихКодов1С 			= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьОписаниеПрефиксовВнешнихКодов1С();
	
	ИдентификаторЗаказаБ24 	= Прав(ИнформацияОЗаказе.ИдентификаторЗаказаБитрикс24, СтрДлина(ИнформацияОЗаказе.ИдентификаторЗаказаБитрикс24)-СтрДлина(ПрефиксВнешнихКодовБитрикс24.Заказы));
	ТелоЗапроса = "fields[order][id]=" + ИдентификаторЗаказаБ24;
	
	КлючЗаказа 	= XMLСтрока(ИнформацияОЗаказе.Заказ);
	
	Если СтруктураНастроек.НастройкиСинхронизацииЗаказов.Свойство("ИнформацияОДоставках") Тогда
		ИнформацияОДоставках	= СтруктураНастроек.НастройкиСинхронизацииЗаказов.ИнформацияОДоставках;
	Иначе
		ИнформацияОДоставках	= Неопределено;
	КонецЕсли;
	
	Если СтруктураНастроек.НастройкиСинхронизацииЗаказов.Свойство("ИнформацияОСтатусах") Тогда
		ИнформацияОСтатусах 	= СтруктураНастроек.НастройкиСинхронизацииЗаказов.ИнформацияОСтатусах;
	Иначе
		ИнформацияОСтатусах 	= Неопределено;
	КонецЕсли;
	
	ТоварыЗаказа = Неопределено;
#Область ТоварыЗаказа	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Заказ", ИнформацияОЗаказе.Заказ);
	Запрос.Текст = " ВЫБРАТЬ *
	|ИЗ
	|	ВТ_ТоварыЗаказов КАК ВТ_ТоварыЗаказов
	|ГДЕ
	|	ВТ_ТоварыЗаказов.Заказ = &Заказ";
	
	ТоварыЗаказа = Запрос.Выполнить().Выгрузить();
#КонецОбласти	
	
	ИдСлужбыДоставкиЗаказа 				= Неопределено;  	
	НаименованиеСлужбыДоставкиЗаказа 	= Неопределено;  	
#Область СлужбаДоставкиИзЗаказа	

	Если ИнформацияОДоставках <> Неопределено Тогда
		Если ИнформацияОДоставках.ИсточникСлужбДоставкиЗаказов = "СпособыДоставкиЗаказов" Тогда
			НайденныеСтроки = ИнформацияОДоставках.СоответствияСпособовДоставкиЗаказа.НайтиСтроки(Новый Структура("СпособДоставки, СлужбаДоставки", ИнформацияОЗаказе.СпособДоставки, ИнформацияОЗаказе.СлужбаДоставки));
		ИначеЕсли ИнформацияОДоставках.ИсточникСлужбДоставкиЗаказов = "СвойствоЗаказов" Тогда 
			Доставка = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойствЗаказов", ИнформацияОЗаказе.Заказ, ИнформацияОДоставках.СвойствоЗаказа);
			НайденныеСтроки = ИнформацияОДоставках.СоответствияСЗначениямиСвойствЗаказа.НайтиСтроки(Новый Структура("Служба", Доставка));
		КонецЕсли;
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденнаяСтрока = НайденныеСтроки[0];	
		Иначе
			НайденнаяСтрока = Неопределено;	
		КонецЕсли;
		
		Если НайденнаяСтрока <> Неопределено Тогда
			ИдСлужбыДоставкиЗаказа 				= НайденнаяСтрока.ИдСлужбы;  	
			НаименованиеСлужбыДоставкиЗаказа 	= НайденнаяСтрока.НазваниеСлужбы;  	
		КонецЕсли;
		
	КонецЕсли;			
#КонецОбласти	

	БазоваяСуммаДоставкиЗаказа 	= 0; 
	СуммаДоставкиЗаказа 		= 0; 
	СкидкаДоставкиЗаказа 		= 0; 
#Область СтоимостьДоставкиИзЗаказа	
	Для каждого ТоварЗаказа Из ТоварыЗаказа Цикл
		
		Если ТоварЗаказа.Номенклатура = СтруктураНастроек.НастройкиСинхронизацииЗаказов.НоменклатураДоставка Тогда
			БазоваяСуммаДоставкиЗаказа 	= ТоварЗаказа.Цена*ТоварЗаказа.Количество;	
			СуммаДоставкиЗаказа			= ТоварЗаказа.Сумма;	
			СкидкаДоставкиЗаказа		= ТоварЗаказа.СуммаАвтоматическойСкидки+ТоварЗаказа.СуммаРучнойСкидки;
		КонецЕсли;
		
	КонецЦикла;
#КонецОбласти	

	ТрекНомерЗаказа = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойствЗаказов", ИнформацияОЗаказе.Заказ, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоТрекНомераЗаказаБитрикс24);	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Заказ", ИнформацияОЗаказе.Заказ);
	Запрос.Текст = " ВЫБРАТЬ *
	|ИЗ
	|	ВТ_ИнформацияВыгружаемыхОтгрузках КАК ВТ_ИнформацияВыгружаемыхОтгрузках
	|ГДЕ
	|	ВТ_ИнформацияВыгружаемыхОтгрузках.Заказ = &Заказ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	ВыборкаОтгрузок = ВыполненныйЗапрос.Выбрать();
	
	НомерОтгрузки = 1;
	Пока ВыборкаОтгрузок.Следующий() Цикл
		
		ИнформацияОтгрузки 		= ВыборкаОтгрузок;          
		ИдентификаторБ24 		= ИдБ24ПоСсылке(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.Отгрузка, ИнформацияОтгрузки.Отгрузка);	
		КлючОтгрузки 			= XMLСтрока(ИнформацияОтгрузки.Идентификатор1С);	
		
		ЭтоНовыйЭлемент = НЕ ЗначениеЗаполнено(ИдентификаторБ24);
		
		Если НЕ ВыгружатьОтгрузки ИЛИ (НЕ ЭтоНовыйЭлемент И НЕ ОбновлятьНаПортале) Тогда
			СтруктураНастроек.НеобновляемыеДанныеНаПортале.Добавить(ИнформацияОтгрузки.Отгрузка);
			Продолжить;
		КонецЕсли;
	
		ДополнительныеДанныеОтгрузке = Неопределено;
#Область ОтгрузкаИзСайта
		Если ЗначениеЗаполнено(ИдентификаторБ24) Тогда
			Если ТипЗнч(ДополнительныеДанныеОЗаказе.Получить("shipments")) = Тип("Массив") Тогда
				Для каждого ТекОтгрузкаИстория Из ДополнительныеДанныеОЗаказе.Получить("shipments") Цикл
					
					Если Формат(ТекОтгрузкаИстория.Получить("id"),"ЧГ=0") = ИдентификаторБ24 Тогда
						ДополнительныеДанныеОтгрузке = ТекОтгрузкаИстория;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если ДополнительныеДанныеОтгрузке = Неопределено Тогда
			ОтгрузкиИстория = ДополнительныеДанныеОЗаказе.Получить("shipments");
			Если ТипЗнч(ОтгрузкиИстория) = Тип("Массив") Тогда
				Если ОтгрузкиИстория.Количество() = 1 Тогда
					ДополнительныеДанныеОтгрузке = ОтгрузкиИстория[0];	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
#КонецОбласти		

	ТоварыОтгрузки = Неопределено;
#Область ТоварыОтгрузки	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Отгрузка", ВыборкаОтгрузок.Объект);
	Запрос.Текст = " ВЫБРАТЬ *
	|ИЗ
	|	ВТ_ТоварыОтгрузок КАК ВТ_ТоварыОтгрузок
	|ГДЕ
	|	ВТ_ТоварыОтгрузок.Отгрузка = &Отгрузка";
	
	ТоварыОтгрузки = Запрос.Выполнить().Выгрузить();
#КонецОбласти	

		БазоваяСуммаДоставки= 0; 
		СуммаДоставки 		= 0; 
		СкидкаДоставки 		= 0; 
#Область СтоимостьДоставкиИзЗаказа	
		Для каждого ТоварОтгрузки Из ТоварыОтгрузки Цикл
			Если ТоварОтгрузки.Номенклатура = СтруктураНастроек.НастройкиСинхронизацииЗаказов.НоменклатураДоставка Тогда
				БазоваяСуммаДоставки= ТоварОтгрузки.Цена*ТоварЗаказа.Количество;	
				СуммаДоставки		= ТоварОтгрузки.Сумма;	
				СкидкаДоставки		= ТоварОтгрузки.СуммаАвтоматическойСкидки+ТоварЗаказа.СуммаРучнойСкидки;
			КонецЕсли;
		КонецЦикла;
		
		Если СуммаДоставки = 0 Тогда
			БазоваяСуммаДоставки	= БазоваяСуммаДоставкиЗаказа; 
			СуммаДоставки 			= СуммаДоставкиЗаказа; 
			СкидкаДоставки 			= СкидкаДоставкиЗаказа; 
		КонецЕсли;
		
		БазоваяСуммаДоставкиЗаказа 	= БазоваяСуммаДоставкиЗаказа - БазоваяСуммаДоставки;
		СуммаДоставкиЗаказа 		= СуммаДоставкиЗаказа - СуммаДоставки;
		СкидкаДоставкиЗаказа 		= СкидкаДоставкиЗаказа - СкидкаДоставки;
		
		
#КонецОбласти	

		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИнформацияОПолях"				, ИнформацияОПолях);
		ДополнительныеПараметры.Вставить("КлючЭлемента"					, КлючОтгрузки);
		ДополнительныеПараметры.Вставить("МенеджерВременныхТаблиц"		, МенеджерВременныхТаблиц);
		ДополнительныеПараметры.Вставить("ЭтоНовыйЭлемент"				, ЭтоНовыйЭлемент);
		ДополнительныеПараметры.Вставить("ИнформацияОбъекта1С"			, ИнформацияОтгрузки);
		ДополнительныеПараметры.Вставить("ИдентификаторБ24"				, ИдентификаторБ24);
		ДополнительныеПараметры.Вставить("ИдентификаторЗаказаБ24"		, ИдентификаторЗаказаБ24);
		ДополнительныеПараметры.Вставить("ДополнительныеДанныеОЗаказе"	, ДополнительныеДанныеОЗаказе);
		ДополнительныеПараметры.Вставить("ДополнительныеДанныеОтгрузке"	, ДополнительныеДанныеОтгрузке);
		
		ДополнительныеПараметры.Вставить("ИнформацияОДоставках"				, ИнформацияОДоставках);
		ДополнительныеПараметры.Вставить("ИдСлужбыДоставкиЗаказа"			, ИдСлужбыДоставкиЗаказа);
		ДополнительныеПараметры.Вставить("НаименованиеСлужбыДоставкиЗаказа"	, НаименованиеСлужбыДоставкиЗаказа);
		ДополнительныеПараметры.Вставить("ТрекНомерЗаказа"					, ТрекНомерЗаказа);
		
		ДополнительныеПараметры.Вставить("БазоваяСуммаДоставки"			, БазоваяСуммаДоставки);
		ДополнительныеПараметры.Вставить("СуммаДоставки"				, СуммаДоставки);
		ДополнительныеПараметры.Вставить("СкидкаДоставки"				, СкидкаДоставки);
		
		ДополнительныеПараметры.Вставить("ИнформацияОСтатусах"			, ИнформацияОСтатусах);
		ДополнительныеПараметры.Вставить("ТоварыОтгрузки"				, ТоварыОтгрузки);

		Поля = ПолучитьСтруктуруКлючейЭлементаВыгрузки(СтруктураНастроек, ДополнительныеПараметры);
		
		Если ЗначениеЗаполнено(АлгоритмПриВыгрузкеДанныхНаПортал) Тогда
			ВыполнитьАлгоритмПередВыгрузкой(СтруктураНастроек, ИнформацияОтгрузки.Отгрузка, Поля, АлгоритмПриВыгрузкеДанныхНаПортал)
		КонецЕсли;

		Для каждого ТекПоле Из Поля Цикл
			Если ТекПоле.Значение <> Неопределено Тогда
				ТелоЗапроса = ТелоЗапроса + ?(СтрДлина(ТелоЗапроса) >0, "&", "") +"fields[order][shipments]["+Формат(НомерОтгрузки, "ЧГ=0")+"]["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
			КонецЕсли;		
		КонецЦикла;  
		
#Область ЗаполнениеТабличнойЧасти

		НомерПозицииОтгрузки = 1;
		Для каждого ТоварОтгрузки Из ТоварыОтгрузки Цикл
			
			Если ТоварОтгрузки.Номенклатура = СтруктураНастроек.НастройкиСинхронизацииЗаказов.НоменклатураДоставка Тогда
				Продолжить;
			КонецЕсли;
			
			ИдентификаторКорзиныЗаказа = "";
#Область ЗаполнениеТабличнойЧасти
			ЗапросПоПозицииЗаказа = Новый Запрос;
			ЗапросПоПозицииЗаказа.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			ЗапросПоПозицииЗаказа.УстановитьПараметр("Заказ"			, ИнформацияОЗаказе.Заказ);	
			ЗапросПоПозицииЗаказа.УстановитьПараметр("Номенклатура"		, ТоварОтгрузки.Номенклатура);	
			ЗапросПоПозицииЗаказа.УстановитьПараметр("Характеристика"	, ТоварОтгрузки.Характеристика);	
			ЗапросПоПозицииЗаказа.Текст = "ВЫБРАТЬ * ИЗ ВТ_ПозицииЗаказа ГДЕ ВТ_ПозицииЗаказа.Заказ = &Заказ И ВТ_ПозицииЗаказа.Номенклатура = &Номенклатура И ВТ_ПозицииЗаказа.Характеристика = &Характеристика";
			
			ВыполненныйЗапросПоПозициямЗаказа = ЗапросПоПозицииЗаказа.Выполнить();
			
			Если НЕ ВыполненныйЗапросПоПозициямЗаказа.Пустой() Тогда
				
				ВыборкаПоПозициямЗаказа = ВыполненныйЗапросПоПозициямЗаказа.Выбрать();

				Пока ВыборкаПоПозициямЗаказа.Следующий() Цикл
					ИдентификаторКорзиныЗаказа = ВыборкаПоПозициямЗаказа.ИдКорзины;
				КонецЦикла;
				
			КонецЕсли;
#КонецОбласти	

			Если ЗначениеЗаполнено(ИдентификаторКорзиныЗаказа) Тогда

				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ИнформацияОПолях"				, ИнформацияОПоляхТЧ);
				ДополнительныеПараметры.Вставить("КлючЭлемента"					, КлючОтгрузки);
				ДополнительныеПараметры.Вставить("МенеджерВременныхТаблиц"		, МенеджерВременныхТаблиц);
				ДополнительныеПараметры.Вставить("ЭтоНовыйЭлемент"				, ЭтоНовыйЭлемент);
				ДополнительныеПараметры.Вставить("ИнформацияОбъекта1С"			, ИнформацияОтгрузки);
				ДополнительныеПараметры.Вставить("Товары"						, ТоварыОтгрузки);
				ДополнительныеПараметры.Вставить("ИнформацияСтрокиТЧ"			, ТоварОтгрузки);
				ДополнительныеПараметры.Вставить("КлючСвязи"					, ТоварОтгрузки.КлючСвязи);
				ДополнительныеПараметры.Вставить("ИдентификаторКорзиныЗаказа"	, ИдентификаторКорзиныЗаказа);
				ДополнительныеПараметры.Вставить("ИмяТЧ"						, "Товары");

				ПоляТЧ = ПолучитьСтруктуруКлючейТЧЭлементаВыгрузки(СтруктураНастроек, ДополнительныеПараметры);
				
				НомерПозицииОтгрузкиСтрокой = Формат(НомерПозицииОтгрузки, "ЧГ=0");
				
				Для каждого ТекПоле Из ПоляТЧ Цикл
					Если ТекПоле.Значение <> Неопределено Тогда
						ТелоЗапроса = ТелоЗапроса + "&fields[order][shipments]["+Строка(НомерОтгрузки)+"][shipmentItems]["+НомерПозицииОтгрузкиСтрокой+"]["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
					КонецЕсли;		
				КонецЦикла;  
				
				НомерПозицииОтгрузки = НомерПозицииОтгрузки + 1;
				
			КонецЕсли;	
			
		КонецЦикла;
#КонецОбласти	

	  	НомерОтгрузки = НомерОтгрузки + 1;

	КонецЦикла;
	
	СтрокаЗапроса = "cmd["+КлючЗаказа+"]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("sale.shipment.modify?"  + ТелоЗапроса);  
	
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Вставить(КлючЗаказа, ПолучитьСтруктуруКлючейБатчЗапросов(СтруктураНастроек.ТипыОбъектовОбмена.Отгрузка, ИнформацияОЗаказе.Заказ));
	
	Возврат СтрокаЗапроса;
	
КонецФункции

#КонецОбласти


#Область ВыгрузкаПечатныхФорм

Функция ВыгрузкаПечатнойФормыВБитрикс24(НастройкаПодключения, ТипДанныхБ24, ИдБитрикс24СПрефиксами, НазваниеПечатнойФормы, ПечатнаяФорма) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Ложь;	
	
	СтруктураНастроек = Б24_КС_ОбщегоНазначенияВызовСервера.СформироватьСтруктуруНастроек(НастройкаПодключения, Ложь, 7);
	Если СтруктураНастроек = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	СтруктураНастроек.Логирование.Измерение2 = "Выгрузка данных на Битрикс24";
	СтруктураНастроек.Логирование.Измерение3 = "Выгрузка файла печатной формы";
	
	ИнформацияФайле = ПолучитьДвоичноеСодержимоеПечатнойФормы(СтруктураНастроек, ПечатнаяФорма, ТипФайлаТабличногоДокумента.DOCX);	
	
	Если ИнформацияФайле.ДвоичноеСодержимоеОтчета = Неопределено Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.КритическаяОшибка, "Не удалось получить двоичные данные печатной формы в формате DOCX. Возможно нет прав на запись печатной формы во временные файлы");
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.КритическаяОшибка, ИнформацияФайле.ОписаниеОшибки);
		
		Возврат Результат;	// этот файл обязателен.
		
	КонецЕсли;
	
	// ДанныеDOCX = Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИнформацияФайле.ДвоичноеСодержимоеОтчета);
	
	ИнформацияФайле = ПолучитьДвоичноеСодержимоеПечатнойФормы(СтруктураНастроек, ПечатнаяФорма, ТипФайлаТабличногоДокумента.PDF);	
	
	Если ИнформацияФайле.ДвоичноеСодержимоеОтчета = Неопределено Тогда
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Ошибка, "Не удалось получить двоичные данные печатной формы в формате PDF. Возможно нет прав на запись печатной формы во временные файлы");
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Ошибка, ИнформацияФайле.ОписаниеОшибки);
		
	КонецЕсли;
	
	ДанныеPDF = Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИнформацияФайле.ДвоичноеСодержимоеОтчета);
	
	ПрефиксВнешнихКодовБитрикс24 = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьПрефиксВнешнихКодовБитрикс24();
	
	ИзмененПрефикс = Ложь;
	Для Каждого ТекПрефикс Из ПрефиксВнешнихКодовБитрикс24 Цикл
			
		Если Лев(ИдБитрикс24СПрефиксами, СтрДлина(ТекПрефикс.Значение))= ТекПрефикс.Значение Тогда
			ИдБитрикс24 = Прав(ИдБитрикс24СПрефиксами, СтрДлина(ИдБитрикс24СПрефиксами) - СтрДлина(ТекПрефикс.Значение)); 	
			ИзмененПрефикс = Истина;
		КонецЕсли;
			
	КонецЦикла;
	
	Если НЕ ИзмененПрефикс Тогда
		ИдБитрикс24 = ИдБитрикс24СПрефиксами;	
	КонецЕсли;
	
	НазваниеСообщения 	= Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(НазваниеПечатнойФормы);
	ТипыДанныхДляОбменаСПорталом = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();	
	
	ТипВладельца = "0";
	
	Если ТипДанныхБ24 = ТипыДанныхДляОбменаСПорталом.Проект Тогда
		ТипВладельца = "2";	
	ИначеЕсли ТипДанныхБ24 = ТипыДанныхДляОбменаСПорталом.Заказ Тогда
		ТипВладельца = "14";	
	ИначеЕсли ТипДанныхБ24 = ТипыДанныхДляОбменаСПорталом.Счет Тогда
		ТипВладельца = "5";	
	ИначеЕсли ТипДанныхБ24 = ТипыДанныхДляОбменаСПорталом.Компания Тогда
		ТипВладельца = "4";	
	ИначеЕсли ТипДанныхБ24 = ТипыДанныхДляОбменаСПорталом.Контакт Тогда
		ТипВладельца = "3";	
	КонецЕсли;
	
	ТелоHTTPЗапроса ="&fields[title]="+НазваниеСообщения+"&fields[number]=2&fields[entityTypeId]="+ТипВладельца+"&fields[entityId]="+Формат(ИдБитрикс24, "ЧГ=0") + "&fields[region]=" + Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЛокализациюБитрикс24();
	
	Если ДанныеPDF <> Неопределено Тогда
		ТелоHTTPЗапроса = ТелоHTTPЗапроса +"&fields[pdfContent]="+ДанныеPDF;  
	КонецЕсли;
	ТелоHTTPЗапроса = ТелоHTTPЗапроса +"&fields[fileContent]="+ДанныеPDF; // чтобы быстро формировалось и не корежилось в Б24 
	
	ДанныеСПортала = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПортал(СтруктураНастроек, "/rest/crm.documentgenerator.document.upload", ТелоHTTPЗапроса); 
	
	Если НЕ ЗначениеЗаполнено(ДанныеСПортала) Тогда
		СтруктураНастроек.ВыполненоБезОшибок = Ложь;
	ИначеЕсли ДанныеСПортала = Истина Тогда		
		Результат = Истина;	
	Иначе	
	
		Если ДанныеСПортала.Получить("result") <> Неопределено Тогда
			Если ДанныеСПортала.Получить("result").Получить("document")  <> Неопределено Тогда
				Если ДанныеСПортала.Получить("result").Получить("document").Получить("id") <> Неопределено Тогда
					Результат = Истина;	
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДвоичноеСодержимоеПечатнойФормы(СтруктураНастроек, ПечатнаяФорма, ФорматПечатнойФормы)
	
	Если ФорматПечатнойФормы = ТипФайлаТабличногоДокумента.DOCX Тогда
		РасширениеФайла = ".docx";	
	ИначеЕсли ФорматПечатнойФормы = ТипФайлаТабличногоДокумента.PDF Тогда
		РасширениеФайла = ".pdf";
	ИначеЕсли ФорматПечатнойФормы = ТипФайлаТабличногоДокумента.XLSX Тогда
		РасширениеФайла = ".xlsx";	
	ИначеЕсли ФорматПечатнойФормы = ТипФайлаТабличногоДокумента.XLS Тогда
		РасширениеФайла = ".xls";	
	ИначеЕсли ФорматПечатнойФормы = ТипФайлаТабличногоДокумента.ODS Тогда
		РасширениеФайла = ".ods";	
	Иначе
		РасширениеФайла = ".txt";	
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ДвоичноеСодержимоеОтчета"	, Неопределено);	
	Результат.Вставить("ОписаниеОшибки"				, "");	
	
	ИмяФайлаПечатнойФормы = ПолучитьИмяВременногоФайла(РасширениеФайла);  
	
	Попытка
		ПечатнаяФорма.Записать(ИмяФайлаПечатнойФормы, ФорматПечатнойФормы);
	Исключение
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Результат;	
	КонецПопытки;
	
	Результат.ДвоичноеСодержимоеОтчета = Base64Строка(Новый ДвоичныеДанные(ИмяФайлаПечатнойФормы));
	
	Попытка
		УдалитьФайлы(ИмяФайлаПечатнойФормы);
	Исключение
		Возврат Результат;	
	КонецПопытки;
	
	Возврат Результат;	
	
КонецФункции

#КонецОбласти


#Область Прочее


Процедура ДобавитьКЗапросуОбъектовДанныеФайлов(СтруктураНастроек, Запрос)
	
	ТекстЗапроса = Запрос.Текст; 
	
	ТипыСправочников = Новый Массив;
	
	Если СтруктураНастроек.Операция = СтруктураНастроек.ТипыОперацийСинхронизации.Компании Тогда
		
		НастройкиСинхронизацииКлиентов = СтруктураНастроек.НастройкиСинхронизацииКлиентов;
		Если НастройкиСинхронизацииКлиентов.Свойство("ВыгружатьФайлыКлиентов") И НастройкиСинхронизацииКлиентов.ВыгружатьФайлыКлиентов 
			И НастройкиСинхронизацииКлиентов.Свойство("СвойствоФайловБ24Компаний") И ЗначениеЗаполнено(НастройкиСинхронизацииКлиентов.СвойствоФайловБ24Компаний) Тогда		
			ТипыСправочников.Добавить(Тип("СправочникСсылка.ПартнерыПрисоединенныеФайлы"));
		КонецЕсли;
		
	ИначеЕсли СтруктураНастроек.Операция = СтруктураНастроек.ТипыОперацийСинхронизации.Контакты Тогда
			
		НастройкиСинхронизацииКлиентов = СтруктураНастроек.НастройкиСинхронизацииКлиентов;
		Если НастройкиСинхронизацииКлиентов.Свойство("ВыгружатьФайлыКлиентов") И НастройкиСинхронизацииКлиентов.ВыгружатьФайлыКлиентов 
			И НастройкиСинхронизацииКлиентов.Свойство("СвойствоФайловБ24Контактов") И ЗначениеЗаполнено(НастройкиСинхронизацииКлиентов.СвойствоФайловБ24Контактов) Тогда		
			ТипыСправочников.Добавить(Тип("СправочникСсылка.ПартнерыПрисоединенныеФайлы"));
		КонецЕсли;
		
	ИначеЕсли СтруктураНастроек.Операция = СтруктураНастроек.ТипыОперацийСинхронизации.Счета Тогда
			
	ИначеЕсли СтруктураНастроек.Операция = СтруктураНастроек.ТипыОперацийСинхронизации.Проекты Тогда
			
		НастройкиСинхронизацииСделок = СтруктураНастроек.НастройкиСинхронизацииСделок;
		Если НастройкиСинхронизацииСделок.Свойство("ВыгружатьФайлыСделок") И НастройкиСинхронизацииСделок.ВыгружатьФайлыСделок 
			И НастройкиСинхронизацииСделок.Свойство("СвойствоФайловБ24Сделок") И ЗначениеЗаполнено(НастройкиСинхронизацииСделок.СвойствоФайловБ24Сделок) Тогда		
			ТипыСправочников.Добавить(Тип("СправочникСсылка.ЗаказКлиентаПрисоединенныеФайлы"));
		КонецЕсли; 
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
	|	Б24_КС_ТаблицаИзменений.Объект КАК Объект
	|ПОМЕСТИТЬ ВТ_ФайлыСсылка
	|ИЗ
	|	РегистрСведений.Б24_КС_ТаблицаИзменений КАК Б24_КС_ТаблицаИзменений
	|ГДЕ
	|	Б24_КС_ТаблицаИзменений.НастройкаПодключения = &НастройкаПодключения
	|	И Б24_КС_ТаблицаИзменений.ТипДанных = &ТипДанныхФ
	|	И ТИПЗНАЧЕНИЯ(Б24_КС_ТаблицаИзменений.Объект) В (&ТипыСправочников)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартнерыПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
	|ПОМЕСТИТЬ ВТ_ВладельцыФайлов
	|ИЗ
	|	ВТ_ФайлыСсылка КАК ВТ_ФайлыСсылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартнерыПрисоединенныеФайлы КАК ПартнерыПрисоединенныеФайлы
	|		ПО ВТ_ФайлыСсылка.Объект = ПартнерыПрисоединенныеФайлы.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаПрисоединенныеФайлы.ВладелецФайла
	|ИЗ
	|	ВТ_ФайлыСсылка КАК ВТ_ФайлыСсылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗаказКлиентаПрисоединенныеФайлы КАК ЗаказКлиентаПрисоединенныеФайлы
	|		ПО ВТ_ФайлыСсылка.Объект = ЗаказКлиентаПрисоединенныеФайлы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ФайлыСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартнерыПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла,
	|	ПартнерыПрисоединенныеФайлы.Ссылка КАК Файл,
	|	ПартнерыПрисоединенныеФайлы.Наименование КАК Наименование,
	|	ПартнерыПрисоединенныеФайлы.ТипХраненияФайла КАК ТипХраненияФайла,
	|	ПартнерыПрисоединенныеФайлы.Расширение КАК Расширение,
	|	ПартнерыПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
	|	ПартнерыПрисоединенныеФайлы.Том КАК Том,
	|	ПартнерыПрисоединенныеФайлы.ПутьКФайлу КАК ПутьКФайлу
	|ПОМЕСТИТЬ ВТ_ПрисоединенныеФайлы
	|ИЗ
	|	Справочник.ПартнерыПрисоединенныеФайлы КАК ПартнерыПрисоединенныеФайлы
	|ГДЕ
	|	НЕ ПартнерыПрисоединенныеФайлы.ПометкаУдаления
	|	И ПартнерыПрисоединенныеФайлы.ВладелецФайла В
	|			(ВЫБРАТЬ
	|				ВТ_ВладельцыФайлов.ВладелецФайла
	|			ИЗ
	|				ВТ_ВладельцыФайлов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаПрисоединенныеФайлы.ВладелецФайла,
	|	ЗаказКлиентаПрисоединенныеФайлы.Ссылка,
	|	ЗаказКлиентаПрисоединенныеФайлы.Наименование,
	|	ЗаказКлиентаПрисоединенныеФайлы.ТипХраненияФайла,
	|	ЗаказКлиентаПрисоединенныеФайлы.Расширение,
	|	ЗаказКлиентаПрисоединенныеФайлы.ДатаСоздания,
	|	ЗаказКлиентаПрисоединенныеФайлы.Том,
	|	ЗаказКлиентаПрисоединенныеФайлы.ПутьКФайлу
	|ИЗ
	|	Справочник.ЗаказКлиентаПрисоединенныеФайлы КАК ЗаказКлиентаПрисоединенныеФайлы
	|ГДЕ
	|	НЕ ЗаказКлиентаПрисоединенныеФайлы.ПометкаУдаления
	|	И ЗаказКлиентаПрисоединенныеФайлы.ВладелецФайла В
	|			(ВЫБРАТЬ
	|				ВТ_ВладельцыФайлов.ВладелецФайла
	|			ИЗ
	|				ВТ_ВладельцыФайлов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВладельцыФайлов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвоичныеДанныеФайлов.Файл КАК Файл,
	|	ДвоичныеДанныеФайлов.Файл КАК ХранимыйФайл,
	|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла
	|ПОМЕСТИТЬ ВТ_ДвоичныеДанныеФайлов
	|ИЗ
	|	РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
	|ГДЕ
	|	ДвоичныеДанныеФайлов.Файл В
	|			(ВЫБРАТЬ
	|				ВТ_ПрисоединенныеФайлы.Файл
	|			ИЗ
	|				ВТ_ПрисоединенныеФайлы)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Файл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла,
	|	ВТ_ПрисоединенныеФайлы.Файл КАК Идентификатор1С,
	|	ВТ_ПрисоединенныеФайлы.Файл КАК Файл,
	|	ВТ_ПрисоединенныеФайлы.Наименование КАК Наименование,
	|	ВТ_ПрисоединенныеФайлы.ТипХраненияФайла КАК ТипХраненияФайла,
	|	ВТ_ПрисоединенныеФайлы.Расширение КАК Расширение,
	|	ВТ_ДвоичныеДанныеФайлов.ХранимыйФайл КАК ХранимыйФайл,
	|	ВТ_ПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
	|	ВТ_ПрисоединенныеФайлы.ПутьКФайлу КАК ПутьКФайлу,
	|	ВТ_ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла,
	|	ТомаХраненияФайлов.ПолныйПутьLinux КАК ТомПолныйПутьLinux,
	|	ТомаХраненияФайлов.ПолныйПутьWindows КАК ТомПолныйПутьWindows
	|ПОМЕСТИТЬ ВТ_ПрисоединеныеФайлыОбъектов
	|ИЗ
	|	ВТ_ПрисоединенныеФайлы КАК ВТ_ПрисоединенныеФайлы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДвоичныеДанныеФайлов КАК ВТ_ДвоичныеДанныеФайлов
	|		ПО ВТ_ПрисоединенныеФайлы.Файл = ВТ_ДвоичныеДанныеФайлов.Файл
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТомаХраненияФайлов КАК ТомаХраненияФайлов
	|		ПО ВТ_ПрисоединенныеФайлы.Том = ТомаХраненияФайлов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПрисоединенныеФайлы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДвоичныеДанныеФайлов";
	
	Запрос.УстановитьПараметр("ТипыСправочников"	, ТипыСправочников);	
	Запрос.УстановитьПараметр("НастройкаПодключения", СтруктураНастроек.НастройкаПодключения);	
	Запрос.УстановитьПараметр("ТипДанныхФ"			, СтруктураНастроек.ТипыОбъектовОбмена.Файл);	
	
	Запрос.Текст = ТекстЗапроса;
	
КонецПроцедуры

Функция ДанныеРестКлючаФайлов(СтруктураНастроек, МенеджерВременныхТаблиц, Объект)
	
	ЗапросФайлов = "";
	ИмяРестКлюча = "";
	
	Если СтруктураНастроек.Операция = СтруктураНастроек.ТипыОперацийСинхронизации.Компании Тогда
		СтруктураНастроек.НастройкиСинхронизацииКлиентов.Свойство("СвойствоФайловБ24Компаний", ИмяРестКлюча);
	ИначеЕсли СтруктураНастроек.Операция = СтруктураНастроек.ТипыОперацийСинхронизации.Контакты Тогда
		СтруктураНастроек.НастройкиСинхронизацииКлиентов.Свойство("СвойствоФайловБ24Контактов", ИмяРестКлюча);
	ИначеЕсли СтруктураНастроек.Операция = СтруктураНастроек.ТипыОперацийСинхронизации.Счета Тогда
		СтруктураНастроек.НастройкиСинхронизацииСчетов.Свойство("СвойствоФайловБ24Счетов", ИмяРестКлюча);
	ИначеЕсли СтруктураНастроек.Операция = СтруктураНастроек.ТипыОперацийСинхронизации.Проекты Тогда
		СтруктураНастроек.НастройкиСинхронизацииСделок.Свойство("СвойствоФайловБ24Сделок", ИмяРестКлюча);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ИмяРестКлюча) Тогда
		Возврат ЗапросФайлов;
	КонецЕсли;
	
	Запрос = Новый Запрос;      
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;	
	Запрос.УстановитьПараметр("ВладелецФайла", Объект); 
	Запрос.Текст = "ВЫБРАТЬ
	|	*
	|ИЗ
	|	ВТ_ПрисоединеныеФайлыОбъектов КАК ВТ_ПрисоединеныеФайлыОбъектов
	|ГДЕ
	|	ВТ_ПрисоединеныеФайлыОбъектов.ВладелецФайла = &ВладелецФайла";   
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		Возврат ЗапросФайлов;
	КонецЕсли;
	
	Итератор = 1;   
	
	ИмяРестКлюча = СтрРазделить(ИмяРестКлюча, ";")[0];
	
	Выборка = ВыполненныйЗапрос.Выбрать();
	Пока Выборка.Следующий() Цикл;
		
		НаименованиеФайла = Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Выборка.Наименование + ?(Лев(Выборка.Расширение, 1) = ".",Выборка.Расширение, "." + Выборка.Расширение));
		
		Если Выборка.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
			
			Если ЗначениеЗаполнено(Выборка.ДвоичныеДанныеФайла) Тогда
				
				ДвоичныеДанныеФайла = Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Выборка.ДвоичныеДанныеФайла.Получить());
				
				ЗапросФайлов = ЗапросФайлов+"&fields["+ИмяРестКлюча+"]["+Формат(Итератор, "ЧГ=0")+"][fileData][0]="+НаименованиеФайла;
				ЗапросФайлов = ЗапросФайлов+"&fields["+ИмяРестКлюча+"]["+Формат(Итератор, "ЧГ=0")+"][fileData][1]="+ДвоичныеДанныеФайла;
				
			КонецЕсли;		
		Иначе      
			
			ИмяФайла = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьАдресФайлаТома(СтруктураНастроек.ПлатформаWindows, Выборка);
			Если ЗначениеЗаполнено(ИмяФайла) И Б24_К_ОбщегоНазначенияВызовСервера.СуществуетФайл(ИмяФайла) Тогда
				
				ДвоичныеДанныеФайла = Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Новый ДвоичныеДанные(ИмяФайла));
				
				ЗапросФайлов = ЗапросФайлов+"&fields["+ИмяРестКлюча+"]["+Формат(Итератор, "ЧГ=0")+"][fileData][0]="+НаименованиеФайла;
				ЗапросФайлов = ЗапросФайлов+"&fields["+ИмяРестКлюча+"]["+Формат(Итератор, "ЧГ=0")+"][fileData][1]="+ДвоичныеДанныеФайла;
				
			КонецЕсли;
		КонецЕсли;
					
		Итератор = Итератор + 1;
		
		СтруктураНастроек.КартинкиИФайлы.Добавить(Выборка.Файл);
		
	КонецЦикла;  
	
	Возврат ЗапросФайлов;

КонецФункции

Процедура ВыгрузитьТоварыДокументовВСделкуСмартПроцесс(мДокументы) Экспорт
	
	ТипыОбъектовОбмена = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	
	ТелоHTTPЗапроса			= "";
	ТелоТоваровДокумента	= "";
	НомерСтроки 			= 1;	

	ТипыДел	= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();       
	
	Для каждого ТекДокумент Из мДокументы Цикл
		
		НастройкаПодключения 	= ТекДокумент.НастройкаПодключения;
		ТипДела 				= ТекДокумент.ТипДела;
		Документ 				= ТекДокумент.Документ;
		ИдДокумента				= ТекДокумент.ДопИдентификатор;
		
		ТипОбъета = "";
		РазбитыйИд = СтрРазделить(ТекДокумент.Идентификатор, "_");
		Если РазбитыйИд.Количество()>0 Тогда
			ТипОбъета			= РазбитыйИд[0];
		КонецЕсли;
		
		ИмяДокумента 			= Документ.Метаданные().Имя;
		
		СтруктураНастроек 	= Б24_КС_ОбщегоНазначенияВызовСервера.СформироватьСтруктуруНастроек(НастройкаПодключения,, 2, Истина);  
		Если СтруктураНастроек = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю("Не удалось подключиться");
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Объект"				, Документ);			
		Запрос.УстановитьПараметр("Портал"				, НастройкаПодключения.Портал); 
		Запрос.УстановитьПараметр("ТипДанныхТоваров"	, СтруктураНастроек.ТипыОбъектовОбмена.Товар);
		Запрос.УстановитьПараметр("ТипДанныхТоваров2"	, СтруктураНастроек.ТипыОбъектовОбмена.Товар2); 
		Запрос.УстановитьПараметр("ТипДанныхПредложений", СтруктураНастроек.ТипыОбъектовОбмена.Предложение); 
		Запрос.УстановитьПараметр("ЭтоТовар2"			, СтруктураНастроек.ВерсияТоваров = "v.2");
		ТекстЗапроса = "ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.Номенклатура) КАК Объект,  
		|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект КАК Справочник.ХарактеристикиНоменклатуры) КАК ПодчиненныйОбъект,
		|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ ВТ_ИдентификаторыТоваров
		|ИЗ
		|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
		|ГДЕ    
		|	НЕ &ЭтоТовар2     
		|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
		|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхТоваров 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.Номенклатура) КАК Объект, 
		|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект КАК Справочник.ХарактеристикиНоменклатуры) КАК ПодчиненныйОбъект,
		|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
		|ГДЕ
		|	&ЭтоТовар2     
		|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
		|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхТоваров2 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Объект,
		|	ПодчиненныйОбъект
		|;
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.Объект КАК Справочник.Номенклатура) КАК Объект, 
		|	ВЫРАЗИТЬ(Б24_К_ИдентификаторыОбъектов.ПодчиненныйОбъект КАК Справочник.ХарактеристикиНоменклатуры) КАК ПодчиненныйОбъект,
		|	Б24_К_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор   
		|ПОМЕСТИТЬ ВТ_ИдентификаторыПредложений
		|ИЗ
		|	РегистрСведений.Б24_К_ИдентификаторыОбъектов КАК Б24_К_ИдентификаторыОбъектов
		|ГДЕ
		|	&ЭтоТовар2     
		|	И Б24_К_ИдентификаторыОбъектов.Портал = &Портал
		|	И Б24_К_ИдентификаторыОбъектов.ТипДанных = &ТипДанныхПредложений 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Объект,
		|	ПодчиненныйОбъект
		|";
		
		ЕстьДокумент = Истина;
		Если ИмяДокумента = "АктВыполненныхРабот" Тогда 
			
			ТекстЗапроса = ТекстЗапроса + "
			|;
			|
			|ВЫБРАТЬ
			|	ТоварыДокумента.Ссылка КАК Ссылка,
			|	ТоварыДокумента.Номенклатура КАК Номенклатура,
			|	ТоварыДокумента.Характеристика КАК Характеристика,
			|	ПРЕДСТАВЛЕНИЕ(ТоварыДокумента.Номенклатура) КАК Содержание,
			|	СправочникНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ТоварыДокумента.Цена КАК Цена,
			|	ТоварыДокумента.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
			|	ТоварыДокумента.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
			|	ТоварыДокумента.Сумма КАК Сумма,
			|	ТоварыДокумента.СтавкаНДС КАК СтавкаНДС,
			|	ТоварыДокумента.СуммаНДС КАК СуммаНДС,
			|	ТоварыДокумента.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_ТоварыДокумента
			|ИЗ
			|	Документ.АктВыполненныхРабот.Услуги КАК ТоварыДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
			|		ПО ТоварыДокумента.Номенклатура = СправочникНоменклатура.Ссылка
			|ГДЕ
			|	ТоварыДокумента.Ссылка = &Объект
			|	И ТоварыДокумента.Количество > 0";
			
		ИначеЕсли ИмяДокумента = "ЗаказКлиента" Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|;
			|
			|ВЫБРАТЬ
			|	ТоварыДокумента.Ссылка КАК Ссылка,
			|	ТоварыДокумента.Номенклатура КАК Номенклатура,
			|	ТоварыДокумента.Характеристика КАК Характеристика,
			|	ТоварыДокумента.Содержание КАК Содержание,
			|	ТоварыДокумента.Упаковка КАК ЕдиницаИзмерения,
			|	ТоварыДокумента.Цена КАК Цена,
			|	ТоварыДокумента.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
			|	ТоварыДокумента.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
			|	ТоварыДокумента.Сумма КАК Сумма,
			|	ТоварыДокумента.СтавкаНДС КАК СтавкаНДС,
			|	ТоварыДокумента.СуммаНДС КАК СуммаНДС,
			|	ТоварыДокумента.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_ТоварыДокумента
			|ИЗ
			|	Документ.ЗаказКлиента.Товары КАК ТоварыДокумента
			|ГДЕ
			|	ТоварыДокумента.Ссылка = &Объект
			|	И ТоварыДокумента.Количество > 0";
			
		ИначеЕсли ИмяДокумента = "ЗаказПоставщику" ИЛИ ИмяДокумента = "ПриобретениеТоваровУслуг" ИЛИ  ИмяДокумента = "РеализацияТоваровУслуг" Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|;
			|
			|ВЫБРАТЬ
			|	ТоварыДокумента.Ссылка КАК Ссылка,
			|	ТоварыДокумента.Номенклатура КАК Номенклатура,
			|	ТоварыДокумента.Характеристика КАК Характеристика,
			|	"""" КАК Содержание,
			|	ТоварыДокумента.Упаковка КАК ЕдиницаИзмерения,
			|	ТоварыДокумента.Цена КАК Цена,
			|	ТоварыДокумента.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
			|	ТоварыДокумента.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
			|	ТоварыДокумента.Сумма КАК Сумма,
			|	ТоварыДокумента.СтавкаНДС КАК СтавкаНДС,
			|	ТоварыДокумента.СуммаНДС КАК СуммаНДС,
			|	ТоварыДокумента.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_ТоварыДокумента
			|ИЗ
			|	Документ."+ИмяДокумента+".Товары КАК ТоварыДокумента
			|ГДЕ
			|	ТоварыДокумента.Ссылка = &Объект
			|	И ТоварыДокумента.Количество > 0";
			
		ИначеЕсли ИмяДокумента = "КоммерческоеПредложениеКлиенту" Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|;
			|
			|ВЫБРАТЬ
			|	ТоварыДокумента.Ссылка КАК Ссылка,
			|	ТоварыДокумента.Номенклатура КАК Номенклатура,
			|	ТоварыДокумента.Характеристика КАК Характеристика,
			|	"""" КАК Содержание,
			|	ТоварыДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ТоварыДокумента.Цена КАК Цена,
			|	ТоварыДокумента.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
			|	ТоварыДокумента.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
			|	ТоварыДокумента.Сумма КАК Сумма,
			|	ТоварыДокумента.СтавкаНДС КАК СтавкаНДС,
			|	ТоварыДокумента.СуммаНДС КАК СуммаНДС,
			|	ТоварыДокумента.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_ТоварыДокумента
			|ИЗ
			|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК ТоварыДокумента
			|ГДЕ
			|	ТоварыДокумента.Ссылка = &Объект
			|	И ТоварыДокумента.Количество > 0";
			
		ИначеЕсли ИмяДокумента = "ВозвратТоваровОтКлиента" ИЛИ ИмяДокумента = "ВозвратТоваровПоставщику" Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|;
			|
			|ВЫБРАТЬ
			|	ТоварыДокумента.Ссылка КАК Ссылка,
			|	ТоварыДокумента.Номенклатура КАК Номенклатура,
			|	ТоварыДокумента.Характеристика КАК Характеристика,
			|	"""" КАК Содержание,
			|	ТоварыДокумента.Упаковка КАК ЕдиницаИзмерения,
			|	ТоварыДокумента.Цена КАК Цена,
			|	0 КАК ПроцентРучнойСкидки,
			|	0 КАК СуммаРучнойСкидки,
			|	ТоварыДокумента.Сумма КАК Сумма,
			|	ТоварыДокумента.СтавкаНДС КАК СтавкаНДС,
			|	ТоварыДокумента.СуммаНДС КАК СуммаНДС,
			|	ТоварыДокумента.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_ТоварыДокумента
			|ИЗ
			|	Документ."+ИмяДокумента+".Товары КАК ТоварыДокумента
			|ГДЕ
			|	ТоварыДокумента.Ссылка = &Объект
			|	И ТоварыДокумента.Количество > 0";
			
		Иначе
			
			ЕстьДокумент = Ложь;
			
		КонецЕсли;
		
		Если ЕстьДокумент Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|;
			|
			|ВЫБРАТЬ
			|	ВТ_ТоварыДокумента.Ссылка КАК Проект,
			|	ВТ_ТоварыДокумента.Номенклатура КАК Номенклатура,
			|	ВТ_ТоварыДокумента.Характеристика КАК Характеристика,
			|	ВТ_ТоварыДокумента.Содержание КАК Содержание,
			|	ВТ_ТоварыДокумента.Количество КАК Количество,
			|	ВТ_ТоварыДокумента.Цена КАК Цена,
			|	ВТ_ТоварыДокумента.Сумма КАК Сумма,
			|	ВТ_ТоварыДокумента.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
			|	ВТ_ТоварыДокумента.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
			|	ВТ_ТоварыДокумента.СтавкаНДС КАК СтавкаНДС,
			|	ВТ_ТоварыДокумента.СуммаНДС КАК СуммаНДС,
			|	Товары.Наименование КАК НаименованиеТовара,
			|	УпаковкиЕдиницыИзмерения.Ссылка КАК ЕдиницаИзмерения,
			|	ПРЕДСТАВЛЕНИЕ(УпаковкиЕдиницыИзмерения.Ссылка) КАК НаименованиеЕдиницыИзмерения,
			|	ВТ_ИдентификаторыТоваров.Идентификатор КАК ИдентификаторБ24Товара,
			|	Товары.НаименованиеПолное КАК НаименованиеПолноеНоменклатуры,
			|	Товары.Наименование КАК НаименованиеНоменклатуры,
			|	ПРЕДСТАВЛЕНИЕ(ВТ_ТоварыДокумента.Характеристика) КАК НаименованиеХарактеристики,
			|	УпаковкиЕдиницыИзмерения.Код КАК КодЕдИзм,
			|	Товары.ТипНоменклатуры КАК ТипНоменклатуры,
			|	ВТ_ИдентификаторыПредложений.Идентификатор КАК ИдентификаторБ24Предложения
			|ИЗ
			|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товары
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
			|			ПО Товары.ЕдиницаИзмерения = УпаковкиЕдиницыИзмерения.Ссылка
			|		ПО ВТ_ТоварыДокумента.Номенклатура = Товары.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыТоваров КАК ВТ_ИдентификаторыТоваров
			|		ПО ВТ_ТоварыДокумента.Номенклатура = ВТ_ИдентификаторыТоваров.Объект
			|			И ВТ_ТоварыДокумента.Характеристика = ВТ_ИдентификаторыТоваров.ПодчиненныйОбъект
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыПредложений КАК ВТ_ИдентификаторыПредложений
			|		ПО ВТ_ТоварыДокумента.Номенклатура = ВТ_ИдентификаторыПредложений.Объект
			|			И ВТ_ТоварыДокумента.Характеристика = ВТ_ИдентификаторыПредложений.ПодчиненныйОбъект";
			
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + "
			|;
			|
			|ВЫБРАТЬ
			|	ИСТИНА КАК Параметр
			|ГДЕ
			|	ЛОЖЬ";    
			
		КонецЕсли;  
		
		Запрос.Текст = ТекстЗапроса;
		ВыполненныйЗапрос = Запрос.Выполнить();
		
		Если НЕ ВыполненныйЗапрос.Пустой() Тогда
			
			ВыборкаТоваров = ВыполненныйЗапрос.Выбрать();
			
			Пока ВыборкаТоваров.Следующий() Цикл
				
				ИдентификаторТовараПредложения = "";
				Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда   
					ИдентификаторТовараПредложения = ВыборкаТоваров.ИдентификаторБ24Предложения; 
					Если НЕ ЗначениеЗаполнено(ИдентификаторТовараПредложения) И ЗначениеЗаполнено(ВыборкаТоваров.Номенклатура) Тогда
						ИдентификаторТовараПредложения = СформироватьТоварПоСсылке(СтруктураНастроек, ВыборкаТоваров.Номенклатура, ВыборкаТоваров.Характеристика);
					КонецЕсли;  
				Иначе
					ИдентификаторТовараПредложения = ВыборкаТоваров.ИдентификаторБ24Товара; 
					Если НЕ ЗначениеЗаполнено(ИдентификаторТовараПредложения) И ЗначениеЗаполнено(ВыборкаТоваров.Номенклатура) Тогда
						ИдентификаторТовараПредложения = СформироватьТоварПоСсылке(СтруктураНастроек, ВыборкаТоваров.Номенклатура, ВыборкаТоваров.Характеристика);
					КонецЕсли;  
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ВыборкаТоваров.Характеристика) Тогда
					ОписаниеТовара 			= ВыборкаТоваров.НаименованиеНоменклатуры;
					ПолноеОписаниеТовара 	= ВыборкаТоваров.НаименованиеПолноеНоменклатуры; 
				Иначе
					ОписаниеТовара = ВыборкаТоваров.НаименованиеНоменклатуры + " (" + ВыборкаТоваров.НаименованиеХарактеристики + ")";
					ПолноеОписаниеТовара = ВыборкаТоваров.НаименованиеПолноеНоменклатуры + " (" + ВыборкаТоваров.НаименованиеХарактеристики + ")"; 
                КонецЕсли;
				
				Если ВыборкаТоваров.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга И ЗначениеЗаполнено(ВыборкаТоваров.Содержание) Тогда
					ПолноеОписаниеТовара 	= ВыборкаТоваров.Содержание;
				КонецЕсли;	
				
				НомерСтрокиСтрокой = Формат(НомерСтроки, "ЧГ=0");
				
				Если ТипДела = ТипыДел.ДелоСделки Тогда    
						
					ПоляТЧ = Новый Структура;   
					ПоляТЧ.Вставить("PRODUCT_ID"			, ИдентификаторТовараПредложения);
					ПоляТЧ.Вставить("PRODUCT_DESCRIPTION"	, ОписаниеТовара);
					ПоляТЧ.Вставить("PRODUCT_NAME"			, ПолноеОписаниеТовара);
					
					СтавкаНДС 		 = ВыборкаТоваров.СтавкаНДС.Ставка;
					СуммаВключаетНДС = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(Документ, "ЦенаВключаетНДС");
					Если СуммаВключаетНДС = Истина Тогда
						ПоляТЧ.Вставить("PRICE"					, ВыборкаТоваров.Сумма/ВыборкаТоваров.Количество);
						
						ЦенаБезСкидкиСНалогом = ВыборкаТоваров.Сумма/ВыборкаТоваров.Количество+ ВыборкаТоваров.СуммаРучнойСкидки/ВыборкаТоваров.Количество;
						
						ПоляТЧ.Вставить("PRICE_NETTO"			, ЦенаБезСкидкиСНалогом/(СтавкаНДС+100)*100);
						ПоляТЧ.Вставить("PRICE_EXCLUSIVE"		, ВыборкаТоваров.Сумма/ВыборкаТоваров.Количество-ВыборкаТоваров.СуммаНДС/ВыборкаТоваров.Количество);
						ПоляТЧ.Вставить("PRICE_BRUTTO"			, ЦенаБезСкидкиСНалогом);
					Иначе
						ПоляТЧ.Вставить("PRICE"					, (ВыборкаТоваров.Сумма+ВыборкаТоваров.СуммаНДС)/ВыборкаТоваров.Количество);
						
						ЦенаБезСкидкиБезНалога = (ВыборкаТоваров.Сумма+ВыборкаТоваров.СуммаРучнойСкидки)/ВыборкаТоваров.Количество;
						
						ПоляТЧ.Вставить("PRICE_NETTO"			, ЦенаБезСкидкиБезНалога);
						ПоляТЧ.Вставить("PRICE_EXCLUSIVE"		, ВыборкаТоваров.Сумма/ВыборкаТоваров.Количество);
						ПоляТЧ.Вставить("PRICE_BRUTTO"			, ЦенаБезСкидкиБезНалога+ЦенаБезСкидкиБезНалога/100*СтавкаНДС);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ВыборкаТоваров.КодЕдИзм) Тогда
						ПоляТЧ.Вставить("MEASURE_CODE"		, СокрЛП(ВыборкаТоваров.КодЕдИзм));
						ПоляТЧ.Вставить("MEASURE_NAME"		, ВыборкаТоваров.НаименованиеЕдиницыИзмерения);
					КонецЕсли;
					ПоляТЧ.Вставить("QUANTITY"				, ВыборкаТоваров.Количество);
					
					ПоляТЧ.Вставить("DISCOUNT_TYPE_ID"		, "2");
					ПоляТЧ.Вставить("DISCOUNT_RATE"			, ВыборкаТоваров.ПроцентРучнойСкидки);
					ПоляТЧ.Вставить("DISCOUNT_SUM"			, ВыборкаТоваров.СуммаРучнойСкидки/ВыборкаТоваров.Количество);
					
					ПоляТЧ.Вставить("TAX_RATE"				, Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьСтавкуПоНДС(ВыборкаТоваров.СтавкаНДС));
					
					ПоляТЧ.Вставить("TAX_INCLUDED"			, ?(СуммаВключаетНДС, "Y", "N"));
					ПоляТЧ.Вставить("CUSTOMIZED"			, "Y");		
					
					Для каждого ТекПоле Из ПоляТЧ Цикл
						ТелоТоваровДокумента = ТелоТоваровДокумента + "&rows["+НомерСтрокиСтрокой+"]["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
					КонецЦикла;       
					
				ИначеЕсли ТипДела = ТипыДел.ДелоСчета ИЛИ ТипДела = ТипыДел.ДелоСмартПроцесса Тогда   
						
					ПоляТЧ = Новый Структура;   
					ПоляТЧ.Вставить("productId"				, ИдентификаторТовараПредложения);
					ПоляТЧ.Вставить("productName"			, ПолноеОписаниеТовара);
					
					СтавкаНДС 		 = ВыборкаТоваров.СтавкаНДС.Ставка;
					СуммаВключаетНДС = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(Документ, "ЦенаВключаетНДС");
					Если СуммаВключаетНДС = Истина Тогда
						ПоляТЧ.Вставить("price"				, ВыборкаТоваров.Сумма/ВыборкаТоваров.Количество);
					Иначе
						ПоляТЧ.Вставить("price"				, (ВыборкаТоваров.Сумма+ВыборкаТоваров.СуммаНДС)/ВыборкаТоваров.Количество);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ВыборкаТоваров.КодЕдИзм) Тогда
						ПоляТЧ.Вставить("measureCode"		, СокрЛП(ВыборкаТоваров.КодЕдИзм));
						ПоляТЧ.Вставить("measureName"		, ВыборкаТоваров.НаименованиеЕдиницыИзмерения);
					КонецЕсли;
					ПоляТЧ.Вставить("quantity"				, ВыборкаТоваров.Количество);
					
					ПоляТЧ.Вставить("discountTypeId"		, "2");
					ПоляТЧ.Вставить("discountRate"			, ВыборкаТоваров.ПроцентРучнойСкидки);
					ПоляТЧ.Вставить("discountSum"			, ВыборкаТоваров.СуммаРучнойСкидки/ВыборкаТоваров.Количество);
					
					ПоляТЧ.Вставить("taxRate"			, Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьСтавкуПоНДС(ВыборкаТоваров.СтавкаНДС));
					
					ПоляТЧ.Вставить("taxIncluded"			, ?(СуммаВключаетНДС, "Y", "N"));
					ПоляТЧ.Вставить("customized"			, "Y");		
					
					Для каждого ТекПоле Из ПоляТЧ Цикл
						ТелоТоваровДокумента = ТелоТоваровДокумента + "&productRows["+НомерСтрокиСтрокой+"]["+ ТекПоле.Ключ + "]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ТекПоле.Значение); 
					КонецЦикла;  

				КонецЕсли;
				
				НомерСтроки = НомерСтроки + 1;
				
			КонецЦикла;	
		КонецЕсли;
	
	КонецЦикла;
	
	Если ТипДела = ТипыДел.ДелоСделки Тогда      
		
		Если ЗначениеЗаполнено(ТелоТоваровДокумента) Тогда
			ТелоТоваровДокумента = "id=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИдДокумента) + ТелоТоваровДокумента;	
			ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + "cmd[]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.deal.productrows.set?" + ТелоТоваровДокумента);	
		КонецЕсли;
		
	ИначеЕсли ТипДела = ТипыДел.ДелоСчета Тогда   
		
		Если ЗначениеЗаполнено(ТелоТоваровДокумента) Тогда
			ТелоТоваровДокумента = "ownerType=SI&ownerId=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИдДокумента) + ТелоТоваровДокумента;	
			ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + "cmd[]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.item.productrow.set?" + ТелоТоваровДокумента);	
		КонецЕсли;
		
	ИначеЕсли ТипДела = ТипыДел.ДелоСмартПроцесса Тогда    
		
		ТипВладельцаСмартПроцесса16 = "T" + Б24_К_ОбщегоНазначенияВызовСервера.КонвертацияДесятичногоЧислаВШестнадцатеричное(ТипОбъета);
		
		Если ЗначениеЗаполнено(ТелоТоваровДокумента) Тогда
			ТелоТоваровДокумента = "ownerType="+ТипВладельцаСмартПроцесса16+"&ownerId=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИдДокумента) + ТелоТоваровДокумента;	
			ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + "cmd[]=" +  Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("crm.item.productrow.set?" + ТелоТоваровДокумента);	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТелоHTTPЗапроса) Тогда
		СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьСтруктуруКлючейЭлементаВыгрузки(СтруктураНастроек, ДополнительныеПараметры)  Экспорт
	
	ИнформацияОПолях 		= ДополнительныеПараметры.ИнформацияОПолях;
	МенеджерВременныхТаблиц = ДополнительныеПараметры.МенеджерВременныхТаблиц;
	ИнформацияОбъекта1С 	= ДополнительныеПараметры.ИнформацияОбъекта1С;
	ЭтоНовыйЭлемент 		= ДополнительныеПараметры.ЭтоНовыйЭлемент;
	КлючЭлемента 			= ДополнительныеПараметры.КлючЭлемента;
	
	СсылкаНаОбъект1С 		= ИнформацияОбъекта1С.Объект;
	
	Поля = Новый Структура;
	
	Для каждого ТекПоле Из ИнформацияОПолях Цикл
		
		Если ТекПоле.ИсточникДанных	= "" ИЛИ ТекПоле.ИсточникДанных = "Не изменять" Тогда		
			Продолжить;
		КонецЕсли;   
		
		Если НЕ ЗначениеЗаполнено(ТекПоле.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеКлюча = Неопределено;
		
		Попытка
			
			Если ТекПоле.ИсточникДанных = "Фиксированное значение" Тогда
				
				ЗначениеКлюча = ТекПоле.Значение;	      
				
			ИначеЕсли ТекПоле.ИсточникДанных = "Предопределенный алгоритм" Тогда
				
#Область ОбщиеАлгоритмы				
				Если ТекПоле.Значение = "Наименование элемента справочника" Тогда
					
					ЗначениеКлюча = ИнформацияОбъекта1С.Наименование;	
					
				ИначеЕсли ТекПоле.Значение = "Идентификатор источника данных" Тогда
					
					ЗначениеКлюча = "ONE_C";	
					
				ИначеЕсли ТекПоле.Значение = "Идентификатор элемента в источнике данных" Тогда
					
					ЗначениеКлюча = КлючЭлемента;	
					
				ИначеЕсли ТекПоле.Значение = "Комментарий" Тогда
					
					ЗначениеКлюча = ИнформацияОбъекта1С.Комментарий;	
					
				ИначеЕсли ТекПоле.Значение = "Ответственный" Тогда
					
					Если ЗначениеЗаполнено(ИнформацияОбъекта1С.Ответственный) Тогда
						НайденнаяСтрока = СтруктураНастроек.ТаблицаСопоставленияПользователей.Найти(ИнформацияОбъекта1С.Ответственный);
						Если НайденнаяСтрока<> Неопределено Тогда
							ЗначениеКлюча = НайденнаяСтрока.ИдПользователя; 
						КонецЕсли;
					КонецЕсли;
					
				ИначеЕсли ТекПоле.Значение = "Доступность" Тогда
					
					ЗначениеКлюча = ?(ИнформацияОбъекта1С.ПометкаУдаления,"N","Y");
					
				ИначеЕсли ТекПоле.Значение = "Символьный код валюты" Тогда
					
					ВалютаСимвольныйКод = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьВалютуПоКоду(Лев(ИнформацияОбъекта1С.ВалютаКод, 3));
					Если ЗначениеЗаполнено(ВалютаСимвольныйКод) Тогда
						ЗначениеКлюча = ВалютаСимвольныйКод;
					КонецЕсли;	
					
				ИначеЕсли ТекПоле.Значение = "Идентификатор владельца" Тогда
					
					ЗначениеКлюча = ИнформацияОбъекта1С.ИдентификаторБ24Владельца;
					
				ИначеЕсли (ТекПоле.ВидСущности = "Компания" ИЛИ ТекПоле.ВидСущности = "Контакт" ИЛИ ТекПоле.ВидСущности = "Проект" ИЛИ ТекПоле.ВидСущности = "Счет2") И ТекПоле.Значение = "Yandex-Direct, Google-Adwords и другие" Тогда
					
					Если ЭтоНовыйЭлемент Тогда
						
						Если ТекПоле.ВидСущности = "Компания" ИЛИ ТекПоле.ВидСущности = "Контакт" Тогда
							НастройкиСущности = СтруктураНастроек.НастройкиСинхронизацииКлиентов;
						ИначеЕсли ТекПоле.ВидСущности = "Счет2" Тогда
							НастройкиСущности = СтруктураНастроек.НастройкиСинхронизацииСчетов;	
						Иначе
							НастройкиСущности = СтруктураНастроек.НастройкиСинхронизацииСделок;	
						КонецЕсли;
						
						Если НастройкиСущности.Свойство("ВыгружатьМеткуСквознойАналитики") Тогда 
							Если НастройкиСущности.ВыгружатьМеткуСквознойАналитики Тогда
								
								НаименованиеИсточника = "1С";
								
								Если НастройкиСущности.ВидМеткиДляСквознойАналитики = "Свойство" Тогда
									
									ЗначениеСвойстваАналитики = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ЗначенияОбъектовСИд", ИнформацияОбъекта1С.Объект, НастройкиСущности.СвойствоДляСквознойАналитики);
									Если ЗначениеЗаполнено(ЗначениеСвойстваАналитики) Тогда
										НаименованиеИсточника = Строка(ЗначениеСвойстваАналитики);
									КонецЕсли;
									
								ИначеЕсли НастройкиСущности.ВидМеткиДляСквознойАналитики = "Канал" Тогда
									
									НаименованиеИсточника = Строка(ИнформацияОбъекта1С.Канал);
									
								КонецЕсли;	
								
								 Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
								 Хеш.Добавить(НаименованиеИсточника);
								 ХэшСтрока = Хеш.ХешСумма; 								
								
								ЗначениеКлюча = "1c-b24-standalone-Onec" + "_" + XMLСтрока(ХэшСтрока); 
								
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					           
				ИначеЕсли (ТекПоле.ВидСущности = "Компания" ИЛИ ТекПоле.ВидСущности = "Контакт" ИЛИ ТекПоле.ВидСущности = "Проект" ИЛИ ТекПоле.ВидСущности = "Счет2") И ТекПоле.Значение = "Метка компаний" Тогда
						
					Если ЭтоНовыйЭлемент Тогда
						
						Если ТекПоле.ВидСущности = "Компания" ИЛИ ТекПоле.ВидСущности = "Контакт" Тогда
							НастройкиСущности = СтруктураНастроек.НастройкиСинхронизацииКлиентов;
						ИначеЕсли ТекПоле.ВидСущности = "Счет2" Тогда
							НастройкиСущности = СтруктураНастроек.НастройкиСинхронизацииСчетов;	
						Иначе
							НастройкиСущности = СтруктураНастроек.НастройкиСинхронизацииСделок;	
						КонецЕсли;
						
						Если НастройкиСущности.Свойство("ВыгружатьМеткуСквознойАналитики") Тогда 
							Если НастройкиСущности.ВыгружатьМеткуСквознойАналитики Тогда
								
								НаименованиеИсточника = "1С";
								
								Если НастройкиСущности.ВидМеткиДляСквознойАналитики = "Свойство" Тогда
									
									ЗначениеСвойстваАналитики = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ЗначенияОбъектовСИд", ИнформацияОбъекта1С.Объект, НастройкиСущности.СвойствоДляСквознойАналитики);
									Если ЗначениеЗаполнено(ЗначениеСвойстваАналитики) Тогда
										НаименованиеИсточника = Строка(ЗначениеСвойстваАналитики);
									КонецЕсли;
									
								ИначеЕсли НастройкиСущности.ВидМеткиДляСквознойАналитики = "Канал" Тогда
									
									НаименованиеИсточника = Строка(ИнформацияОбъекта1С.Канал);
									
								КонецЕсли;	
								
								ЗначениеКлюча = НаименованиеИсточника;
								
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;		
#КонецОбласти				
				
				Если ТекПоле.ВидСущности = "Компания" Тогда	
#Область Компании							
					Если ТекПоле.Значение = "Тип компании" Тогда
						
						НайденныеСтроки = СтруктураНастроек.ПресетыТиповКомпаний.НайтиСтроки(Новый Структура("Клиент, Поставщик, ПрочиеОтношения, Конкурент", ИнформацияОбъекта1С.Клиент, ИнформацияОбъекта1С.Поставщик, ИнформацияОбъекта1С.ПрочиеОтношения, ИнформацияОбъекта1С.Конкурент));
						Если НайденныеСтроки.Количество() > 0 Тогда
							ЗначениеКлюча = НайденныеСтроки[0].ИдТипа; 
						КонецЕсли;
			
					ИначеЕсли ТекПоле.Значение = "Признак организации" Тогда
						
						ЗначениеКлюча = ?(ТипЗнч(СсылкаНаОбъект1С) = Тип("СправочникСсылка.Организации"), "Y", "N");
					
					КонецЕсли;				
#КонецОбласти			
				ИначеЕсли ТекПоле.ВидСущности = "Контакт" Тогда										
#Область Контакты					
					Если ТекПоле.Значение = "Имя" Тогда
	
						ФИО = Б24_К_ОбщегоНазначенияВызовСервера.РазобратьФИО(ИнформацияОбъекта1С.Наименование);
						ЗначениеКлюча = ?(ЗначениеЗаполнено(ФИО.Имя), ФИО.Имя, ИнформацияОбъекта1С.Наименование);
						
					ИначеЕсли ТекПоле.Значение = "Отчество" Тогда    
						
						ФИО = Б24_К_ОбщегоНазначенияВызовСервера.РазобратьФИО(ИнформацияОбъекта1С.Наименование);

						ЗначениеКлюча = ФИО.Отчество;
						
					ИначеЕсли ТекПоле.Значение = "Фамилия" Тогда
						
						ФИО = Б24_К_ОбщегоНазначенияВызовСервера.РазобратьФИО(ИнформацияОбъекта1С.Наименование);
						
						ЗначениеКлюча = ?(ЗначениеЗаполнено(ФИО.Имя), ФИО.Фамилия, "");
						
					ИначеЕсли ТекПоле.Значение = "Ид компании" Тогда
						
						Если ЗначениеЗаполнено(ИнформацияОбъекта1С.ИдентификаторКомпанииБитрикс24) Тогда
							ЗначениеКлюча = ИнформацияОбъекта1С.ИдентификаторКомпанииБитрикс24; 
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Тип контакта" Тогда
						
						НайденныеСтроки = СтруктураНастроек.ПресетыТиповКонтактов.НайтиСтроки(Новый Структура("Клиент, Поставщик, ПрочиеОтношения, Конкурент", ИнформацияОбъекта1С.Клиент, ИнформацияОбъекта1С.Поставщик, ИнформацияОбъекта1С.ПрочиеОтношения, ИнформацияОбъекта1С.Конкурент));
						Если НайденныеСтроки.Количество() > 0 Тогда
							ЗначениеКлюча = НайденныеСтроки[0].ИдТипа; 
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Дата рождения" Тогда
						
						Если ЗначениеЗаполнено(ИнформацияОбъекта1С.ДатаРождения) Тогда
							ЗначениеКлюча = ИнформацияОбъекта1С.ДатаРождения;
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Должность" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Должность;
						
					ИначеЕсли ТекПоле.Значение = "Это ИП" Тогда
						
						Если СтрНайти(ИнформацияОбъекта1С.Наименование, "ИП") > 0 Тогда
							ЗначениеКлюча = "ИП";
						Иначе
							ЗначениеКлюча = ""; 
						КонецЕсли;
						
					КонецЕсли;					
#КонецОбласти	
				ИначеЕсли ТекПоле.ВидСущности = "Реквизит" Тогда		
#Область Реквизиты
					Если ТекПоле.Значение = "Тип владельца" Тогда
	
						ЗначениеКлюча = ?(СтруктураНастроек.ТипыКонтрагентовДляКомпаний.Найти(ИнформацияОбъекта1С.ТипПартнера) <> Неопределено ИЛИ ИнформацияОбъекта1С.ЭтоКомпания, "4", "3");
						
					ИначеЕсли ТекПоле.Значение = "Идентификатор шаблона" Тогда
						
						НайденнаяСтрока = СтруктураНастроек.ПресетыШаблоновРеквизитов.Найти(ИнформацияОбъекта1С.ТипКонтрагента);
						Если НайденнаяСтрока = Неопределено Тогда
							Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.КритическаяОшибка, "Не найден пресет для типа:" + Строка(ИнформацияОбъекта1С.ТипКонтрагента));
							СтруктураНастроек.ВыполненоБезОшибок = Ложь;
							ЗначениеКлюча = "";	
						Иначе
							ЗначениеКлюча = НайденнаяСтрока.ИдШаблона;
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Наименование реквизита" Тогда
						
						ЗначениеКлюча = ?(ЗначениеЗаполнено(ИнформацияОбъекта1С.НаименованиеПолное), ИнформацияОбъекта1С.НаименованиеПолное, ИнформацияОбъекта1С.Наименование);
						
						//ЗначениеКлюча = Лев(ЗначениеКлюча, 50);
						
					ИначеЕсли ТекПоле.Значение = "Сокращенное наименование организации" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Наименование;
						
					ИначеЕсли ТекПоле.Значение = "Полное наименование организации" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.НаименованиеПолное;
						
					ИначеЕсли ТекПоле.Значение = "Полное ФИО" Тогда
						
						Если СтруктураНастроек.ТипыКонтрагентовДляКомпаний.Найти(ИнформацияОбъекта1С.ТипПартнера) = Неопределено    
							ИЛИ ИнформацияОбъекта1С.ТипПартнера = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда
							
							НаименованиеПолное = ?(ЗначениеЗаполнено(ИнформацияОбъекта1С.НаименованиеПолное), ИнформацияОбъекта1С.НаименованиеПолное, ИнформацияОбъекта1С.Наименование); 
							ЗначениеКлюча = НаименованиеПолное;
							
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Имя" Тогда
						
						Если СтруктураНастроек.ТипыКонтрагентовДляКомпаний.Найти(ИнформацияОбъекта1С.ТипПартнера) = Неопределено 
							ИЛИ ИнформацияОбъекта1С.ТипПартнера = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда
							
							НаименованиеПолное = ?(ЗначениеЗаполнено(ИнформацияОбъекта1С.НаименованиеПолное), ИнформацияОбъекта1С.НаименованиеПолное, ИнформацияОбъекта1С.Наименование); 
							ФИО = Б24_К_ОбщегоНазначенияВызовСервера.РазобратьФИО(НаименованиеПолное);
				
							ЗначениеКлюча = ?(ЗначениеЗаполнено(ФИО.Имя), ФИО.Имя, ИнформацияОбъекта1С.Наименование); 
							
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Отчество" Тогда
						
						Если СтруктураНастроек.ТипыКонтрагентовДляКомпаний.Найти(ИнформацияОбъекта1С.ТипПартнера) = Неопределено 
							ИЛИ ИнформацияОбъекта1С.ТипПартнера = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда
							
							НаименованиеПолное = ?(ЗначениеЗаполнено(ИнформацияОбъекта1С.НаименованиеПолное), ИнформацияОбъекта1С.НаименованиеПолное, ИнформацияОбъекта1С.Наименование); 
							ФИО = Б24_К_ОбщегоНазначенияВызовСервера.РазобратьФИО(НаименованиеПолное);
							
							ЗначениеКлюча = ФИО.Отчество;
							
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Фамилия" Тогда
						
						Если СтруктураНастроек.ТипыКонтрагентовДляКомпаний.Найти(ИнформацияОбъекта1С.ТипПартнера) = Неопределено 
							ИЛИ ИнформацияОбъекта1С.ТипПартнера = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда
							
							НаименованиеПолное = ?(ЗначениеЗаполнено(ИнформацияОбъекта1С.НаименованиеПолное), ИнформацияОбъекта1С.НаименованиеПолное, ИнформацияОбъекта1С.Наименование); 
							ФИО = Б24_К_ОбщегоНазначенияВызовСервера.РазобратьФИО(НаименованиеПолное);
							
							ЗначениеКлюча = ?(ЗначениеЗаполнено(ФИО.Имя), ФИО.Фамилия, "");
							
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Страна" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Страна; 
						
					ИначеЕсли ТекПоле.Значение = "ИНН" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.ИНН; 
						
					ИначеЕсли ТекПоле.Значение = "КПП" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.КПП; 
						
					ИначеЕсли ТекПоле.Значение = "ОКПО" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.КодПоОКПО; 
						
					ИначеЕсли ТекПоле.Значение = "ОГРНИП" Тогда
											
						Если СтруктураНастроек.ТипыКонтрагентовДляКомпаний.Найти(ИнформацияОбъекта1С.ТипПартнера) <> Неопределено Тогда  
							
							ДлинаДанных = СтрДлина(ИнформацияОбъекта1С.РегистрационныйНомер);
							Если ДлинаДанных > 13 И ДлинаДанных < 16 Тогда
								ЗначениеКлюча = ИнформацияОбъекта1С.РегистрационныйНомер; 
							КонецЕсли;	
							
						Иначе
							ЗначениеКлюча = ""; 
						КонецЕсли;
							
					ИначеЕсли ТекПоле.Значение = "ОГРН" Тогда
						
						Если СтруктураНастроек.ТипыКонтрагентовДляКомпаний.Найти(ИнформацияОбъекта1С.ТипПартнера) <> Неопределено Тогда
							Если НЕ СтрДлина(ИнформацияОбъекта1С.РегистрационныйНомер) > 13 Тогда
								ЗначениеКлюча = ИнформацияОбъекта1С.РегистрационныйНомер; 
							КонецЕсли;					
						Иначе
							ЗначениеКлюча = ""; 
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "БИК" Тогда
						
						ЗначениеКлюча = ""; 
						
					ИначеЕсли ТекПоле.Значение = "ИИН" Тогда
						
						ЗначениеКлюча = ""; 
						
					КонецЕсли;				
#КонецОбласти				
				ИначеЕсли ТекПоле.ВидСущности = "Банковский счет" Тогда
#Область БанкСчета
					Если ТекПоле.Значение = "Тип владельца банк. счетов" Тогда
						
						ЗначениеКлюча = "8"; 
						
					ИначеЕсли ТекПоле.Значение = "Наименование банка" Тогда
						
						ЗначениеКлюча = ?(ЗначениеЗаполнено(ИнформацияОбъекта1С.НаименованиеБанкаВСчете), ИнформацияОбъекта1С.НаименованиеБанкаВСчете, ИнформацияОбъекта1С.НаименованиеБанка);
						
					ИначеЕсли ТекПоле.Значение = "Адрес банка" Тогда
						
						ЗначениеКлюча = ?(ЗначениеЗаполнено(ИнформацияОбъекта1С.АдресБанкаВСчете), ИнформацияОбъекта1С.АдресБанкаВСчете, ИнформацияОбъекта1С.АдресБанка);
						
					ИначеЕсли ТекПоле.Значение = "Корр счет банка" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.КоррСчетБанка; 
						
					ИначеЕсли ТекПоле.Значение = "Бик банка" Тогда
						
						ЗначениеКлюча = ?(ЗначениеЗаполнено(ИнформацияОбъекта1С.БИКБанкаВСчете), ИнформацияОбъекта1С.БИКБанкаВСчете, ИнформацияОбъекта1С.БикБанка);
						
					ИначеЕсли ТекПоле.Значение = "Номер счета" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.НомерСчета; 
						
					ИначеЕсли ТекПоле.Значение = "СВИФТ банка" Тогда
						
						ЗначениеКлюча = ?(ЗначениеЗаполнено(ИнформацияОбъекта1С.СВИФТБанкаВСчете), ИнформацияОбъекта1С.СВИФТБанкаВСчете, ИнформацияОбъекта1С.СВИФТБИК);
						
					КонецЕсли;						 
#КонецОбласти				
				ИначеЕсли ТекПоле.ВидСущности = "Товар"  Тогда
#Область Товары
					Если ТекПоле.Значение = "Внешний код товара" Тогда
						
						ЗначениеКлюча = ДополнительныеПараметры.КлючЭлемента; 	
						
					ИначеЕсли ТекПоле.Значение = "Признак активности товара" Тогда
						
						ЗначениеКлюча = ?(ДополнительныеПараметры.Активный = Истина,"Y","N"); 
						
					ИначеЕсли ТекПоле.Значение = "Название товара" Тогда
						
						ЗначениеКлюча = ДополнительныеПараметры.НаименованиеТовара; 	
						
					ИначеЕсли ТекПоле.Значение = "Описание товара" Тогда
						
						ЗначениеКлюча = ДополнительныеПараметры.НаименованиеПолноеТовара; 	
						
					ИначеЕсли ТекПоле.Значение = "Идентификатор раздела" Тогда
						
						НайденныеСтроки = ДополнительныеПараметры.ПривязкаТовараКРазделам.НайтиСтроки(Новый Структура("Номенклатура", ИнформацияОбъекта1С.Объект));
						
						Если НайденныеСтроки.Количество() = 0  Тогда	
							ЗначениеКлюча = "";
						ИначеЕсли НайденныеСтроки.Количество() = 1  Тогда	
							
							ИдентификаторРаздела = НайденныеСтроки[0].Идентификатор; 
							Если НЕ ЗначениеЗаполнено(ИдентификаторРаздела) И НЕ ЗначениеЗаполнено(СтруктураНастроек.ДеревоГрупп) Тогда
								ИдентификаторРаздела = СформироватьРазделТовараПоСсылке(СтруктураНастроек, ИнформацияОбъекта1С.Родитель);
							КонецЕсли;
							
							ЗначениеКлюча = ?(ЗначениеЗаполнено(ИдентификаторРаздела), ИдентификаторРаздела, ""); 
							
						ИначеЕсли НайденныеСтроки.Количество() > 1  Тогда	
							
							Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Товар " + ИнформацияОбъекта1С.НаименованиеНоменклатуры + " привязан к нескольким разделам. Будет указан первый.");
							
							ИдентификаторРаздела = НайденныеСтроки[0].Идентификатор;
							Если НЕ ЗначениеЗаполнено(ИдентификаторРаздела) И НЕ ЗначениеЗаполнено(СтруктураНастроек.ДеревоГрупп) Тогда
								ИдентификаторРаздела = СформироватьРазделТовараПоСсылке(СтруктураНастроек, ИнформацияОбъекта1С.Родитель);
							КонецЕсли;
							
							ЗначениеКлюча = ?(ЗначениеЗаполнено(ИдентификаторРаздела), ИдентификаторРаздела, ""); 
							
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Единица измерения товара" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.ИдентификаторЕдиницыИзмеренияБ24;	    
						
					ИначеЕсли ТекПоле.Значение = "Единица измерения предложения" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.ИдентификаторЕдиницыИзмеренияБ24;	
						
					ИначеЕсли ТекПоле.Значение = "Цена товара" Тогда
										
						Если ЗначениеЗаполнено(ИнформацияОбъекта1С.Цена) Тогда
							ЗначениеКлюча = XMLСтрока(ИнформацияОбъекта1С.Цена);
						Иначе
							ЗначениеКлюча = "0"; 
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "НДС включён в цену" Тогда
						
						ЗначениеКлюча = ?(ИнформацияОбъекта1С.ЦенаВключаетНДС = Истина,"Y","N"); 
						
					ИначеЕсли ТекПоле.Значение = "Идентификатор ставки НДС" Тогда
						
						СтавкаНДС = ИнформацияОбъекта1С.СтавкаНДС;	
						НайденнаяСтрока = СтруктураНастроек.ПресетыСтавокНДС.Найти(СтавкаНДС);
						Если НайденнаяСтрока <> Неопределено Тогда
							ЗначениеКлюча = НайденнаяСтрока.ИдСтавки;
						Иначе
							Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Ставка НДС: " + Строка(СтавкаНДС) + " не поддерживается модулем. В настройках синхронизации необходимо указать соответствие ставки НДС 1С И Битрикс24.");
						КонецЕсли;					
						
					ИначеЕсли ТекПоле.Значение = "Детальная картинка товара" Тогда
						
						ЗначениеКлюча = ""; 
						
					ИначеЕсли ТекПоле.Значение = "Картинка для анонса товара" Тогда
						
						ЗначениеКлюча = ""; 
				
					КонецЕсли;				
#КонецОбласти				
				ИначеЕсли ТекПоле.ВидСущности = "Товар2"  Тогда
 #Область Товары2
					Если ТекПоле.Значение = "Внешний код товара" Тогда
						
						ЗначениеКлюча = ДополнительныеПараметры.КлючЭлемента; 	
						
					ИначеЕсли ТекПоле.Значение = "Признак активности товара" Тогда
						
						ЗначениеКлюча = ?(ДополнительныеПараметры.Активный = Истина,"Y","N");     
						
					ИначеЕсли ТекПоле.Значение = "Признак доступности товара" Тогда
						
						ЗначениеКлюча = ?(ДополнительныеПараметры.Активный = Истина,"Y","N"); 
						
					ИначеЕсли ТекПоле.Значение = "Наименование товара" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.НаименованиеНоменклатуры; 	
						
					ИначеЕсли ТекПоле.Значение = "Тип текста описания анонса" Тогда
						
						ЗначениеКлюча = "text"; 
						
					ИначеЕсли ТекПоле.Значение = "Тип текста детального описания" Тогда
						
						ЗначениеКлюча = "text"; 	
						
					ИначеЕсли ТекПоле.Значение = "Описание для анонса" Тогда   
						
						ЗначениеКлюча = ИнформацияОбъекта1С.НаименованиеПолноеНоменклатуры; 	
						
					ИначеЕсли ТекПоле.Значение = "Детальное описание" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Описание; 	
						
					ИначеЕсли ТекПоле.Значение = "Идентификатор раздела" Тогда
						
						ЗначениеКлюча = "";	  
						
						НайденныеСтроки = ДополнительныеПараметры.ПривязкаТовараКРазделам.НайтиСтроки(Новый Структура("Номенклатура", ИнформацияОбъекта1С.Объект));
						
						Если НайденныеСтроки.Количество() = 1  Тогда	
							
							ИдентификаторРаздела = НайденныеСтроки[0].Идентификатор;  
							Если НЕ ЗначениеЗаполнено(ИдентификаторРаздела) Тогда
								Если СтруктураНастроек.НастройкиСинхронизацииТоваров.ИсточникИерархии = "Категории номенклатуры" Тогда    
									  ЗначениеКлюча = СформироватьРазделТовараПоСсылке(СтруктураНастроек, ИнформацияОбъекта1С.ВидНоменклатуры);
								ИначеЕсли СтруктураНастроек.НастройкиСинхронизацииТоваров.ИсточникИерархии = "Иерархия номенклатуры" Тогда      
									  ЗначениеКлюча = СформироватьРазделТовараПоСсылке(СтруктураНастроек, ИнформацияОбъекта1С.Родитель);
								КонецЕсли;	 
							Иначе
								ЗначениеКлюча = ИдентификаторРаздела;	
							КонецЕсли;
							
						ИначеЕсли НайденныеСтроки.Количество() > 1  Тогда	
							Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Товар " + ИнформацияОбъекта1С.НаименованиеНоменклатуры + " привязан к нескольким разделам. Будет указан первый.");
							ИдентификаторРаздела = НайденныеСтроки[0].Идентификатор;
							ЗначениеКлюча = ?(ЗначениеЗаполнено(ИдентификаторРаздела), ИдентификаторРаздела, "");
						КонецЕсли;
										
					ИначеЕсли ТекПоле.Значение = "Единица измерения товара" Тогда
						
						ЗначениеКлюча = "";
						Если ЗначениеЗаполнено(ИнформацияОбъекта1С.ИдентификаторЕдиницыИзмеренияБ24) Тогда
							ЗначениеКлюча = ИнформацияОбъекта1С.ИдентификаторЕдиницыИзмеренияБ24; 
						Иначе
							Если ЗначениеЗаполнено(ИнформацияОбъекта1С.ЕдиницаИзмерения) Тогда
								РегистрыСведений.Б24_КС_ТаблицаИзменений.ДобавитьОбъектВТаблицуИзменений(СтруктураНастроек.НастройкаПодключения,   
								СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения2, ИнформацияОбъекта1С.ЕдиницаИзмерения,, СтруктураНастроек.ВремяЗапускаВМиллисекундах+100);  
							КонецЕсли;
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "НДС включён в цену" Тогда
						
						ЗначениеКлюча = ?(ДополнительныеПараметры.ЦенаВключаетНДС = Истина,"Y","N"); 
						
					ИначеЕсли ТекПоле.Значение = "Идентификатор ставки НДС" Тогда
						
						СтавкаНДС = ИнформацияОбъекта1С.СтавкаНДС;	
						
						НайденнаяСтрока = СтруктураНастроек.ПресетыСтавокНДС.Найти(СтавкаНДС);
						Если НайденнаяСтрока <> Неопределено Тогда
							ЗначениеКлюча = НайденнаяСтрока.ИдСтавки;
						Иначе
							Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Ставка НДС: " + Строка(СтавкаНДС) + " не поддерживается модулем. В настройках синхронизации необходимо указать соответствие ставки НДС 1С И Битрикс24.");
						КонецЕсли;					
						
					ИначеЕсли ТекПоле.Значение = "Вес товара" Тогда 
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Вес*1000; 	
						
					ИначеЕсли ТекПоле.Значение = "Ширина товара" Тогда                   
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Ширина*1000; 
						
					ИначеЕсли ТекПоле.Значение = "Длина товара" Тогда     
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Длина*1000; 
						
					ИначеЕсли ТекПоле.Значение = "Высота товара" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Высота*1000; 	
						
					КонецЕсли;				
#КонецОбласти	
				ИначеЕсли ТекПоле.ВидСущности = "Предложение"  Тогда
#Область Предложения
					Если ТекПоле.Значение = "Внешний код предложения" Тогда
						
						ЗначениеКлюча = ДополнительныеПараметры.КлючЭлемента; 	
						
					ИначеЕсли ТекПоле.Значение = "Признак активности предложения" Тогда
						
						ЗначениеКлюча = ?(ДополнительныеПараметры.Активный = Истина,"Y","N");     
						
					ИначеЕсли ТекПоле.Значение = "Признак доступности предложения" Тогда
						
						ЗначениеКлюча = ?(ДополнительныеПараметры.Активный = Истина,"Y","N");     
						
					ИначеЕсли ТекПоле.Значение = "Наименование предложения" Тогда
						
						Если НЕ ЗначениеЗаполнено(ИнформацияОбъекта1С.НаименованиеПредложения) Тогда 
							ЗначениеКлюча = ИнформацияОбъекта1С.НаименованиеТовара;	
						Иначе
							ЗначениеКлюча = ИнформацияОбъекта1С.НаименованиеТовара+" ("+ИнформацияОбъекта1С.НаименованиеПредложения+")"; 
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Краткое наименование предложения" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.НаименованиеПредложения; 
						
					ИначеЕсли ТекПоле.Значение = "Тип текста описания анонса" Тогда
						
						ЗначениеКлюча = "text"; 
						
					ИначеЕсли ТекПоле.Значение = "Тип текста детального описания" Тогда
						
						ЗначениеКлюча = "text"; 	
						
					ИначеЕсли ТекПоле.Значение = "Описание для анонса" Тогда   
						
						Если НЕ ЗначениеЗаполнено(ИнформацияОбъекта1С.НаименованиеПолное) Тогда 
							ЗначениеКлюча = ИнформацияОбъекта1С.НаименованиеПолноеТовара; 
						Иначе
							ЗначениеКлюча = ИнформацияОбъекта1С.НаименованиеПолное; 
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Детальное описание" Тогда
						
						Если НЕ ЗначениеЗаполнено(ИнформацияОбъекта1С.НаименованиеПолное) Тогда 
							ЗначениеКлюча = ИнформацияОбъекта1С.ОписаниеТовара; 
						Иначе
							ЗначениеКлюча = ИнформацияОбъекта1С.НаименованиеПолное; 
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Единица измерения предложения" ИЛИ ТекПоле.Значение = "Единица измерения товара" Тогда
						
						ЗначениеКлюча = "";
						Если ЗначениеЗаполнено(ИнформацияОбъекта1С.ИдентификаторЕдиницыИзмеренияБ24) Тогда
							ЗначениеКлюча = ИнформацияОбъекта1С.ИдентификаторЕдиницыИзмеренияБ24; 
						Иначе
							Если ЗначениеЗаполнено(ИнформацияОбъекта1С.ЕдиницаИзмерения) Тогда
								РегистрыСведений.Б24_КС_ТаблицаИзменений.ДобавитьОбъектВТаблицуИзменений(СтруктураНастроек.НастройкаПодключения,  
								СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения2, ИнформацияОбъекта1С.ЕдиницаИзмерения,, СтруктураНастроек.ВремяЗапускаВМиллисекундах+100);  
							КонецЕсли;
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "НДС включён в цену" Тогда
						
						ЗначениеКлюча = ?(ДополнительныеПараметры.ЦенаВключаетНДС = Истина,"Y","N"); 
						
					ИначеЕсли ТекПоле.Значение = "Идентификатор ставки НДС" Тогда
						
						СтавкаНДС = ИнформацияОбъекта1С.СтавкаНДС;	
						
						НайденнаяСтрока = СтруктураНастроек.ПресетыСтавокНДС.Найти(СтавкаНДС);
						Если НайденнаяСтрока <> Неопределено Тогда
							ЗначениеКлюча = НайденнаяСтрока.ИдСтавки;
						Иначе
							Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Ставка НДС: " + Строка(СтавкаНДС) + " не поддерживается модулем. В настройках синхронизации необходимо указать соответствие ставки НДС 1С И Битрикс24.");
						КонецЕсли;					
						
					ИначеЕсли ТекПоле.Значение = "Вес предложения" Тогда 
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Вес*1000; 	
						
					ИначеЕсли ТекПоле.Значение = "Ширина предложения" Тогда                   
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Ширина*1000; 
						
					ИначеЕсли ТекПоле.Значение = "Длина предложения" Тогда     
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Длина*1000; 
						
					ИначеЕсли ТекПоле.Значение = "Высота предложения" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Высота*1000; 	
						
					КонецЕсли;				
#КонецОбласти	
				ИначеЕсли ТекПоле.ВидСущности = "Проект" Тогда
#Область Сделки
					Если ТекПоле.Значение = "Дата начала" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Дата; 
						
						Если СтруктураНастроек.НастройкиСинхронизацииСделок.ИсточникДатыДокумента = "По данным с Битрикс24" Тогда
							ДатаВыставленияБ24 = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойств", СсылкаНаОбъект1С, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоДатаСделкиБитрикс24);
							Если ЗначениеЗаполнено(ДатаВыставленияБ24) Тогда
								ЗначениеКлюча = ДатаВыставленияБ24; 
							КонецЕсли;
						КонецЕсли;					
						
					ИначеЕсли ТекПоле.Значение = "Номер Проекты" Тогда
						
						ЗначениеКлюча = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ИнформацияОбъекта1С.Номер); 
										
						Если СтруктураНастроек.НастройкиСинхронизацииСделок.ИсточникНомераДокумента = "По данным с Битрикс24" Тогда
							НомерСделкиБ24 = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойств", СсылкаНаОбъект1С, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоНомерСделкиБитрикс24);
							Если ЗначениеЗаполнено(НомерСделкиБ24) Тогда
								Поля.Вставить("ID", НомерСделкиБ24);  	
							КонецЕсли;
						КонецЕсли;					
						
					ИначеЕсли ТекПоле.Значение = "Дата завершения" Тогда
						
						Если ЗначениеЗаполнено(ИнформацияОбъекта1С.ДатаОтгрузки) Тогда
							ЗначениеКлюча = ИнформацияОбъекта1С.ДатаОтгрузки;  	
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Идентификатор привязанной компании" Тогда
						
						Если СтруктураНастроек.ТипыКонтрагентовДляКонтактов.Найти(ИнформацияОбъекта1С.ТипПартнера) <> Неопределено Тогда
							ЗначениеКлюча = "0";
						Иначе
												
							Если ЗначениеЗаполнено(ИнформацияОбъекта1С.ИдентификаторБ24Партнера) Тогда
								
								ЗначениеКлюча = ИнформацияОбъекта1С.ИдентификаторБ24Партнера;
								
							Иначе
								
								ЗначениеКлюча = РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.Компания, ИнформацияОбъекта1С.Партнер, Неопределено);  
								Если НЕ ЗначениеЗаполнено(ЗначениеКлюча) Тогда
									Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Не найден идентификатор партнера(компании): " + Строка(ИнформацияОбъекта1С.Партнер) + ". Его необходимо повторно выгрузить на Битрикс24");
									ЗначениеКлюча = СформироватьКомпаниюПоСсылке(СтруктураНастроек, ИнформацияОбъекта1С.Партнер);
								КонецЕсли;
								
							КонецЕсли;    					
												
						КонецЕсли;
										
					ИначеЕсли ТекПоле.Значение = "Идентификатор привязанного контакта" Тогда
						
						Если СтруктураНастроек.ТипыКонтрагентовДляКонтактов.Найти(ИнформацияОбъекта1С.ТипПартнера) <> Неопределено Тогда
												
							Если ЗначениеЗаполнено(ИнформацияОбъекта1С.ИдентификаторБ24Партнера) Тогда
								
								ЗначениеКлюча = ИнформацияОбъекта1С.ИдентификаторБ24Партнера;
								
							Иначе
								
								ЗначениеКлюча = РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.Контакт, ИнформацияОбъекта1С.Партнер, Неопределено);  
								Если НЕ ЗначениеЗаполнено(ЗначениеКлюча) Тогда
									Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Не найден идентификатор партнера(контакта): " + Строка(ИнформацияОбъекта1С.Партнер) + ". Его необходимо повторно выгрузить на Битрикс24");
									ЗначениеКлюча = СформироватьКонтактПоСсылке(СтруктураНастроек, ИнформацияОбъекта1С.Партнер);
								КонецЕсли;
								
							КонецЕсли;    					
												
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Идентификатор привязанного реквизита" Тогда
						
						Если ЗначениеЗаполнено(ИнформацияОбъекта1С.ИдентификаторБ24РеквизитаКонтрагента) Тогда
							ЗначениеКлюча = ИнформацияОбъекта1С.ИдентификаторБ24РеквизитаКонтрагента;  	
						Иначе
								
							ЗначениеКлюча = РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.Реквизит, ИнформацияОбъекта1С.Контрагент, Неопределено);  
							Если НЕ ЗначениеЗаполнено(ЗначениеКлюча) Тогда
								Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Не найден идентификатор контрагента(реквизит): " + Строка(ИнформацияОбъекта1С.Контрагент) + ". Повторно выгружается на Битрикс24");
								ЗначениеКлюча = СформироватьРеквизитПоСсылке(СтруктураНастроек, ИнформацияОбъекта1С.Контрагент);
							КонецЕсли;
							
						КонецЕсли;
	
					ИначеЕсли ТекПоле.Значение = "Идентификатор направления" Тогда
						
						ЗначениеКлюча = ДополнительныеПараметры.ИдНаправленияСделки;	
						
					ИначеЕсли ТекПоле.Значение = "Идентификатор стадии" Тогда						
#Область ПоискСтатусаСделки	
						Если СтруктураНастроек.НастройкиСинхронизацииСделок.Свойство("ИнформацияОСтатусах") Тогда
		
							ИнформацияОСтатусах = СтруктураНастроек.НастройкиСинхронизацииСделок.ИнформацияОСтатусах;
							ИдНаправлениеСделки = ДополнительныеПараметры.ИдНаправленияСделки;
							
							ПереводитьВСтатусКогдаОплачен 			= Неопределено;
							ПереводитьВСтатусКогдаОтгружен 			= Неопределено;
							ПереводитьВСтатусКогдаОплаченОтгружен 	= Неопределено;
							
							Если ИнформацияОСтатусах.Свойство("ПринудительныеСтатусы") Тогда
								Для Каждого ТекПринудительныйСтатус Из ИнформацияОСтатусах.ПринудительныеСтатусы Цикл
									
									Если ТекПринудительныйСтатус.ИдНаправления = ИдНаправлениеСделки Тогда
										
										Если ТекПринудительныйСтатус.НазначениеСтатуса = "Оплата" Тогда
											ПереводитьВСтатусКогдаОплачен = ТекПринудительныйСтатус.ИдСтатуса;	
										ИначеЕсли ТекПринудительныйСтатус.НазначениеСтатуса = "Отгрузка" Тогда
											ПереводитьВСтатусКогдаОтгружен = ТекПринудительныйСтатус.ИдСтатуса; 
										ИначеЕсли ТекПринудительныйСтатус.НазначениеСтатуса = "ОплатаОтгрузка" Тогда
											ПереводитьВСтатусКогдаОплаченОтгружен = ТекПринудительныйСтатус.ИдСтатуса; 
										КонецЕсли;	
									КонецЕсли;	
									
								КонецЦикла;
							КонецЕсли;
							
							Если ИнформацияОбъекта1С.ПроцентОтгрузки >= 100 И ИнформацияОбъекта1С.ПроцентОплаты >= 100 И ЗначениеЗаполнено(ПереводитьВСтатусКогдаОплаченОтгружен) Тогда
								
								ЗначениеКлюча = ПереводитьВСтатусКогдаОплаченОтгружен;
								
								ОбновитьСтатусДокумента(СтруктураНастроек, СсылкаНаОбъект1С, МенеджерВременныхТаблиц, ИнформацияОСтатусах, ПереводитьВСтатусКогдаОплаченОтгружен, ИдНаправлениеСделки);
								
							ИначеЕсли ИнформацияОбъекта1С.ПроцентОтгрузки >= 100 И ЗначениеЗаполнено(ПереводитьВСтатусКогдаОтгружен) Тогда
								
								ЗначениеКлюча = ПереводитьВСтатусКогдаОтгружен;
								
								ОбновитьСтатусДокумента(СтруктураНастроек, СсылкаНаОбъект1С, МенеджерВременныхТаблиц, ИнформацияОСтатусах, ПереводитьВСтатусКогдаОтгружен, ИдНаправлениеСделки);
								
							ИначеЕсли ИнформацияОбъекта1С.ПроцентОплаты >= 100 И ЗначениеЗаполнено(ПереводитьВСтатусКогдаОплачен) Тогда
								
								ЗначениеКлюча = ПереводитьВСтатусКогдаОплачен;
								
								ОбновитьСтатусДокумента(СтруктураНастроек, СсылкаНаОбъект1С, МенеджерВременныхТаблиц, ИнформацияОСтатусах, ПереводитьВСтатусКогдаОплачен, ИдНаправлениеСделки);
								
							Иначе
								
								НайденныеСтроки = Неопределено;
								тзнСтатусов		= Неопределено;
								Если ИнформацияОСтатусах.ИсточникСтатусов1С = "СвойствоЗаказов" Тогда
									
									Статус = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойств", СсылкаНаОбъект1С, ИнформацияОСтатусах.СвойствоЗаказов);
									тзнСтатусов = ИнформацияОСтатусах.СтатусыНаправленийЗначенийСвойств;
									
								ИначеЕсли ИнформацияОСтатусах.ИсточникСтатусов1С = "СтатусыЗаказов" Тогда
									
									Статус = ИнформацияОбъекта1С.Статус;
									тзнСтатусов = ИнформацияОСтатусах.СтатусыНаправленийСтатусов;
									
								ИначеЕсли ИнформацияОСтатусах.ИсточникСтатусов1С = "СостоянияЗаказов" Тогда
									
									Статус = ИнформацияОбъекта1С.Состояние;
									тзнСтатусов = ИнформацияОСтатусах.СтатусыНаправленийСостояний;
									
								КонецЕсли;
								
								Если ТипЗнч(тзнСтатусов) = Тип("ТаблицаЗначений") Тогда
									НайденныеСтроки = тзнСтатусов.НайтиСтроки(Новый Структура("Статус, ИдНаправления", Статус, ИдНаправлениеСделки));
								КонецЕсли;
								
								Если НайденныеСтроки <> Неопределено Тогда
									Если НайденныеСтроки.Количество() > 0 Тогда
										НайденнаяСтрока = НайденныеСтроки[0];
										Если НайденнаяСтрока <> Неопределено Тогда
											ЗначениеКлюча = НайденнаяСтрока.ИдСтатуса;
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
								
							КонецЕсли;
							
							Если ЭтоНовыйЭлемент И ЗначениеКлюча = Неопределено И ИнформацияОСтатусах.Свойство("СтатусПоУмолчанию") Тогда
								ДанныеСтатусаПоУм = СтрРазделить(ИнформацияОСтатусах.СтатусПоУмолчанию, "#"); 
								Если ДанныеСтатусаПоУм.Количество() > 1 Тогда
									ЗначениеКлюча = ДанныеСтатусаПоУм[1];	
								КонецЕсли;
							КонецЕсли;
							
						КонецЕсли;
	#КонецОбласти							
					ИначеЕсли ТекПоле.Значение = "Название" Тогда
						
						ТемаСделки = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойств", СсылкаНаОбъект1С, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоНазваниеТемыСделки);
						Если ЗначениеЗаполнено(ТемаСделки) Тогда
							ЗначениеКлюча = ТемаСделки;	
						Иначе        
							ЗначениеКлюча = "Заказ покупателя " + (ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ИнформацияОбъекта1С.Номер));	
						КонецЕсли;					
						
					ИначеЕсли ТекПоле.Значение = "Сумма" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.СуммаДокумента; 	
						
					ИначеЕсли ТекПоле.Значение = "Ставка налога" ИЛИ ТекПоле.Значение = "Сумма налога" Тогда
						
						ТоварыВрем = ДополнительныеПараметры.ТоварыСделки.Скопировать(,"Проект, СуммаНДС");
						ТоварыВрем.Свернуть("Проект", "СуммаНДС");
						Если ТоварыВрем.Количество() > 0 Тогда
							ЗначениеКлюча = ТоварыВрем[0].СуммаНДС;
						Иначе
							ЗначениеКлюча = "0";
						КонецЕсли;
					КонецЕсли;
#КонецОбласти
				ИначеЕсли ТекПоле.ВидСущности = "Счет" Тогда
				ИначеЕсли ТекПоле.ВидСущности = "Заказ" Тогда
#Область Заказы
					Если ТекПоле.Значение = "Идентификатор" Тогда
	
						ЗначениеКлюча = ДополнительныеПараметры.ИдентификаторБ24;  	
		
					ИначеЕсли ТекПоле.Значение = "Внешний идентификатор" Тогда
						
						ЗначениеКлюча = ДополнительныеПараметры.КлючЭлемента;	
						
					ИначеЕсли ТекПоле.Значение = "Дата, до которой необходимо оплатить счет" Тогда
						
						ЗначениеКлюча = "";
						
						ДополнительныеДанныеОЗаказе = ДополнительныеПараметры.ДополнительныеДанныеОЗаказе;
						Если ТипЗнч(ДополнительныеДанныеОЗаказе) = Тип("Соответствие") Тогда
							ЗначениеКлюча = ДополнительныеПараметры.ДополнительныеДанныеОЗаказе.Получить("datePayBefore");	
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Идентификатор статуса" Тогда
						
						ИдСтатуса = "";
						
						ДополнительныеДанныеОЗаказе = ДополнительныеПараметры.ДополнительныеДанныеОЗаказе;
						Если ТипЗнч(ДополнительныеДанныеОЗаказе) = Тип("Соответствие") Тогда
							ИдСтатуса = ДополнительныеПараметры.ДополнительныеДанныеОЗаказе.Получить("statusId");	
						КонецЕсли;
						
						
						Если СтруктураНастроек.НастройкиСинхронизацииЗаказов.Свойство("ИнформацияОСтатусах") Тогда
							
							ИнформацияОСтатусах = СтруктураНастроек.НастройкиСинхронизацииЗаказов.ИнформацияОСтатусах;
							
							ПереводитьВСтатусКогдаОплачен 	= ИнформацияОСтатусах.ПереводитьВСтатусКогдаОплаченЗаказ;
							ПереводитьВСтатусКогдаОтгружен 	= ИнформацияОСтатусах.ПереводитьВСтатусКогдаОтгруженЗаказ;
							
							Если ИнформацияОСтатусах.Свойство("ПереводитьВСтатусКогдаОплаченОтгруженЗаказ") Тогда
								ПереводитьВСтатусКогдаОплаченОтгружен = ИнформацияОСтатусах.ПереводитьВСтатусКогдаОплаченОтгруженЗаказ;
							Иначе
								ПереводитьВСтатусКогдаОплаченОтгружен = "";
							КонецЕсли;
							
							Если ИнформацияОбъекта1С.ПроцентОтгрузки >= 100 И ИнформацияОбъекта1С.ПроцентОплаты >= 1000 И ЗначениеЗаполнено(ПереводитьВСтатусКогдаОплаченОтгружен) Тогда
								
								ИдСтатуса = ПереводитьВСтатусКогдаОплаченОтгружен;  
								ОбновитьСтатусДокумента(СтруктураНастроек, ИнформацияОбъекта1С.Объект, МенеджерВременныхТаблиц, ИнформацияОСтатусах, ПереводитьВСтатусКогдаОплаченОтгружен);
								
							ИначеЕсли ИнформацияОбъекта1С.ПроцентОтгрузки >= 100 И ЗначениеЗаполнено(ПереводитьВСтатусКогдаОтгружен) Тогда
								
								ИдСтатуса = ПереводитьВСтатусКогдаОтгружен;  	
								ОбновитьСтатусДокумента(СтруктураНастроек, ИнформацияОбъекта1С.Объект, МенеджерВременныхТаблиц, ИнформацияОСтатусах, ПереводитьВСтатусКогдаОтгружен);
								
							ИначеЕсли ИнформацияОбъекта1С.ПроцентОплаты >= 100 И ЗначениеЗаполнено(ПереводитьВСтатусКогдаОплачен) Тогда
								
								ИдСтатуса = ПереводитьВСтатусКогдаОплачен;  
								ОбновитьСтатусДокумента(СтруктураНастроек, ИнформацияОбъекта1С.Объект, МенеджерВременныхТаблиц, ИнформацияОСтатусах, ПереводитьВСтатусКогдаОплачен);
								
							Иначе
								
								Если ИнформацияОСтатусах.ИсточникСтатусовЗаказов = "СвойствоЗаказов" Тогда
									Статус = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойств", ИнформацияОбъекта1С.Объект, ИнформацияОСтатусах.СвойствоЗаказа);
									тзнСтатусов = ИнформацияОСтатусах.СоответствияСЗначениямиСвойствЗаказа;
									
								Иначе
									Статус = ИнформацияОбъекта1С.Состояние;
									тзнСтатусов = ИнформацияОСтатусах.СоответствияССостояниямиЗаказа;
								КонецЕсли;
								
								Если ТипЗнч(тзнСтатусов) = Тип("ТаблицаЗначений") Тогда
									НайденныеСтроки = тзнСтатусов.НайтиСтроки(Новый Структура("Статус", Статус));
									Если НайденныеСтроки.Количество() >0 Тогда
										НайденнаяСтрока = НайденныеСтроки[0];	
									Иначе
										НайденнаяСтрока = Неопределено;	
									КонецЕсли;
									
									Если НайденнаяСтрока <> Неопределено Тогда
										ИдСтатуса = НайденнаяСтрока.ИдСтатуса;  	
									КонецЕсли;
								КонецЕсли;
								
							КонецЕсли;
						КонецЕсли;					
						
						ЗначениеКлюча = ИдСтатуса;
						
					ИначеЕсли ТекПоле.Значение = "ID ответственного" Тогда
						
						ИдОтветственного = "";
						
						ДополнительныеДанныеОЗаказе = ДополнительныеПараметры.ДополнительныеДанныеОЗаказе;
						Если ТипЗнч(ДополнительныеДанныеОЗаказе) = Тип("Соответствие") Тогда
							ИдОтветственного = ДополнительныеПараметры.ДополнительныеДанныеОЗаказе.Получить("responsibleId");	
						КонецЕсли;
						
						Если ЗначениеЗаполнено(ИнформацияОбъекта1С.Ответственный) Тогда
							НайденнаяСтрока = СтруктураНастроек.ТаблицаСопоставленияПользователей.Найти(ИнформацияОбъекта1С.Ответственный);
							Если НайденнаяСтрока<> Неопределено Тогда
								ИдОтветственного = НайденнаяСтрока.ИдПользователя; 
							КонецЕсли;
						КонецЕсли;			
						
						ЗначениеКлюча = ИдОтветственного;
						
					ИначеЕсли ТекПоле.Значение = "Номер документа отгрузки" Тогда
						
						ЗначениеКлюча = "";
						
						ДополнительныеДанныеОЗаказе = ДополнительныеПараметры.ДополнительныеДанныеОЗаказе;
						Если ТипЗнч(ДополнительныеДанныеОЗаказе) = Тип("Соответствие") Тогда
							ЗначениеКлюча = ДополнительныеПараметры.ДополнительныеДанныеОЗаказе.Получить("deliveryDocNum");	
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Дата выставления" Тогда
						
						ЗначениеКлюча = "";
						
						ДополнительныеДанныеОЗаказе = ДополнительныеПараметры.ДополнительныеДанныеОЗаказе;
						Если ТипЗнч(ДополнительныеДанныеОЗаказе) = Тип("Соответствие") Тогда
							ЗначениеКлюча = ДополнительныеПараметры.ДополнительныеДанныеОЗаказе.Получить("dateBill");	
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Причина отмены" Тогда
						
						ЗначениеКлюча = "";
						
						ДополнительныеДанныеОЗаказе = ДополнительныеПараметры.ДополнительныеДанныеОЗаказе;
						Если ТипЗнч(ДополнительныеДанныеОЗаказе) = Тип("Соответствие") Тогда
							ЗначениеКлюча = ДополнительныеПараметры.ДополнительныеДанныеОЗаказе.Получить("reasonCanceled");	
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Тема заказа" Тогда
						
						ЗначениеКлюча = "";
						
						ДополнительныеДанныеОЗаказе = ДополнительныеПараметры.ДополнительныеДанныеОЗаказе;
						Если ТипЗнч(ДополнительныеДанныеОЗаказе) = Тип("Соответствие") Тогда
							ЗначениеКлюча = ДополнительныеПараметры.ДополнительныеДанныеОЗаказе.Получить("orderTopic");	
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Пользовательское описание" Тогда
						
						КомментарийПользователя = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойств", СсылкаНаОбъект1С, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоКомментарияЗаказаБитрикс24);
						ЗначениеКлюча = КомментарийПользователя;	
						
					ИначеЕсли ТекПоле.Значение = "Комментарий" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Комментарий;	
						
					ИначеЕсли ТекПоле.Значение = "Отменен" Тогда
						
						ЗначениеКлюча = ?(ИнформацияОбъекта1С.ПометкаУдаления,"Y","N");
					
					КонецЕсли;						
#КонецОбласти				
				ИначеЕсли ТекПоле.ВидСущности = "Оплата" Тогда
#Область Оплаты
					Если ТекПоле.Значение = "Идентификатор оплаты" Тогда
						
						Если ЗначениеЗаполнено(ДополнительныеПараметры.ИдентификаторБ24) Тогда
							ЗначениеКлюча = ДополнительныеПараметры.ИдентификаторБ24;
						КонецЕсли;					
						
					ИначеЕсли ТекПоле.Значение = "Идентификатор заказа" Тогда
						
						ЗначениеКлюча = ДополнительныеПараметры.ИдентификаторЗаказаБ24
	
					ИначеЕсли ТекПоле.Значение = "Сумма оплаты" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.СуммаДокумента; 
						
					ИначеЕсли ТекПоле.Значение = "Внешний идентификатор" Тогда
						
						ЗначениеКлюча = ДополнительныеПараметры.КлючЭлемента;	
						
					ИначеЕсли ТекПоле.Значение = "Дата счета на оплату" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Дата; 
						
					ИначеЕсли ТекПоле.Значение = "Номер счета на оплаты" Тогда
						
						ЗначениеКлюча = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ИнформацияОбъекта1С.Номер); 
						
					ИначеЕсли ТекПоле.Значение = "Флаг оплаченности: Y или N" Тогда
						
						ЗначениеКлюча = ?(ИнформацияОбъекта1С.Проведен, "Y", "N");
						
					ИначеЕсли ТекПоле.Значение = "Комментарий" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Комментарий;
						
					ИначеЕсли ТекПоле.Значение = "Номер платежного документа" Тогда
						
						Если ИнформацияОбъекта1С.Проведен Тогда
							НомерПлатежногоДокумента = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ИнформацияОбъекта1С.Номер); 
						КонецЕсли;
						
						Если НЕ ЗначениеЗаполнено(НомерПлатежногоДокумента) Тогда
							ДополнительныеДанныеОплате = ДополнительныеПараметры.ДополнительныеДанныеОплате;	
							Если ДополнительныеДанныеОплате <> Неопределено Тогда
								НомерПлатежногоДокумента = ДополнительныеДанныеОплате.Получить("payVoucherNum");
							КонецЕсли;
						КонецЕсли;
						
						ЗначениеКлюча = НомерПлатежногоДокумента;
						
					ИначеЕсли ТекПоле.Значение = "Дата платежного документа" Тогда
						
						Если ИнформацияОбъекта1С.Проведен Тогда
							ДатаПлатежногоДокумента = ИнформацияОбъекта1С.Дата; 
						КонецЕсли;
						
						Если НЕ ЗначениеЗаполнено(ДатаПлатежногоДокумента) Тогда
							ДополнительныеДанныеОплате = ДополнительныеПараметры.ДополнительныеДанныеОплате;	
							Если ДополнительныеДанныеОплате <> Неопределено Тогда
								ДатаПлатежногоДокумента = ДополнительныеДанныеОплате.Получить("payVoucherDate");
							КонецЕсли;
						КонецЕсли;
						
						ЗначениеКлюча = ДатаПлатежногоДокумента;
						
					ИначеЕсли ТекПоле.Значение = "ID пользователя, ответственного за оплату" Тогда
						
						ДополнительныеДанныеОплате = ДополнительныеПараметры.ДополнительныеДанныеОплате;	
						Если ДополнительныеДанныеОплате <> Неопределено Тогда
							ЗначениеКлюча = ДополнительныеДанныеОплате.Получить("responsibleId");
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Дата документа возврата" Тогда
						
						ДополнительныеДанныеОплате = ДополнительныеПараметры.ДополнительныеДанныеОплате;	
						Если ДополнительныеДанныеОплате <> Неопределено Тогда
							ЗначениеКлюча = ДополнительныеДанныеОплате.Получить("payReturnDate");
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Дата назначения ответственного" Тогда
						
						ДополнительныеДанныеОплате = ДополнительныеПараметры.ДополнительныеДанныеОплате;	
						Если ДополнительныеДанныеОплате <> Неопределено Тогда
							ЗначениеКлюча = ДополнительныеДанныеОплате.Получить("dateResponsibleId");
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Дата, до которой необходимо оплатить счет (в магазине не используется)" Тогда
						
						ДополнительныеДанныеОплате = ДополнительныеПараметры.ДополнительныеДанныеОплате;	
						Если ДополнительныеДанныеОплате <> Неопределено Тогда
							ЗначениеКлюча = ДополнительныеДанныеОплате.Получить("datePayBefore");
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Комментарий к возврату" Тогда
						
						ДополнительныеДанныеОплате = ДополнительныеПараметры.ДополнительныеДанныеОплате;	
						Если ДополнительныеДанныеОплате <> Неопределено Тогда
							ЗначениеКлюча = ДополнительныеДанныеОплате.Получить("payReturnComment");
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "ID платежной системы" Тогда
						
						ИнформацияОПлатежнойСистеме = ДополнительныеПараметры.ИнформацияОПлатежнойСистеме;	
						Если ИнформацияОПлатежнойСистеме <> Неопределено Тогда
							ИдПлатежнойСистемы = ИнформацияОПлатежнойСистеме.Ид;
						КонецЕсли;						
						
						Если НЕ ЗначениеЗаполнено(ИдПлатежнойСистемы) Тогда
							ДополнительныеДанныеОплате = ДополнительныеПараметры.ДополнительныеДанныеОплате;	
							Если ДополнительныеДанныеОплате <> Неопределено Тогда
								ИдПлатежнойСистемы = ДополнительныеДанныеОплате.Получить("paySystemId");
							КонецЕсли;
						КонецЕсли;
						
						ЗначениеКлюча = ИдПлатежнойСистемы;	
						
					ИначеЕсли ТекПоле.Значение = "Название платежной системы" Тогда
						
						ИнформацияОПлатежнойСистеме = ДополнительныеПараметры.ИнформацияОПлатежнойСистеме;	
						Если ИнформацияОПлатежнойСистеме <> Неопределено Тогда
							НаименованиеПлатежнойСистемы = ИнформацияОПлатежнойСистеме.Наименование;
						КонецЕсли;						
						
						Если НЕ ЗначениеЗаполнено(НаименованиеПлатежнойСистемы) Тогда
							ДополнительныеДанныеОплате = ДополнительныеПараметры.ДополнительныеДанныеОплате;	
							Если ДополнительныеДанныеОплате <> Неопределено Тогда
								НаименованиеПлатежнойСистемы = ДополнительныеДанныеОплате.Получить("paySystemName");
							КонецЕсли;
						КонецЕсли;
						
						ЗначениеКлюча = НаименованиеПлатежнойСистемы;	
						
					ИначеЕсли ТекПоле.Значение = "Дата оплаты" Тогда
						
						ДополнительныеДанныеОплате = ДополнительныеПараметры.ДополнительныеДанныеОплате;	
						Если ДополнительныеДанныеОплате <> Неопределено Тогда
							ИнформацияОДатеОплаты = ДополнительныеДанныеОплате.Получить("datePaid");
							Если ЗначениеЗаполнено(ИнформацияОДатеОплаты) Тогда
								ЗначениеКлюча = ИнформацияОДатеОплаты;
							Иначе
								
								Если ИнформацияОбъекта1С.Проведен Тогда
									ЗначениеКлюча = ИнформацияОбъекта1С.Дата;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
								
					КонецЕсли;				
#КонецОбласти				
				ИначеЕсли ТекПоле.ВидСущности = "Отгрузка" Тогда
#Область Отгрузки
					Если ТекПоле.Значение = "Идентификатор отгрузки" Тогда
						
						Если ЗначениеЗаполнено(ДополнительныеПараметры.ИдентификаторБ24) Тогда
							ЗначениеКлюча = ДополнительныеПараметры.ИдентификаторБ24;
						КонецЕсли;					
						
					ИначеЕсли ТекПоле.Значение = "Идентификатор заказа" Тогда
						
						ЗначениеКлюча = ДополнительныеПараметры.ИдентификаторЗаказаБ24
	
					ИначеЕсли ТекПоле.Значение = "Внешний идентификатор" Тогда
						
						ЗначениеКлюча = ДополнительныеПараметры.КлючЭлемента;	
						
					ИначеЕсли ТекПоле.Значение = "ID пользователя, ответственного за отгрузку" Тогда
						
						ДополнительныеДанныеОтгрузке = ДополнительныеПараметры.ДополнительныеДанныеОтгрузке;	
						Если ДополнительныеДанныеОтгрузке <> Неопределено Тогда
							ЗначениеКлюча = ДополнительныеДанныеОтгрузке.Получить("responsibleId");
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Дата назначения ответственного" Тогда
						
						ДополнительныеДанныеОтгрузке = ДополнительныеПараметры.ДополнительныеДанныеОтгрузке;	
						Если ДополнительныеДанныеОтгрузке <> Неопределено Тогда
							ЗначениеКлюча = ДополнительныеДанныеОтгрузке.Получить("dateResponsibleId");
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Статус отправления" Тогда
						
						ДополнительныеДанныеОтгрузке = ДополнительныеПараметры.ДополнительныеДанныеОтгрузке;	
						Если ДополнительныеДанныеОтгрузке <> Неопределено Тогда
							ЗначениеКлюча = ДополнительныеДанныеОтгрузке.Получить("trackingStatus");
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Описание статуса отправления" Тогда
						
						ДополнительныеДанныеОтгрузке = ДополнительныеПараметры.ДополнительныеДанныеОтгрузке;	
						Если ДополнительныеДанныеОтгрузке <> Неопределено Тогда
							ЗначениеКлюча = ДополнительныеДанныеОтгрузке.Получить("trackingDescription");
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Дата последней проверки статуса отправления" Тогда
						
						ДополнительныеДанныеОтгрузке = ДополнительныеПараметры.ДополнительныеДанныеОтгрузке;	
						Если ДополнительныеДанныеОтгрузке <> Неопределено Тогда
							ЗначениеКлюча = ДополнительныеДанныеОтгрузке.Получить("trackingLastCheck");
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Флаг разрешения доставки: Y/N" Тогда
									
						ДоставкаРазрешена = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойствОтгрузок", ИнформацияОбъекта1С.Объект, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоДоставкаРазрешенаОтгрузкиБитрикс24);	
						ЗначениеКлюча = ?(ДоставкаРазрешена = Истина, "Y", "N");					
						
					ИначеЕсли ТекПоле.Значение = "Дата разрешения доставки" Тогда
						
						ДополнительныеДанныеОтгрузке = ДополнительныеПараметры.ДополнительныеДанныеОтгрузке;	
						Если ДополнительныеДанныеОтгрузке <> Неопределено Тогда
							ЗначениеКлюча = ДополнительныеДанныеОтгрузке.Получить("dateAllowDelivery");
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Флаг, установлена ли цена вручную" Тогда
						
						ЗначениеКлюча = "Y";
						
					ИначеЕсли ТекПоле.Значение = "Номер документа отгрузки" Тогда
						
						ЗначениеКлюча = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ИнформацияОбъекта1С.Номер); 
						
					ИначеЕсли ТекПоле.Значение = "Дата документа отгрузки" Тогда
						
						ЗначениеКлюча = ИнформацияОбъекта1С.Дата; 
						
					ИначеЕсли ТекПоле.Значение = "Флаг отгрузки: Y/N" Тогда
						
						ЗначениеКлюча = ?(ИнформацияОбъекта1С.Проведен, "Y", "N");
						
					ИначеЕсли ТекПоле.Значение = "Дата отгрузки" Тогда
						
						Если ИнформацияОбъекта1С.Проведен Тогда
							ЗначениеКлюча = ИнформацияОбъекта1С.Дата;
						КонецЕсли;		
						
					ИначеЕсли ТекПоле.Значение = "ID службы доставки" Тогда
						
					    ИдСлужбыДоставки = Неопределено;
						Если ДополнительныеПараметры.ИнформацияОДоставках <> Неопределено Тогда
							
							Доставка = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойствОтгрузок", ИнформацияОбъекта1С.Объект, ДополнительныеПараметры.ИнформацияОДоставках.СвойствоОтгрузки);
							НайденныеСтроки = ДополнительныеПараметры.ИнформацияОДоставках.СоответствияСЗначениямиСвойствОтгрузки.НайтиСтроки(Новый Структура("Служба", Доставка));
							
							Если НайденныеСтроки.Количество() > 0 Тогда
								ИдСлужбыДоставки = НайденныеСтроки[0].ИдСлужбы;  	
							КонецЕсли;
							
							Если НЕ ЗначениеЗаполнено(ИдСлужбыДоставки) И ЗначениеЗаполнено(ДополнительныеПараметры.ИдСлужбыДоставкиЗаказа) Тогда
								ИдСлужбыДоставки = ДополнительныеПараметры.ИдСлужбыДоставкиЗаказа;  	
							КонецЕсли;
							
						КонецЕсли;
						
						Если НЕ ЗначениеЗаполнено(ИдСлужбыДоставки) И ДополнительныеДанныеОтгрузке <> Неопределено Тогда
							ИдСлужбыДоставки = ДополнительныеДанныеОтгрузке.Получить("deliveryId");  	
						КонецЕсли;
						
						ЗначениеКлюча = ИдСлужбыДоставки;
						
					ИначеЕсли ТекПоле.Значение = "Название службы доставки" Тогда
									
						НаименованиеСлужбыДоставки 	= Неопределено;
						Если ДополнительныеПараметры.ИнформацияОДоставках <> Неопределено Тогда
							
							Доставка = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойствОтгрузок", ИнформацияОбъекта1С.Объект, ДополнительныеПараметры.ИнформацияОДоставках.СвойствоОтгрузки);
							НайденныеСтроки = ДополнительныеПараметры.ИнформацияОДоставках.СоответствияСЗначениямиСвойствОтгрузки.НайтиСтроки(Новый Структура("Служба", Доставка));
							
							Если НайденныеСтроки.Количество() > 0 Тогда
								НаименованиеСлужбыДоставки 	= НайденныеСтроки[0].НазваниеСлужбы;  	
							КонецЕсли;
							
							Если НЕ ЗначениеЗаполнено(НаименованиеСлужбыДоставки) И ЗначениеЗаполнено(ДополнительныеПараметры.ИдСлужбыДоставкиЗаказа) Тогда
								НаименованиеСлужбыДоставки 	= ДополнительныеПараметры.НаименованиеСлужбыДоставкиЗаказа;  	
							КонецЕсли;
							
						КонецЕсли;
						
						Если НЕ ЗначениеЗаполнено(НаименованиеСлужбыДоставки) И ДополнительныеДанныеОтгрузке <> Неопределено Тогда
							НаименованиеСлужбыДоставки 	= ДополнительныеДанныеОтгрузке.Получить("deliveryName");  	
						КонецЕсли;
						
						ЗначениеКлюча = НаименованиеСлужбыДоставки;
						
					ИначеЕсли ТекПоле.Значение = "Трэк-номер" ИЛИ ТекПоле.Значение = "Трек-номер" Тогда
							
						ТрекНомер = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойствОтгрузок", ИнформацияОбъекта1С.Объект, СтруктураНастроек.ПредопределенныеСвойства.ПредопределенноеСвойствоТрекНомераОтгрузкиБитрикс24);	
						Если НЕ ЗначениеЗаполнено(ТрекНомер) И ЗначениеЗаполнено(ДополнительныеПараметры.ТрекНомерЗаказа) Тогда
							ТрекНомер = ДополнительныеПараметры.ТрекНомерЗаказа;
						КонецЕсли;
						
						Если НЕ ЗначениеЗаполнено(ТрекНомер) И ДополнительныеПараметры.ДополнительныеДанныеОтгрузке <> Неопределено Тогда
							ТрекНомер = ДополнительныеПараметры.ДополнительныеДанныеОтгрузке.Получить("trackingNumber");  	
						КонецЕсли;
						
						Если ЗначениеЗаполнено(ТрекНомер) Тогда
							ЗначениеКлюча = ТрекНомер;
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Статус отгрузки" Тогда
	
					    ИдСтатусаОтгрузки = Неопределено;
						Если ДополнительныеПараметры.ИнформацияОСтатусах <> Неопределено Тогда
							
							КогдаОтгруженаОтгрузка = ДополнительныеПараметры.ИнформацияОСтатусах.ПереводитьВСтатусКогдаОтгруженаОтгрузка;
							
							Если ИнформацияОбъекта1С.Проведен И ЗначениеЗаполнено(КогдаОтгруженаОтгрузка) Тогда
								ИдСтатусаОтгрузки = КогдаОтгруженаОтгрузка;	
							Иначе
								ЗначениеСвойстваСтатусаОтгрузки = ПолучитьСвойствоИзВременнойТаблицы(СтруктураНастроек, МенеджерВременныхТаблиц, "ВТ_ТаблицаСвойствОтгрузок", ИнформацияОбъекта1С.Объект, ДополнительныеПараметры.ИнформацияОСтатусах.СвойствоОтгрузки);
								
								НайденныеСтроки = ДополнительныеПараметры.ИнформацияОСтатусах.СоответствияСЗначениямиСвойствОтгрузки.НайтиСтроки(Новый Структура("Статус", ЗначениеСвойстваСтатусаОтгрузки));
								
								Если НайденныеСтроки.Количество() > 0 Тогда
									ИдСтатусаОтгрузки = НайденныеСтроки[0].ИдСтатуса;  	
								КонецЕсли; 							
							КонецЕсли;
							
						КонецЕсли;
								
						Если НЕ ЗначениеЗаполнено(ИдСтатусаОтгрузки) И ДополнительныеПараметры.ДополнительныеДанныеОтгрузке <> Неопределено Тогда
							ИдСтатусаОтгрузки = ДополнительныеПараметры.ДополнительныеДанныеОтгрузке.Получить("statusId");  	
						КонецЕсли;
	
						Если ЗначениеЗаполнено(ИдСтатусаОтгрузки) Тогда
							ЗначениеКлюча = ИдСтатусаОтгрузки;
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Базовая стоимость доставки" Тогда
						
						ЗначениеКлюча = ?(ДополнительныеПараметры.БазоваяСуммаДоставки > 0, ДополнительныеПараметры.БазоваяСуммаДоставки, 0);
						
					ИначеЕсли ТекПоле.Значение = "Стоимость доставки" Тогда
						
						ЗначениеКлюча = ?(ДополнительныеПараметры.СуммаДоставки > 0, ДополнительныеПараметры.СуммаДоставки, 0);
						
					ИначеЕсли ТекПоле.Значение = "Сумма итоговой скидки/наценки для отгрузки" Тогда
						
						ЗначениеКлюча = ?(ДополнительныеПараметры.СкидкаДоставки > 0, ДополнительныеПараметры.СкидкаДоставки, 0);
						
					КонецЕсли;
#КонецОбласти						
				КонецЕсли;			

			ИначеЕсли ТекПоле.ИсточникДанных = "Из дополнительного реквизита" ИЛИ ТекПоле.ИсточникДанных = "Из дополнительного сведения" Тогда
				
				Если ТекПоле.ВидСущности = "Товар" ИЛИ ТекПоле.ВидСущности = "Товар2" ИЛИ ТекПоле.ВидСущности = "Предложение" Тогда
					
					Если ТекПоле.ВидСущности = "Товар" ИЛИ ТекПоле.ВидСущности = "Товар2" Тогда
						
						Запрос = Новый Запрос;
						Запрос.УстановитьПараметр("Свойство"	, ТекПоле.Значение);
						Запрос.УстановитьПараметр("Номенклатура", ДополнительныеПараметры.Номенклатура);
						Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
						ТекстЗапроса = "ВЫБРАТЬ
						|	ВТ_ЗначенияСвойствНоменклатуры.Значение КАК Значение,
						|	ВТ_ЗначенияСвойствНоменклатуры.ИдентификаторЗначенияСвойстваБ24 КАК ИдентификаторЗначенияСвойстваБ24,
						|	ВТ_ЗначенияСвойствНоменклатуры.ТипЗначения КАК ТипЗначения,
						|	ВТ_ЗначенияСвойствНоменклатуры.ДополнительныеЗначенияИспользуются КАК ДополнительныеЗначенияИспользуются
						|ИЗ
						|	ВТ_ЗначенияСвойствНоменклатуры КАК ВТ_ЗначенияСвойствНоменклатуры
						|ГДЕ
						|	ВТ_ЗначенияСвойствНоменклатуры.Свойство = &Свойство
						|	И ВТ_ЗначенияСвойствНоменклатуры.Номенклатура = &Номенклатура";   
						
						Если ТекПоле.ВидСущности = "Товар" Тогда  
							Запрос.УстановитьПараметр("Характеристика", ДополнительныеПараметры.Характеристика);
							ТекстЗапроса = ТекстЗапроса + "
							|
							|ОБЪЕДИНИТЬ ВСЕ
							|
							|ВЫБРАТЬ
							|	ВТ_ЗначенияСвойствХарактеристикНоменклатуры.Значение,
							|	ВТ_ЗначенияСвойствХарактеристикНоменклатуры.ИдентификаторЗначенияСвойстваБ24,
							|	ВТ_ЗначенияСвойствХарактеристикНоменклатуры.ТипЗначения,
							|	ВТ_ЗначенияСвойствХарактеристикНоменклатуры.ДополнительныеЗначенияИспользуются
							|ИЗ
							|	ВТ_ЗначенияСвойствХарактеристикНоменклатуры КАК ВТ_ЗначенияСвойствХарактеристикНоменклатуры
							|ГДЕ
							|	ВТ_ЗначенияСвойствХарактеристикНоменклатуры.Свойство = &Свойство
							|	И ВТ_ЗначенияСвойствХарактеристикНоменклатуры.Номенклатура = &Номенклатура
							|	И ВТ_ЗначенияСвойствХарактеристикНоменклатуры.Характеристика = &Характеристика";    
						КонецЕсли;
						
					ИначеЕсли ТекПоле.ВидСущности = "Предложение" Тогда	
						
						Запрос = Новый Запрос;
						Запрос.УстановитьПараметр("Свойство"		, ТекПоле.Значение);
						Запрос.УстановитьПараметр("Характеристика"	, ДополнительныеПараметры.Характеристика);
						Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
						ТекстЗапроса = "ВЫБРАТЬ
						|	ВТ_ЗначенияСвойствПредложений.Значение КАК Значение,
						|	ВТ_ЗначенияСвойствПредложений.ИдентификаторЗначенияСвойстваБ24 КАК ИдентификаторЗначенияСвойстваБ24,
						|	ВТ_ЗначенияСвойствПредложений.ТипЗначения КАК ТипЗначения,
						|	ВТ_ЗначенияСвойствПредложений.ДополнительныеЗначенияИспользуются КАК ДополнительныеЗначенияИспользуются
						|ИЗ
						|	ВТ_ЗначенияСвойствПредложений КАК ВТ_ЗначенияСвойствПредложений
						|ГДЕ
						|	ВТ_ЗначенияСвойствПредложений.Свойство = &Свойство
						|	И ВТ_ЗначенияСвойствПредложений.Характеристика = &Характеристика";    
						
					КонецЕсли;
					
					Запрос.Текст = ТекстЗапроса;
					Выборка = Запрос.Выполнить().Выбрать();
					
					Пока Выборка.Следующий() Цикл
						
						Если Выборка.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда	
							
							НайденнаяСтрока = СтруктураНастроек.ТаблицаСопоставленияПользователей.Найти(Выборка.Значение, "Пользователь1С");	
							Если НайденнаяСтрока <> Неопределено Тогда
								ЗначениеКлюча = НайденнаяСтрока.ИдПользователя;
							Иначе
								ЗначениеКлюча = "";	
							КонецЕсли;
							
						ИначеЕсли Выборка.ТипЗначения.СодержитТип(Тип("Булево")) Тогда	
							ЗначениеКлюча = ?(Выборка.Значение = Истина, "Y", "N");	
						Иначе
							
							Если Выборка.ДополнительныеЗначенияИспользуются Тогда
								Если ЗначениеЗаполнено(Выборка.ИдентификаторЗначенияСвойстваБ24) Тогда
									ЗначениеКлюча = Выборка.ИдентификаторЗначенияСвойстваБ24;
								Иначе
									ЗначениеКлюча = Строка(Выборка.Значение);	
								КонецЕсли;
							Иначе
								ЗначениеКлюча = Строка(Выборка.Значение);
							КонецЕсли;
						КонецЕсли;
						
					КонецЦикла;
					
				ИначеЕсли ТекПоле.ВидСущности = "Компания" ИЛИ ТекПоле.ВидСущности = "Контакт" 
					ИЛИ ТекПоле.ВидСущности = "Счет" ИЛИ ТекПоле.ВидСущности = "Счет2" ИЛИ ТекПоле.ВидСущности = "Проект" Тогда
						
					ЗапросЗначенийСвойств = Новый Запрос;
					ЗапросЗначенийСвойств.УстановитьПараметр("Объект"	, СсылкаНаОбъект1С);
					ЗапросЗначенийСвойств.УстановитьПараметр("Свойство"	, ТекПоле.Значение);
					
					ЗапросЗначенийСвойств.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
					ЗапросЗначенийСвойств.Текст = "ВЫБРАТЬ *
					|ИЗ
					|	ВТ_ЗначенияОбъектовСИд
					| ГДЕ
					| ВТ_ЗначенияОбъектовСИд.Объект = &Объект
					| И ВТ_ЗначенияОбъектовСИд.Свойство = &Свойство";
					ВыполненныйЗапросЗначенийСвойств = ЗапросЗначенийСвойств.Выполнить();	
					Если НЕ ВыполненныйЗапросЗначенийСвойств.Пустой() Тогда
						
						ВыборкаЗначенийСвойств = ВыполненныйЗапросЗначенийСвойств.Выбрать();
						Пока ВыборкаЗначенийСвойств.Следующий() Цикл
							
							Если ТекПоле.Значение.ДополнительныеЗначенияИспользуются Тогда
								
								Если ЗначениеЗаполнено(ВыборкаЗначенийСвойств.ИдентификаторЗначенияСвойстваБитрикс24) Тогда
									ЗначениеКлюча = ВыборкаЗначенийСвойств.ИдентификаторЗначенияСвойстваБитрикс24;
								Иначе
									ЗначениеКлюча = Строка(ВыборкаЗначенийСвойств.Значение);
								КонецЕсли;
								
							Иначе
								
								Если ТекПоле.Значение.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда	
									
									НайденнаяСтрока = СтруктураНастроек.ТаблицаСопоставленияПользователей.Найти(ВыборкаЗначенийСвойств.Значение, "Пользователь1С");	
									
									Если НайденнаяСтрока <> Неопределено Тогда
										ЗначениеКлюча = НайденнаяСтрока.ИдПользователя;
									Иначе
										ЗначениеКлюча = Строка(ВыборкаЗначенийСвойств.Значение);
									КонецЕсли;
									
								ИначеЕсли ТекПоле.Значение.ТипЗначения.СодержитТип(Тип("Булево")) Тогда	
									ЗначениеКлюча = ?(ВыборкаЗначенийСвойств.Значение = Истина, "Y", "N");
								Иначе
									ЗначениеКлюча = ВыборкаЗначенийСвойств.Значение; 
								КонецЕсли;
								
							КонецЕсли;
							
							Прервать;
						КонецЦикла;
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ТекПоле.ИсточникДанных = "<Свой алгоритм>" Тогда
				
				Параметры = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьСтруктуруПараметровПредопределенногоАлгоритма();
				Параметры.СтруктураНастроек = СтруктураНастроек;
				Параметры.Объект1С 			= СсылкаНаОбъект1С;
				Параметры.СтруктураДанных 	= Поля;

				ЗначениеКлюча = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПредопределенногоАлгоритма(ТекПоле.Значение, Параметры, "Функция");		
				
				Если Лев(ТекПоле.КлючЗапроса, 10) = "PARENT_ID_" ИЛИ Лев(ТекПоле.КлючЗапроса, 8) = "parentId" Тогда
					
					Если Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.ПодсистемаСуществует("СмартПроцессы") Тогда
						МодульВыгрузкаСервер = ОбщегоНазначения.ОбщийМодуль("Б24_СМ_ВыгрузкаСервер");
						ЗначениеКлюча = МодульВыгрузкаСервер.ПолучитьИдентификаторСмартПроцессаДляДругихПодсистем(СтруктураНастроек, ТекПоле.Идентификатор, ЗначениеКлюча);
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ТекПоле.ИсточникДанных = "Реквизит объекта" Тогда
				
				ЗначениеРеквизита 		= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(СсылкаНаОбъект1С, ТекПоле.Значение);
				ТипЗначенияРеквизита 	= ТипЗнч(ЗначениеРеквизита);
				
				Если ТипЗначенияРеквизита = Тип("Строка") ИЛИ ТипЗначенияРеквизита = Тип("Булево") ИЛИ ТипЗначенияРеквизита = Тип("Число")Тогда
					ЗначениеКлюча = ЗначениеРеквизита;
				ИначеЕсли ТипЗнч(ЗначениеРеквизита) = Тип("Дата") Тогда
					ЗначениеКлюча = ЗначениеРеквизита;	
				Иначе
					ЗначениеКлюча = Строка(ЗначениеРеквизита);		
				КонецЕсли;
				
				Если Лев(ТекПоле.КлючЗапроса,7) = "UF_CRM_" Тогда
					
					ЗапросЗначенийСвойств = Новый Запрос;
					ЗапросЗначенийСвойств.УстановитьПараметр("ДополнительныйИдентификаторБитрикс24"	, ТекПоле.КлючЗапроса);
					ЗапросЗначенийСвойств.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
					ЗапросЗначенийСвойств.Текст = "ВЫБРАТЬ *
					|ИЗ
					|	ВТ_ИдентификаторыПользовательскихПолей
					| ГДЕ
					| ВТ_ИдентификаторыПользовательскихПолей.ДополнительныйИдентификаторБитрикс24 = &ДополнительныйИдентификаторБитрикс24";
					ВыполненныйЗапросСвойств = ЗапросЗначенийСвойств.Выполнить();	
					Если НЕ ВыполненныйЗапросСвойств.Пустой() Тогда
						
						Выборка = ВыполненныйЗапросСвойств.Выбрать();
						Пока Выборка.Следующий() Цикл
							
							Если Выборка.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) Тогда
								
								НайденноеЗначение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Строка(ЗначениеРеквизита),Истина,, Выборка.Объект);
								Если ЗначениеЗаполнено(НайденноеЗначение) Тогда
								
									ЗапросЗначенийСвойств = Новый Запрос;
									ЗапросЗначенийСвойств.УстановитьПараметр("ЗначениеСвойства"	, НайденноеЗначение);
									ЗапросЗначенийСвойств.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
									ЗапросЗначенийСвойств.Текст = "ВЫБРАТЬ *
									|ИЗ
									|	ВТ_ИдентификаторыЗначенийПользовательскихПолей
									| ГДЕ
									| ВТ_ИдентификаторыЗначенийПользовательскихПолей.Объект = &ЗначениеСвойства";
									ВыполненныйЗапросЗначенийСвойств = ЗапросЗначенийСвойств.Выполнить();	
									Если НЕ ВыполненныйЗапросЗначенийСвойств.Пустой() Тогда
										Выборка = ВыполненныйЗапросЗначенийСвойств.Выбрать();
										Пока Выборка.Следующий() Цикл
											ЗначениеКлюча = Выборка.Идентификатор;
											Прервать;
										КонецЦикла;
										
									КонецЕсли;
									
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЦикла;
						
						
					КонецЕсли;
					
				ИначеЕсли Лев(ТекПоле.КлючЗапроса, 10) = "PARENT_ID_" ИЛИ Лев(ТекПоле.КлючЗапроса, 8) = "parentId" Тогда
					
					Если Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.ПодсистемаСуществует("СмартПроцессы") Тогда
						МодульВыгрузкаСервер = ОбщегоНазначения.ОбщийМодуль("Б24_СМ_ВыгрузкаСервер");
						ЗначениеКлюча = МодульВыгрузкаСервер.ПолучитьИдентификаторСмартПроцессаДляДругихПодсистем(СтруктураНастроек, ТекПоле.Идентификатор, ЗначениеРеквизита);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
		Исключение                                                                                                                              
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, ТекПоле.ВидСущности + "/" + ТекПоле.Значение + "/" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Поля.Вставить(ТекПоле.КлючЗапроса, ЗначениеКлюча);
		
	КонецЦикла;
		
	Возврат Поля;	
	
КонецФункции

Функция ПолучитьСтруктуруКлючейТЧЭлементаВыгрузки(СтруктураНастроек, ДополнительныеПараметры)
	
	ИнформацияОПолях 		= ДополнительныеПараметры.ИнформацияОПолях;
	МенеджерВременныхТаблиц = ДополнительныеПараметры.МенеджерВременныхТаблиц;
	ИнформацияОбъекта1С 	= ДополнительныеПараметры.ИнформацияОбъекта1С;
	ЭтоНовыйЭлемент 		= ДополнительныеПараметры.ЭтоНовыйЭлемент;
	КлючЭлемента 			= ДополнительныеПараметры.КлючЭлемента;
	Товары					= ДополнительныеПараметры.Товары;
	ИнформацияСтрокиТЧ		= ДополнительныеПараметры.ИнформацияСтрокиТЧ;
	
	СсылкаНаОбъект1С 		= ИнформацияОбъекта1С.Объект;
	
	Поля = Новый Структура;
	
	Для каждого ТекПоле Из ИнформацияОПолях Цикл
		
		Если ТекПоле.ИсточникДанных	= "" ИЛИ ТекПоле.ИсточникДанных = "Не изменять" Тогда		
			Продолжить;
		КонецЕсли;   
		
		Если НЕ ЗначениеЗаполнено(ТекПоле.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеКлюча = Неопределено;
		
		Попытка
			
			Если ТекПоле.ИсточникДанных = "Фиксированное значение" Тогда
				
				ЗначениеКлюча = ТекПоле.Значение;	      
				
			ИначеЕсли ТекПоле.ИсточникДанных = "Предопределенный алгоритм" Тогда
			
#Область ОбщиеАлгоритмы		
				Если ТекПоле.Значение = "Количество" Тогда
					
					ЗначениеКлюча = ИнформацияСтрокиТЧ.Количество;
					
				ИначеЕсли ТекПоле.Значение = "НДС включён в цену ('Y' или 'N')" Тогда
					
					ЗначениеКлюча = ?(ИнформацияОбъекта1С.ЦенаВключаетНДС, "Y", "N");
					
				ИначеЕсли ТекПоле.Значение = "Ставка НДС/100" Тогда
					
					СтавкаНДС = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьСтавкуПоНДС(ИнформацияСтрокиТЧ.СтавкаНДС);
					Если СтавкаНДС = "" Тогда     
						ЗначениеКлюча = Неопределено;	
					Иначе
						ЗначениеКлюча = СтавкаНДС/100; 
					КонецЕсли;
					
				ИначеЕсли ТекПоле.Значение = "Код единицы измерения" Тогда
					
					ЗначениеКлюча = СокрЛП(ИнформацияСтрокиТЧ.КодЕдИзм);	
					
				ИначеЕсли ТекПоле.Значение = "Условное обозначение единицы измерения" Тогда
					
					ЗначениеКлюча = ИнформацияСтрокиТЧ.НаименованиеЕдиницыИзмерения;	      
					
				ИначеЕсли ТекПоле.Значение = "Наименование товарной позиции" Тогда
					
					ПолноеОписаниеТовара = "";	
					
					Если НЕ ЗначениеЗаполнено(ИнформацияСтрокиТЧ.Характеристика) Тогда
						ПолноеОписаниеТовара = ИнформацияСтрокиТЧ.НаименованиеПолноеНоменклатуры; 
					Иначе      
						ПолноеОписаниеТовара = ИнформацияСтрокиТЧ.НаименованиеТовара + " (" + ИнформацияСтрокиТЧ.НаименованиеХарактеристики + ")"; 
					КонецЕсли;
					
					ЗначениеКлюча = ПолноеОписаниеТовара;
					
				ИначеЕсли ТекПоле.Значение = "Идентификатор товара в каталоге" Тогда    
					
					Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда
						
						Если ЗначениеЗаполнено(ИнформацияСтрокиТЧ.ИдентификаторБ24Предложения) Тогда
							ЗначениеКлюча = ИнформацияСтрокиТЧ.ИдентификаторБ24Предложения;
						ИначеЕсли ЗначениеЗаполнено(ИнформацияСтрокиТЧ.ИдентификаторБ24Товара) Тогда
							ЗначениеКлюча = ИнформацияСтрокиТЧ.ИдентификаторБ24Товара;
						Иначе   
							
							ЗначениеКлюча = РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.Предложение, ИнформацияСтрокиТЧ.Номенклатура, ИнформацияСтрокиТЧ.Характеристика);  
							Если НЕ ЗначениеЗаполнено(ЗначениеКлюча) Тогда
								Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Не найден идентификатор предложения: " 
								+ Строка(ИнформацияСтрокиТЧ.Номенклатура) + " - "+ Строка(ИнформацияСтрокиТЧ.Характеристика) + ". Будет повторно выгружен в Битрикс24");
								ЗначениеКлюча = СформироватьТоварПоСсылке(СтруктураНастроек, ИнформацияСтрокиТЧ.Номенклатура, ИнформацияСтрокиТЧ.Характеристика);
							КонецЕсли;
								
						КонецЕсли;   
						
					Иначе
						
						Если ЗначениеЗаполнено(ИнформацияСтрокиТЧ.ИдентификаторБ24Товара) Тогда
							ЗначениеКлюча = ИнформацияСтрокиТЧ.ИдентификаторБ24Товара;
						Иначе
								
							ЗначениеКлюча = РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.Товар, ИнформацияСтрокиТЧ.Номенклатура, ИнформацияСтрокиТЧ.Характеристика);  
							Если НЕ ЗначениеЗаполнено(ЗначениеКлюча) Тогда
								Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Не найден идентификатор товара: " + Строка(ИнформацияСтрокиТЧ.Номенклатура) + ". Будет повторно выгружен в Битрикс24");
								ЗначениеКлюча = СформироватьТоварПоСсылке(СтруктураНастроек, ИнформацияСтрокиТЧ.Номенклатура, ИнформацияСтрокиТЧ.Характеристика);
							КонецЕсли;
								
						КонецЕсли;   
						
					КонецЕсли;
					
				ИначеЕсли ТекПоле.Значение = "Внешний код товарной позиции" Тогда
								
					Если НЕ ЗначениеЗаполнено(ИнформацияСтрокиТЧ.Характеристика) Тогда
						XMLТовара			= XMLСтрока(ИнформацияСтрокиТЧ.Номенклатура);
					Иначе
						XMLТовара			= XMLСтрока(ИнформацияСтрокиТЧ.Номенклатура) + "#" + XMLСтрока(ИнформацияСтрокиТЧ.Характеристика);
					КонецЕсли;	
					
					ЗначениеКлюча = XMLТовара;
					
				ИначеЕсли ТекПоле.Значение = "Признак кастомной цены" Тогда
					
					ЗначениеКлюча = "Y";
					
				ИначеЕсли ТекПоле.Значение = "Символьный код валюты" Тогда
					
					ВалютаСимвольныйКод = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьВалютуПоКоду(Лев(ИнформацияОбъекта1С.ВалютаКод, 3));
					Если ЗначениеЗаполнено(ВалютаСимвольныйКод) Тогда
						ЗначениеКлюча = ВалютаСимвольныйКод;
					КонецЕсли;	
					
				КонецЕсли;				
#КонецОбласти					
				
				Если ТекПоле.ВидСущности = "Проект" Тогда		
#Область Сделка		
					Если ТекПоле.Значение = "Идентификатор позиции товара" Тогда
			
						Если ЗначениеЗаполнено(ИнформацияСтрокиТЧ.Б24_К_ИдентификаторПозиции) Тогда
							ЗначениеКлюча = ИнформацияСтрокиТЧ.Б24_К_ИдентификаторПозиции;
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Описание товарной позиции" Тогда
						
						ОписаниеТовара = "";			
						Если НЕ ЗначениеЗаполнено(ИнформацияСтрокиТЧ.Характеристика) Тогда
							ОписаниеТовара = ИнформацияСтрокиТЧ.НаименованиеНоменклатуры; 
						Иначе      
							ОписаниеТовара = ИнформацияСтрокиТЧ.НаименованиеНоменклатуры + " (" + ИнформацияСтрокиТЧ.НаименованиеХарактеристики + ")";
						КонецЕсли;
						
						ЗначениеКлюча = ОписаниеТовара;
						
					ИначеЕсли ТекПоле.Значение = "Цена" Тогда
						
						Если ИнформацияОбъекта1С.СуммаВключаетНДС = Истина Тогда
							ЗначениеКлюча = ИнформацияСтрокиТЧ.Сумма/ИнформацияСтрокиТЧ.Количество;	      
						Иначе
							ЗначениеКлюча = (ИнформацияСтрокиТЧ.Сумма+ИнформацияСтрокиТЧ.СуммаНДС)/ИнформацияСтрокиТЧ.Количество;	      
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Цена без налога и без скидки" Тогда
						
						Если ИнформацияОбъекта1С.СуммаВключаетНДС = Истина Тогда
							
							ЦенаБезСкидкиСНалогом = ИнформацияСтрокиТЧ.Сумма/ИнформацияСтрокиТЧ.Количество+ИнформацияСтрокиТЧ.СуммаРучнойСкидки/ИнформацияСтрокиТЧ.Количество;
							
							ЗначениеКлюча = ЦенаБезСкидкиСНалогом/(ИнформацияСтрокиТЧ.СтавкаНДС.Ставка+100)*100;
							
						Иначе
							
							ЗначениеКлюча = (ИнформацияСтрокиТЧ.Сумма+ИнформацияСтрокиТЧ.СуммаРучнойСкидки)/ИнформацияСтрокиТЧ.Количество;
							
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Цена без налога, но со скидкой" Тогда
						
						Если ИнформацияОбъекта1С.СуммаВключаетНДС = Истина Тогда
							
							ЗначениеКлюча = ИнформацияСтрокиТЧ.Сумма/ИнформацияСтрокиТЧ.Количество-ИнформацияСтрокиТЧ.СуммаНДС/ИнформацияСтрокиТЧ.Количество;
							
						Иначе
							
							ЗначениеКлюча = ИнформацияСтрокиТЧ.Сумма/ИнформацияСтрокиТЧ.Количество;
							
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Цена с налогом, но без скидки" Тогда
						
						Если ИнформацияОбъекта1С.СуммаВключаетНДС = Истина Тогда
							
							ЗначениеКлюча = ИнформацияСтрокиТЧ.Сумма/ИнформацияСтрокиТЧ.Количество+ИнформацияСтрокиТЧ.СуммаРучнойСкидки/ИнформацияСтрокиТЧ.Количество;
							
						Иначе
							
							ЦенаБезСкидкиБезНалога = (ИнформацияСтрокиТЧ.Сумма+ИнформацияСтрокиТЧ.СуммаРучнойСкидки)/ИнформацияСтрокиТЧ.Количество;
							
							Если ИнформацияСтрокиТЧ.СтавкаНДС.Ставка = 0 Тогда
								ЗначениеКлюча = ЦенаБезСкидкиБезНалога;	
							Иначе
								ЗначениеКлюча = ЦенаБезСкидкиБезНалога+ЦенаБезСкидкиБезНалога/100*ИнформацияСтрокиТЧ.СтавкаНДС.Ставка;
							КонецЕсли;
							
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Тип скидки" Тогда
						
						ЗначениеКлюча = "2";	      
						
					ИначеЕсли ТекПоле.Значение = "Процент скидки" Тогда
						
						ЗначениеКлюча = ИнформацияСтрокиТЧ.ПроцентРучнойСкидки;	      
						
					ИначеЕсли ТекПоле.Значение = "Сумма скидки" Тогда
						
						ЗначениеКлюча = ИнформацияСтрокиТЧ.СуммаРучнойСкидки/ИнформацияСтрокиТЧ.Количество;	      
						
					ИначеЕсли ТекПоле.Значение = "Ставка НДС" Тогда
						
						ЗначениеКлюча = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьСтавкуПоНДС(ИнформацияСтрокиТЧ.СтавкаНДС);       
						
					КонецЕсли;						
#КонецОбласти				
				ИначеЕсли ТекПоле.ВидСущности = "Счет" Тогда		
#Область Счет	
					Если ТекПоле.Значение = "Идентификатор позиции товара" Тогда
			
						Если ЗначениеЗаполнено(ИнформацияСтрокиТЧ.Б24_К_ИдентификаторПозиции) Тогда
							ЗначениеКлюча = ИнформацияСтрокиТЧ.Б24_К_ИдентификаторПозиции;
						Иначе
							ЗначениеКлюча = "0";	
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Цена" Тогда
						
						Если ИнформацияОбъекта1С.СуммаВключаетНДС Тогда																			   
							ЗначениеКлюча =  ИнформацияСтрокиТЧ.Сумма/ИнформацияСтрокиТЧ.Количество;
						Иначе
							ЗначениеКлюча =  ИнформацияСтрокиТЧ.Цена-ИнформацияСтрокиТЧ.СуммаРучнойСкидки;
						КонецЕсли;					
						
					ИначеЕсли ТекПоле.Значение = "Скидка на единицу товара" Тогда
						
						ЗначениеКлюча = ИнформацияСтрокиТЧ.СуммаРучнойСкидки;
					
					КонецЕсли;					
#КонецОбласти				
				ИначеЕсли ТекПоле.ВидСущности = "Заказ" Тогда
#Область Заказ	
					Если ТекПоле.Значение = "Цена товара без учета скидок и наценок" Тогда
						
						ЗначениеКлюча = ИнформацияСтрокиТЧ.Цена;
						
					ИначеЕсли ТекПоле.Значение = "Цена товара с учетом скидок и наценок" Тогда
						
						ЗначениеКлюча = ИнформацияСтрокиТЧ.Сумма/ИнформацияСтрокиТЧ.Количество;
						
					ИначеЕсли ТекПоле.Значение = "Внешний идентификатор позиции товара" Тогда
						
						ЗначениеКлюча = ДополнительныеПараметры.КлючСвязи;
						
					ИначеЕсли ТекПоле.Значение = "Идентификатор позиции товара" Тогда
						
						ЗначениеКлюча = ДополнительныеПараметры.ИдентификаторПозиции;
					
					КонецЕсли;					
#КонецОбласти				
				ИначеЕсли ТекПоле.ВидСущности = "Отгрузка" Тогда
#Область Отгрузка	
					Если ТекПоле.Значение = "Идентификатор позиции товаров заказе" Тогда
						
						ЗначениеКлюча = ДополнительныеПараметры.ИдентификаторКорзиныЗаказа;
						
					ИначеЕсли ТекПоле.Значение = "Идентификатор позиции товара в отгрузке" Тогда
						
						Если ЗначениеЗаполнено(ИнформацияСтрокиТЧ.ИдПозицииОтгрузки) Тогда
							ЗначениеКлюча = ИнформацияСтрокиТЧ.ИдПозицииОтгрузки; 
						КонецЕсли;
						
					ИначеЕсли ТекПоле.Значение = "Внешний идентификатор позиции товара" Тогда
						
						ЗначениеКлюча = "S_" + Строка(ДополнительныеПараметры.КлючСвязи);
					
					ИначеЕсли ТекПоле.Значение = "Зарезервировано" Тогда
						
						ЗначениеКлюча = ИнформацияСтрокиТЧ.Количество;
	
					КонецЕсли;
#КонецОбласти						
				КонецЕсли;
			
					
			ИначеЕсли ТекПоле.ИсточникДанных = "<Свой алгоритм>" Тогда
				
				
				Для каждого ТекСтрокаДокумента Из СсылкаНаОбъект1С[ДополнительныеПараметры.ИмяТЧ] Цикл
					
					Если ТекСтрокаДокумента.КлючСвязи = ДополнительныеПараметры.КлючСвязи Тогда
						
						Параметры = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьСтруктуруПараметровПредопределенногоАлгоритма();
						Параметры.СтруктураНастроек 		= СтруктураНастроек;
						Параметры.Объект1С 					= СсылкаНаОбъект1С;
						Параметры.СтрокаТаблицыОбъекта1С 	= ТекСтрокаДокумента;
						Параметры.СтруктураДанных 			= Поля;

						ЗначениеКлюча = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПредопределенногоАлгоритма(ТекПоле.Значение, Параметры, "Функция");		
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
		Исключение
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, ТекПоле.ВидСущности + "/" + ТекПоле.Значение + "/" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
			
		Поля.Вставить(ТекПоле.КлючЗапроса, ЗначениеКлюча);
			
	КонецЦикла;
		
	Возврат Поля;	
	
КонецФункции

Процедура ВыполнитьАлгоритмПередВыгрузкой(СтруктураНастроек, Объект1С, Поля, АлгоритмКлюча)
	
	Параметры = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьСтруктуруПараметровПредопределенногоАлгоритма();
	Параметры.СтруктураНастроек = СтруктураНастроек;
	Параметры.Объект1С 			= Объект1С;
	Параметры.СтруктураДанных 	= Поля;
	
	Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПредопределенногоАлгоритма(АлгоритмКлюча, Параметры, "Процедура");		
		
КонецПроцедуры        

Функция ИдБ24ПоСсылке(Портал, ТипДанных, Объект, ПодчиненныйОбъект = Неопределено)
	
	Результат = РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(Портал, ТипДанных, Объект, ПодчиненныйОбъект);

	Если НЕ ЗначениеЗаполнено(Результат) Тогда Результат = Неопределено КонецЕсли;
	
	Возврат Результат;
	
КонецФункции     

#КонецОбласти


#Область ПринудительнаяВыгрузкаПодчиненныхОбъектов1С

Функция СформироватьКомпаниюПоСсылке(СтруктураНастроек, Объект1С) Экспорт
	
	лПолнаяВыгрузка 				= СтруктураНастроек.ПолнаяВыгрузка;
	лЛогирование					= СтруктураНастроек.Логирование;
	лКлючиПодчиненныхБатчЗапросов 	= СтруктураНастроек.КлючиПодчиненныхБатчЗапросов;
		
		СтруктураНастроек.ПолнаяВыгрузка = Ложь;
		
		ДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах() - 60*60*24*1000;
		
		мДанных = Новый Массив;
		мДанных.Добавить(Объект1С);
		
		НоваяЗапись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
		НоваяЗапись.НастройкаПодключения		= СтруктураНастроек.НастройкаПодключения;
		НоваяЗапись.ТипДанных 					= СтруктураНастроек.ТипыОбъектовОбмена.Компания;
		НоваяЗапись.Объект 						= Объект1С; 
		НоваяЗапись.ПодчиненныйОбъект 			= Неопределено; 
		НоваяЗапись.ВремяЗаписиВМиллисекундах	= ДатаВМиллисекундах;
		НоваяЗапись.Записать();
		
		Б24_КС_ОбщегоНазначенияВызовСервера.СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Компания);	
		
		Выборка = Справочники.Контрагенты.Выбрать(,,Новый Структура("Партнер", Объект1С));
		Пока Выборка.Следующий() Цикл
			НоваяЗапись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
			НоваяЗапись.НастройкаПодключения		= СтруктураНастроек.НастройкаПодключения;
			НоваяЗапись.ТипДанных 					= СтруктураНастроек.ТипыОбъектовОбмена.Реквизит;
			НоваяЗапись.Объект 						= Выборка.Ссылка; 
			НоваяЗапись.ПодчиненныйОбъект 			= Неопределено; 
			НоваяЗапись.ВремяЗаписиВМиллисекундах	= ДатаВМиллисекундах;
			НоваяЗапись.Записать();
		КонецЦикла;
		
		Б24_КС_ОбщегоНазначенияВызовСервера.СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Реквизит);	
	
	СтруктураНастроек.ПолнаяВыгрузка 				= лПолнаяВыгрузка;
	СтруктураНастроек.Логирование 					= лЛогирование;
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов 	= лКлючиПодчиненныхБатчЗапросов;
	
	Возврат РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.Компания, Объект1С, Неопределено);
	
КонецФункции

Функция СформироватьКонтактПоСсылке(СтруктураНастроек, Объект1С) Экспорт
	
	лПолнаяВыгрузка 				= СтруктураНастроек.ПолнаяВыгрузка;
	лЛогирование					= СтруктураНастроек.Логирование;
	лКлючиПодчиненныхБатчЗапросов 	= СтруктураНастроек.КлючиПодчиненныхБатчЗапросов;
		
		СтруктураНастроек.ПолнаяВыгрузка = Ложь;
		
		ДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах() - 60*60*24*1000;
		
		мДанных = Новый Массив;
		мДанных.Добавить(Объект1С);
		
		НоваяЗапись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
		НоваяЗапись.НастройкаПодключения		= СтруктураНастроек.НастройкаПодключения;
		НоваяЗапись.ТипДанных 					= СтруктураНастроек.ТипыОбъектовОбмена.Контакт;
		НоваяЗапись.Объект 						= Объект1С; 
		НоваяЗапись.ПодчиненныйОбъект 			= Неопределено; 
		НоваяЗапись.ВремяЗаписиВМиллисекундах	= ДатаВМиллисекундах;
		НоваяЗапись.Записать();
		
		Б24_КС_ОбщегоНазначенияВызовСервера.СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Контакт);	
		
		Выборка = Справочники.Контрагенты.Выбрать(,,Новый Структура("Партнер", Объект1С));
		Пока Выборка.Следующий() Цикл
			НоваяЗапись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
			НоваяЗапись.НастройкаПодключения		= СтруктураНастроек.НастройкаПодключения;
			НоваяЗапись.ТипДанных 					= СтруктураНастроек.ТипыОбъектовОбмена.Реквизит;
			НоваяЗапись.Объект 						= Выборка.Ссылка; 
			НоваяЗапись.ПодчиненныйОбъект 			= Неопределено; 
			НоваяЗапись.ВремяЗаписиВМиллисекундах	= ДатаВМиллисекундах;
			НоваяЗапись.Записать();
		КонецЦикла;       
		
		Б24_КС_ОбщегоНазначенияВызовСервера.СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Реквизит);	
	
	СтруктураНастроек.ПолнаяВыгрузка 				= лПолнаяВыгрузка;
	СтруктураНастроек.Логирование 					= лЛогирование;
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов 	= лКлючиПодчиненныхБатчЗапросов;
	
	Возврат РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.Контакт, Объект1С, Неопределено);
	
КонецФункции

Функция СформироватьРеквизитПоСсылке(СтруктураНастроек, Объект1С) Экспорт
	
	лПолнаяВыгрузка 				= СтруктураНастроек.ПолнаяВыгрузка;
	лЛогирование					= СтруктураНастроек.Логирование;
	лКлючиПодчиненныхБатчЗапросов 	= СтруктураНастроек.КлючиПодчиненныхБатчЗапросов;
	
		СтруктураНастроек.ПолнаяВыгрузка = Ложь;
		
		ДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах() - 60*60*24*1000;
		
		мДанных = Новый Массив;
		мДанных.Добавить(Объект1С);
		
		НоваяЗапись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
		НоваяЗапись.НастройкаПодключения		= СтруктураНастроек.НастройкаПодключения;
		НоваяЗапись.ТипДанных 					= СтруктураНастроек.ТипыОбъектовОбмена.Реквизит;
		НоваяЗапись.Объект 						= Объект1С; 
		НоваяЗапись.ПодчиненныйОбъект 			= Неопределено; 
		НоваяЗапись.ВремяЗаписиВМиллисекундах	= ДатаВМиллисекундах;
		НоваяЗапись.Записать();
		
		Б24_КС_ОбщегоНазначенияВызовСервера.СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Реквизит);	
	
	СтруктураНастроек.ПолнаяВыгрузка 				= лПолнаяВыгрузка;
	СтруктураНастроек.Логирование 					= лЛогирование;
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов 	= лКлючиПодчиненныхБатчЗапросов;
	
	Возврат РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, СтруктураНастроек.ТипыОбъектовОбмена.Реквизит, Объект1С, Неопределено);
	
КонецФункции

Функция СформироватьБанкСчетаПоВладельцу(СтруктураНастроек, Владелец) Экспорт

	лПолнаяВыгрузка 				= СтруктураНастроек.ПолнаяВыгрузка;
	лЛогирование					= СтруктураНастроек.Логирование;
	лКлючиПодчиненныхБатчЗапросов 	= СтруктураНастроек.КлючиПодчиненныхБатчЗапросов;
	
		СтруктураНастроек.ПолнаяВыгрузка = Ложь;
		
		ДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах() - 60*60*24*1000;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец", Владелец); 
		Запрос.Текст = "ВЫБРАТЬ
		|	БанковскиеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.Владелец = &Владелец";
		ВыполненныйЗапрос = Запрос.Выполнить();
		
		Если НЕ ВыполненныйЗапрос.Пустой() Тогда
			
			Выборка = ВыполненныйЗапрос.Выбрать();
			Пока Выборка.Следующий() Цикл
			
				НоваяЗапись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
				НоваяЗапись.НастройкаПодключения		= СтруктураНастроек.НастройкаПодключения;
				НоваяЗапись.ТипДанных 					= СтруктураНастроек.ТипыОбъектовОбмена.БанковскийСчетРеквизита;
				НоваяЗапись.Объект 						= Выборка.Ссылка; 
				НоваяЗапись.ПодчиненныйОбъект 			= Неопределено; 
				НоваяЗапись.ВремяЗаписиВМиллисекундах	= ДатаВМиллисекундах;
				НоваяЗапись.Записать();
				
			КонецЦикла;
			
			Б24_КС_ОбщегоНазначенияВызовСервера.СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.БанковскийСчетРеквизита);	
		
		КонецЕсли;
	
	СтруктураНастроек.ПолнаяВыгрузка 				= лПолнаяВыгрузка;
	СтруктураНастроек.Логирование 					= лЛогирование;
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов 	= лКлючиПодчиненныхБатчЗапросов;
	
	Возврат Истина;
	
КонецФункции

Функция СформироватьТоварПоСсылке(СтруктураНастроек, Номенклатура, Характеристика) Экспорт
	
	лПолнаяВыгрузка 				= СтруктураНастроек.ПолнаяВыгрузка;
	лЛогирование					= СтруктураНастроек.Логирование;
	лКлючиПодчиненныхБатчЗапросов 	= СтруктураНастроек.КлючиПодчиненныхБатчЗапросов;
	
		СтруктураНастроек.ПолнаяВыгрузка = Ложь;
		
		ДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах() - 60*60*24*1000;
		
		ТипОбъектаОбмена = Неопределено;
		Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда
			
			ТипОбъектаОбмена = СтруктураНастроек.ТипыОбъектовОбмена.Товар2; 
			
			НоваяЗапись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
			НоваяЗапись.НастройкаПодключения		= СтруктураНастроек.НастройкаПодключения;
			НоваяЗапись.ТипДанных 					= СтруктураНастроек.ТипыОбъектовОбмена.Товар2;
			НоваяЗапись.Объект 						= Номенклатура; 
			НоваяЗапись.ВремяЗаписиВМиллисекундах	= ДатаВМиллисекундах;
			НоваяЗапись.Записать();                          
			
			Б24_КС_ОбщегоНазначенияВызовСервера.СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Товар2);	
			
			Если ЗначениеЗаполнено(Характеристика) 
				ИЛИ НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ИспользованиеХарактеристик") = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать Тогда
			
				ТипОбъектаОбмена = СтруктураНастроек.ТипыОбъектовОбмена.Предложение; 
			
				НоваяЗапись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
				НоваяЗапись.НастройкаПодключения		= СтруктураНастроек.НастройкаПодключения;
				НоваяЗапись.ТипДанных 					= СтруктураНастроек.ТипыОбъектовОбмена.Предложение;
				НоваяЗапись.Объект 						= ?(ЗначениеЗаполнено(Характеристика), Характеристика, Номенклатура); 
				НоваяЗапись.ПодчиненныйОбъект 			= Характеристика; 
				НоваяЗапись.ВремяЗаписиВМиллисекундах	= ДатаВМиллисекундах+1;
				НоваяЗапись.Записать();               
			
				Б24_КС_ОбщегоНазначенияВызовСервера.СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Предложение);	
			
			КонецЕсли;
			
			
		Иначе    
			
			ТипОбъектаОбмена = СтруктураНастроек.ТипыОбъектовОбмена.Товар; 
			
			НоваяЗапись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
			НоваяЗапись.НастройкаПодключения		= СтруктураНастроек.НастройкаПодключения;
			НоваяЗапись.ТипДанных 					= СтруктураНастроек.ТипыОбъектовОбмена.Товар;
			НоваяЗапись.Объект 						= Номенклатура; 
			НоваяЗапись.ПодчиненныйОбъект 			= Характеристика; 
			НоваяЗапись.ВремяЗаписиВМиллисекундах	= ДатаВМиллисекундах;
			НоваяЗапись.Записать();
			
			Б24_КС_ОбщегоНазначенияВызовСервера.СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Товар);	
			
		КонецЕсли;
	
	СтруктураНастроек.ПолнаяВыгрузка 				= лПолнаяВыгрузка;
	СтруктураНастроек.Логирование 					= лЛогирование;
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов 	= лКлючиПодчиненныхБатчЗапросов;
	
	Возврат РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, ТипОбъектаОбмена, Номенклатура, Характеристика);
	
КонецФункции

Функция СформироватьРазделТовараПоСсылке(СтруктураНастроек, РазделТовара) Экспорт
	
	ДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах() - 60*60*24*1000;
	
	лПолнаяВыгрузка 				= СтруктураНастроек.ПолнаяВыгрузка;
	лЛогирование					= СтруктураНастроек.Логирование;
	лКлючиПодчиненныхБатчЗапросов 	= СтруктураНастроек.КлючиПодчиненныхБатчЗапросов;
		
	СтруктураНастроек.ПолнаяВыгрузка = Ложь;
	
	ТипОбъектаОбмена = Неопределено;
	Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда
		ТипОбъектаОбмена = СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара2; 
	Иначе    
		ТипОбъектаОбмена = СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара;
	КонецЕсли;
	
	НоваяЗапись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
	НоваяЗапись.НастройкаПодключения		= СтруктураНастроек.НастройкаПодключения;
	НоваяЗапись.ТипДанных 					= ТипОбъектаОбмена;
	НоваяЗапись.Объект 						= РазделТовара; 
	НоваяЗапись.ВремяЗаписиВМиллисекундах	= ДатаВМиллисекундах;
	НоваяЗапись.Записать();                          
			
	Б24_КС_ОбщегоНазначенияВызовСервера.СформироватьИОтправить(СтруктураНастроек, ТипОбъектаОбмена);	
	
	СтруктураНастроек.ПолнаяВыгрузка 				= лПолнаяВыгрузка;
	СтруктураНастроек.Логирование 					= лЛогирование;
	СтруктураНастроек.КлючиПодчиненныхБатчЗапросов 	= лКлючиПодчиненныхБатчЗапросов;
	
	Возврат РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, ТипОбъектаОбмена, РазделТовара);
	
КонецФункции

#КонецОбласти
