&НаКлиенте
Перем ТекущийПользователь;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подписать(Команда)
	ОткрытьФормуПодписи(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Отозвать(Команда)
	ОткрытьФормуПодписи(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодписи(ОтзывПодписи)

    ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПодписи", ЭтаФорма);
	ОткрытьФорму("Документ.АктПриемкиПомещения.Форма.ФормаПодписи", Новый Структура("ОтзывПодписи", ОтзывПодписи), ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	

КонецПроцедуры // ОткрытьФормуПодписи()

&НаКлиенте
Процедура ПослеВыбораПодписи(Результат, ДополнительныеПараметры) Экспорт

	

КонецПроцедуры // ПослеВыбораПодписи()



&НаКлиенте
Процедура ВидимостьКнопокПодпись()

	ЕстьПользовательВПодписях = Ложь;
	
	Для каждого х Из Объект.Соглосователи Цикл
	
		Если х.Соглосователь = ТекущийПользователь И НЕ х.ПодписьОтозвана Тогда
			ЕстьПользовательВПодписях = Истина;
			Прервать;
		КонецЕсли;	
	
	КонецЦикла;
	
	Элементы.СоглосователиПодписать.Видимость 	= НЕ ЕстьПользовательВПодписях;
	Элементы.СоглосователиОтозвать.Видимость 	= ЕстьПользовательВПодписях;
	
КонецПроцедуры // ВидимостьКнопокПодпись()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущийПользователь = омСотрудники.ПолучитьТекущегоПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	НеПоказыватьВВыборе = Новый Массив;
	
	Для каждого х Из Объект.Помещения Цикл
		НеПоказыватьВВыборе.Добавить(х.Помещение);	
	КонецЦикла;
	
	омПомещениеКлиент.ОткрытьПодборПомещения(Объект, ЭтаФорма, , , НеПоказыватьВВыборе, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПомещения(Результат, ДополнительныеПараметры) Экспорт	

	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры = Неопределено Тогда
		
		Для каждого Помещение Из Результат Цикл
			
			НС = Объект.Помещения.Добавить();
			НС.Помещение = Помещение;
			
		КонецЦикла;
		
	Иначе 
		Если Результат.Количество() = 0 Тогда
		
			Возврат;	
		
		КонецЕсли;
		
		ДополнительныеПараметры.ТД.Помещение = Результат[0];
		
	КонецЕсли; 
	
КонецПроцедуры // ПослеВыбораЭлементовСделки()

&НаКлиенте
Процедура СделкаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	мПервыеПоещения = Новый Массив;
	
	Для каждого х Из Объект.Помещения Цикл
		
		Если мПервыеПоещения.Найти(х.Помещение) = Неопределено Тогда
			мПервыеПоещения.Добавить(х.Помещение);	
		Иначе
			
			Отказ = Истина;
			ПоказатьПредупреждение(, "Дубль помещения " + х.Помещение);
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры


