
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьТаблицуДанных();

КонецПроцедуры  

Процедура ЗаполнитьТаблицуДанных()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧастичныйПодрядСрезПоследних.ИзделиеКомплект КАК ИзделиеКомплект,
		|	ЧастичныйПодрядСрезПоследних.Подрядчик КАК Подрядчик,
		|	ЧастичныйПодрядСрезПоследних.Комментарий КАК Комментарий,
		|	ЧастичныйПодрядСрезПоследних.НомерЧасти КАК НомерЧасти
		|ИЗ
		|	РегистрСведений.ЧастичныйПодряд.СрезПоследних КАК ЧастичныйПодрядСрезПоследних
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Подрядчик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЧастичныйПодрядСрезПоследних.Подрядчик = &Подрядчик
		|		КОНЕЦ
		|	И НЕ ЧастичныйПодрядСрезПоследних.Завершен
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЧастичныйПодрядСрезПоследних.Подрядчик.Наименование,
		|	ЧастичныйПодрядСрезПоследних.ИзделиеКомплект.Наименование";
	
	Запрос.УстановитьПараметр("Подрядчик", Подрядчик);
	
	ТаблицаДанных.Загрузить(Запрос.Выполнить().Выгрузить());
	

КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДанныхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДанныхПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДанныхПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина; 
	
	ТД = Элементы.ТаблицаДанных.ТекущиеДанные; 
	
	Если ТД = Неопределено Тогда
	    Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ТаблицаДанныхИзделияКомплект" Тогда
		ПоказатьЗначение(, ТД.ИзделиеКомплект);
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ТаблицаДанныхВозврат" Тогда
		ТД.Возврат = НЕ ТД.Возврат;
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ТаблицаДанныхПодрядчик" Тогда
		ПоказатьЗначение(, ТД.Подрядчик);
	КонецЕсли;
	
КонецПроцедуры    


&НаКлиенте
Процедура ПодрядчикПриИзменении(Элемент)
	ЗаполнитьТаблицуДанных();
КонецПроцедуры


&НаКлиенте
Процедура ВозвратИзПодряда(Команда)
	
	мКомплекты = Новый Массив;
	
	Для каждого х Из ТаблицаДанных Цикл
	
		Если х.Возврат Тогда
			мКомплекты.Добавить(Новый Структура("ИзделиеКомплект, НомерЧасти", х.ИзделиеКомплект, х.НомерЧасти));
		КонецЕсли;	
		
	КонецЦикла; 
	
	Если мКомплекты.Количество() > 0 Тогда
		ЗаписатьНаСервере(мКомплекты);
		ЗаполнитьТаблицуДанных();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ЗаписатьНаСервере(мКомплекты)

	ТД = ТекущаяДата();
	
	СтруктураПараметров = омПодряд.СтруктураПараметровДляЗаписиЧастичногоПодряда();
	
	Для каждого ТекущийКомплект Из мКомплекты Цикл
	
		МенеджерЗаписи = РегистрыСведений.ЧастичныйПодряд.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИзделиеКомплект = ТекущийКомплект.ИзделиеКомплект;
		МенеджерЗаписи.НомерЧасти = ТекущийКомплект.НомерЧасти;
		МенеджерЗаписи.Период = ТД;
		МенеджерЗаписи.Завершен = Истина;
		
		МенеджерЗаписи.Записать();
	
	КонецЦикла;
	

КонецПроцедуры // ЗаписатьНаСервере(мКомплекты)


