&НаКлиенте
Перем мВыбранныеПодразделения, мВыбранныеСтадии, мВыбранныеЭтапы, ЗначениеПеретаскивания;
&НаКлиенте
Перем мКартаПодразделения, мКартаСтадии, мКартаЭтапы;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыборЭлементовПриИзмененииНаСервере(ЭлементыРасписания,ВыборЭлементов,мДанные)
	ЭлементыРасписания.Очистить();

	Запрос = Новый Запрос;
	Если ВыборЭлементов = 0 Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подразделения.Ссылка КАК Ссылка,
		|	Подразделения.Наименование КАК Наименование,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК Стадия
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	НЕ(Подразделения.ПометкаУдаления
		|				ИЛИ Подразделения.Ссылка В (&мДанные)
		|				ИЛИ Подразделения.НеПоказыватьВРасписании)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
		
	ИначеЕсли ВыборЭлементов = 1 Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Стадии.Ссылка КАК Ссылка,
		|	Стадии.Наименование КАК Наименование,
		|	Стадии.Подразделение КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК Стадия
		|ИЗ
		|	Справочник.Стадии КАК Стадии
		|ГДЕ
		|	НЕ(Стадии.ПометкаУдаления
		|				ИЛИ Стадии.Ссылка В (&мДанные)
		|				ИЛИ Стадии.НеПоказыватьВРасписании)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыКанбан.Ссылка КАК Ссылка,
		|	ЭтапыКанбан.Наименование КАК Наименование,
		|	ЭтапыКанбан.Стадия.Подразделение КАК Подразделение,
		|	ЭтапыКанбан.Стадия КАК Стадия
		|ИЗ
		|	Справочник.ЭтапыКанбан КАК ЭтапыКанбан
		|ГДЕ
		|	НЕ(ЭтапыКанбан.ПометкаУдаления
		|				ИЛИ ЭтапыКанбан.Ссылка В (&мДанные)
		|				ИЛИ ЭтапыКанбан.НеПоказыватьВРасписании)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("мДанные", мДанные);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	мЭлементы = Новый Массив;
	Пока Выборка.Следующий() Цикл
		стДанные = Новый Структура("Ссылка,Наименование,Подразделение,Стадия", );
		ЗаполнитьЗначенияСвойств(стДанные, Выборка);
		мЭлементы.Добавить(стДанные);
	КонецЦикла;

	Возврат мЭлементы;
КонецФункции

&НаКлиенте
Процедура ВыборЭлементовПриИзменении(Элемент)
	Если ЭтаФорма.ВыборЭлементов = 0 Тогда
		мДанные = мВыбранныеПодразделения;
	ИначеЕсли ЭтаФорма.ВыборЭлементов = 1 Тогда
		мДанные = мВыбранныеСтадии;
	Иначе
		мДанные = мВыбранныеЭтапы;
	КонецЕсли;
	мЭлементы = ВыборЭлементовПриИзмененииНаСервере(ЭтаФорма.ЭлементыРасписания,ЭтаФорма.ВыборЭлементов,мДанные); 
	
	ВывестиЭлементы(мЭлементы);
	
КонецПроцедуры 

&НаКлиенте
Процедура ВывестиЭлементы(мЭлементы)
	
	КоличествоЭлементов = мЭлементы.Количество();
	мВысотаСтрок = Новый Массив;
	
	Для х = 1 По КоличествоЭлементов Цикл
		мВысотаСтрок.Добавить(5);
		мВысотаСтрок.Добавить(10);
	КонецЦикла; 
	
	омТабличныйДокументКлиентСервер.УстановитьВысотуСтрок(ЭтаФорма.ЭлементыРасписания, мВысотаСтрок);

	мШиринаКолонок = Новый Массив(3);
    мШиринаКолонок[0] = 1;
    мШиринаКолонок[1] = 25;
    мШиринаКолонок[2] = 1;
	омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(ЭтаФорма.ЭлементыРасписания, мШиринаКолонок);
	
	стПараметры = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров();
	стПараметры.НомерКолонки = 2;
	НомерСтроки = 2;
	Для каждого стЭлемент Из мЭлементы Цикл
		стПараметры.Текст = стЭлемент.Наименование;
		стПараметры.Расшифровка = стЭлемент;
		стПараметры.НомерСтроки = НомерСтроки; 
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ЭтаФорма.ЭлементыРасписания,стПараметры);	
		
		НомерСтроки = НомерСтроки + 2;
	КонецЦикла;
	
	

КонецПроцедуры // ВывестиЭлементы()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	мВыбранныеПодразделения = Новый Массив;
	мВыбранныеСтадии  		= Новый Массив;
	мВыбранныеЭтапы 		= Новый Массив;

	мКартаПодразделения		= Новый Массив;
	мКартаСтадии  			= Новый Массив;
	мКартаЭтапы 			= Новый Массив;
	
	ВыборЭлементовПриИзменении(Неопределено);
	

КонецПроцедуры 

#Область Карта

&НаКлиенте
Процедура ДобавитьЭлементВКарту(ЗначениеПеретаскивания,ИмяОбласти)
	Если ВыборЭлементов = 0 Тогда
		мВыбранные 	= мВыбранныеПодразделения;
		мКарта		= мКартаПодразделения;	
	ИначеЕсли ВыборЭлементов = 1 Тогда
		мВыбранные 	= мВыбранныеСтадии;
		мКарта		= мКартаСтадии;	
	Иначе
		мВыбранные 	= мВыбранныеЭтапы;
		мКарта		= мКартаЭтапы;	
	КонецЕсли;
	
    Если мВыбранные.Найти(ЗначениеПеретаскивания.Значение) = Неопределено Тогда
		мВыбранные.Добавить(ЗначениеПеретаскивания.Значение);
		стДанныеЯчейки = омТабличныйДокументКлиентСервер.РазобратьИмяЯчейки(ИмяОбласти); //R5C1
		ОпределитьМестоНаКарте(ЗначениеПеретаскивания.Значение,мКарта,стДанныеЯчейки.Колонка);
		ПересчитатьРазмерКарт();
	КонецЕсли;
КонецПроцедуры // ДобавитьЭлементВКарту()

&НаКлиенте
Процедура ПересчитатьРазмерКарт()

	Для каждого стПодразделение Из мКартаПодразделения Цикл
		текПодразделение = стПодразделение.Ссылка;	
		Для каждого стСтадия Из мКартаСтадии Цикл
			
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры // 		ПересчитатьРазмерКарт()


&НаКлиенте
Процедура ОпределитьМестоНаКарте(Значение,мКарта,Колонка, ШиринаОбласти = 1)
	
	
	КоличествоЭлементов = мКарта.Количество(); 

	Если КоличествоЭлементов = 0 Тогда
		стДанные = Новый Структура("Значение,ПерваяКолонка,Ширина", Значение, Колонка, ШиринаОбласти);		
		мКарта.Добавить(стДанные);	
	Иначе
		ЭлементВставили = Ложь;
		Для х = 0 По КоличествоЭлементов - 1 Цикл
			стДанные = мКарта[х];
			Если стДанные.ПерваяКолонка >= Колонка Тогда
				ЭлементВставили = Истина;
				стДанные = Новый Структура("Значение,ПерваяКолонка,Ширина", Значение, Колонка, ШиринаОбласти);		
				мКарта.Вставить(х, стДанные);
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ОпределитьМестоНаКарте(мКарта,стДанныеЯчейки.Колонка) 

&НаКлиенте
Процедура КонтрольПоследовательностиКарт()

	мКартаПодразделения_вр		= Новый Массив;
	мКартаСтадии_вр  			= Новый Массив;
	мКартаЭтапы_вр	 			= Новый Массив;

	Для каждого текПодразделение Из мКартаПодразделения Цикл
		Для каждого текСтадия Из мКартаСтадии Цикл
			Если текСтадия.Подразделение = текПодразделение.Ссылка Тогда
				мКартаСтадии_вр.Добавить(текСтадия);
				Для каждого текЭтап Из мКартаЭтапы Цикл
					Если текЭтап.Стадия = текСтадия.Ссылка Тогда
						мКартаЭтапы_вр.Добавить(текЭтап);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	мКартаСтадии 	= мКартаСтадии_вр; 
	мКартаЭтапы 	= мКартаЭтапы_вр; 
КонецПроцедуры // КонтрольПоследовательностиКарт()


#КонецОбласти

#Область Перетаскивание
	
&НаКлиенте
Процедура ЭлементыРасписанияНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	ЗначениеПеретаскивания = Новый Структура("Значение, ДопустимаяСтрока"
		, ПараметрыПеретаскивания.Значение.ТекущаяОбласть.Расшифровка,  ДопустимаяСтрокаПеремещения()); 
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.КопированиеИПеремещение;
	Элементы.Расписание.Редактирование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыРасписанияПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыРасписанияОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Элементы.Расписание.Редактирование = Ложь;
	ВыборЭлементовПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыРасписанияПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)
	стДанныеЯчейки = омТабличныйДокументКлиентСервер.РазобратьИмяЯчейки(Область.Имя); //R5C1
	Если стДанныеЯчейки.Строка = ЗначениеПеретаскивания.ДопустимаяСтрока Тогда
		ДобавитьЭлементВКарту(ЗначениеПеретаскивания, Область.Имя);	
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Элементы.Расписание.Редактирование 			= Истина;
	Элементы.ЭлементыРасписания.Редактирование 	= Истина;
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Элементы.Расписание.Редактирование 			= Ложь;
	Элементы.ЭлементыРасписания.Редактирование 	= Ложь;
КонецПроцедуры


&НаКлиенте
Функция ДопустимаяСтрокаПеремещения()

	Возврат (ЭтаФорма.ВыборЭлементов + 1) * 2;	
	

КонецФункции // ДопустимаяСтрокаПеремещения()


#КонецОбласти
