Функция ПолучитьСтруктураКанбана(НаименованиеДоски) Экспорт
	
	СтруктураДоски = Новый Структура("УИДДоски, Наименование, НомерВерсии, ПутьКФайлуКартинкиКорзины, ПерваяЗагрузка, Отбор", "", "", 0, "", Истина, Неопределено);
	
	СтруктураКанбана = Новый Структура("СтруктураДоски, мКолонки, мДорожки", СтруктураДоски, Новый Массив, Новый Массив);
	
	ИмяДоскиДляТЗ = омКанбанДоскиНаСервереПовтор.ПолучитьИмяДоски(НаименованиеДоски);
	
	Если ПустаяСтрока(ИмяДоскиДляТЗ) Тогда
		Возврат СтруктураКанбана;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КанбанДоски.УИД КАК УИДДоски,
	|	КанбанДоски.Наименование КАК Наименование,
	|	КанбанДоски.НомерВерсии КАК НомерВерсии,
	|	КанбанДоски.ИмяКартинкиКорзины КАК ИмяКартинкиКорзины
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	РегистрСведений.КанбанДоски КАК КанбанДоски
	|ГДЕ
	|	КанбанДоски.Наименование = &Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КанбанДорожки.УИД КАК УИД,
	|	КанбанДорожки.Наименование КАК Наименование,
	|	КанбанДорожки.Цвет КАК Цвет,
	|	КанбанДорожки.ЛимитКарточек КАК ЛимитКарточек
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанДорожки КАК КанбанДорожки
	|		ПО вт.УИДДоски = КанбанДорожки.Доска
	|
	|УПОРЯДОЧИТЬ ПО
	|	КанбанДорожки.НомерПоПорядку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КанбанКолонки.УИД КАК УИД,
	|	КанбанКолонки.ИмяСобытия КАК ИмяСобытия,
	|	КанбанКолонки.ЛимитКарточек КАК ЛимитКарточек,
	|	КанбанКолонки.ЛимитЧасов КАК ЛимитЧасов,
	|	КанбанКолонки.Наименование КАК Наименование,
	|	КанбанКолонки.Цвет КАК Цвет,
	|	КанбанКолонки.ЗапрещенИнтерактивныйПереход КАК ЗапрещенИнтерактивныйПереход,
	|	КанбанКолонки.ЗапрещенИнтерактивныйУход КАК ЗапрещенИнтерактивныйУход
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКолонки КАК КанбанКолонки
	|		ПО вт.УИДДоски = КанбанКолонки.Доска
	|
	|УПОРЯДОЧИТЬ ПО
	|	КанбанКолонки.НомерПоПорядку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.УИДДоски КАК УИДДоски,
	|	вт.Наименование КАК Наименование,
	|	вт.НомерВерсии КАК НомерВерсии,
	|	вт.ИмяКартинкиКорзины КАК ИмяКартинкиКорзины
	|ИЗ
	|	вт КАК вт";
	
	Запрос.УстановитьПараметр("Наименование", ИмяДоскиДляТЗ);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл  
		СтруктураДорожки = Новый Структура("УИД, ИмяСобытия, ЛимитКарточек,  Наименование, Цвет", );
		ЗаполнитьЗначенияСвойств(СтруктураДорожки, Выборка);
		СтруктураКанбана.мДорожки.Добавить(СтруктураДорожки);
	КонецЦикла;
	
	Выборка = Результат[2].Выбрать();
	Пока Выборка.Следующий() Цикл  
		СтруктураКолонки = Новый Структура("УИД, ИмяСобытия, ЛимитКарточек, ЛимитЧасов, Наименование, Цвет, ЗапрещенИнтерактивныйПереход, ЗапрещенИнтерактивныйУход", );
		ЗаполнитьЗначенияСвойств(СтруктураКолонки, Выборка);
		СтруктураКанбана.мКолонки.Добавить(СтруктураКолонки);
	КонецЦикла;
	
	Выборка = Результат[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураКанбана.СтруктураДоски, Выборка);
		
		Если НЕ ПустаяСтрока(Выборка.ИмяКартинкиКорзины) И ПустаяСтрока(СтруктураКанбана.СтруктураДоски.ПутьКФайлуКартинкиКорзины) Тогда
			
			ПутьКФайлу = КаталогВременныхФайлов() + Выборка.ИмяКартинкиКорзины + ".png";
			Файл = Новый Файл(ПутьКФайлу); 
			Если НЕ Файл.Существует() Тогда
				БиблиотекаКартинок[Выборка.ИмяКартинкиКорзины].Записать(ПутьКФайлу);	
			КонецЕсли; 
			
			СтруктураКанбана.СтруктураДоски.ПутьКФайлуКартинкиКорзины = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу));
			
			УдалитьФайлы(ПутьКФайлу);
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураКанбана;
	
КонецФункции // ПолучитьУИДДДоски()

