
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПустойКомплект  = Справочники.ИзделияКомплект.ПустаяСсылка();
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
		              |	ОстаткиТоваровНаСкладахОстатки.Номенклатура КАК Номенклатура,
		              |	ОстаткиТоваровНаСкладахОстатки.Склад КАК Склад,
		              |	ОстаткиТоваровНаСкладахОстатки.КоличествоОстаток КАК Количество,
		              |	ОстаткиТоваровНаСкладахОстатки.СуммаСНДСОстаток КАК СуммаСНДС
		              |ИЗ
		              |	РегистрНакопления.ОстаткиТоваровНаСкладах.Остатки(&Дата, Номенклатура В (&МассивМатериалы)) КАК ОстаткиТоваровНаСкладахОстатки";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Склад", ЭтотОбъект.Склад);
	Запрос.УстановитьПараметр("МассивМатериалы", Материалы.ВыгрузитьКолонку("Номенклатура"));
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	стОтбор = Новый Структура("Номенклатура", );
	
	Движения.ОстаткиТоваровНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл 
		
		стОтбор.Номенклатура = ТекСтрокаМатериалы.Номенклатура;
		НайденныеСтроки = ТЗ.НайтиСтроки(стОтбор);
		
		Количество = ТекСтрокаМатериалы.Количество * ТекСтрокаМатериалы.Коэффициент; 
		

		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		    Если НайденнаяСтрока.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.ОстаткиТоваровНаСкладах.Добавить();
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Движение.Номенклатура 		= ТекСтрокаМатериалы.Номенклатура;
			Движение.Период 			= Дата;
			Движение.Склад 				= Склад;
			
			Если НайденнаяСтрока.Количество >= Количество Тогда
				Движение.СуммаСНДС 	= Окр((НайденнаяСтрока.СуммаСНДС / НайденнаяСтрока.Количество) * Количество, 2);
				Движение.Количество = Количество;
				
				НайденнаяСтрока.СуммаСНДС  = НайденнаяСтрока.СуммаСНДС  - Движение.СуммаСНДС;
				НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - Количество;
				Количество = 0;
				Прервать;
			Иначе
				Движение.СуммаСНДС 	= НайденнаяСтрока.СуммаСНДС;
				Движение.Количество = НайденнаяСтрока.Количество;
				
				Количество 			= Количество - НайденнаяСтрока.Количество;
				
				НайденнаяСтрока.Количество = 0;
				НайденнаяСтрока.СуммаСНДС  = 0;
			КонецЕсли;
			
		КонецЦикла; 
		
		Если Количество > 0 Тогда
			Движение = Движения.ОстаткиТоваровНаСкладах.Добавить();
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Движение.Номенклатура 		= ТекСтрокаМатериалы.Номенклатура;
			Движение.Период 			= Дата;
			Движение.Склад 				= Склад;
			Движение.Количество			= Количество;
			Движение.СуммаСНДС			= 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.Записать(); 
	
	
	СуммаДокумента = Движения.ОстаткиТоваровНаСкладах.Итог("СуммаСНДС");
	
	Сделка 	= ?(ЗначениеЗаполнено(ИзделиеКомплект), ИзделиеКомплект.Проект, Справочники.Проекты.ПустаяСсылка());
	
	тзТЧ = Материалы.ВыгрузитьКолонки("Количество, Номенклатура"); 
	тзТЧ.Свернуть("Номенклатура", "Количество");
	
	Движения.ВыданноСоСклада.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из тзТЧ Цикл
		Движение = Движения.ВыданноСоСклада.Добавить();
		Движение.Проект 					= Сделка;
		Движение.ИзделиеКомплект 			= ИзделиеКомплект;
		Движение.Количество 				= ТекСтрокаМатериалы.Количество;
		Движение.Номенклатура 				= ТекСтрокаМатериалы.Номенклатура;
		Движение.СтатусСписанияМатериалов 	= СтатусСписанияМатериалов;
	КонецЦикла;


	
КонецПроцедуры  


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мМатериалы = Новый Массив;
	
	Для каждого текМатериал Из Материалы Цикл
		Если НЕ текМатериал.РучноеДобавление И мМатериалы.Найти(текМатериал.Номенклатура) = Неопределено Тогда
			мМатериалы.Добавить(текМатериал.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ мМатериалы.Количество() = 0 Тогда
		мЦены = ОбщегоНазначения.ТаблицаЗначенийВМассив(омЦеныНаСервере.ПолучитьСебестоимостьМатериалов(мМатериалы, Склад, Новый МоментВремени(Дата,Ссылка)));
		
		стОтбор = Новый Структура("РучноеДобавление,Номенклатура",Ложь, );
		Для каждого текЦена Из мЦены Цикл
			стОтбор.Номенклатура = текЦена.Номенклатура;
			
			Для каждого текМатериал Из Материалы.НайтиСтроки(стОтбор) Цикл
				Если текМатериал.Коэффициент = 0 Тогда
					Продолжить;
				КонецЕсли;	
				
				текМатериал.Цена 	= текЦена.Цена * текМатериал.Коэффициент;
				текМатериал.Сумма 	= текМатериал.Цена * текМатериал.Количество;
				
			КонецЦикла;     	
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

