Функция ПолучитьЗаголовокЗадачи(ОбъектТЗ, ТипЗадачи = "ПКД") Экспорт

	стПереходы = РегистрыСведений.ДатыКомплекта.ПолучитьКоличествоПереходов(ОбъектТЗ);
	
	Возврат стПереходы.КомплектНаименование + "." + ТипЗадачи + (стПереходы.ПереходРедакция  + 1);

КонецФункции // ПолучитьЗаголовокЗадачи()

Функция ДействияНаСервере(Действие, Знач мКомплектыДляАналогичногоДействия, Знач Задача, ТипЗадачи, Исполнитель = Неопределено, Параметр = Неопределено) Экспорт
	
	МенеджерРегистра = РегистрыСведений.ТаймингЗадач;
	
	ОбъектЗадача 		= Задача.ПолучитьОбъект();
	ОбъектЗадача.Дата 	= ТекущаяДата();
	
	ОбъектЗадача.Наименование = ПолучитьЗаголовокЗадачи(Задача.ОбъектТЗ);

	Если Действие = "История" Тогда
		Возврат МенеджерРегистра.ПолучитьИсториюЗадачи(Задача);
	ИначеЕсли Действие = "ИзменениеКонструктора" Тогда

		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Разработка;
		ОбъектЗадача.Исполнитель 	= Исполнитель;
		
		ОбъектЗадача.Записать();
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, Исполнитель, , ОбъектЗадача.ТипЗадачи);
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);			
		
	ИначеЕсли ТипЗадачи = Перечисления.ТипыЗадачКонструирования.Разработка 
		ИЛИ ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором 
		ИЛИ ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором Тогда
		
		Если Действие = "НачатьВыполнение" Тогда
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ВРаботеКонструктора, Исполнитель, Параметр, ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные,);
			
		ИначеЕсли Действие = "Приостановить" Тогда
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ПриостановкаКонструктором, Исполнитель, Параметр, ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		ИначеЕсли Действие = "ЗавершениеРаботы" Тогда
			
			омСтадииКомплекта.УстановитьСтатусСУчетомГлобальныхНастроек(ОбъектЗадача);
		КонецЕсли;
		
	ИначеЕсли ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда

		Если Действие = "ДоработкаВедущийКонструктор" Тогда
			
			Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);
			
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором;
			ОбъектЗадача.Исполнитель 	= Конструктор;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, Конструктор, , ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
			
			омКонструктор.ИзменитьЗначениеПерехода(ОбъектЗадача.ОбъектТЗ, "ПереходДоработка");
			
		ИначеЕсли Действие = "КонтрольВедущийКонструктор" Тогда
			
			Дизайнер = омСотрудники.СотрудникиОбъекта(Параметр).Дизайнер;
			
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.КонтрольДизайнера;
			ОбъектЗадача.Исполнитель 	= Дизайнер;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ДизайнерскийКонтроль, Дизайнер, , ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
		ИначеЕсли Действие = "ИзменениеВедущийКонструктор" Тогда
			
			Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);
			
			ОбъектЗадача.ТипЗадачи 				= Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором;
			ОбъектЗадача.ДополнительноеСвойство = "";
			ОбъектЗадача.Исполнитель 			= Конструктор;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, Конструктор, , ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
			омКонструктор.ИзменитьЗначениеПерехода(ОбъектЗадача.ОбъектТЗ, "ПереходИзменения");

		КонецЕсли;
		
	ИначеЕсли ТипЗадачи = Перечисления.ТипыЗадачКонструирования.КонтрольДизайнера Тогда    

		Если Действие = "ДоработкаДизайнера" Тогда
			
			ВедущийКонструктор = омСотрудники.СотрудникиОбъекта(Параметр).ВедущийКонструктор;
			
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором;
			ОбъектЗадача.Исполнитель 	= ВедущийКонструктор;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором, ВедущийКонструктор, , ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
			омКонструктор.ИзменитьЗначениеПерехода(ОбъектЗадача.ОбъектТЗ, "ПереходДоработка");

		ИначеЕсли Действие = "КорректировкаДизайнер" Тогда
			
			Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);

			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором;
			ОбъектЗадача.Исполнитель 	= Конструктор;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, Конструктор, , ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
			омКонструктор.ИзменитьЗначениеПерехода(ОбъектЗадача.ОбъектТЗ, "ПереходИзменения");

		ИначеЕсли Действие = "РедакцияДизайнер" Тогда
			
			Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);

			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором;
			ОбъектЗадача.СтатусЗадачи 	= Перечисления.СтатусыЗадач.Редакция;
			ОбъектЗадача.Исполнитель 	= Конструктор;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, Конструктор, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
			омКонструктор.ИзменитьЗначениеПерехода(ОбъектЗадача.ОбъектТЗ, "ПереходРедакция");

		ИначеЕсли Действие = "РекламацияДизайнер" Тогда
			
			Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);

			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором;
			ОбъектЗадача.СтатусЗадачи 	= Перечисления.СтатусыЗадач.Рекламация;
			ОбъектЗадача.Исполнитель 	= Конструктор;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, Конструктор, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
			омКонструктор.ИзменитьЗначениеПерехода(ОбъектЗадача.ОбъектТЗ, "ПереходРекламация");

		ИначеЕсли Действие = "КонтрольКП" Тогда
			
			Финдиректор = Справочники.Организации.ПолучитьФиндиректораОрганизации();

			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ОжиданиеФиндиректором;
			ОбъектЗадача.Исполнитель 	= Финдиректор;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеФиндиректором, Финдиректор, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
		ИначеЕсли Действие = "Согласовано" Тогда
			
			мКомплектыДляАналогичногоДействия.Очистить();
			ДействиеСогласовано(Задача);
			
		КонецЕсли;
			
	ИначеЕсли ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ОжиданиеМенеджером Тогда        
		
		Если Действие = "ВозвратСЗапроса" Тогда
			
			Дизайнер = омСотрудники.СотрудникиОбъекта(Параметр).Дизайнер;
                                                                                                                                                            			
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.КонтрольДизайнера;
			ОбъектЗадача.СтатусЗадачи 	= Перечисления.СтатусыЗадач.Запрос;
			ОбъектЗадача.Исполнитель 	= Дизайнер;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ДизайнерскийКонтроль, Дизайнер, , ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
		ИначеЕсли Действие = "ВозвратССогласования" Тогда
			
			Дизайнер = омСотрудники.СотрудникиОбъекта(Параметр).Дизайнер;
                                                                                                                                                            			
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.КонтрольДизайнера;
			ОбъектЗадача.СтатусЗадачи 	= Перечисления.СтатусыЗадач.Согласование;
			ОбъектЗадача.Исполнитель 	= Дизайнер;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ДизайнерскийКонтроль, Дизайнер, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
		ИначеЕсли Действие = "Согласовано" Тогда
			
			мКомплектыДляАналогичногоДействия.Очистить();
			ДействиеСогласовано(Задача);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ОжиданиеФиндиректором Тогда        

		Если Действие = "ОтменаИзделия" Тогда
			
			Финдиректор = Справочники.Организации.ПолучитьФиндиректораОрганизации();
                                                                                                                                                            			
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Отмена;
			ОбъектЗадача.СтатусЗадачи 	= Перечисления.СтатусыЗадач.Отмена;
			ОбъектЗадача.Выполнена		= Истина;
			ОбъектЗадача.Исполнитель 	= Финдиректор;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.Отмена, Финдиректор, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
		ИначеЕсли Действие = "СогласованоБезИзменений" Тогда
			
			Дизайнер = омСотрудники.СотрудникиОбъекта(Параметр).Дизайнер;
		                                                                                                                                                    			
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.КонтрольДизайнера;
			ОбъектЗадача.Исполнитель 	= Дизайнер;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ДизайнерскийКонтроль, Дизайнер, , ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
		ИначеЕсли Действие = "СогласованоСИзменением" Тогда
			
			Дизайнер = омСотрудники.СотрудникиОбъекта(Параметр).Дизайнер;
		                                                                                                                                                    			
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.КонтрольДизайнера;
			ОбъектЗадача.Исполнитель 	= Дизайнер;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ДизайнерскийКонтроль, Дизайнер, , ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
		КонецЕсли;

	КонецЕсли; 
	
	Если мКомплектыДляАналогичногоДействия.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Задачи_ПКД.Ссылка КАК Задача
			|ИЗ
			|	Задача.Задачи_ПКД КАК Задачи_ПКД
			|ГДЕ
			|	Задачи_ПКД.ОбъектТЗ В(&ОбъектТЗ)";
			
		Запрос.УстановитьПараметр("ОбъектТЗ", мКомплектыДляАналогичногоДействия);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ПустойМассив = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			ДействияНаСервере(Действие, ПустойМассив, Выборка.Задача, ТипЗадачи, ОбъектЗадача.Исполнитель, Параметр);
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Выборка.Задача);
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ Действие = "Согласовано"  Тогда
		
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
		
	КонецЕсли;
	
КонецФункции // ДействияНаСервере()

Процедура ДействиеСогласовано(Задача, Комментарий = "") Экспорт
	
	ОбъектЗадача = ЗавершитьЗадачуПКД(Задача, Комментарий);
	
	ТипыВнешнегоПроизводства = омВнешнееПроизводство.ТипВнешнегоПроизводства(ОбъектЗадача.ОбъектТЗ);
	
	Если ТипыВнешнегоПроизводства.РКД Тогда
		
		Если НЕ ЗначениеЗаполнено(ТипыВнешнегоПроизводства.ЗадачаВнешнегоПроизводства) Тогда
			омВнешнееПроизводство.СоздатьЗадачуВнешнегоПроизводства(ОбъектЗадача.ОбъектТЗ, ОбъектЗадача.Проект);
		КонецЕсли;
		
	Иначе
		
		Если ТипЗнч(ОбъектЗадача.ОбъектТЗ) = Тип("СправочникСсылка.ИзделияКомплект") Тогда
			
			Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);
			СоздатьЗадачуРКД(ОбъектЗадача, Конструктор);
			
		Иначе
			
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(ОбъектЗадача.Ссылка);
			
			мКомплекты = омКомпозицииСервер.ПолучитьКомплектыКомпозиции(ОбъектЗадача.ОбъектТЗ);
			
			омЗадачиПКДСервер.КонтрольОтдельныхЗадачРКД(мКомплекты);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Задачи_ПКД.Ссылка КАК Задача,
			|	Пользователи.Ссылка КАК Конструктор
			|ИЗ
			|	Задача.Задачи_ПКД КАК Задачи_ПКД
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект В (&Комплект)) КАК ДанныеКомплектаСрезПоследних
			|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО (ДанныеКомплектаСрезПоследних.Конструктор = Пользователи.Сотрудник)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
			|		ПО Задачи_ПКД.ОбъектТЗ = ДатыКомплекта.Комплект
			|ГДЕ
			|	НЕ Задачи_ПКД.Выполнена
			|	И НЕ ЕСТЬNULL(ДатыКомплекта.РКД_отдельно_от_композиции, ЛОЖЬ)";
			
			Запрос.УстановитьПараметр("Комплект", мКомплекты);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ОбъектЗадача = ЗавершитьЗадачуПКД(Выборка.Задача, Комментарий);
				СоздатьЗадачуРКД(ОбъектЗадача, Выборка.Конструктор);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

Функция ЗавершитьЗадачуПКД(СсылкаНаЗадачу, Комментарий = "")

	ОбъектЗадача 				= СсылкаНаЗадачу.ПолучитьОбъект();
	ОбъектЗадача.Дата 			= ТекущаяДата();
	ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Завершение;
	ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.ПКД;
	ОбъектЗадача.Выполнена      = Истина;
	ОбъектЗадача.Комментарий	= Комментарий;
	
	ОбъектЗадача.Записать(); 
	
	МенеджерРегистра = РегистрыСведений.ТаймингЗадач;
	стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ПустаяСсылка(), ОбъектЗадача.Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
	МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(СсылкаНаЗадачу, стДанные);

	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(СсылкаНаЗадачу);

	Возврат ОбъектЗадача;
	
КонецФункции

Процедура СоздатьЗадачуРКД(ОбъектЗадача, Конструктор)
	
	ЗадачаРКД 					= Задачи.Задачи_РКД.СоздатьЗадачу();
	ЗадачаРКД.Дата 				= ТекущаяДата();
	ЗадачаРКД.Исполнитель 		= Конструктор;
	ЗадачаРКД.Дата 				= ТекущаяДата();
	ЗадачаРКД.Наименование		= Строка(ОбъектЗадача.ОбъектТЗ) + ".РКД";
	ЗадачаРКД.ОбъектТЗ 			= ОбъектЗадача.ОбъектТЗ;
	ЗадачаРКД.Основание 		= ОбъектЗадача.Ссылка;
	ЗадачаРКД.Проект 			= ОбъектЗадача.Проект;
	ЗадачаРКД.СтатусЗадачи		= Перечисления.СтатусыЗадач.РКД;
	ЗадачаРКД.ТипЗадачи			= Перечисления.ТипыЗадачКонструирования.Разработка;
	
	ЗадачаРКД.Записать();
	
	МенеджерРегистра = РегистрыСведений.ТаймингЗадач;
	стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, Конструктор, ЗадачаРКД.СтатусЗадачи, ЗадачаРКД.ТипЗадачи);
	МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ЗадачаРКД.Ссылка, стДанные);
	
	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(ЗадачаРКД.Ссылка);
	
КонецПроцедуры



