Функция ДействияНаСервере(Действие, Знач мКомплектыДляАналогичногоДействия, Знач Задача, ТипЗадачи, Исполнитель = Неопределено, Параметр = Неопределено) Экспорт
	
	МенеджерРегистра = РегистрыСведений.ТаймингЗадач;
	
	НаименованиеОбъекта = Задача.ОбъектТЗ.Наименование + ".";
	
	Если Действие = "История" Тогда
		Возврат МенеджерРегистра.ПолучитьИсториюЗадачи(Задача);
	ИначеЕсли ТипЗадачи = Перечисления.ТипыЗадачКонструирования.Разработка 
		ИЛИ ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором 
		ИЛИ ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором Тогда
		
		Если Действие = "НачатьВыполнение" Тогда
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ВРаботеКонструктора, Исполнитель, Параметр, ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные,);
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
			
		ИначеЕсли Действие = "Приостановить" Тогда
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ПриостановкаКонструктором, Исполнитель, Параметр, ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		ИначеЕсли Действие = "ЗавершениеРаботы" Тогда
			
			ВедущийКонструктор = омСотрудники.СотрудникиОбъекта(Параметр).ВедущийКонструктор;
			
			ОбъектЗадача 				= Задача.ПолучитьОбъект();
			ОбъектЗадача.Дата 			= ТекущаяДата();
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором;
			ОбъектЗадача.Исполнитель 	= ВедущийКонструктор;
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором, ВедущийКонструктор, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда

		Если Действие = "ДоработкаВедущийКонструктор" Тогда
			
			Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);
			
			ОбъектЗадача 				= Задача.ПолучитьОбъект();
			ОбъектЗадача.Дата 			= ТекущаяДата();
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором;
			ОбъектЗадача.Исполнитель 	= Конструктор;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, Конструктор, , ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
			
			омКонструктор.ИзменитьЗначениеПерехода(ОбъектЗадача.ОбъектТЗ, "ПереходДоработка");
			
		ИначеЕсли Действие = "КонтрольВедущийКонструктор" Тогда
			
			Дизайнер = омСотрудники.СотрудникиОбъекта(Параметр).Дизайнер;
			
			ОбъектЗадача 				= Задача.ПолучитьОбъект();
			ОбъектЗадача.Дата 			= ТекущаяДата();
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.КонтрольДизайнера;
			ОбъектЗадача.Исполнитель 	= Дизайнер;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ДизайнерскийКонтроль, Дизайнер);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
			
		ИначеЕсли Действие = "ИзменениеВедущийКонструктор" Тогда
			
			Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);
			
			ОбъектЗадача 						= Задача.ПолучитьОбъект();
			ОбъектЗадача.Дата 					= ТекущаяДата();
			ОбъектЗадача.ТипЗадачи 				= Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором;
			ОбъектЗадача.ДополнительноеСвойство = "";
			ОбъектЗадача.Исполнитель 			= Конструктор;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, Конструктор, , ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
			
			омКонструктор.ИзменитьЗначениеПерехода(ОбъектЗадача.ОбъектТЗ, "ПереходИзменения");

		КонецЕсли;
		
	ИначеЕсли ТипЗадачи = Перечисления.ТипыЗадачКонструирования.КонтрольДизайнера Тогда    

		Если Действие = "ДоработкаДизайнера" Тогда
			
			ВедущийКонструктор = омСотрудники.СотрудникиОбъекта(Параметр).ВедущийКонструктор;
			
			ОбъектЗадача 				= Задача.ПолучитьОбъект();
			ОбъектЗадача.Дата 			= ТекущаяДата();
			ОбъектЗадача.Наименование	= НаименованиеОбъекта + "Проверка";
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором;
			ОбъектЗадача.Исполнитель 	= ВедущийКонструктор;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором, ВедущийКонструктор, , ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
			
			омКонструктор.ИзменитьЗначениеПерехода(ОбъектЗадача.ОбъектТЗ, "ПереходДоработка");

		ИначеЕсли Действие = "КорректировкаДизайнер" Тогда
			
			Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);

			ОбъектЗадача 				= Задача.ПолучитьОбъект();
			ОбъектЗадача.Дата 			= ТекущаяДата();
			ОбъектЗадача.Наименование	= НаименованиеОбъекта + "Ожидание";
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором;
			ОбъектЗадача.Исполнитель 	= Конструктор;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, Конструктор, , ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
			
			омКонструктор.ИзменитьЗначениеПерехода(ОбъектЗадача.ОбъектТЗ, "ПереходИзменения");

		ИначеЕсли Действие = "РедакцияДизайнер" Тогда
			
			Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);

			ОбъектЗадача 				= Задача.ПолучитьОбъект();
			ОбъектЗадача.Дата 			= ТекущаяДата();
			ОбъектЗадача.Наименование	= НаименованиеОбъекта + "Ожидание";
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором;
			ОбъектЗадача.СтатусЗадачи 	= Перечисления.СтатусыЗадач.Редакция;
			ОбъектЗадача.Исполнитель 	= Конструктор;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, Конструктор, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
			
			омКонструктор.ИзменитьЗначениеПерехода(ОбъектЗадача.ОбъектТЗ, "ПереходРедакция");

		ИначеЕсли Действие = "РекламацияДизайнер" Тогда
			
			Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);

			ОбъектЗадача 				= Задача.ПолучитьОбъект();
			ОбъектЗадача.Дата 			= ТекущаяДата();
			ОбъектЗадача.Наименование	= НаименованиеОбъекта + "Ожидание";
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором;
			ОбъектЗадача.СтатусЗадачи 	= Перечисления.СтатусыЗадач.Рекламация;
			ОбъектЗадача.Исполнитель 	= Конструктор;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, Конструктор, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
			
			омКонструктор.ИзменитьЗначениеПерехода(ОбъектЗадача.ОбъектТЗ, "ПереходРекламация");

		ИначеЕсли Действие = "КонтрольКП" Тогда
			
			Финдиректор = Справочники.Организации.ПолучитьФиндиректораОрганизации();

			ОбъектЗадача 				= Задача.ПолучитьОбъект();
			ОбъектЗадача.Дата 			= ТекущаяДата();
			ОбъектЗадача.Наименование	= НаименованиеОбъекта + "Ожидание";
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ОжиданиеФиндиректором;
			ОбъектЗадача.Исполнитель 	= Финдиректор;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеФиндиректором, Финдиректор, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
			
		ИначеЕсли Действие = "Согласовано" Тогда
			
			ДействиеСогласовано(Задача);
			
		КонецЕсли;
			
	ИначеЕсли ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ОжиданиеМенеджером Тогда        
		
		Если Действие = "ВозвратСЗапроса" Тогда
			
			Дизайнер = омСотрудники.СотрудникиОбъекта(Параметр).Дизайнер;
                                                                                                                                                            			
			ОбъектЗадача 				= Задача.ПолучитьОбъект();
			ОбъектЗадача.Дата 			= ТекущаяДата();
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.КонтрольДизайнера;
			ОбъектЗадача.Исполнитель 	= Дизайнер;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ДизайнерскийКонтроль, Дизайнер, , ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
			
		ИначеЕсли Действие = "ВозвратССогласования" Тогда
			
			Дизайнер = омСотрудники.СотрудникиОбъекта(Параметр).Дизайнер;
                                                                                                                                                            			
			ОбъектЗадача 				= Задача.ПолучитьОбъект();
			ОбъектЗадача.Дата 			= ТекущаяДата();
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.КонтрольДизайнера;
			ОбъектЗадача.СтатусЗадачи 	= Перечисления.СтатусыЗадач.Согласование;
			ОбъектЗадача.Исполнитель 	= Дизайнер;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ДизайнерскийКонтроль, Дизайнер, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
			
		ИначеЕсли Действие = "Согласовано" Тогда
			
			ДействиеСогласовано(Задача);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ОжиданиеФиндиректором Тогда        

		Если Действие = "ОтменаИзделия" Тогда
			
			Финдиректор = Справочники.Организации.ПолучитьФиндиректораОрганизации();
                                                                                                                                                            			
			ОбъектЗадача 				= Задача.ПолучитьОбъект();
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Отмена;
			ОбъектЗадача.Дата 			= ТекущаяДата();
			ОбъектЗадача.СтатусЗадачи 	= Перечисления.СтатусыЗадач.Отмена;
			ОбъектЗадача.Исполнитель 	= Финдиректор;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.Отмена, Финдиректор, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
			
		ИначеЕсли Действие = "СогласованоБезИзменений" Тогда
			
			Дизайнер = омСотрудники.СотрудникиОбъекта(Параметр).Дизайнер;
		                                                                                                                                                    			
			ОбъектЗадача 				= Задача.ПолучитьОбъект();
			ОбъектЗадача.Дата 			= ТекущаяДата();
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.КонтрольДизайнера;
			ОбъектЗадача.Исполнитель 	= Дизайнер;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ДизайнерскийКонтроль, Дизайнер, , ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
			
		ИначеЕсли Действие = "СогласованоСИзменением" Тогда
			
			Дизайнер = омСотрудники.СотрудникиОбъекта(Параметр).Дизайнер;
		                                                                                                                                                    			
			ОбъектЗадача 				= Задача.ПолучитьОбъект();
			ОбъектЗадача.Дата 			= ТекущаяДата();
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.КонтрольДизайнера;
			ОбъектЗадача.Исполнитель 	= Дизайнер;
			
			ОбъектЗадача.Записать();
			
			стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ДизайнерскийКонтроль, Дизайнер, , ОбъектЗадача.ТипЗадачи);
			МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
			
		КонецЕсли;

	КонецЕсли; 
	
	Если мКомплектыДляАналогичногоДействия.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Задачи_ПКД.Ссылка КАК Задача
			|ИЗ
			|	Задача.Задачи_ПКД КАК Задачи_ПКД
			|ГДЕ
			|	Задачи_ПКД.ОбъектТЗ В(&ОбъектТЗ)";
			
		Запрос.УстановитьПараметр("ОбъектТЗ", мКомплектыДляАналогичногоДействия);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ПустойМассив = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			ДействияНаСервере(Действие, ПустойМассив, Выборка.Задача, ТипЗадачи, Исполнитель, Параметр);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РегистрыСведений.ТаймингЗадач.ПолучитьСостояниеЗадачи(Задача);
	
КонецФункции // ДействияНаСервере()

Процедура ДействиеСогласовано(Задача)
	
	ОбъектЗадача 				= Задача.ПолучитьОбъект();
	
	Если ТипЗнч(ОбъектЗадача.ОбъектТЗ) = Тип("СправочникСсылка.ИзделияКомплект") Тогда
		
		Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);
		
		ОбъектЗадача.Дата 			= ТекущаяДата();
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Завершение;
		ОбъектЗадача.Выполнена      = Истина;
		
		ОбъектЗадача.Записать(); 
		
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
		
		СоздатьЗадачуРКД(ОбъектЗадача, Конструктор);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Задача
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.Композиция = &Композиция";
		
		Запрос.УстановитьПараметр("Композиция", Задача);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Выборка.Задача);
			
			ОбъектЗадача 				= Выборка.Задача.ПолучитьОбъект();
			ОбъектЗадача.Дата 			= ТекущаяДата();
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Завершение;
			ОбъектЗадача.Выполнена      = Истина;
			
			ОбъектЗадача.Записать(); 
			
			омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Выборка.Задача);
			
			Если ТипЗнч(ОбъектЗадача.ОбъектТЗ) = Тип("СправочникСсылка.ИзделияКомплект") Тогда
				СоздатьЗадачуРКД(ОбъектЗадача, Конструктор);
			КонецЕсли;
			
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура СоздатьЗадачуРКД(ОбъектЗадача, Конструктор)
	
	ЗадачаРКД 					= Задачи.Задачи_РКД.СоздатьЗадачу();
	ЗадачаРКД.Дата 				= ТекущаяДата();
	ЗадачаРКД.Исполнитель 		= Конструктор;
	ЗадачаРКД.Дата 				= ТекущаяДата();
	ЗадачаРКД.Наименование		= Строка(ОбъектЗадача.ОбъектТЗ) + ".РКД.Разработка";
	ЗадачаРКД.ОбъектТЗ 			= ОбъектЗадача.ОбъектТЗ;
	ЗадачаРКД.Основание 		= ОбъектЗадача.Ссылка;
	ЗадачаРКД.Проект 			= ОбъектЗадача.Проект;
	ЗадачаРКД.СтатусЗадачи		= Перечисления.СтатусыЗадач.РКД;
	ЗадачаРКД.ТипЗадачи			= Перечисления.ТипыЗадачКонструирования.Разработка;
	
	ЗадачаРКД.Записать();
	
	МенеджерРегистра = РегистрыСведений.ТаймингЗадач;
	стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, Конструктор, Перечисления.СтатусыЗадач.РКД, ОбъектЗадача.ТипЗадачи);
	МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ЗадачаРКД.Ссылка, стДанные);
	
	
КонецПроцедуры



