
Процедура ПриЗаписи(Отказ)
	
	Если НЕ ДополнительныеСвойства.Свойство("НеПроверятьОбобщеность") Тогда
		
		омЗадачиПКДСервер.ПроверкаОбобщеннойЗадачи(Ссылка);
		
	КонецЕсли; 
	
	омЗадачиОбщие.ЗаполнитьПланНаОснованииЗапускаВРаботу(Ссылка, Строка(Ссылка));	
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	КоличествоНеВыполненыхВопросовЧекЛиста = 0;
	
	Для каждого х Из ЧекЛист Цикл
	
		Если НЕ х.Выполнение Тогда
		
			КоличествоНеВыполненыхВопросовЧекЛиста = КоличествоНеВыполненыхВопросовЧекЛиста + 1;		
		
		КонецЕсли;	
	
	КонецЦикла;
	
	Если НормаВремени = 0 Тогда
	
		НормаВремени = омЗадачиПКДСервер.НормаВремениПКДОбъектаТЗ(ОбъектТЗ);	
	
	КонецЕсли;
	
КонецПроцедуры

