
Процедура ПриЗаписи(Отказ)

	
	Если НЕ ДополнительныеСвойства.Свойство("НеПроверятьОбобщеность") Тогда
		
		омЗадачиПКДСервер.ПроверкаОбобщеннойЗадачи(Ссылка);
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Ссылка);
		
		Если НЕ Выполнена Тогда
		
			ПроверитьГантКонструктора();
		
		КонецЕсли;

	КонецЕсли;
	
	
	
КонецПроцедуры


Функция ПолучитьЗаголовок() Экспорт 
	
	Возврат Строка(ОбъектТЗ) + ".ПКД." + ТипЗадачи;	
	
КонецФункции // ПолучитьЗаголовок()


Процедура ПередЗаписью(Отказ)
	Заголовок 	= ПолучитьЗаголовок();
КонецПроцедуры

Процедура ПроверитьГантКонструктора()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.ГантКонструктораНачалоПКД КАК ГантКонструктораНачалоПКД,
		|	ДатыКомплекта.ДнейПКД КАК ДнейПКД
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПустаяДата 	= Дата(1, 1, 1);
	ДнейПКД		= 1;
	ГантКонструктораНачалоПКД = ПустаяДата;
	
	Пока Выборка.Следующий() Цикл
		ДнейПКД 					= Выборка.ДнейПКД;
		ГантКонструктораНачалоПКД 	= Выборка.ГантКонструктораНачалоПКД;
	КонецЦикла;
	
	Если ГантКонструктораНачалоПКД = ПустаяДата Тогда
	
		МенеджерЗаписи = РегистрыСведений.ДатыКомплекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Комплект = ОбъектТЗ;
		МенеджерЗаписи.Проект 	= Проект; 
		МенеджерЗаписи.Прочитать();
	
		МенеджерЗаписи.Комплект 					= ОбъектТЗ;
		МенеджерЗаписи.Проект 						= Проект; 
        МенеджерЗаписи.ГантКонструктораНачалоПКД 	= Дата;
		МенеджерЗаписи.ГантКонструктораОкончаниеПКД = омДаты.ДобавитьДниСУчетомВыходных(Дата, ДнейПКД);
		
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
