
Процедура ПриЗаписи(Отказ)
	
	Если НЕ ДополнительныеСвойства.Свойство("НеПроверятьОбобщеность") Тогда
		
		омЗадачиПКДСервер.ПроверкаОбобщеннойЗадачи(Ссылка);
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановоеЗначениеПроектирования.Задача КАК Задача
		|ИЗ
		|	РегистрСведений.ПлановоеЗначениеПроектирования КАК ПлановоеЗначениеПроектирования
		|ГДЕ
		|	ПлановоеЗначениеПроектирования.Задача.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
	
		омЗадачиОбщие.ЗаполнитьПланНаОснованииЗапускаВРаботу(Ссылка, Строка(Ссылка));	
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	КоличествоНеВыполненыхВопросовЧекЛиста = 0;
	
	Для каждого х Из ЧекЛист Цикл
	
		Если НЕ х.Выполнение Тогда
		
			КоличествоНеВыполненыхВопросовЧекЛиста = КоличествоНеВыполненыхВопросовЧекЛиста + 1;		
		
		КонецЕсли;	
	
	КонецЦикла;
	
КонецПроцедуры

