
Процедура ПриЗаписи(Отказ)

	
	Если НЕ ДополнительныеСвойства.Свойство("НеПроверятьОбобщеность") Тогда
		
		омЗадачиПКДСервер.ПроверкаОбобщеннойЗадачи(Ссылка);
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Ссылка);
		
		Если НЕ Выполнена Тогда
		
			ПроверитьГантКонструктора();
		
		КонецЕсли;

	КонецЕсли;
	
	
	
КонецПроцедуры


Функция ПолучитьЗаголовок() Экспорт 
	
	Суффикс = "";
	
	Если  ТипЗадачи = Перечисления.ТипыЗадачКонструирования.Разработка 
		ИЛИ ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором 
		ИЛИ ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние
				|ИЗ
				|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача.Ссылка = &Ссылка) КАК ТаймингЗадачСрезПоследних";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Суффикс = Строка(Выборка.Состояние);
			КонецЦикла;
	
	
	КонецЕсли;

	
	Возврат Строка(ОбъектТЗ) + ".ПКД." + ?(ПустаяСтрока(Суффикс), ТипЗадачи, Суффикс);;	
	
КонецФункции // ПолучитьЗаголовок()


Процедура ПередЗаписью(Отказ)
	Заголовок 	= ПолучитьЗаголовок();
	
	КоличествоНеВыполненыхВопросовЧекЛиста = 0;
	Для каждого х Из ЧекЛист Цикл
	
		Если НЕ х.Выполнение Тогда
		
			КоличествоНеВыполненыхВопросовЧекЛиста = КоличествоНеВыполненыхВопросовЧекЛиста + 1;		
		
		КонецЕсли;	
	
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПроверитьГантКонструктора()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.ГантКонструктораНачалоПКД КАК ГантКонструктораНачалоПКД,
		|	ДатыКомплекта.ДнейПКД КАК ДнейПКД
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПустаяДата 	= Дата(1, 1, 1);
	ДнейПКД		= 1;
	ГантКонструктораНачалоПКД = ПустаяДата;
	
	Пока Выборка.Следующий() Цикл
		ДнейПКД 					= Выборка.ДнейПКД;
		ГантКонструктораНачалоПКД 	= Выборка.ГантКонструктораНачалоПКД;
	КонецЦикла;
	
	Если ГантКонструктораНачалоПКД = ПустаяДата Тогда
	
		МенеджерЗаписи = РегистрыСведений.ДатыКомплекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Комплект = ОбъектТЗ;
		МенеджерЗаписи.Проект 	= Проект; 
		МенеджерЗаписи.Прочитать();
	
		МенеджерЗаписи.Комплект 					= ОбъектТЗ;
		МенеджерЗаписи.Проект 						= Проект; 
        МенеджерЗаписи.ГантКонструктораНачалоПКД 	= Дата;
		МенеджерЗаписи.ГантКонструктораОкончаниеПКД = омДаты.ДобавитьДниСУчетомВыходных(Дата, ДнейПКД);
		
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
