
Процедура УстановитьКорпаративныйАккаунт() Экспорт
 
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСеанса.КорпоротивныйАккаунт = Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.КорпоративныйАккаунт КАК КорпоративныйАккаунт
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.ТекущийПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПараметрыСеанса.КорпоротивныйАккаунт = Выборка.КорпоративныйАккаунт;	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.КорпоротивныйАккаунт) И НЕ ИспользоватьКорпоративнуюПочту() Тогда
		
		ПараметрыСеанса.КорпоротивныйАккаунт = Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка();
		
	КонецЕсли;
	
КонецПроцедуры // ЕстьКорпаративнаяПочта()

Функция ИспользоватьКорпоративнуюПочту() Экспорт

	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки
		|	И НастройкиПроекта.Значение = Истина";
		
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.ПолучитьИмяНеЗагружатьПочту());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат Истина;
		
	КонецЦикла; 
	
	Возврат Ложь;

КонецФункции // ИспользоватьКорпоративнуюПочту()


Функция ПолучитьСписокПисем()

	

КонецФункции // ПолучитьСписокПисем()





