
Процедура УстановитьКорпаративныйАккаунт() Экспорт
 
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСеанса.КорпоротивныйАккаунт = Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.КорпоративныйАккаунт КАК КорпоративныйАккаунт
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.ТекущийПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПараметрыСеанса.КорпоротивныйАккаунт = Выборка.КорпоративныйАккаунт;	
	КонецЦикла;
	
КонецПроцедуры // ЕстьКорпаративнаяПочта()

Функция ПолучитьСписокПисем()

	

КонецФункции // ПолучитьСписокПисем()





