
&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = "Файл изображения|*.jpg;*.png;*.jpeg"; 
	ПомещенныйФайл = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога);
	
	Если ПомещенныйФайл <> Неопределено И Не ПомещенныйФайл.ПомещениеФайлаОтменено Тогда 
		ИмяФайла = ПомещенныйФайл.СсылкаНаФайл.Имя;
		ЗаписатьФайлКартинкиНаСервере(ПараметрКоманды, ПомещенныйФайл.Адрес, ИмяФайла);
		Оповестить("Добавлена картинка", ПараметрКоманды);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьФайлКартинкиНаСервере(ЭлементСделки, АдресВХ, ИмяФайла)

	
	МЗ = РегистрыСведений.КартинкиНоменклатуры.СоздатьМенеджерЗаписи();
	
	МЗ.ИзделиеЭлемент 	= ЭлементСделки;
	МЗ.ИмяФайла 		= ИмяФайла;
	МЗ.Картинка 		= Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХ));
	
	МЗ.Записать();
	
	
КонецФункции