
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЛегенду();
	
КонецПроцедуры

Процедура ЗаполнитьЛегенду()
	
	мШиринаКолонок = Новый Массив(3);
	мШиринаКолонок[0] = 5;
	мШиринаКолонок[1] = 20;
	мШиринаКолонок[2] = 40;
	
	омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(Легенда, мШиринаКолонок);
	
	стПараметровОбласти = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров();
	
	БелыйЦвет = Новый Цвет(255, 255, 255);
	
	ЭтапыДляВывода = Новый Массив(7);  
	
	ЭтапыДляВывода[0] = "ПКД";
	ЭтапыДляВывода[1] = "РКД";
	ЭтапыДляВывода[2] = "Проект";
	ЭтапыДляВывода[3] = "Пауза";
	ЭтапыДляВывода[4] = "ЗадачаПросрочена";
	ЭтапыДляВывода[5] = "Выходной";
	ЭтапыДляВывода[6] = "ПланКонструирование";
	
	НомерСтроки = 2; 
	
	тзЦвета = омДиаграммаГанта.ПолучитьТаблицуЦветов();
	
	Для каждого х Из тзЦвета Цикл
		
		Если х.ЭтоГруппа ИЛИ ЭтапыДляВывода.Найти(х.НаименованиеЭтапа) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		стПараметровОбласти.Текст 				= "";
		стПараметровОбласти.НомерСтроки 		= НомерСтроки;
		стПараметровОбласти.НомерКолонки 		= 2;
		стПараметровОбласти.ЦветФона            = омДиаграммаГанта.ПолучитьЦвет(х.НаименованиеЭтапа, тзЦвета);
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(Легенда, стПараметровОбласти);
		
		стПараметровОбласти.Текст 				= ?(х.НаименованиеЭтапа = "", "Исполнитель", х.НаименованиеЭтапа);
		стПараметровОбласти.НомерКолонки 		= 3;
		стПараметровОбласти.ЦветФона            = БелыйЦвет;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(Легенда, стПараметровОбласти);

		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла; 
	
	стПараметровОбласти.Текст 				= "";
	стПараметровОбласти.НомерСтроки 		= НомерСтроки;
	стПараметровОбласти.НомерКолонки 		= 2;
	стПараметровОбласти.ЦветФона            = омДиаграммаГанта.ПолучитьЦвет("", тзЦвета);
	омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(Легенда, стПараметровОбласти);
	
	стПараметровОбласти.Текст 				= "Конструктор";
	стПараметровОбласти.НомерКолонки 		= 3;
	стПараметровОбласти.ЦветФона            = БелыйЦвет;
	омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(Легенда, стПараметровОбласти);
	
КонецПроцедуры
