
Функция СериализоватьВJSONНаСервере(СериализуемыйОбъект) Экспорт
    
    ЗаписьJSON = Новый ЗаписьJSON; 
    ЗаписьJSON.УстановитьСтроку();
    НастройкиСериализации = Новый НастройкиСериализацииJSON();
    НастройкиСериализации.СериализовыватьМассивыКакОбъекты = Ложь;
    ЗаписатьJSON(ЗаписьJSON, СериализуемыйОбъект); 
    СтрокаJSON = ЗаписьJSON.Закрыть();
        
    Возврат СтрокаJSON; 

КонецФункции

Функция ДесериализоватьИзJSONНаСервере(СтрокаJSON) Экспорт
    
    ЧтениеJSON = Новый ЧтениеJSON(); 
    ЧтениеJSON.УстановитьСтроку(СтрокаJSON); 
    ДесериализованныйОбъект = ПрочитатьJSON(ЧтениеJSON); 
    ЧтениеJSON.Закрыть();
    
    Возврат ДесериализованныйОбъект;
    
КонецФункции