Процедура УвеличитьВерсию(ТипВерсии, НомерВерсииТекущий = 0, ПриЗакрытии = Ложь, Пользователь = Неопределено) Экспорт
	
	ПользовательДляЗаписи = ПолучитьПользователяДляЗаписи(Пользователь);	
	
	МенеджерЗаписей = РегистрыСведений.ВерсииОбщихЗадач.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписей.Пользователь 	= ПользовательДляЗаписи;
	МенеджерЗаписей.ТипВерсии 		= ТипВерсии;
	
	МенеджерЗаписей.Прочитать();
	
	Если МенеджерЗаписей.Выбран() Тогда
	
		Если ПриЗакрытии Тогда
			МенеджерЗаписей.НомерВерсииПриЗакрытии = НомерВерсииТекущий;	
		Иначе
			МенеджерЗаписей.НомерВерсии = ?(МенеджерЗаписей.НомерВерсии > 99999, 1, МенеджерЗаписей.НомерВерсии  + 1);	
		КонецЕсли;
		
	Иначе
		
		МенеджерЗаписей.Пользователь 	= ПользовательДляЗаписи;
		МенеджерЗаписей.ТипВерсии 		= ТипВерсии;
		
		Если ПриЗакрытии Тогда
			МенеджерЗаписей.НомерВерсииПриЗакрытии = НомерВерсииТекущий;	
		Иначе
			МенеджерЗаписей.НомерВерсии = 1;	
		КонецЕсли;

	КонецЕсли;
	
	МенеджерЗаписей.Записать();
	
КонецПроцедуры

Функция ПолучитьНомерВерсии(ТипВерсии = Неопределено, Пользователь = Неопределено) Экспорт  
	
	ПользовательДляЗаписи = ПолучитьПользователяДляЗаписи(Пользователь); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииОбщихЗадач.ТипВерсии КАК ТипВерсии,
		|	ВерсииОбщихЗадач.НомерВерсии КАК НомерВерсии,
		|	ВерсииОбщихЗадач.НомерВерсииПриЗакрытии КАК НомерВерсииПриЗакрытии
		|ИЗ
		|	РегистрСведений.ВерсииОбщихЗадач КАК ВерсииОбщихЗадач
		|ГДЕ
		|	ВерсииОбщихЗадач.Пользователь = &Пользователь
		|	И ВЫБОР
		|			КОГДА &ТипВерсии = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВерсииОбщихЗадач.ТипВерсии = &ТипВерсии
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Пользователь", 	ПользовательДляЗаписи);
	Запрос.УстановитьПараметр("ТипВерсии", 		ТипВерсии);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПерваяЗапись = Истина;
	НомерЗаписи = 0;
	
	Пока Выборка.Следующий() Цикл
		Если ПерваяЗапись Тогда
			
			ПерваяЗапись = Ложь;
			
			Если ТипВерсии = Неопределено Тогда 
				ДанныеНомерВерсии = Новый Массив(Выборка.Количество());	
			Иначе
				Возврат Новый Структура("НомерВерсии, НомерВерсииПриЗакрытии"
								, Выборка.НомерВерсии, Выборка.НомерВерсииПриЗакрытии);
				
			КонецЕсли; 
		КонецЕсли;
		
		ДанныеНомерВерсии[НомерЗаписи] =  Новый Структура("ТипВерсии, НомерВерсии, НомерВерсииПриЗакрытии"
															, Выборка.ТипВерсии
															, Выборка.НомерВерсии
															, Выборка.НомерВерсииПриЗакрытии);
		НомерЗаписи = НомерЗаписи + 1;
		
	КонецЦикла;
	
	Если ПерваяЗапись Тогда
		
		Если ТипВерсии = Неопределено Тогда
			Возврат Новый Массив;
		КонецЕсли;
		
		Возврат Новый Структура("НомерВерсии, НомерВерсииПриЗакрытии", -1, -1);		
		
	КонецЕсли; 
	
	Возврат ДанныеНомерВерсии;
	
КонецФункции // ПолучитьНомерВерсии() 

Функция ПолучитьПользователяДляЗаписи(Пользователь)

	Возврат ?(Пользователь = Неопределено, 
				ПараметрыСеанса.ТекущийПользователь,
				Пользователь);
	

КонецФункции // ПолучитьПользователяДляЗаписи()
 
