
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_СписаниеМатериалов", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	омЕдиницыКлиент.ЗаполнитьЕдиницуПриИзмененииМатериала(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницыИзмеренияПриИзменении(Элемент)
	омЕдиницыКлиент.ЗаполнитьКоэффициентПриИзмененииЕдиницы(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницыИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ТД = Элементы.Материалы.ТекущиеДанные;
	Элемент.СписокВыбора.ЗагрузитьЗначения(омЕдиницыИзмерения.ЕдиницыИзмеренийНоменклатурыДляВыбора(ТД.Номенклатура));
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекущаяСтрока.Сумма 				= ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	Если ТекущаяСтрока.Цена = 0 Тогда
		ТекущаяСтрока.РучноеДобавление 	= Ложь;
	Иначе
		ТекущаяСтрока.РучноеДобавление 	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция  РасчитатьЦеныСебестоимостиНаСервере(мМатериалы, Склад, Дата, Ссылка)
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(омЦеныНаСервере.ПолучитьСебестоимостьМатериалов(мМатериалы, Склад, Новый МоментВремени(Дата,Ссылка)));
КонецФункции

&НаКлиенте
Процедура РасчитатьЦеныСебестоимости(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Склад";
		Сообщение.Текст = "Не заполнен склад.";
		Сообщение.Сообщить();
		
	    Возврат;
	КонецЕсли;
	
	мМатериалы = Новый Массив;
	
	Для каждого текМатериал Из Объект.Материалы Цикл
		Если НЕ текМатериал.РучноеДобавление И мМатериалы.Найти(текМатериал.Номенклатура) = Неопределено Тогда
			мМатериалы.Добавить(текМатериал.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Если мМатериалы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	мЦены = РасчитатьЦеныСебестоимостиНаСервере(мМатериалы, Объект.Склад, Объект.Дата, Объект.Ссылка );
	
	стОтбор = Новый Структура("РучноеДобавление,Номенклатура",Ложь, );
	Для каждого текЦена Из мЦены Цикл
		стОтбор.Материал = текЦена.Номенклатура;
		
		Для каждого текМатериал Из Объект.Материалы.НайтиСтроки(стОтбор) Цикл
			Если текМатериал.Коэффициент = 0 Тогда
				Продолжить;
			КонецЕсли;	
			
			текМатериал.Цена 	= текЦена.Цена * текМатериал.Коэффициент;
			текМатериал.Сумма 	= текМатериал.Цена * текМатериал.Количество;
		
		КонецЦикла;     	
	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	мМатериал = Новый Массив;
	
	Для каждого текСтрока Из Объект.Материалы Цикл
		Если мМатериал.Найти(текСтрока.Номенклатура) = Неопределено Тогда
			мМатериал.Добавить(текСтрока.Номенклатура);
		Иначе	
		    Отказ = Истина;
			ПоказатьПредупреждение(,"Задвоен Номенклатура " + текСтрока.Номенклатура);
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
