
&НаКлиенте
Процедура ТаблицаДанныхПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДанные();
КонецПроцедуры

Процедура ЗаполнитьДанные()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Задача,
		|	Задачи_ПКД.ОбъектТЗ КАК Изделие,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях КАК ПланРазработкиВДнях
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних КАК ПлановоеЗначениеПроектированияСрезПоследних
		|		ПО Задачи_ПКД.ОбъектТЗ = ПлановоеЗначениеПроектированияСрезПоследних.Задача
		|ГДЕ
		|	НЕ Задачи_ПКД.Выполнена
		|	И (ДанныеКомплектаСрезПоследних.Конструктор ЕСТЬ NULL
		|			ИЛИ ДанныеКомплектаСрезПоследних.Конструктор = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|			ИЛИ ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях ЕСТЬ NULL
		|			ИЛИ ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях = 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Задачи_РКД.Ссылка,
		|	Задачи_РКД.ОбъектТЗ,
		|	ДанныеКомплектаСрезПоследних.Конструктор,
		|	ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО Задачи_РКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних КАК ПлановоеЗначениеПроектированияСрезПоследних
		|		ПО Задачи_РКД.ОбъектТЗ = ПлановоеЗначениеПроектированияСрезПоследних.Задача
		|ГДЕ
		|	НЕ Задачи_РКД.Выполнена
		|	И (ДанныеКомплектаСрезПоследних.Конструктор ЕСТЬ NULL
		|			ИЛИ ДанныеКомплектаСрезПоследних.Конструктор = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|			ИЛИ ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях ЕСТЬ NULL
		|			ИЛИ ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях = 0)";
	
	ТаблицаДанных.Загрузить(Запрос.Выполнить().Выгрузить());
	

КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДанныхПередНачаломИзменения(Элемент, Отказ)
	
	ТД = Элементы.ТаблицаДанных.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
	
		Отказ = Истина;
		Возврат;
	
	КонецЕсли;
	
	
	Если Элемент.ТекущийЭлемент.Имя = "ТаблицаДанныхИзделие" Тогда
	
		Отказ = Истина;
		ПоказатьЗначение(, ТД.Изделие);	
	
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ТаблицаДанныхЗадача" Тогда
	
		Отказ = Истина;
		ПоказатьЗначение(, ТД.Задача);
	
	Иначе
		
		Элементы.ФормаСохранить.Доступность = Истина;
		ТД.Изменен = Истина;
	
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СохранитьНаСервере(СтруктураДанных)
	
	
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура Сохранить(Команда)
	
	Элементы.ФормаСохранить.Доступность = Ложь;
	
	мДанные = Новый Массив;
	
	Для каждого х Из ТаблицаДанных Цикл
	
		Если х.Изменен Тогда
		
			х.Изменен = НЕ х.Изменен;
			СтруктураДанных = Новый Структура("Задача, Изделие, Конструктор, ПланРазработкиВДнях", );
			ЗаполнитьЗначенияСвойств(СтруктураДанных, х);
			мДанные.Добавить(СтруктураДанных);
		
		КонецЕсли;
	
	КонецЦикла;
	
	СохранитьНаСервере(СтруктураДанных);
	
КонецПроцедуры

