// <Описание функции>
//
// Параметры
//  <текОблость>  - <Строка> - <текущая область (R7C2)>
//  <СдвигВниз>  - <Число> - <Сдвиг по вертикали, если отрицательное то вверх>
//  <СвдигВправо>  - <Число> - <Сдвиг по горизонтали, если отрицательное то вверх>
//
// Возвращаемое значение:
//   <строка>   - <полученная область (R7C2)>
//
//&НаКлиентеНаСервере 
Функция ПолучитьСоседниюОбласть(текОблость,СдвигВниз,СвдигВправо) Экспорт
    текСтрока = "";
    текКолонка = "";
    Разделитель = Ложь;
    текАдрес = СокрЛП(текОблость);
    ДлинаАдреса = СтрДлина(текАдрес);
	Для х=1 По ДлинаАдреса Цикл
        буф = Сред(текАдрес,х,1);
    	Если ВРег(буф) = "R" Тогда
            Продолжить;
        ИначеЕсли ВРег(буф) = "C" Тогда	
            Разделитель = Истина;
        ИначеЕсли Разделитель Тогда
            текКолонка = текКолонка + буф;
        Иначе
            текСтрока = текСтрока + буф;
        КонецЕсли; 
    КонецЦикла; 
    текСтрока = Число(текСтрока) 	+ СдвигВниз;
    текКолонка = Число(текКолонка) 	+ СвдигВправо;
    Возврат("R" + текСтрока + "C" + текКолонка);
КонецФункции // ПолучитьСоседниюОбласть()

Функция РазобратьИмяЯчейки(текИмяОбласти) Экспорт
    текСтрока  = "";
    текКолонка = "";
	флИмяСтрока = Истина;
	флПервыйРаз = Истина;
    буфер = СокрЛП(текИмяОбласти);
    Для х = 1 По СтрДлина(буфер) Цикл
        текЗнак = Сред(буфер, х, 1);
        Если текЗнак = ":" Тогда
            Прервать;
        КонецЕсли; 
        Если текЗнак = "R" Тогда
            Если НЕ флПервыйРаз Тогда
                Прервать;
            КонецЕсли; 
        	флПервыйРаз = Ложь;
            Продолжить;
        КонецЕсли; 
        Если текЗнак = "C" Тогда
            Если флИмяСтрока Тогда
                флИмяСтрока = Ложь;
            КонецЕсли; 
            Продолжить;
        КонецЕсли; 
        Если флИмяСтрока Тогда
            текСтрока  = текСтрока  + текЗнак;
        Иначе
            текКолонка = текКолонка + текЗнак;
        КонецЕсли; 
    КонецЦикла; 
    стрВозврата = Новый Структура("Строка", Число(текСтрока));
    стрВозврата.Вставить("Колонка",  Число(текКолонка));
    Возврат(стрВозврата);
КонецФункции // ()


&НаСервере
Функция ПолучитьСтруктуруШрифта()
	Возврат Новый Структура("Имя,Размер,Жирный,Наклонный,Подчеркивание,Зачеркивание","Arial",10,Ложь,Ложь,Ложь,Ложь);
КонецФункции // ПолучитьСтруктуруШрифта()

&НаСервере
Функция ПолучитьШрифт(стШрифт)
  Возврат Новый Шрифт(стШрифт.Имя,стШрифт.Размер,стШрифт.Жирный,стШрифт.Наклонный,стШрифт.Подчеркивание,стШрифт.Зачеркивание);

КонецФункции // ПолучитьШрифт()

&НаСервере
Процедура ИзменитьШрифтОбласти(Область,стШрифт)
	текШрифт = Область.Шрифт;
	
	стТекущийШрифт = ПолучитьСтруктуруШрифта();
	Если НЕ текШрифт = Неопределено Тогда
		стТекущийШрифт.Имя 				= текШрифт.Имя;
		стТекущийШрифт.Размер 			= текШрифт.Размер;
		стТекущийШрифт.Жирный 			= текШрифт.Жирный;
		стТекущийШрифт.Наклонный 		= текШрифт.Наклонный;
		стТекущийШрифт.Зачеркивание		= текШрифт.Зачеркивание;
		стТекущийШрифт.Подчеркивание 	= текШрифт.Подчеркивание;
	КонецЕсли;
	
	ДозаполнитьСтруктуру(стТекущийШрифт,стШрифт);
	Область.Шрифт = ПолучитьШрифт(стТекущийШрифт); 

КонецПроцедуры // ИъзменитьШрифтОбласти()


&НаСервере
Процедура ФорматЯчейки(Область,СтрШрифт,ГоризонтальноеПол,ВертикальноеПол,Ширина=0)
  Если ЗначениеЗаполнено(ГоризонтальноеПол) Тогда
	  Область.ГоризонтальноеПоложение=ГоризонтальноеПол;    
  КонецЕсли; 
  Если ЗначениеЗаполнено(ВертикальноеПол) Тогда
	  Область.ВертикальноеПоложение=ВертикальноеПол;    
  КонецЕсли; 
  Если Ширина>0 Тогда
	  Область.ШиринаКолонки=Ширина;
  КонецЕсли; 
КонецПроцедуры // ФорматЯчейки()

&НаСервере
Процедура ОбвестиОбласть(Область,Знач ТипЛинии = Неопределено,Толщина = 1)
	Если ТипЛинии = Неопределено Тогда
		ТипЛинии = ТипЛинииЯчейкиТабличногоДокумента.Сплошная;	
	КонецЕсли;
	текЛинии=Новый Линия(ТипЛинии,Толщина);
    Область.ГраницаСлева 	= текЛинии;
    Область.ГраницаСнизу 	= текЛинии;
    Область.ГраницаСправа	= текЛинии;
    Область.ГраницаСнизу 	= текЛинии;
КонецПроцедуры // ОбвестиОбласть()

&НаСервере
Функция ПолучитьСтруктуруПоложения()
	Возврат Новый Структура("Горизонтальное,Вертикальное",ГоризонтальноеПоложение.Лево,ВертикальноеПоложение.Центр);
КонецФункции // ПолучитьСтруктуруШрифта()

&НаСервере
Функция ЗаполнитьСтруктуруПоложение(стПоложение)
	ПоложениеОбразец = ПолучитьСтруктуруПоложения();
	ДозаполнитьСтруктуру(ПоложениеОбразец,стПоложение);
	Возврат ПоложениеОбразец;
КонецФункции // ПолучитьСтруктуруШрифта()

&НаСервере
Функция ЗаполнитьСтруктуруШрифта(стШрифт)
	ШрифтОбразец = ПолучитьСтруктуруШрифта();
	ДозаполнитьСтруктуру(ШрифтОбразец,стШрифт);
	Возврат ШрифтОбразец;
КонецФункции // ПолучитьСтруктуруШрифта()

&НаСервере
Процедура ДозаполнитьСтруктуру(стОбразец,стДанные)
	Если НЕ ТипЗнч(стДанные) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент из стДанные Цикл 
		Если стОбразец.Свойство(Элемент.Ключ) Тогда
			стОбразец[Элемент.Ключ] = Элемент.Значение; 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ДозаполнмтьСтруктуру()


&НаСервере
Функция ПолучитьОбласть(ТабДокумент,стКоординаты)
	Если стКоординаты.Свойство("ПравоНиз") Тогда
		Область = ТабДокумент.Область(стКоординаты.ЛевоВерх + ":" + стКоординаты.ПравоНиз);
	ИначеЕсли стКоординаты.Свойство("Высота") Тогда
		ПравоНиз = ПолучитьСоседниюОбласть(стКоординаты.ЛевоВерх,стКоординаты.Высота -1,стКоординаты.Ширина - 1);	
		Область = ТабДокумент.Область(стКоординаты.ЛевоВерх + ":" + ПравоНиз);
	Иначе
		Область = ТабДокумент.Область(стКоординаты.ЛевоВерх);
	КонецЕсли;
	
	Возврат Область;
КонецФункции // ПолучитьКоординатыОбласти()

&НаСервере
Функция ПолучитьШиринуКолонокПоУмолчанию(КоличествоКолонок = 10) Экспорт

	Если НЕ ТипЗнч(КоличествоКолонок) = Тип("Число") И КоличествоКолонок <=0 Тогда
	 	Возврат Новый Массив;
	КонецЕсли;
	
	мШиронаКолонок = Новый Массив(КоличествоКолонок);
	мШиронаКолонок[0] = 2;
	
	Для номерКолонки = 1 По КоличествоКолонок - 1 Цикл
		мШиронаКолонок[номерКолонки] = 10;
	КонецЦикла;
	
	Возврат мШиронаКолонок;
КонецФункции // ПолучитьШиринуКолонокПоУмолчанию() 

&НаСервере
Процедура УстановитьШиринуКолонок(ТабДокумент,мШиринаКолонок) Экспорт
	счКолонок = 1;
	Для каждого ширинаКолонки Из мШиринаКолонок Цикл
		ТабДокумент.Область(,счКолонок,,счКолонок).ШиринаКолонки = ширинаКолонки;
		счКолонок = счКолонок + 1;
	КонецЦикла;
КонецПроцедуры // УстановитьШиринуКолонок(мШиринаКолонок)()



//стПоложение - структура "Горизонтальное,Вертикальное". по умолчанию Лево, Центр передаются только те поля которые не равны по умолчанию ПолучитьСтруктуруПоложения()
//стКоординаты - структура ЛевоВерх, ПравоНиз не оязательная (выводится одна ячейка). Формат "R1C2" или ЛевоВерх, Ширина, Высота цифры
//стШрифт - структура передаются только те поля которые не равны по умолчанию ПолучитьСтруктуруШрифта 
	//стШрифт.Вставить("Имя","");
	//стШрифт.Вставить("Размер",11);
	//стШрифт.Вставить("Жирный",1);
	//стШрифт.Вставить("Наклонный",0);
	//стШрифт.Вставить("Подчеркнутый",0);
	//стШрифт.Вставить("Зачеркнутый",0);

&НаСервере
Процедура ВывестиОбласть(ТабДокумент,стКоординаты,Текст,Расшифровка = Неопределено, 
	Цвет = Неопределено,Знач стШрифт = Неопределено,
	Знач стПоложение = Неопределено, Ширина = Неопределено, ОбъединятьОбласть = Истина, ЦветТекста = Неопределено) Экспорт

	Область = ПолучитьОбласть(ТабДокумент, стКоординаты);
	Если ОбъединятьОбласть Тогда
		Область.Объединить();
	КонецЕсли;
	Область.Расшифровка = Расшифровка; 
	стПоложениеПараметры = ЗаполнитьСтруктуруПоложение(стПоложение);
	Область.ГоризонтальноеПоложение = стПоложениеПараметры.Горизонтальное;
	Область.ВертикальноеПоложение 	= стПоложениеПараметры.Вертикальное;
	
	ИзменитьШрифтОбласти(Область,ЗаполнитьСтруктуруШрифта(стШрифт));
	Область.Текст = Текст;
	
	Если НЕ Цвет = Неопределено Тогда
		Область.ЦветФона = Цвет;
	КонецЕсли;
	Если НЕ ЦветТекста = Неопределено Тогда
		Область.ЦветТекста = ЦветТекста;
	КонецЕсли;
КонецПроцедуры // СоздатьШапку()

