
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	УИДДоскиПроизводство 	= омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("НаименованиеДоскиПроизводство");
	
	ИмяКолонки 				= ОбъектОтчета.НаименованиеКолонкиОжиданиеПроизводства();
	УИДКолонкаОжидание		= омКанбанДоскиНаСервереПовтор.ПолучитьУИДКолонки(УИДДоскиПроизводство, ИмяКолонки);
	
	ЗаполнитьКомплекты();
	
КонецПроцедуры


Процедура ЗаполнитьКомплекты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.ОбъектТЗ КАК ОбъектТЗ
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанПереходКарточки КАК КанбанПереходКарточкиСрезПоследних
		|			ПО КанбанКарточки.УИД = КанбанПереходКарточкиСрезПоследних.УИДКарточка
		|				И (КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = &УИДКудаКолонка)
		|		ПО Задачи_РКД.ОбъектТЗ = КанбанКарточки.Ресурс
		|ГДЕ
		|	Задачи_РКД.Выполнена
		|	И КанбанКарточки.Ресурс ЕСТЬ NULL
		|	И ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Задачи_РКД.Проект = &Проект
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Задачи_РКД.ОбъектТЗ.Наименование";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("УИДКудаКолонка", УИДКолонкаОжидание);
	
	Комплекты.Очистить();
	Комплекты.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектТЗ"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПеренестиВПроизводствоНаСервере(УИДДоскиПроизводство, УИДКолонкаОжидание, МассивКомплектов, Проект)


	ИмяДоски = омКанбанДоскиНаСервереПовтор.ПолучитьИмяДоски("НаименованиеДоскиПроизводство");
	стРазделители = Новый Структура("Проект, Сотрудник", Проект, Неопределено);
	
	омКанбанНачальноеЗаполнение.ЗаполнитьНачальноеЗаполнениеКанбана(ИмяДоски, стРазделители, МассивКомплектов, "Начальное заполнение"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВПроизводство(Команда)
	
	МассивКомплектов = Новый Массив;
	
	Для каждого ТекущийЭлементКомплекта Из Комплекты Цикл
	
		Если ТекущийЭлементКомплекта.Пометка Тогда
		
			МассивКомплектов.Добавить(ТекущийЭлементКомплекта.Значение);	
		
		КонецЕсли;	
	
	КонецЦикла;
	
	Если МассивКомплектов.Количество() > 0 Тогда
	
		ПеренестиВПроизводствоНаСервере(УИДДоскиПроизводство, УИДКолонкаОжидание, МассивКомплектов, Проект); 
	
		ЗаполнитьКомплекты();
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ЗаполнитьКомплекты(); 
	
	Элементы.ФормаПеренестиВПроизводство.Доступность = ЗначениеЗаполнено(Проект);
КонецПроцедуры
