Процедура СоздатьЭлементыИРеквизитыНаФорме(ТекущаяФорма,РодительскийЭлемент) Экспорт
	
	ЭлементГруппа 		= СоздатьГруппуКартинка(ТекущаяФорма, РодительскийЭлемент);
	ЭлементГруппаКнопки = СоздатьГруппуКнопки(ТекущаяФорма, ЭлементГруппа);
	СоздадьКомандуДобавитьКартинку(ТекущаяФорма);
	СоздатьКнопкуДобавитьКартинку(ТекущаяФорма, ЭлементГруппаКнопки);
	//СоздатьКнопкуВсеКомментарии(ТекущаяФорма, ЭлементГруппаКнопки);
	//
	//ИмяРеквизита = СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма);
	//СоздатьЭлементФормы(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа);	
	
КонецПроцедуры

Процедура СоздатьКнопкуДобавитьКартинку(ТекущаяФорма, ЭлементГруппа)
	
	КнопкаДобавитьКартинка 				= ТекущаяФорма.Элементы.Добавить("КнопкаДобавитьКартинку", Тип("КнопкаФормы"), ЭлементГруппа);
	КнопкаДобавитьКартинка.Заголовок 	= "Добавить картинку";
	КнопкаДобавитьКартинка.ИмяКоманды 	= "ОбщаяКомандаКартинка";
	
КонецПроцедуры

Функция СоздадьКомандуДобавитьКартинку(ТекущаяФорма)
	
	КомандаДобавитьКартинка 			= ТекущаяФорма.Команды.Добавить("ОбщаяКомандаКартинка");
	КомандаДобавитьКартинка.Заголовок 	= "Добавить картинку";
	КомандаДобавитьКартинка.Действие 	= "ОбщаяКомандаКартинка";
	
	Возврат КомандаДобавитьКартинка;
	
КонецФункции

Функция СоздатьГруппуКартинка(ТекущаяФорма, РодительскийЭлемент)
	
	ГруппаКартинки 						= ТекущаяФорма.Элементы.Добавить("ГруппаКартинки_авто", Тип("ГруппаФормы"), РодительскийЭлемент);
	ГруппаКартинки.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКартинки.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ГруппаКартинки.ОтображатьЗаголовок 	= Ложь; 
	ГруппаКартинки.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Возврат ГруппаКартинки;
	
КонецФункции


Функция СоздатьГруппуКнопки(ТекущаяФорма, РодительскийЭлемент)
	
	ГруппаКомментарий 						= ТекущаяФорма.Элементы.Добавить("ГруппаКартинкиКнопки_авто", Тип("ГруппаФормы"), РодительскийЭлемент);
	ГруппаКомментарий.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКомментарий.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ГруппаКомментарий.ОтображатьЗаголовок 	= Ложь; 
	ГруппаКомментарий.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	Возврат ГруппаКомментарий;
	
КонецФункции

