Процедура СоздатьЭлементыИРеквизитыНаФорме(ТекущаяФорма,РодительскийЭлемент) Экспорт
	
	ЭлементГруппа 		= СоздатьГруппуКартинка(ТекущаяФорма, РодительскийЭлемент);
	ЭлементГруппаКнопки = СоздатьГруппуКнопки(ТекущаяФорма, ЭлементГруппа);
	СоздадьКомандуКартинкуИКнопку(ТекущаяФорма, ЭлементГруппаКнопки, "Добавить картинку", "КнопкаДобавитьКартинку");
	СоздатьКнопкуКартинки(ТекущаяФорма, ЭлементГруппаКнопки, "<<", "КартинкуВлево");
	СоздатьРеквизитИЭлемент(ТекущаяФорма, "ИмяКартинки_авто", ЭлементГруппаКнопки, "", ВидПоляФормы.ПолеНадписи);
	ТекущаяФорма.ИмяКартинки_авто = "1";
	СоздатьКнопкуКартинки(ТекущаяФорма, ЭлементГруппаКнопки, ">>", "КартинкуВправо");
	
	Если РольДоступна("РедактированиеОбразцов") Тогда
		СоздатьКнопкуКартинки(ТекущаяФорма, ЭлементГруппаКнопки, "Удалить", "УдалитьКартинку");
	КонецЕсли;
	
	СоздатьРеквизитИЭлемент(ТекущаяФорма, "Картинка_авто", ЭлементГруппа, "", ВидПоляФормы.ПолеКартинки);

КонецПроцедуры

Процедура СоздатьКнопкуКартинки(ТекущаяФорма, ЭлементГруппа, Заголовок, ИмяКоманды)
	
	КнопкаДобавитьКартинка 				= ТекущаяФорма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ЭлементГруппа);
	КнопкаДобавитьКартинка.Заголовок 	= Заголовок;
	КнопкаДобавитьКартинка.ИмяКоманды 	= "ОбщаяКомандаКартинка";
	
КонецПроцедуры

Процедура СоздадьКомандуКартинкуИКнопку(ТекущаяФорма, ЭлементГруппа, Заголовок, ИмяКоманды)
	
	КомандаДобавитьКартинка 			= ТекущаяФорма.Команды.Добавить("ОбщаяКомандаКартинка");
	КомандаДобавитьКартинка.Заголовок 	= Заголовок;
	КомандаДобавитьКартинка.Действие 	= "ОбщаяКомандаКартинка";
	
	СоздатьКнопкуКартинки(ТекущаяФорма, ЭлементГруппа, Заголовок, ИмяКоманды);
	
КонецПроцедуры

Функция СоздатьГруппуКартинка(ТекущаяФорма, РодительскийЭлемент)
	
	ГруппаКартинки 						= ТекущаяФорма.Элементы.Добавить("ГруппаКартинки_авто", Тип("ГруппаФормы"), РодительскийЭлемент);
	ГруппаКартинки.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКартинки.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ГруппаКартинки.ОтображатьЗаголовок 	= Ложь; 
	ГруппаКартинки.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Возврат ГруппаКартинки;
	
КонецФункции


Функция СоздатьГруппуКнопки(ТекущаяФорма, РодительскийЭлемент)
	
	ГруппаКомментарий 						= ТекущаяФорма.Элементы.Добавить("ГруппаКартинкиКнопки_авто", Тип("ГруппаФормы"), РодительскийЭлемент);
	ГруппаКомментарий.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКомментарий.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ГруппаКомментарий.ОтображатьЗаголовок 	= Ложь; 
	ГруппаКомментарий.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	Возврат ГруппаКомментарий;
	
КонецФункции
                          
Процедура СоздатьРеквизитИЭлемент(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа, Заголовок, ВидПоля)

	ДобавляемыеРеквизиты = Новый Массив; 
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(имяРеквизита, Новый ОписаниеТипов("Строка"))); 
	
    ТекущаяФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	СоздатьЭлементФормы(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа, Заголовок, ВидПоля);
	
КонецПроцедуры // СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма)

Процедура СоздатьЭлементФормы(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа, Заголовок, ВидПоля)
	
	НовыйЭлемент 					= ТекущаяФорма.Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), ЭлементГруппа);
	НовыйЭлемент.Заголовок			= Заголовок;
	НовыйЭлемент.Вид 				= ВидПоля;
	НовыйЭлемент.ПутьКДанным 		= ИмяРеквизита;
	
	Если ПустаяСтрока(Заголовок) Тогда
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;

	
КонецПроцедуры // СоздатьЭлементФормы(ТекущаяФорма)



