
Процедура ПолучитьСообщениеБотов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТелеграммБоты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТелеграммБоты КАК ТелеграммБоты
		|ГДЕ
		|	ТелеграммБоты.Активный";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураНастроек = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		ПрочитатьСообщенияПользователя(Выборка.Ссылка, СтруктураНастроек);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьСообщенияПользователя(Бот, СтруктураНастроек = Неопределено) Экспорт
	
	Если СтруктураНастроек = Неопределено Тогда
	
		СтруктураНастроек = ПолучитьНастройкиTelegram(Бот);
	
	КонецЕсли;
	
	МаксимальныйНомерЗаписи = Формат(ПолучитьМаксимальныйНомерЗаписи(Бот) + 1, "ЧГ=0");
	
	Источник = СтрШаблон("bot%1/getUpdates?offset=%2", СтруктураНастроек.token, МаксимальныйНомерЗаписи);
	
	HTTPСоединение  =  Новый HTTPСоединение(СтруктураНастроек.api,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос(Источник);
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json");	
	
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
			Данные = ДесериализоватьJSON(HTTPОтвет.ПолучитьТелоКакСтроку());
			Если Данные.ok И Данные.result.Количество() > 0 Тогда
				 
				Для каждого СтрокаМассива Из Данные.result  Цикл
					
					СообщениеID = СтрокаМассива.update_id;
					
					Если ПроверитьНаличиеСообщенияПоID(СообщениеID, Бот) Тогда
						Продолжить;
					КонецЕсли;
					
					Если СтрокаМассива.Свойство("message") Тогда
						
						message = СтрокаМассива.message;
						
						ПользовательТелеграм = ВернутьСоздатьПользователяTelegram(message.chat);
						
						Команда = ВернутьКомандуTelegram(message, Бот, ПользовательТелеграм);
						ЗаписатьИсториюСообщений(message, СообщениеID, Команда, Бот);					 
						ОбработатьОтветПользователя(Команда, СтруктураНастроек, message, СообщениеID, Бот, ПользовательТелеграм);
						
					ИначеЕсли СтрокаМассива.Свойство("callback_query") Тогда
						
						callback_query = СтрокаМассива.mecallback_queryssage;
						data = СтрокаМассива.data;
						
						ПользовательТелеграм = ВернутьСоздатьПользователяTelegram(callback_query.from.id);
						
						
					КонецЕсли;
					
				КонецЦикла; 
			КонецЕсли; 		
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьИсториюСообщений(message, ID_Сообщения, Команда, Бот)
	
	МенеджерЗаписи = РегистрыСведений.ТелеграммСообщения.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период 			= ТекущаяДата();
	МенеджерЗаписи.Сообщение 		= СокрЛП(message.text);
	МенеджерЗаписи.Команда 			= Команда;
	МенеджерЗаписи.ВидСообщения 	= Перечисления.Telegram_ВидСообщения.Входящее;
	МенеджерЗаписи.ID_Пользователя 	= message.chat.id;
	МенеджерЗаписи.Бот 				= Бот;
	МенеджерЗаписи.ID_Сообщения 	= ID_Сообщения;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ЗаписатьИсториюОтветов(ОтветСистемы, Команда, ID_Сообщения, Бот)
	
	МенеджерЗаписи = РегистрыСведений.Telegram_ИсторияСообщений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период 		= ТекущаяДата();
	МенеджерЗаписи.Сообщение 	= ОтветСистемы;
	МенеджерЗаписи.Бот 			= Бот;
	МенеджерЗаписи.Команда 		= Команда;
	МенеджерЗаписи.ВидСообщения = Перечисления.Telegram_ВидСообщения.Исходящее;
	МенеджерЗаписи.ID_Сообщения = ID_Сообщения;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура ОбработатьОтветПользователя(Команда, СтруктураНастроек, message, СообщениеID, Бот, ПользовательТелеграм)
	      
	Если НЕ ЗначениеЗаполнено(Команда) Тогда
		Возврат;
	КонецЕсли; 	 
	
	
	Если Команда = Перечисления.ТелеграммКоманды.Старт Тогда
		
		ВыполнитьКомандуСтарт(СтруктураНастроек, ПользовательТелеграм, message.chat, Бот);	
		
	Иначе  
	КонецЕсли; 
	

КонецПроцедуры 

Функция ПроверитьНаличиеСообщенияПоID(ID_Сообщения, Бот)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
					|	ТелеграммСообщения.Период КАК Период
					|ИЗ
					|	РегистрСведений.ТелеграммСообщения КАК ТелеграммСообщения
					|ГДЕ
					|	ТелеграммСообщения.ID_Сообщения = &ID_Сообщения
					|	И ТелеграммСообщения.Бот = &Бот";
	
	Запрос.УстановитьПараметр("ID_Сообщения",	ID_Сообщения);
	Запрос.УстановитьПараметр("Бот",			Бот);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаЗапроса.Количество() > 0 Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции // ПроверитьНаличиеСообщенияПоID()

Функция ПолучитьНастройкиTelegram(Бот) Экспорт
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ИмяБота",	"");
	СтруктураНастроек.Вставить("token",		"");
	СтруктураНастроек.Вставить("api",		омТелеграммНаСервереПовторное.ПолучитьAPIТелеграмм());
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТелеграммБоты.Token КАК token,
	               |	ТелеграммБоты.Наименование КАК ИмяБота
	               |ИЗ
	               |	Справочник.ТелеграммБоты КАК ТелеграммБоты
	               |ГДЕ
	               |	ТелеграммБоты.Ссылка = &Бот";
	
	Запрос.УстановитьПараметр("Бот", Бот);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество()>0 Тогда
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктураНастроек, Выборка);
	КонецЕсли;

	Возврат СтруктураНастроек;
	
КонецФункции // ПолучитьПараметры()

Функция ВернутьКомандуTelegram(message, Бот, ПользовательТелеграм)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТелеграммБотыКоманды.Команда КАК Команда
	               |ПОМЕСТИТЬ втКоманда
	               |ИЗ
	               |	Справочник.ТелеграммБоты.Команды КАК ТелеграммБотыКоманды
	               |ГДЕ
	               |	ТелеграммБотыКоманды.Ссылка = &Бот
	               |	И ТелеграммБотыКоманды.НаименованиеКоманды = &НаименованиеКоманды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втКоманда.Команда КАК Команда
	               |ИЗ
	               |	втКоманда КАК втКоманда
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТелеграммДоступныеКоманды КАК ТелеграммДоступныеКоманды
	               |		ПО втКоманда.Команда = ТелеграммДоступныеКоманды.Команда
	               |ГДЕ
	               |	ТелеграммДоступныеКоманды.ID_ПользователяТелеграмм = &ID_ПользователяТелеграмм";
	
	Запрос.УстановитьПараметр("ID_ПользователяТелеграмм",	message.chat.id);
	Запрос.УстановитьПараметр("НаименованиеКоманды",		НРег(message.text));
	Запрос.УстановитьПараметр("Бот", 						Бот);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		Выборка.Следующий();
		Возврат Выборка.Команда;
		
	КонецЕсли; 
	
	Возврат Перечисления.ТелеграммКоманды.ПустаяСсылка();
	
КонецФункции // ВернутьКомандуTelegram()

Функция ВернутьСоздатьПользователяTelegram(chat)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	Telegram_Пользователи.Пользователь КАК Пользователь
					|ИЗ
					|	РегистрСведений.ТелеграммПользователи КАК Telegram_Пользователи
					|ГДЕ
					|	Telegram_Пользователи.ID_Пользователя = &ID_Пользователя";
	
	Запрос.УстановитьПараметр("ID_Пользователя", chat.id);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаЗапроса.Количество()>0 Тогда
		
		ВыборкаЗапроса.Следующий();
		Возврат ВыборкаЗапроса.Пользователь;
		
	КонецЕсли; 
	
	МенеджерЗаписи = РегистрыСведений.ТелеграммПользователи.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.first_name 		= chat.first_name;
	МенеджерЗаписи.last_name 		= chat.last_name;
	МенеджерЗаписи.ID_Пользователя 	= chat.id;
	
	МенеджерЗаписи.Записать(Истина);
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
	
КонецФункции // ВернутьСоздатьПользователяTelegram()

Функция ДесериализоватьJSON(СтрокаJSON) 
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Данные = ПрочитатьJSON(Чтение, Ложь);
	Чтение.Закрыть();	
	
	Возврат Данные;
	
КонецФункции 

Функция ПолучитьМаксимальныйНомерЗаписи(Бот)

	ИмяПараметра = "ID_СообщенияМаксимум";

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТелеграммСлужебныеДанные.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ТелеграммСлужебныеДанные КАК ТелеграммСлужебныеДанные
		|ГДЕ
		|	ТелеграммСлужебныеДанные.ИмяПараметра = &ИмяПараметра
		|	И ТелеграммСлужебныеДанные.Бот = &Бот";
	
	Запрос.УстановитьПараметр("Бот", 			Бот);
	Запрос.УстановитьПараметр("ИмяПараметра", 	ИмяПараметра);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Значение;
	КонецЦикла;
	
    Возврат 0;
	
КонецФункции // ПолучитьМаксимальныйНомерЗаписи()

Функция ОтправитьФайл()
	
	    ТабДок = Новый ТабличныйДокумент;
		
		Отчеты.Telegram_ИсторияСообщений.Создать().СкомпоноватьРезультат(ТабДок);
		
		ИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
		
		ТабДок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLSX);
		
			 
КонецФункции // ОтправитьФайл()

#Область Команды

Процедура ВыполнитьКомандуСтарт(СтруктураНастроек, ПользовательТелеграм, chat, Бот)

	ТекстСтарта = "Выберите действие на клавиатуре.";  
	
	
	
	//МассивКнопок = Новый Массив;
	//МассивКнопок.Добавить("Отчеты");

	//Кнопки = Новый Массив;

	//Для каждого кнопка ИЗ МассивКнопок Цикл
	//	Кнопки.Добавить(Новый Структура("text, callback_data", кнопка, кнопка + "_главное_меню"));
	//КонецЦикла;

	//Строки = Новый Массив;
	//Строки.Добавить(Кнопки);
	//КнопкиJs = ЗаписатьJS(Новый Структура("inline_keyboard", Строки));
	//
	//Приемник = "bot" + СтруктураНастроек.token + "/sendMessage?chat_id=" + Формат(chat.id, "ЧГ=0") + "&text=" + ТекстСтарта + "&reply_markup="+КнопкиJs;
	Приемник = СтрШаблон("bot%1/sendMessage?chat_id=%2&text=%3", СтруктураНастроек.token, Формат(chat.id, "ЧГ=0"), ТекстСтарта);
	
	КлавиатураПользователя = Получить_JOSN_Кнопок(Бот, chat.id);
	
	Если НЕ ПустаяСтрока(КлавиатураПользователя) Тогда
	
		Приемник = Приемник + СтрШаблон("&reply_markup=%1", КлавиатураПользователя);	
	
	КонецЕсли;

	HTTPСоединение  =  Новый HTTPСоединение(СтруктураНастроек.api,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	
	HTTPЗапрос = Новый HTTPЗапрос(Приемник);
	

	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	
	//Ответ.КодСостояния
КонецПроцедуры
	
#КонецОбласти 

Функция Получить_JOSN_Кнопок(Бот, ID_Пользователя)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТелеграммСлужебныеДанные.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ТелеграммСлужебныеДанные КАК ТелеграммСлужебныеДанные
		|ГДЕ
		|	ТелеграммСлужебныеДанные.Бот = &Бот
		|	И ТелеграммСлужебныеДанные.ИмяПараметра = ""ТекстовоеПредставлениеКнопок""
		|	И ТелеграммСлужебныеДанные.ID_Пользователя = &ID_Пользователя";
	
	Запрос.УстановитьПараметр("Бот", 				Бот);
	Запрос.УстановитьПараметр("ID_Пользователя", 	ID_Пользователя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Количество() > 0 Цикл
		Выборка.Следующий();
		Возврат Выборка.Значение;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции // Получить_JOSN_Кнопок()

