&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ОбъектТЗ = ПредопределенноеЗначение("Справочник.Композиции.ПустаяСсылка");
	
	Если ЗначениеЗаполнено(Проект) Тогда
		СтруктураДанных = ПолучитьОбъектыПроекта(Проект);
		
		Для каждого Значение Из СтруктураДанных.ЗадачиПКД Цикл
			ЗаполнитьЗначенияСвойств(ЗадачиПКД.Добавить(), Значение);	
		КонецЦикла;
		
		Элементы.ОбъектТЗ.СписокВыбора.ЗагрузитьЗначения();
	Иначе
		ЗадачиПКД.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбъектыПроекта(Проект)
	
	СтруктураДанных = Новый Структура("ЗадачиПКД, ЗадачиРКД, Производство", );

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА ИзделияКомплект.Родитель.Композиция = ЗНАЧЕНИЕ(Справочник.Композиции.ПустаяСсылка)
		|			ТОГДА ИзделияКомплект.Ссылка
		|		ИНАЧЕ ИзделияКомплект.Родитель.Композиция
		|	КОНЕЦ КАК Ссылка
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	НЕ ИзделияКомплект.ЭтоГруппа
		|	И ИзделияКомплект.Проект = &Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт.Ссылка КАК ОбъектТЗ,
		|	Задачи_ПКД.Ссылка КАК Задача,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ПО вт.Ссылка = Задачи_ПКД.ОбъектТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО вт.Ссылка = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	ВЫБОР
		|			КОГДА Задачи_ПКД.ТипЗадачи ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			КОГДА Задачи_ПКД.ТипЗадачи В (&ТипыЗадач)
		|					И НЕ Задачи_ПКД.Выполнена
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	вт.Ссылка.Наименование";
	
	ТипыЗадач = омЗадачиПКДПовтор.ТипыЗадачКонструктора(Ложь);
	
	Для каждого х Из омЗадачиПКДПовтор.ТипыЗадачКонструктораВедущий() Цикл
		ТипыЗадач.Добавить(х);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Проект", 	Проект);
	Запрос.УстановитьПараметр("ТипыЗадач", 	ТипыЗадач);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции // ПолучитьОбъектыПроекта()

&НаКлиенте
Процедура ПослеЗакрытияВыбораФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры // ПослеЗакрытияВыбораФайла()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры) = Тип("ДанныеФормыСтруктура") И Параметры.Свойство("НаимеаниеДействия") Тогда
		НаимеаниеДействия = Параметры.НаимеаниеДействия;	
	КонецЕсли;
	
	ЭтаФорма.Заголовок = ?(НаимеаниеДействия = "КорректировкаДизайне", "Корректировка Заказчика", "Изменение Дизайнера");
	
КонецПроцедуры


#Область БлокировкаТаблиц

&НаКлиенте
Процедура ЗадачиПКДПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПКДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТД = Элементы.ЗадачиПКД.ТекущиеДанные;
	
	Если НЕ ТД = Неопределено Тогда
		ВыбранноеЗначение = ТД.Задача;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПКДПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

	
#КонецОбласти
