&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ОбъектТЗ = ПредопределенноеЗначение("Справочник.Композиции.ПустаяСсылка");
	
	Если ЗначениеЗаполнено(Проект) Тогда
		Элементы.ОбъектТЗ.Доступность = Истина;
		Элементы.ОбъектТЗ.СписокВыбора.ЗагрузитьЗначения(ПолучитьОбъектыПроекта(Проект));
	Иначе
		Элементы.ОбъектТЗ.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбъектыПроекта(Проект)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА ИзделияКомплект.Родитель.Композиция = ЗНАЧЕНИЕ(Справочник.Композиции.ПустаяСсылка)
		|			ТОГДА ИзделияКомплект.Ссылка
		|		ИНАЧЕ ИзделияКомплект.Родитель.Композиция
		|	КОНЕЦ КАК Ссылка
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	НЕ ИзделияКомплект.ЭтоГруппа
		|	И ИзделияКомплект.Проект = &Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт.Ссылка КАК Ссылка
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ПО вт.Ссылка = Задачи_ПКД.ОбъектТЗ
		|ГДЕ
		|	ВЫБОР
		|			КОГДА Задачи_ПКД.ТипЗадачи ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			КОГДА Задачи_ПКД.ТипЗадачи В (&ТипыЗадач)
		|					И НЕ Задачи_ПКД.Выполнена
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	вт.Ссылка.Наименование";
	
	Запрос.УстановитьПараметр("Проект", 	Проект);
	Запрос.УстановитьПараметр("ТипыЗадач", 	омЗадачиПКДПовтор.ТипыЗадачКонструктора());
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции // ПолучитьОбъектыПроекта()

&НаКлиенте
Процедура ОбъектТЗПриИзменении(Элемент)
	
	
	Если ЗначениеЗаполнено(ОбъектТЗ) Тогда
		ОповещенияПослеЗакрытияВыбораФайла = Новый ОписаниеОповещения("ПослеЗакрытияВыбораФайла", ЭтаФорма);
		
		ПараметрыДоработки = Новый Структура("ОбъектДействий, ДействиеПриОкончании, НаименованиеДействия, ИмяДействияДляФайла"
		, ОбъектТЗ, НаимеаниеДействия, "Перемещение файла в каталог PDM", НаимеаниеДействия);
		ОткрытьФорму("ОбщаяФорма.ФормаПереносИнформацииВPDM", ПараметрыДоработки, , , , , ОповещенияПослеЗакрытияВыбораФайла, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияВыбораФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры // ПослеЗакрытияВыбораФайла()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры) = Тип("ДанныеФормыСтруктура") И Параметры.Свойство("НаимеаниеДействия") Тогда
		НаимеаниеДействия = Параметры.НаимеаниеДействия;	
	КонецЕсли;
	
	ЭтаФорма.Заголовок = ?(НаимеаниеДействия = "КорректировкаДизайне", "Корректировка Заказчика", "Изменение Дизайнера");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПКДПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ЗадачиПКДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

