&НаКлиенте
Перем ТипДействияСтрокой, ИмяДействияДляФайла, МассивСоставовВсехКомпозиций;

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ОбъектТЗ = ПредопределенноеЗначение("Справочник.Композиции.ПустаяСсылка");
	
	ЗадачиПКД.Очистить();
	ЗадачиРКД.Очистить();
	ВыбранноеЗначение = Неопределено;
	
	Если ЗначениеЗаполнено(Проект) Тогда
		СтруктураДанных = ПолучитьОбъектыПроекта(Проект);
		
		Для каждого Значение Из СтруктураДанных.ЗадачиПКД Цикл
			ЗаполнитьЗначенияСвойств(ЗадачиПКД.Добавить(), Значение);	
		КонецЦикла;
		
		Для каждого Значение Из СтруктураДанных.ЗадачиРКД Цикл
			ЗаполнитьЗначенияСвойств(ЗадачиРКД.Добавить(), Значение);	
		КонецЦикла;
		
		МассивСоставовВсехКомпозиций = Новый Массив;
		
		Если НЕ СтруктураДанных.СоставКомпозиций = Неопределено Тогда
			
			Для каждого Значение Из СтруктураДанных.СоставКомпозиций Цикл
				СтруктураСостава = Новый Структура("Комплект, Композиция, ТекущаяСтадия, ЗадачаПКД", );
				ЗаполнитьЗначенияСвойств(СтруктураСостава, Значение);
				МассивСоставовВсехКомпозиций.Добавить(СтруктураСостава);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
    Элементы.ЗадачиПКД.Видимость 				= ЗадачиПКД.Количество() > 0;
    Элементы.ГруппаРКД.Видимость 				= ЗадачиРКД.Количество() > 0;
	Элементы.ВыбранноеЗначениеСписок.Видимость 	= Ложь;
	
КонецПроцедуры

Функция ПолучитьОбъектыПроекта(Проект)
	
	СтруктураДанных = Новый Структура("ЗадачиПКД, ЗадачиРКД, Производство, СоставКомпозиций", );

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА ИзделияКомплект.Родитель.Композиция = ЗНАЧЕНИЕ(Справочник.Композиции.ПустаяСсылка)
		|			ТОГДА ИзделияКомплект.Ссылка
		|		ИНАЧЕ ИзделияКомплект.Родитель.Композиция
		|	КОНЕЦ КАК Ссылка
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	НЕ ИзделияКомплект.ЭтоГруппа
		|	И ИзделияКомплект.Проект = &Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт.Ссылка КАК ОбъектТЗ,
		|	Задачи_ПКД.Ссылка КАК Задача,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия.ПолноеНаименование КАК ТекущаяСтадия,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	Задачи_ПКД.ТипЗадачи КАК ТипЗадачи
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ПО вт.Ссылка = Задачи_ПКД.ОбъектТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО вт.Ссылка = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	Задачи_ПКД.ТипЗадачи В(&ТипыЗадач)
		|	И НЕ Задачи_ПКД.Выполнена
		|
		|УПОРЯДОЧИТЬ ПО
		|	вт.Ссылка.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Задачи_РКД.ОбъектТЗ КАК ОбъектТЗ,
		|	Задачи_РКД.Ссылка КАК Задача,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия.ПолноеНаименование КАК ТекущаяСтадия,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	Задачи_РКД.ТипЗадачи КАК ТипЗадачи,
		|	ЛОЖЬ КАК ЭтоКомпозиция,
		|	Задачи_РКД.Выполнена КАК ЗадачаВыполнена
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО Задачи_РКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	НЕ Задачи_РКД.Выполнена
		|	И НЕ Задачи_РКД.Проект = &Проект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Задачи_РКД.ОбъектТЗ.Наименование";
	
	ТипыЗадач = омЗадачиПКДПовтор.ТипыЗадачКонструктора(Ложь);
	
	Для каждого х Из омЗадачиПКДПовтор.ТипыЗадачКонструктораВедущий() Цикл
		ТипыЗадач.Добавить(х);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Проект", 	Проект);
	Запрос.УстановитьПараметр("ТипыЗадач", 	ТипыЗадач);
	
	Результат = Запрос.ВыполнитьПакет();
	СтруктураДанных.ЗадачиПКД 	= ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат[1].Выгрузить());
	
	Если ТребуетсяПересогласование Тогда
		СтруктураДанных.ЗадачиРКД   = ОбщегоНазначения.ТаблицаЗначенийВМассив(ПолучитьКомпозицииРКД(Результат[2].Выгрузить(), СтруктураДанных));
	Иначе
		СтруктураДанных.ЗадачиРКД	= ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат[2].Выгрузить());
	КонецЕсли;
	 
	Возврат СтруктураДанных; 
	 
КонецФункции // ПолучитьОбъектыПроекта()

Функция ПолучитьКомпозицииРКД(ТекущиеЗадачиРКД, СтруктураДанных)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Комплект,
		|	ИзделияКомплект.Наименование КАК КомплектНаименование,
		|	ИзделияКомплект.Родитель.Композиция КАК Композиция,
		|	ИзделияКомплект.Родитель.Композиция.Наименование КАК КомпозицияНаименование,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия.Наименование КАК ТекущаяСтадия,
		|	Задачи_ПКД.Ссылка КАК ЗадачаПКД,
		|	Задачи_ПКД.Выполнена КАК ЗадачаВыполнена,
		|	Задачи_ПКД.ТипЗадачи КАК ТипЗадачи
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО (ДанныеКомплектаСрезПоследних.Комплект = ИзделияКомплект.Родитель.Композиция)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ПО (Задачи_ПКД.ОбъектТЗ = ИзделияКомплект.Ссылка)
		|ГДЕ
		|	ИзделияКомплект.Ссылка В(&Комплект)
		|	И НЕ(ИзделияКомплект.Родитель.Композиция ЕСТЬ NULL
		|				ИЛИ ИзделияКомплект.Родитель.Композиция = ЗНАЧЕНИЕ(Справочник.Композиции.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("Комплект", ТекущиеЗадачиРКД.ВыгрузитьКолонку("ОбъектТЗ"));
	
	СтруктураДанных.СоставКомпозиций = Запрос.Выполнить().Выгрузить();
	СтруктураДанных.СоставКомпозиций.Индексы.Добавить("Комплект");
	
	СтруктураДанных.ЗадачиРКД = ТекущиеЗадачиРКД.СкопироватьКолонки("Задача, ТекущаяСтадия, Конструктор, ТипЗадачи, ЗадачаВыполнена, ЭтоКомпозиция");
	СтруктураДанных.ЗадачиРКД.Колонки.Добавить("ОбъектТЗ");
	
	Отбор = Новый Структура("Комплект", );
		
	Для каждого ДанныеКомплекта Из ТекущиеЗадачиРКД Цикл
		
		Отбор.Комплект = ДанныеКомплекта.ОбъектТЗ;
		
		НайденыеСтроки = СтруктураДанных.СоставКомпозиций.НайтиСтроки(Отбор);
		
		Если НайденыеСтроки.Количество() = 0 Тогда
		
			ЗаполнитьЗначенияСвойств(СтруктураДанных.ЗадачиРКД.Добавить(), ДанныеКомплекта);
			
		Иначе
			
			Если СтруктураДанных.ЗадачиРКД.Найти(НайденыеСтроки[0].Композиция, "ОбъектТЗ") = Неопределено Тогда
				//ОбъектТЗ, Задача, ТекущаяСтадия, Конструктор, ТипЗадачи, ЗадачаВыполнена, ЭтоКомпозиция
				НС = СтруктураДанных.ЗадачиРКД.Добавить();
				НС.ОбъектТЗ 		= НайденыеСтроки[0].Композиция;
				НС.Задача			= НайденыеСтроки[0].ЗадачаПКД;
				НС.ЗадачаВыполнена	= НайденыеСтроки[0].ЗадачаВыполнена;
				НС.ТекущаяСтадия	= НайденыеСтроки[0].ТекущаяСтадия;
				НС.ТипЗадачи		= НайденыеСтроки[0].ТипЗадачи;
				НС.Конструктор		= НайденыеСтроки[0].Конструктор;
				НС.ЭтоКомпозиция	= Истина;
				
			КонецЕсли;	
		
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДанных.СоставКомпозиций = ОбщегоНазначения.ТаблицаЗначенийВМассив(СтруктураДанных.СоставКомпозиций);
	
	Возврат СтруктураДанных.ЗадачиРКД;
	
КонецФункции // ПолучитьКомпозицииРКД()

&НаКлиенте
Процедура ПослеЗакрытияВыбораФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры // ПослеЗакрытияВыбораФайла()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры) = Тип("ДанныеФормыСтруктура") И Параметры.Свойство("НаимеаниеДействия") Тогда
		НаимеаниеДействия = Параметры.НаимеаниеДействия;	
	КонецЕсли;
	
    Элементы.ЗадачиПКД.Видимость 					= Ложь;
    Элементы.ГруппаРКД.Видимость 					= Ложь;  
	
КонецПроцедуры


#Область БлокировкаТаблиц

&НаКлиенте
Процедура ЗадачиПКДПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;
	
	ВыбранноеЗначениеСписок.Очистить();
	
	ТД = Элементы.ЗадачиПКД.ТекущиеДанные;
	
	Если НЕ ТД = Неопределено Тогда
		ВыбранноеЗначение 							= ТД.Задача;
		Элементы.ВыбранноеЗначениеСписок.Видимость 	= Ложь;
		ТребуетсяПересогласование 					= Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПКДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПКДПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиРКДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиРКДПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;
	ВыбранноеЗначениеСписок.Очистить();
	
	ТД = Элементы.ЗадачиРКД.ТекущиеДанные;
	
	Если НЕ ТД = Неопределено Тогда
		ВыбранноеЗначение = ?(ЗначениеЗаполнено(ТД.Задача), ТД.Задача, ТД.ОбъектТЗ);
		Для каждого х Из СоставКомпозиции Цикл
			Если х.Отметка Тогда
				ВыбранноеЗначениеСписок.Добавить(х.Комплект);	
			КонецЕсли;
		КонецЦикла;
		Элементы.ВыбранноеЗначениеСписок.Видимость = ВыбранноеЗначениеСписок.Количество() > 0;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗадачиРКДПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СоставКомпозицииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
	
&НаКлиенте
Процедура СоставКомпозицииПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТД = Элементы.СоставКомпозиции.ТекущиеДанные;
	
	Если НЕ ТД = Неопределено Тогда
		ТД.Отметка = НЕ ТД.Отметка;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоставКомпозицииПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ДобавитьИзменения(Команда)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		ТекущиеСостояниеЗадачи = омЗадачиПКДСервер.ТекущиеСостояниеЗадачи(ВыбранноеЗначение).ТекущиеСостояние;
		
		Если ТекущиеСостояниеЗадачи = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ВРаботеКонструктора")
					ИЛИ ТекущиеСостояниеЗадачи = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ПриостановкаКонструктором") Тогда
			ТипДействияСтрокой = "";
		Иначе
			Если ТипЗнч(ВыбранноеЗначение) = Тип("ЗадачаСсылка.Задачи_РКД") И ТребуетсяПересогласование Тогда
				ТипДействияСтрокой = "ПереносВ_ПКД_Дизайнером";
			Иначе
				ТипДействияСтрокой = "СбросДизайнером";
			КонецЕсли;
			
		КонецЕсли;
		
		СтруктураДанных = Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение);
		
		ОповещенияПослеЗакрытияВыбораФайла = Новый ОписаниеОповещения("ПослеЗакрытияВыбораФайла", ЭтаФорма);
		
		ПараметрыДоработки = Новый Структура("ОбъектДействий, ДействиеПриОкончании, НаименованиеДействия, ИмяДействияДляФайла"
		, ВыбранноеЗначение, ТипДействияСтрокой, "Перемещение файла в каталог PDM", ИмяДействияДляФайла);
		ОткрытьФорму("ОбщаяФорма.ФормаПереносИнформацииВPDM", ПараметрыДоработки, , , , , ОповещенияПослеЗакрытияВыбораФайла, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		
	Иначе
		ПоказатьПредупреждение(, "Не выбрано значение");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НаимеаниеДействия 	= "КорректировкаДизайнера" Тогда
		ЭтаФорма.Заголовок 	= "Корректировка Дизайнера";
		ТипДействияСтрокой 	= "КорректировкаДизайнер";
		ИмяДействияДляФайла = "Корректировка";
	Иначе
		ЭтаФорма.Заголовок 	= "Изменение Заказчиком";
		ТипДействияСтрокой 	= "РедакцияДизайнер";
		ИмяДействияДляФайла = "Редакция";
	КонецЕсли;
	
	МассивСоставовВсехКомпозиций = Новый Массив;
	Элементы.ВыбранноеЗначениеСписок.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяПересогласованиеПриИзменении(Элемент)
	ПроектПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиРКДПриАктивизацииСтроки(Элемент)
	
	Отказ = Истина;
	
	СоставКомпозиции.Очистить();
	
	ТД = Элементы.ЗадачиРКД.ТекущиеДанные;
	
	Если НЕ ТД = Неопределено  И ТД.ЭтоКомпозиция Тогда
		
		Для каждого х Из МассивСоставовВсехКомпозиций Цикл
		
			Если х.Композиция = ТД.ОбъектТЗ Тогда
			
				ЗаполнитьЗначенияСвойств(СоставКомпозиции.Добавить(), х);	
			
			КонецЕсли;		
		
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтметиитьВсеКомплекты(Команда)
	УчтановитьЗначенияФлагов(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СброситьВсеКомплекты(Команда)
	УчтановитьЗначенияФлагов(Ложь);
КонецПроцедуры  

&НаКлиенте
Процедура УчтановитьЗначенияФлагов(Значение)

	Для каждого х Из СоставКомпозиции Цикл
		х.Отметка = Значение;	
	КонецЦикла;	

КонецПроцедуры


