Функция СформироватьСтартовуюСтраницуHTML() Экспорт

	
	
	
	
КонецФункции // СформироватьСтартовуюСтраницу()  

Функция НаборРолей() Экспорт

    МассивРолей = Новый Массив(7);
	МассивРолей[0] = "ГлавныйКонструктор";
	МассивРолей[1] = "Дизайнер";
	МассивРолей[2] = "Конструктор";
	МассивРолей[3] = "НачальникМонтажа";
	МассивРолей[4] = "НачальникПроизводства";
	МассивРолей[5] = "НачальникСклада";
	МассивРолей[6] = "Администратор";
	
	Возврат МассивРолей;
	
КонецФункции // НаборРолей() 

Функция ПолучитьДеревоПараметров() Экспорт

    ДеревоПараметров = Новый ДеревоЗначений;
	
    ДеревоПараметров.Колонки.Добавить("Параметр", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200)));
	
	НС = ДеревоПараметров.Строки.Добавить();
	НС.Параметр = "Начальная страница";
	НачСтр = НС.Строки.Добавить();
	НачСтр1 = НачСтр.Строки.Добавить();
	НачСтр1.Параметр = "Отчеты";
	НачСтр1 = НачСтр.Строки.Добавить();
	НачСтр1.Параметр = "Месседжер";
	

КонецФункции // ПолучитьДеревоПараметров()


