
&НаСервереБезКонтекста
Функция ПрикрепитьНаСервере()
	// Вставить содержимое обработчика.
КонецФункции

&НаКлиенте
Процедура Прикрепить(Команда)
	
	стрОшибка = ПрикрепитьФайл();
	
	Если ПустаяСтрока(стрОшибка) Тогда
		Закрыть();
	Иначе
		ПоказатьПредупреждение(, стрОшибка);	
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Функция ПрикрепитьФайл()

	Возврат ПрикрепитьНаСервере();	

КонецФункции // ПрикрепитьФайл()


&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ОбъектТЗ = ПредопределенноеЗначение("Справочник.Композиции.ПустаяСсылка");
	
	Если ЗначениеЗаполнено(Проект) Тогда
		Элементы.ОбъектТЗ.Доступность = Истина;
		Элементы.ОбъектТЗ.СписокВыбора.ЗагрузитьЗначения(ПолучитьОбъектыПроекта(Проект));
	Иначе
		Элементы.ОбъектТЗ.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбъектыПроекта(Проект)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА ИзделияКомплект.Родитель.Композиция = ЗНАЧЕНИЕ(Справочник.Композиции.ПустаяСсылка)
		|			ТОГДА ИзделияКомплект.Ссылка
		|		ИНАЧЕ ИзделияКомплект.Родитель.Композиция
		|	КОНЕЦ КАК Ссылка
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	НЕ ИзделияКомплект.ЭтоГруппа
		|	И ИзделияКомплект.Проект = &Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Ссылка КАК Ссылка
		|ИЗ
		|	вт КАК вт
		|
		|УПОРЯДОЧИТЬ ПО
		|	вт.Ссылка.Наименование";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции // ПолучитьОбъектыПроекта()
