
#Область СозданиеРеквизитовФормы

Процедура СоздатьЭлементыИРеквизитыНаФорме(ТекущаяФорма,РодительскийЭлемент) Экспорт
	
	ЭлементГруппа = СоздатьГруппуДлительныеОперации(ТекущаяФорма, РодительскийЭлемент);
	СоздадьКомандуПоказатьДлительныеДействия(ТекущаяФорма);
	СоздатьКнопкуДобавитьКомментарий(ТекущаяФорма, ЭлементГруппа);
	
	ИмяРеквизита = СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма);
	СоздатьЭлементФормы(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа);	
	
КонецПроцедуры 

Функция СоздадьКомандуПоказатьДлительныеДействия(ТекущаяФорма)
	
	КомандаДобавитьКомментарий 				= ТекущаяФорма.Команды.Добавить("ОбщаяКомандаДлительныеДействия");
	КомандаДобавитьКомментарий.Заголовок 	= "Показать действия";
	КомандаДобавитьКомментарий.Действие 	= "ОбщаяКомандаДлительныеДействия";
	
	Возврат КомандаДобавитьКомментарий;
	
КонецФункции

Процедура СоздатьКнопкуДобавитьКомментарий(ТекущаяФорма, ЭлементГруппа)
	
	КнопкаДобавитьКомментарий 				= ТекущаяФорма.Элементы.Добавить("КнопкаПоказатьДлительныеДействия", Тип("КнопкаФормы"), ЭлементГруппа);
	КнопкаДобавитьКомментарий.Заголовок 	= "Показать действия";
	КнопкаДобавитьКомментарий.ИмяКоманды 	= "ОбщаяКомандаДлительныеДействия";
	
КонецПроцедуры

Функция СоздатьГруппуДлительныеОперации(ТекущаяФорма, РодительскийЭлемент)
	
	ГруппаКомментарий 						= ТекущаяФорма.Элементы.Добавить("ГруппаДлительныеДействия_авто", Тип("ГруппаФормы"), РодительскийЭлемент);
	ГруппаКомментарий.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКомментарий.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ГруппаКомментарий.ОтображатьЗаголовок 	= Ложь; 
	ГруппаКомментарий.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Возврат ГруппаКомментарий;
	
КонецФункции

Процедура СоздатьЭлементФормы(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа)
	
	НовыйЭлемент 				= ТекущаяФорма.Элементы.Добавить("ДлительныеДействия_авто", Тип("ПолеФормы"), ЭлементГруппа);
	НовыйЭлемент.Заголовок		= "Длительные действия";
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеHTMLДокумента;
	НовыйЭлемент.ПутьКДанным 	= ИмяРеквизита;
	НовыйЭлемент.Видимость		= Ложь;
	
КонецПроцедуры // СоздатьЭлементФормы(ТекущаяФорма)

Функция СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма)

	имяРеквизита = "ДлительныеДействия_авто";
	
	ДобавляемыеРеквизиты = Новый Массив; 
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(имяРеквизита, Новый ОписаниеТипов("Строка"))); 
	
    ТекущаяФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Возврат имяРеквизита;
	
КонецФункции // СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма)

#КонецОбласти

Функция Получить_HTML_длительное_действие(ОбъектДействия) Экспорт

	стрВозврата = омHTML.ПолучитьЗаголовокHTML();
	стрВозврата = стрВозврата + омHTML.ПолучитьHeadHTML("", 4);
	
	стрВозврата = стрВозврата + "<table>";
	стрВозврата = стрВозврата + "<tr><th style=""min-width: 70px;"">Дата</th><th>Текст</th><th style=""min-width: 65px;"">Автор</th>";
	
	//Если ОтображатьТип Тогда
	//	стрВозврата = стрВозврата + "<th>Тип</th></tr>";
	//	ШаблонСтроки = "<tr><td>%1</td><td>%2</td><td>%3</td><td>%4</td></tr>";
	//Иначе
		стрВозврата = стрВозврата + "</tr>";
		ШаблонСтроки = "<tr><td>%1</td><td>%2</td><td>%3</td></tr>";
	//КонецЕсли; 
	
	
	//Для каждого СтрокаТаблицы Из ДанныеКомментария Цикл
	//	
	//	ТестСообщения = СтрЗаменить(СтрокаТаблицы.Текст, "&", "&amp;");
	//	ТестСообщения = СтрЗаменить(ТестСообщения, ">",  "&gt;");
	//	ТестСообщения = СтрЗаменить(ТестСообщения, "<",  "&lt;");
	//	ТестСообщения = СтрЗаменить(ТестСообщения, """", "&quot;");
	//	ТестСообщения = СтрЗаменить(ТестСообщения, "'",  "&apos;");
	//	
	//	Если ОтображатьТип Тогда
	//		стрВозврата = стрВозврата + СтрШаблон(ШаблонСтроки, Формат(СтрокаТаблицы.Дата, "ДФ=dd.MM.yy"), ТестСообщения, СтрокаТаблицы.Автор, СтрокаТаблицы.ТипКомментария);	
	//	Иначе
	//		стрВозврата = стрВозврата + СтрШаблон(ШаблонСтроки, Формат(СтрокаТаблицы.Дата, "ДФ=dd.MM.yy"), ТестСообщения, СтрокаТаблицы.Автор);	
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	стрВозврата = стрВозврата + "</table>";
	
	стрВозврата = стрВозврата + омHTML.ПолучитьХвостHTML();
	
	Возврат стрВозврата;

КонецФункции // Создать()


Функция МиллисикундыВДату(ЧислоМиллисекунд) Экспорт

	Возврат Дата(1970, 1, 1, 1, 0, 0) + Цел(ЧислоМиллисекунд / 1000);	

КонецФункции // МилисикундыВДату()
