
&НаКлиенте
Процедура РекламацииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РекламацииПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РекламацииПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТД = Элементы.Рекламации.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "РекламацииЗадача" Тогда
		ЧтоОткрыть = ТД.Задача;	
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "РекламацииКомплект" Тогда
		ЧтоОткрыть = ТД.Комплект;	
	Иначе
		ЧтоОткрыть = ТД.Рекламация;	
	КонецЕсли;
	
	ПоказатьЗначение(, ЧтоОткрыть);
	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ВедущийКонструктор", ВедущийКонструктор);
	Параметры.Свойство("Проект", Проект);

	Элементы.ВедущийКонструктор.Видимость 	= ЗначениеЗаполнено(ВедущийКонструктор);
	Элементы.Проект.Видимость 				= ЗначениеЗаполнено(Проект);
	
	ЗаполнитьДанные();
	
КонецПроцедуры

Процедура ЗаполнитьДанные()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рекламации.Ссылка КАК Рекламация,
		|	Рекламации.Дата КАК Дата,
		|	Рекламации.ВедущийКонструктор КАК ВедущийКонструктор,
		|	Рекламации.Конструктор КАК Конструктор,
		|	Рекламации.ОстановитьПроизводство КАК ОстановитьПроизводство,
		|	Рекламации.Причина КАК Причина,
		|	Рекламации.Проект КАК Проект,
		|	Задачи_РКД.Ссылка КАК Задача,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия.ПолноеНаименование КАК ТекущаяСтадияПолноеНаименование,
		|	Рекламации.Комплект КАК Комплект
		|ИЗ
		|	Документ.Рекламации КАК Рекламации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Задачи_РКД КАК Задачи_РКД
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|			ПО Задачи_РКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|		ПО (Задачи_РКД.Основание = Рекламации.Ссылка)
		|ГДЕ
		|	НЕ Рекламации.ПометкаУдаления
		|	И НЕ Рекламации.РКДВыполнено
		|	И ВЫБОР
		|			КОГДА &ВедущийКонструктор = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Рекламации.ВедущийКонструктор = &ВедущийКонструктор
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("ВедущийКонструктор", ВедущийКонструктор);
	
	Рекламации.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры



