Процедура ЗаполнитьДанныеНаОснованииКомплекта(Объект, Элементы = Неопределено, ДобавитьСлужебныеКлолнки = Ложь) Экспорт

		Если Не ЗначениеЗаполнено(Объект.Проект) Тогда

			Объект.Проект = Объект.Комплект.Проект; 
			
			Если НЕ Элементы = Неопределено Тогда
				
				Если Элементы.Проект.СписокВыбора.НайтиПоЗначению(Объект.Проект) = Неопределено Тогда
					Элементы.Проект.СписокВыбора.Добавить(Объект.Проект);	
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ТипРекламации) Тогда
			Объект.ТипРекламации = ПолучитьТипРекламации(Объект.Комплект, Объект.Проект, ДобавитьСлужебныеКлолнки);		
		КонецЕсли;
		
		ПользователиКомплекта = омСотрудники.СотрудникиОбъекта(Объект.Комплект);
		
		Объект.Конструктор 			= ПользователиКомплекта.Конструктор;
		Объект.ВедущийКонструктор 	= ПользователиКомплекта.ВедущийКонструктор;

КонецПроцедуры

Функция ПолучитьТипРекламации(Комплект, Проект, ДобавитьСлужебныеКлолнки = Ложь)
	
	СписокКомплектов = ПолучитьСписокКомплектовВПроизводстве(Проект, ПредопределенноеЗначение("Перечисление.ТипыРекламации.ИзОжиданияГЧ"), ДобавитьСлужебныеКлолнки); 
	
	Если НЕ СписокКомплектов.НайтиПоЗначению(Комплект) = Неопределено Тогда
		
		Возврат ПредопределенноеЗначение("Перечисление.ТипыРекламации.ИзОжиданияГЧ");	
		
	КонецЕсли;
	
	СписокКомплектов = ПолучитьСписокКомплектовВПроизводстве(Проект, ПредопределенноеЗначение("Перечисление.ТипыРекламации.ИзПроизводства"), ДобавитьСлужебныеКлолнки);
	
	Если НЕ СписокКомплектов.НайтиПоЗначению(Комплект) = Неопределено Тогда
		
		Возврат ПредопределенноеЗначение("Перечисление.ТипыРекламации.ИзПроизводства");	
		
	КонецЕсли;
	
КонецФункции // ПолучитьТипРекламации()

Функция ПолучитьСписокКомплектовВПроизводстве(Проект, ТипРекламации, ДобавитьСлужебныеКолонки = Ложь) Экспорт
	
	СписокВозврата = Новый СписокЗначений;
	
	Если ТипРекламации = Перечисления.ТипыРекламации.ИзПроизводства Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВЫРАЗИТЬ(КанбанКарточки.Ресурс КАК Справочник.ИзделияКомплект) КАК Комплект
			|ПОМЕСТИТЬ втКомплекты
			|ИЗ
			|	РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
			|		ПО КанбанПереходКарточкиСрезПоследних.УИДКарточка = КанбанКарточки.УИД
			|ГДЕ
			|	КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка В(&УИДКудаКолонка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Рекламации.Комплект КАК Комплект
			|ПОМЕСТИТЬ втСуществующие
			|ИЗ
			|	Документ.Рекламации КАК Рекламации
			|ГДЕ
			|	ВЫБОР
			|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ Рекламации.Проект = &Проект
			|		КОНЕЦ
			|	И НЕ Рекламации.ПометкаУдаления
			|	И НЕ Рекламации.РКДВыполнено
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	втКомплекты.Комплект КАК Комплект,
			|	втКомплекты.Комплект.Наименование КАК Наименование
			|ИЗ
			|	втКомплекты КАК втКомплекты
			|		ЛЕВОЕ СОЕДИНЕНИЕ втСуществующие КАК втСуществующие
			|		ПО втКомплекты.Комплект = втСуществующие.Комплект
			|ГДЕ
			|	ВЫБОР
			|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ втКомплекты.Комплект.Проект = &Проект
			|		КОНЕЦ
			|	И втСуществующие.Комплект ЕСТЬ NULL
			|
			|УПОРЯДОЧИТЬ ПО
			|	Наименование";
			
		Запрос.УстановитьПараметр("Проект", Проект);
		Запрос.УстановитьПараметр("УИДКудаКолонка", омКанбанПроизводство.ПолучитьУИДКолонокПороизводства(ДобавитьСлужебныеКолонки));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СписокВозврата.Добавить(Выборка.Комплект, Выборка.Наименование);
		КонецЦикла;
		
	Иначе 	
		
		Для каждого х Из  Обработки.ОжиданиеГЧ.ЗадачиВОжиданииГЧ(, Проект) Цикл
			
			Если СписокВозврата.НайтиПоЗначению(х.ОбъектТЗ) = Неопределено Тогда
				СписокВозврата.Добавить(х.ОбъектТЗ, х.ОбъектТЗНаименование);
			КонецЕсли;
		КонецЦикла;
		
		СписокВозврата.СортироватьПоПредставлению();
		
	КонецЕсли;
	
	Возврат СписокВозврата;
	
КонецФункции // ПолучитьСписокПроектовВПроизводстве()    

