
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипРекламации = Перечисления.ТипыРекламации.ИзПроизводства Тогда
		
		УИДДоскиПроизводство = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
		УИДКарточка = омКанбанДоскиНаСервере.ПолучитьУИДКарточки(УИДДоскиПроизводство, Комплект);
		
		ЕстьТегРекламация = Ложь;
		
		Если НЕ ПустаяСтрока(УИДКарточка) Тогда
			Если омКанбанДоскиНаСервере.ПроверитьНаличиеТега(УИДКарточка, Справочники.Теги.Рекламация) Тогда
				ЕстьТегРекламация = Истина;
			КонецЕсли;
			ПеремещениеКарточкиКанбана();
		КонецЕсли;
		
		
		Если РКДВыполнено Тогда
			
			Если НЕ ПустаяСтрока(УИДКарточка) Тогда
				
				Если ЕстьТегРекламация Тогда
					
					омКанбанДоскиНаСервере.УдалитьТег(Справочники.Теги.Рекламация, УИДКарточка);	
					омКанбанДоскиНаСервере.ЗаписатьТег(Справочники.Теги.РекламацияЗавершена, УИДКарточка);
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если ОстановитьПроизводство И НЕ ПустаяСтрока(УИДКарточка) Тогда
				
				ДанныеКарточки = омКанбанДоскиНаСервере.ПолучитьКарточкиКанбанаСКолонкамиИТегами(УИДДоскиПроизводство, Комплект);
				
				Если ДанныеКарточки.Количество() > 0 Тогда 
					
					Если НЕ ДанныеКарточки[0].УИДКудаКолонка = омКанбанДоскиНаСервереПовтор.ПолучитьУИДКолонки(УИДДоскиПроизводство, "_Приостановка_Производства") Тогда
						
						Если омКанбанДоскиНаСервереПовтор.ПолучитьМассивСлужебныхКолонок().Найти(ДанныеКарточки[0].УИДКудаКолонка) = Неопределено Тогда
							
							омКанбанПроизводство.ПеревестиКарточкуВПриостановку(Комплект, , УИДКарточка);		
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ (ПустаяСтрока(УИДКарточка) ИЛИ ЕстьТегРекламация) Тогда
				
				омКанбанДоскиНаСервере.ЗаписатьТег(Справочники.Теги.Рекламация, УИДКарточка);
				омКанбанПроизводство.СоздатьКомментарий(УИДКарточка, Комментарий);
				
			КонецЕсли;
			
			ЗапуститьРКД();
			ЗаполнитьПоляЗадачи(УИДКарточка);
			
		КонецЕсли;
		
		Параметр = Новый Структура("РежимЗаписиДокумента", РежимЗаписиДокумента.Проведение);
		омЗадачаОбщаяНаСервере.СозданиеОбщейЗадачи(Ссылка, Параметр);
		
	ИначеЕсли Не РКДВыполнено Тогда
		
		ЗапуститьРКД();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПеремещениеКарточкиКанбана()
	
	УИДДоскиПроизводство = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
	
	ДанныеКарточки = омКанбанДоскиНаСервере.ПолучитьКарточкиКанбанаСКолонкамиИТегами(УИДДоскиПроизводство, Комплект);
	
	Если ДанныеКарточки.Количество() = 0 Тогда
		УИДКудаКолонка 	= "";
		УИДКарточка 	= "";
	Иначе
		УИДКудаКолонка 	= ДанныеКарточки[0].УИДКудаКолонка;
		УИДКарточка		= ДанныеКарточки[0].УИДКарточка;	
	КонецЕсли;
	
	Если Не ПустаяСтрока(УИДКарточка) Тогда
		
		УИДКолонкиПриостановки = омКанбанДоскиНаСервереПовтор.ПолучитьУИДКолонки(УИДДоскиПроизводство, "_Приостановка_Производства");
		
		Если УИДКолонкиПриостановки = УИДКудаКолонка Тогда
			
			Если (НЕ ОстановитьПроизводство ИЛИ РКДВыполнено) И НЕ ПустаяСтрока(ПредыдущаяСтатдияПроизводства) Тогда
				
				омКанбанПроизводство.ПереместитьРеквизитВПереопределенное(Комплект, ПредыдущаяСтатдияПроизводства);
				
			КонецЕсли; 
			
		Иначе
			
			Если ОстановитьПроизводство И НЕ РКДВыполнено Тогда
				
				омКанбанПроизводство.ПереместитьРеквизитВПереопределенное(Комплект, УИДКолонкиПриостановки);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗапуститьРКД()
	
	Задачи.Задачи_ПКД.СоздатьЗадачуРКД(Комплект, Конструктор, Перечисления.СтатусыЗадач.Корректировка, Перечисления.ТипыЗадачКонструирования.Конструктор
			, Перечисления.СостоянияЗадач.ОжиданиеКонструктором, Комментарий, "Рекламация", Истина, ТипРекламации, Ссылка); 
	
КонецФункции  

Процедура ЗаполнитьПоляЗадачи(УИДКарточка)
	
	Если НЕ ПустаяСтрока(УИДКарточка) Тогда
		
		омКанбанДоскиНаСервере.ЗаписатьТег(Справочники.Теги.Рекламация, УИДКарточка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		Префикс = Проект.Префикс + "-";
		УстановитьНовыйНомер(Префикс); 
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		
		Параметр = Новый Структура("РежимЗаписиДокумента", ДополнительныеСвойства.РежимЗаписи);
		омЗадачаОбщаяНаСервере.СозданиеОбщейЗадачи(Ссылка, Параметр);
		
	КонецЕсли;
	
КонецПроцедуры

