Функция ДобавитьОбъектВОчередь(ОбъектВыгрузки, ТипОбмена) Экспорт
	
	ДанныеОперации 	= Новый Структура("Результат, ОписаниеОшибки", Истина, "");
	ПустаяДата		= Дата(1, 1, 1);
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОчередьВыгрузкиPDM");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ОбъектВыгрузки", 	ОбъектВыгрузки);
		ЭлементБлокировки.УстановитьЗначение("ЗавершенОбмен", 	ПустаяДата);
		БлокировкаДанных.Заблокировать();
		
		МенеджерЗаписи 					= РегистрыСведений.ОчередьВыгрузкиPDM.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ОбъектВыгрузки 	= ОбъектВыгрузки;
		МенеджерЗаписи.ТипОбмена 		= ТипОбмена;
		МенеджерЗаписи.ЗавершенОбмен 	= ПустаяДата;
		МенеджерЗаписи.Автор 			= ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.ДатаОчередь 		= Текущаядата();
		
		МенеджерЗаписи.Записать()
		
	Исключение
		
	    ДанныеОперации.Результат 		= Ложь;
		ДанныеОперации.ОписаниеОшибки 	= ОписаниеОшибки();

	КонецПопытки;
	
	Возврат ДанныеОперации;
	
КонецФункции // ДобавитьОбъектВОчередь()
