Функция ПолучитьФайлНаСервере(ИмяФайла) Экспорт

	ТД = ТекущаяДата();
	ИмяФайла = "ТЗ_на_согласовании_" + Формат(Год(ТД), "ЧГ=0") + "_" + Месяц(ТД) + "_" + День(ТД) + ".pdf";

	ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("pdf");
	
	СоздатьФайлОтчета(ИмяПромежуточногоФайла);
	
	Двоичное 	= Новый ДвоичныеДанные(ИмяПромежуточногоФайла);  // получаем двоичные данные из файла
	Адрес 		= ПоместитьВоВременноеХранилище(Двоичное); // кидаем двоичные данные во врем. хранилище
	
	Попытка
		УдалитьФайлы(ИмяПромежуточногоФайла);
	Исключение
	КонецПопытки;
	
	Возврат Адрес;

КонецФункции // ПолучитьФайлНаСервере()

Функция СоздатьФайлОтчета(ПутьКФайлу = "", ПолеВывода = Неопределено, ТипФайла = Неопределено) Экспорт

	Если ПолеВывода = Неопределено Тогда
	
		ПолеВывода = Новый ТабличныйДокумент;	
	
	КонецЕсли;
	
	СформироватьОтчетНаСервере(ПолеВывода);
	
	Если НЕ ПустаяСтрока(ПутьКФайлу) Тогда
	
		ПолеВывода.Записать(ПутьКФайлу, ?(ТипФайла = Неопределено, ТипФайлаТабличногоДокумента.PDF, ТипФайла));		
	
	КонецЕсли;
	
КонецФункции // СоздатьФайлОтчета() 

Процедура СформироватьОтчетНаСервере(ПолеВывода)
	
	ПолеВывода.Очистить(); 		
	
	стТаблицы = ПолучитьТаблицуДанных();
	
	ВывестиДанные(стТаблицы, ПолеВывода);
	
КонецПроцедуры // СформироватьОтчетНаСервере()

Функция ПолучитьТаблицуДанных()
	
	УстановитьПривилегированныйРежим(Истина);
	
	тзДанныеЗапрос 	= ЗаполнитьКомплектыИзделий();
	
	тзЭтапы = Неопределено;
	
	тзДанные = РассчитатьПоля(тзДанныеЗапрос, тзЭтапы);
	
	Возврат Новый Структура("тзДанные, тзЭтапы", тзДанные, тзЭтапы);
	
КонецФункции // ПолучитьТаблицуДанных()     

Функция РассчитатьПоля(тзДанныеЗапрос, тзЭтапы) 
	
	МассивСтадийУКонструктора = омЗадачиПКДПовтор.СтадииКонструктора(Истина);
	
	ТипСтрока 	= Новый ОписаниеТипов("Строка");
	ТипДата 	= Новый ОписаниеТипов("Дата");
	ТипБулево 	= Новый ОписаниеТипов("Булево");
	ТипЧисло 	= Новый ОписаниеТипов("Число");
	
	тзДанные = Новый ТаблицаЗначений;
	тзДанные.Колонки.Добавить("ПроектНаименование", 			ТипСтрока);
	тзДанные.Колонки.Добавить("Номер",							ТипСтрока);
	тзДанные.Колонки.Добавить("КомплектКомпозиция");
	тзДанные.Колонки.Добавить("ИзделиеЗаказчика", 				ТипСтрока);
	тзДанные.Колонки.Добавить("КомплектКомпозицияНаименование", ТипСтрока);
	тзДанные.Колонки.Добавить("Помещение");
	тзДанные.Колонки.Добавить("ПомещениеНаименование", 			ТипСтрока);
	тзДанные.Колонки.Добавить("Согласовано", 					ТипДата);
	тзДанные.Колонки.Добавить("СогласованоАрхитектор", 			ТипСтрока);
	тзДанные.Колонки.Добавить("Приоритет");
	тзДанные.Колонки.Добавить("Конструктор",					Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	тзДанные.Колонки.Добавить("Состояние",						Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	тзДанные.Колонки.Добавить("СостояниеСтрока",				ТипСтрока);
	тзДанные.Колонки.Добавить("КрайТЗ", 						ТипДата);
	тзДанные.Колонки.Добавить("ДатаГотовностиЧертежа",			ТипДата);
	тзДанные.Колонки.Добавить("КрайСогласования", 				ТипДата);
	тзДанные.Колонки.Добавить("КрайПроектирование", 			ТипДата);
	тзДанные.Колонки.Добавить("КрайПроизводство", 				ТипДата);
	тзДанные.Колонки.Добавить("КрайРКД", 						ТипДата);
	тзДанные.Колонки.Добавить("КрайМонтаж", 					ТипДата);
	тзДанные.Колонки.Добавить("Договор", 						ТипДата);
	тзДанные.Колонки.Добавить("Редакция");
	тзДанные.Колонки.Добавить("ПодрядПроект",					ТипБулево);
	тзДанные.Колонки.Добавить("ПодрядРКД",						ТипБулево);
	тзДанные.Колонки.Добавить("ПодрядПроизводство",				ТипБулево);
	тзДанные.Колонки.Добавить("ЭтоКомпозиция",					ТипБулево);
	тзДанные.Колонки.Добавить("СогласованДизайнером",			ТипБулево);
	тзДанные.Колонки.Добавить("ОтгрузкаЧислом",					ТипЧисло); //0 - не отгружен, 1 - частичная отгрузка, 2 полностью отгружен
	тзДанные.Колонки.Добавить("Дней_в_стадии",					ТипЧисло);
	тзДанные.Колонки.Добавить("ОсновнойЭтап");
	
	НомерКомпозиции 		= 0;   
	Номер			 		= 1;
	НомерВнутриКомпозиции 	= 0;
	
	мКомплект 			= Новый Массив;
	мИзделиеКомплект 	= Новый Массив;
	
	ТД 						= НачалоДня(ТекущаяДата());
	СекундВНеделе 			= 3600 * 24 * 7;
	ПустаяДата				= Дата(1, 1, 1);
	
	текущаяКомпозиция 	= Неопределено;
	текущийПроект 		= Неопределено;
	
	Для каждого х Из тзДанныеЗапрос Цикл 
		
		Если НЕ тзДанные.Найти(х.ИзделиеКомплект, "КомплектКомпозиция") = Неопределено Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		Если НЕ текущийПроект = х.Проект  Тогда
			
			НС = тзДанные.Добавить();
			НС.ПроектНаименование = Строка(х.ПроектНомер) + " " + х.ПроектНаименование; 
			текущийПроект = х.Проект; 
			Номер 			= 0;
			НомерКомпозиции = 0;
			НомерВнутриКомпозиции = 0;
			
		КонецЕсли;
		
		Если НЕ текущаяКомпозиция = х.Композиция И ЗначениеЗаполнено(х.Композиция) Тогда
			
			Номер = Номер + 1;
			
			НомерВнутриКомпозиции = 1;
			
			НС = тзДанные.Добавить();
			
			НомерКомпозиции 					= Номер;
			текущаяКомпозиция 					= х.Композиция;	
			НС.Номер 							= НомерКомпозиции;
			НС.КомплектКомпозиция 				= х.Композиция;
			НС.КомплектКомпозицияНаименование 	= х.КомпозицииНаименование;
			НС.Помещение 						= х.ПомещениеКомпозиции;
			НС.ПомещениеНаименование		 	= х.ПомещениеКомпозицииНаименование;
			НС.Приоритет 						= х.ПриоритетКомпозиция;
			НС.Конструктор 						= х.КонструкторКомпозиция;
			НС.Состояние		 				= х.ТекущаяСтадияКомпозиция;
			НС.СостояниеСтрока	 				= х.ТекущаяСтадияКомпозицияСтрока;
			НС.КрайПроектирование 				= х.ВнешняяДатаОкончаниеПроектированияКомпозиции;
			НС.КрайТЗ 							= х.ВнешняяДатаОкончаниеТЗКомпозиции;
			НС.КрайСогласования 				= х.ВнешняяДатаОкончаниеСогласованияКомпозиции;
			НС.ОсновнойЭтап			 			= х.ОсновнойЭтапКомпозиции;
			НС.ПодрядРКД						= х.ПодрядРКДКомпозиции;
			НС.ПодрядПроект						= х.ПодрядПроектКомпозиции;
			НС.ПодрядПроизводство				= х.ПодрядПроизводствоКомпозиции;
			НС.ЭтоКомпозиция					= Истина;
			
			мКомплект.Добавить(х.Композиция);
			
		КонецЕсли;
		
		НС = тзДанные.Добавить();
		
		Если ЗначениеЗаполнено(х.Композиция) Тогда
			
			НомерВнутриКомпозиции = НомерВнутриКомпозиции + 1;
			
			НС.Номер 							=  Строка(НомерКомпозиции) + "." + НомерВнутриКомпозиции;
			НС.КомплектКомпозицияНаименование 	= "   " + х.КомплектНаименование;
			НС.КрайПроектирование 				= ПустаяДата;
			НС.КрайТЗ 							= ПустаяДата;
			НС.КрайСогласования 				= ПустаяДата;
			
		Иначе	
			
			Номер = Номер + 1;
			
			НС.Номер 							= Номер;
			НС.КомплектКомпозицияНаименование 	= х.КомплектНаименование;
			НС.КрайПроектирование 				= х.ВнешняяДатаОкончаниеПроектирования;
			НС.КрайТЗ 							= х.ВнешняяДатаОкончаниеТЗ;
			НС.КрайСогласования 				= х.ВнешняяДатаОкончаниеСогласования;
			
		КонецЕсли;
		
		НС.КомплектКомпозиция 				= х.ИзделиеКомплект;
		НС.Помещение 						= х.Помещение;                  
		НС.ПомещениеНаименование		 	= х.ПомещениеНаименование;
		НС.Приоритет 						= х.Приоритет;
		НС.Состояние		 				= х.ТекущаяСтадия;
		НС.СостояниеСтрока	 				= х.ТекущаяСтадияСтрока;
		НС.КрайПроизводство 				= х.ВнешняяДатаОкончаниеПроизводства;
		НС.КрайМонтаж 						= х.ВнешняяДатаОкончаниеМонтажа;
		НС.КрайРКД 							= х.ВнешняяДатаОкончаниеРКД;
		НС.ОсновнойЭтап			 			= х.ОсновнойЭтап;
		НС.СогласованДизайнером				= х.СогласованДизайнером;
		НС.ПодрядРКД						= х.ПодрядРКД;
		НС.ПодрядПроект						= х.ПодрядПроект;
		НС.ПодрядПроизводство				= х.ПодрядПроизводство;
		НС.Конструктор 						= х.Конструктор;
		НС.ЭтоКомпозиция					= Ложь;
		
		мКомплект.Добавить(х.ИзделиеКомплект);
		мИзделиеКомплект.Добавить(х.ИзделиеКомплект);
		
	КонецЦикла;
	
	тзДанные.Индексы.Добавить("КомплектКомпозиция");    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
		|	ЧастичнаяОтгрузка.ИзделиеКомплект КАК ИзделиеКомплект
		|ИЗ
		|	Справочник.ЧастичнаяОтгрузка КАК ЧастичнаяОтгрузка
		|ГДЕ
		|	ЧастичнаяОтгрузка.ИзделиеКомплект В(&ИзделиеКомплект)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЧастичнаяОтгрузка.ИзделиеКомплект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтгрузкаГотовойПродукцииИзделияКомплекты.ИзделиеКомплект КАК ИзделиеКомплект
		|ИЗ
		|	Документ.ОтгрузкаГотовойПродукции.ИзделияКомплекты КАК ОтгрузкаГотовойПродукцииИзделияКомплекты
		|ГДЕ
		|	ОтгрузкаГотовойПродукцииИзделияКомплекты.ИзделиеКомплект В(&ИзделиеКомплект)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтгрузкаГотовойПродукцииИзделияКомплекты.ИзделиеКомплект";
	
	Запрос.УстановитьПараметр("ИзделиеКомплект", мКомплект);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденаяСтрока = тзДанные.Найти(Выборка.ИзделиеКомплект, "КомплектКомпозиция");
		Если НЕ НайденаяСтрока = Неопределено Тогда
			НайденаяСтрока.ОтгрузкаЧислом = 1;	
		КонецЕсли;
	КонецЦикла;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденаяСтрока = тзДанные.Найти(Выборка.ИзделиеКомплект, "КомплектКомпозиция");
		Если НЕ НайденаяСтрока = Неопределено Тогда
			НайденаяСтрока.ОтгрузкаЧислом = 2;	
		КонецЕсли;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыСогласования.ДатаСогласованияАрхитектором КАК ДатаСогласованияАрхитектором,
		|	ДатыСогласования.ДатаСогласованияЗаказчиком КАК ДатаСогласованияЗаказчиком,
		|	ДатыСогласования.ДатаСогласованияДизайнером КАК ДатаСогласования,
		|	ДатыСогласования.Комплект КАК Комплект
		|ИЗ
		|	РегистрСведений.ДатыСогласования КАК ДатыСогласования
		|ГДЕ
		|	ДатыСогласования.Комплект В(&Комплект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК Комплект,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокМонтажаВНеделях КАК СрокМонтажаВНеделях,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокПроизводстваВНеделях КАК СрокПроизводстваВНеделях,
		|	МАКСИМУМ(ЕСТЬNULL(СостояниеЗамера.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаПринятияПомещения
		|ИЗ
		|	Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеЗамера КАК СостояниеЗамера
		|		ПО ИзделияКомплектИзделияЭлемент.Ссылка.ОсновноеПомещение = СостояниеЗамера.ОбъектЗамера
		|			И (СостояниеЗамера.СтатусЗамера = &СтатусЗамера)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК ПриложенияКДоговорамИзделияЗаказчика
		|			ПО (ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика = ИзделияЗаказчикаИзделияЭлемент.Ссылка)
		|		ПО ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент = ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент
		|ГДЕ
		|	ИзделияКомплектИзделияЭлемент.Ссылка В(&Комплект)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияКомплектИзделияЭлемент.Ссылка,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокМонтажаВНеделях,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокПроизводстваВНеделях
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК Комплект,
		|	ДанныеИзделияЗаказчика.НаименованиеСАртикулом КАК ИзделияЗаказчикаНаименование
		|ИЗ
		|	Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
		|			ПО ИзделияЗаказчикаИзделияЭлемент.Ссылка = ДанныеИзделияЗаказчика.ИзделиеЗаказчика
		|		ПО ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент = ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент
		|ГДЕ
		|	ИзделияКомплектИзделияЭлемент.Ссылка В(&мИзделиеКомплект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеКомплекта.Комплект КАК Комплект,
		|	ДанныеКомплекта.ТекущаяСтадия.ОсновнойЭтап КАК ОсновнойЭтап,
		|	МАКСИМУМ(ДанныеКомплекта.Период) КАК Начало
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|ГДЕ
		|	ДанныеКомплекта.Комплект В(&Комплект)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеКомплекта.Комплект,
		|	ДанныеКомплекта.ТекущаяСтадия.ОсновнойЭтап
		|
		|УПОРЯДОЧИТЬ ПО
		|	Начало";
	
	Запрос.УстановитьПараметр("СтатусЗамера", 		Перечисления.СтатусыЗамера.Строительный);
	Запрос.УстановитьПараметр("Комплект", 			мКомплект);
	Запрос.УстановитьПараметр("мИзделиеКомплект", 	мИзделиеКомплект);
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[0].Выбрать();
	
	тзЭтапы = Результат[3].Выгрузить();
	тзЭтапы.Индексы.Добавить("Комплект");
	
	ОтборЭтапа = Новый Структура("ОсновнойЭтап, Комплект", Перечисления.ОсновныеЭтапы.Согласование); 
	
	Пока Выборка.Следующий() Цикл
		
		НайденаяСтрока = тзДанные.Найти(Выборка.Комплект, "КомплектКомпозиция");
		НайденаяСтрока.Согласовано = Выборка.ДатаСогласования;
		НайденаяСтрока.СогласованоАрхитектор = ?(Выборка.ДатаСогласованияАрхитектором = ПустаяДата, "", Формат(Выборка.ДатаСогласованияАрхитектором, "ДФ=dd.MM.yyyy"))
		+ " / "
		+ ?(Выборка.ДатаСогласованияЗаказчиком = ПустаяДата, "", Формат(Выборка.ДатаСогласованияЗаказчиком, "ДФ=dd.MM.yyyy"));
		
		
		ОтборЭтапа.Комплект = Выборка.Комплект;
		НайденыеСтроки = тзЭтапы.НайтиСтроки(ОтборЭтапа); 
		
		Для каждого СтрокаЭтапа Из НайденыеСтроки Цикл
			СтрокаЭтапа.Начало = Выборка.ДатаСогласования;		
		КонецЦикла;
	КонецЦикла;
	
	Выборка = Результат[2].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НайденаяСтрока = тзДанные.Найти(Выборка.Комплект, "КомплектКомпозиция");
		Если НЕ ПустаяСтрока(НайденаяСтрока.ИзделиеЗаказчика) Тогда
			НайденаяСтрока.ИзделиеЗаказчика = НайденаяСтрока.ИзделиеЗаказчика + ", " + Символы.ПС;
		КонецЕсли;
		НайденаяСтрока.ИзделиеЗаказчика = НайденаяСтрока.ИзделиеЗаказчика + Выборка.ИзделияЗаказчикаНаименование;
	КонецЦикла;
	
	Возврат тзДанные;
	
КонецФункции

Функция ЗаполнитьКомплектыИзделий()
	
	Статусы = Новый Массив(2);
	Статусы[0] = Перечисления.СтатусыЗадач.ТЗВнутреннееОжидание;
	Статусы[1] = Перечисления.СтатусыЗадач.ТЗВнешнееОжидание;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКолонки.УИД КАК УИД,
		|	КанбанКолонки.Статус КАК Статус
		|ПОМЕСТИТЬ втКолонки
		|ИЗ
		|	РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|ГДЕ
		|	КанбанКолонки.Доска = &Доска
		|	И КанбанКолонки.Статус В(&Статус)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КанбанПереходКарточкиСрезПоследних.Пользователь КАК Пользователь,
		|	КанбанПереходКарточкиСрезПоследних.Период КАК Период,
		|	втКолонки.Статус КАК Статус,
		|	КанбанКарточки.Ресурс КАК Ресурс
		|ИЗ
		|	РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДКарточка = КанбанКарточки.УИД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКолонки КАК втКолонки
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = втКолонки.УИД
		|ГДЕ
		|	КанбанКарточки.Доска = &Доска";
	
	Запрос.УстановитьПараметр("Доска", омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("НаименованиеДоскиДляТЗ"));
	Запрос.УстановитьПараметр("Статус", Статусы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	//Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции // ЗаполнитьКомплектыИзделий()


Процедура ВывестиДанные(стТаблицы, ПолеВывода)
	
	КоличествоСекундВДне 	= 3600 * 24;
	ПустаяДата				= Дата(1, 1, 1);
	СекундВНеделе			= КоличествоСекундВДне * 7;
	ТД						= НачалоДня(ТекущаяДата());

	Макет = Отчеты.СостояниеПроекта.ПолучитьМакет("Макет1");
	МассивОбластей = ПолучитьОбласти();
	
	тзЭтапы = стТаблицы.тзЭтапы;
	
	ПолеВывода.Очистить();
	
	ПолеВывода.РазмерСтраницы = "A3";
	ПолеВывода.АвтоМасштаб 			= Ложь;
	ПолеВывода.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	
	обШапка 	= Макет.ПолучитьОбласть("Шапка");
	обСтрока 	= Макет.ПолучитьОбласть("Строка"); 
	обПроект 	= Макет.ПолучитьОбласть("Проект");
	
	ОбластьСтрока = обСтрока; 
	ОбластьПроект = обПроект; 
	
	ПолеВывода.ФиксацияСлева = 3;
	
	МассивОбластейДляВывода = Новый Массив;
	МассивОбластейДляВывода.Добавить(обШапка);
	
	стЦвета = Новый Структура();
	
	стЦвета.Вставить("ЦветКопозиция", 					 Новый Цвет(240, 240, 240));
	стЦвета.Вставить("ЦветКопозицияТекущая", 			 Новый Цвет(220, 220, 250));
	стЦвета.Вставить("ЦветКопозицияВниманиеПрошедшие", 	 стЦвета.ЦветКопозиция);
	стЦвета.Вставить("ЦветКопозицияВниманиеТекущие", 	 Новый Цвет(250, 250, 175));
	стЦвета.Вставить("ЦветКопозицияОпазданиеПрошедшие",  стЦвета.ЦветКопозиция);
	стЦвета.Вставить("ЦветКопозицияОпазданиеТекущие", 	 Новый Цвет(250, 220, 220));
	
	стЦвета.Вставить("ЦветКомплекта", 					 Новый Цвет(255, 255, 255));
	стЦвета.Вставить("ЦветКомплектаТекущая", 			 Новый Цвет(220, 220, 255));
	стЦвета.Вставить("ЦветКомплектВниманиеПрошедшие", 	 стЦвета.ЦветКомплекта);
	стЦвета.Вставить("ЦветКомплектВниманиеТекущие", 	 Новый Цвет(255, 250, 175));
	стЦвета.Вставить("ЦветКомплектОпазданиеПрошедшие", 	 стЦвета.ЦветКомплекта);
	стЦвета.Вставить("ЦветКомплектОпазданиеТекущие", 	 Новый Цвет(255, 220, 220)); 
	
	стЦвета.Вставить("ЦветКомплектВМонтаже", 	 		Новый Цвет(220, 255, 220)); 
	стЦвета.Вставить("ЦветКомплектЧастичнаяОтгрузка",	Новый Цвет(240, 255, 240)); 
	
	стОборКомплект 	= Новый Структура("Комплект", );
	ДнейДоОкончания = 0;
	СтадияЗавершениеПКД = омСтадииКомплектаПовтор.ПолучитьСтадиюОкончаниеПКД();
	
	Для каждого текСтрока Из стТаблицы.тзДанные Цикл
		
		Если ЗначениеЗаполнено(текСтрока.ПроектНаименование) Тогда
			обПроект.Параметры.Заполнить(текСтрока); 
			текОбласть = обПроект; 
		Иначе
			обСтрока.Параметры.Заполнить(текСтрока); 
			текОбласть = обСтрока;
			
			Если текСтрока.ЭтоКомпозиция Тогда
				ТекущийЦветФона = стЦвета.ЦветКопозиция;
			Иначе
				ТекущийЦветФона = стЦвета.ЦветКомплекта;
			КонецЕсли;
			
			
			Для каждого ТекущаяОбласть Из текОбласть.Области Цикл
				
				ИндексОбласти = МассивОбластей.Найти(ТекущаяОбласть.Имя);
				Если ИндексОбласти = Неопределено Тогда
					Продолжить;
				КонецЕсли; 
				
				ТекущаяОбласть.ЦветФона = ТекущийЦветФона;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ПроверитьВывод(МассивОбластейДляВывода, текОбласть, обШапка, ПолеВывода);
		
		обСтрока 	= Макет.ПолучитьОбласть("Строка"); 
		обПроект 	= Макет.ПолучитьОбласть("Проект");
		
	КонецЦикла;
	
	Для каждого ТекущаяОбласть Из МассивОбластейДляВывода Цикл
		ПолеВывода.Вывести(ТекущаяОбласть); 
	КонецЦикла;
	
КонецПроцедуры // ВывестиДанные()


Функция ПроверитьВывод(МассивОбластейДляВывода, текОбласть, обШапка, ПолеВывода)
	
	МассивОбластейДляВывода.Добавить(текОбласть);
	
	ВременнаяТаблица = Новый ТабличныйДокумент;
	Для каждого ТекущаяОбласть Из МассивОбластейДляВывода Цикл
		ВременнаяТаблица.Вывести(ТекущаяОбласть);
	КонецЦикла;
	
	Если НЕ ПолеВывода.ПроверитьВывод(ВременнаяТаблица) Тогда
		
		МаксимальныйИндекс = МассивОбластейДляВывода.Количество() - 1;
		
		МассивОбластейДляВывода.Удалить(МаксимальныйИндекс);
		
		Для х = 0 По МаксимальныйИндекс - 1 Цикл
			ПолеВывода.Вывести(МассивОбластейДляВывода[х]);
		КонецЦикла;
		
		ПолеВывода.ВывестиГоризонтальныйРазделительСтраниц();
		
		МассивОбластейДляВывода.Очистить();
		
		МассивОбластейДляВывода.Добавить(обШапка);
		МассивОбластейДляВывода.Добавить(текОбласть);
		
	КонецЕсли;
	
КонецФункции // ПроверитьВывод()


Функция ПолучитьОбласти()
	
	МассивОбластей = Новый Массив(14);
	МассивОбластей[0] = "ОбластьНомер";
	МассивОбластей[1] = "ОбластьКомплект";
	МассивОбластей[2] = "ОбластьИзделиеЗаказчика";
	МассивОбластей[3] = "ОбластьПомещение";
	МассивОбластей[4] = "ОбластьСогласовано";
	МассивОбластей[5] = "ОбластьПриоритет";
	МассивОбластей[6] = "ОбластьСостояние";
	МассивОбластей[7] = "ОбластьКрайТЗ";
	МассивОбластей[8] = "ОбластьКрайПроектирование";
	МассивОбластей[9] = "ОбластьКрайСогласования";
	МассивОбластей[10] = "ОбластьКрайРКД";
	МассивОбластей[11] = "ОбластьДатаГотовности";
	МассивОбластей[12] = "ОбластьСостояние";
	МассивОбластей[13] = "ОбластьКонструктор";
	
	Возврат МассивОбластей;
	
КонецФункции // ПолучитьОбласти()
