Функция ПолучитьФайлНаСервере(ИмяФайла) Экспорт

	ТД = ТекущаяДата();
	ИмяФайла = "ТЗ_на_согласовании_" + Формат(Год(ТД), "ЧГ=0") + "_" + Месяц(ТД) + "_" + День(ТД) + ".pdf";

	ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("pdf");
	
	СоздатьФайлОтчета(ИмяПромежуточногоФайла);
	
	Двоичное 	= Новый ДвоичныеДанные(ИмяПромежуточногоФайла);  // получаем двоичные данные из файла
	Адрес 		= ПоместитьВоВременноеХранилище(Двоичное); // кидаем двоичные данные во врем. хранилище
	
	Попытка
		УдалитьФайлы(ИмяПромежуточногоФайла);
	Исключение
	КонецПопытки;
	
	Возврат Адрес;

КонецФункции // ПолучитьФайлНаСервере()

Функция СоздатьФайлОтчета(ПутьКФайлу = "", ПолеВывода = Неопределено, ТипФайла = Неопределено) Экспорт

	Если ПолеВывода = Неопределено Тогда
	
		ПолеВывода = Новый ТабличныйДокумент;	
	
	КонецЕсли;
	
	СформироватьОтчетНаСервере(ПолеВывода);
	
	Если НЕ ПустаяСтрока(ПутьКФайлу) Тогда
	
		ПолеВывода.Записать(ПутьКФайлу, ?(ТипФайла = Неопределено, ТипФайлаТабличногоДокумента.PDF, ТипФайла));		
	
	КонецЕсли;
	
КонецФункции // СоздатьФайлОтчета() 

Процедура СформироватьОтчетНаСервере(ПолеВывода)
	
	стТаблицы = ПолучитьТаблицуДанных();
	
	ВывестиДанные(стТаблицы, ПолеВывода);
	
КонецПроцедуры // СформироватьОтчетНаСервере()

Функция ПолучитьТаблицуДанных()
	
	УстановитьПривилегированныйРежим(Истина);
	
	тзДанныеЗапрос 	= ЗаполнитьКомплектыИзделий();
	
	тзДанные = РассчитатьПоля(тзДанныеЗапрос);
	
	Возврат Новый Структура("тзДанные", тзДанные);
	
КонецФункции // ПолучитьТаблицуДанных()     

Функция РассчитатьПоля(тзДанныеЗапрос) 
	
	ТипСтрока 	= Новый ОписаниеТипов("Строка");
	ТипДата 	= Новый ОписаниеТипов("Дата");
	ТипБулево 	= Новый ОписаниеТипов("Булево");
	ТипЧисло 	= Новый ОписаниеТипов("Число");
	
	тзДанные = Новый ТаблицаЗначений;
	тзДанные.Колонки.Добавить("НаименованиеКолонки", 			ТипСтрока);
	тзДанные.Колонки.Добавить("ПользовательНаименование",		ТипСтрока);
	тзДанные.Колонки.Добавить("Пользователь",					Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	тзДанные.Колонки.Добавить("Дата", 							ТипДата);
	тзДанные.Колонки.Добавить("Статус",							Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	тзДанные.Колонки.Добавить("Ресурс", 						);
	тзДанные.Колонки.Добавить("РесурсНаименование",				ТипСтрока);
	тзДанные.Колонки.Добавить("Комментарий", 					ТипСтрока);
	тзДанные.Колонки.Добавить("КоличествоДней", 				ТипЧисло);
	
	
	ТД 						= КонецДня(ТекущаяДата());
	КоличествоСекундВСутках	= 24 * 3600;
	
	текущаяКомпозиция 	= Неопределено;
	Для каждого х Из тзДанныеЗапрос Цикл 
		
		НС = тзДанные.Добавить();
		ЗаполнитьЗначенияСвойств(НС, х);
		
		НС.КоличествоДней = Окр((ТД - х.Дата) / КоличествоСекундВСутках, 0);
		
	КонецЦикла;
	
	Возврат тзДанные;
	
КонецФункции

Функция ЗаполнитьКомплектыИзделий()
	
	Статусы = Новый Массив(2);
	Статусы[0] = Перечисления.СтатусыЗадач.ТЗВнутреннееОжидание;
	Статусы[1] = Перечисления.СтатусыЗадач.ТЗВнешнееОжидание;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКолонки.УИД КАК УИД,
		|	КанбанКолонки.Статус КАК Статус
		|ПОМЕСТИТЬ втКолонки
		|ИЗ
		|	РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|ГДЕ
		|	КанбанКолонки.Доска = &Доска
		|	И КанбанКолонки.Статус В(&Статус)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КанбанПереходКарточкиСрезПоследних.Пользователь КАК Пользователь,
		|	КанбанПереходКарточкиСрезПоследних.Период КАК Дата,
		|	втКолонки.Статус КАК Статус,
		|	КанбанКарточки.Ресурс КАК Ресурс,
		|	ЕСТЬNULL(КанбанДополнительныеДанныеПерехода.Комментарий, """") КАК Комментарий,
		|	КанбанКолонки.Наименование КАК НаименованиеКолонки,
		|	КанбанПереходКарточкиСрезПоследних.Пользователь.Наименование КАК ПользовательНаименование,
		|	КанбанКарточки.Ресурс.Наименование КАК РесурсНаименование
		|ИЗ
		|	РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДКарточка = КанбанКарточки.УИД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКолонки КАК втКолонки
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = втКолонки.УИД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КанбанДополнительныеДанныеПерехода КАК КанбанДополнительныеДанныеПерехода
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДПерехода = КанбанДополнительныеДанныеПерехода.УИДПерехода
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = КанбанКолонки.УИД
		|ГДЕ
		|	КанбанКарточки.Доска = &Доска
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеКолонки,
		|	КанбанПереходКарточкиСрезПоследних.Период";
	
	Запрос.УстановитьПараметр("Доска", омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиДляТЗ"));
	Запрос.УстановитьПараметр("Статус", Статусы);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции // ЗаполнитьКомплектыИзделий()

Процедура ВывестиДанные(стТаблицы, ПолеВывода)
	
	КоличествоСекундВДне 	= 3600 * 24;
	ПустаяДата				= Дата(1, 1, 1);
	СекундВНеделе			= КоличествоСекундВДне * 7;
	ТД						= НачалоДня(ТекущаяДата());

	Макет = Отчеты.ТЗ_на_согласовании.ПолучитьМакет("Макет");
	
	ПолеВывода.Очистить();
	
	ПолеВывода.РазмерСтраницы 		= "A4";
	ПолеВывода.АвтоМасштаб 			= Ложь;
	ПолеВывода.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	
	обШапка 	= Макет.ПолучитьОбласть("Шапка");
	обСтрока 	= Макет.ПолучитьОбласть("Строка"); 
	обСтатус 	= Макет.ПолучитьОбласть("Статус");
	
	обШапка.Параметры.ДатаПечати = "Дата печати" + Формат(ТекущаяДата(), "ДЛФ=DDT");
	ПолеВывода.Вывести(обШапка); 
	
	ТекущийСтатус = Неопределено;
	
	Для каждого текСтрока Из стТаблицы.тзДанные Цикл
		
		Если НЕ ТекущийСтатус = текСтрока.НаименованиеКолонки Тогда
		
			ТекущийСтатус = текСтрока.НаименованиеКолонки;
			обСтатус.Параметры.НаименованиеКолонки = ТекущийСтатус;
			ПолеВывода.Вывести(обСтатус); 
		
		КонецЕсли;
		
		обСтрока.Параметры.Заполнить(текСтрока);
		ПолеВывода.Вывести(обСтрока); 
		
	КонецЦикла;
	
КонецПроцедуры // ВывестиДанные()
