Функция ПолучитьФайлНаСервере(ИмяФайла) Экспорт

	ТД = ТекущаяДата();
	ИмяФайла = "ТЗ_на_согласовании_" + Формат(Год(ТД), "ЧГ=0") + "_" + Месяц(ТД) + "_" + День(ТД) + ".pdf";

	ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("pdf");
	
	СоздатьФайлОтчета(ИмяПромежуточногоФайла);
	
	Двоичное 	= Новый ДвоичныеДанные(ИмяПромежуточногоФайла);  // получаем двоичные данные из файла
	Адрес 		= ПоместитьВоВременноеХранилище(Двоичное); // кидаем двоичные данные во врем. хранилище
	
	Попытка
		УдалитьФайлы(ИмяПромежуточногоФайла);
	Исключение
	КонецПопытки;
	
	Возврат Адрес;

КонецФункции // ПолучитьФайлНаСервере()

Функция СоздатьФайлОтчета(ПутьКФайлу = "", ПолеВывода = Неопределено, ТипФайла = Неопределено) Экспорт

	Если ПолеВывода = Неопределено Тогда
	
		ПолеВывода = Новый ТабличныйДокумент;	
	
	КонецЕсли;
	
	СформироватьОтчетНаСервере(ПолеВывода);
	
	Если НЕ ПустаяСтрока(ПутьКФайлу) Тогда
	
		ПолеВывода.Записать(ПутьКФайлу, ?(ТипФайла = Неопределено, ТипФайлаТабличногоДокумента.PDF, ТипФайла));		
	
	КонецЕсли;
	
КонецФункции // СоздатьФайлОтчета() 

Процедура СформироватьОтчетНаСервере(ПолеВывода, Проекты)
	
	ПолеВывода.Очистить(); 		
	
	стТаблицы = ПолучитьТаблицуДанных();
	
	ВывестиДанные(стТаблицы, ПолеВывода);
	
КонецПроцедуры // СформироватьОтчетНаСервере()

Функция ПолучитьТаблицуДанных(Проекты)
	
	УстановитьПривилегированныйРежим(Истина);
	
	тзДанныеЗапрос 	= ЗаполнитьКомплектыИзделий();
	
	тзЭтапы = Неопределено;
	
	тзДанные = РассчитатьПоля(тзДанныеЗапрос, тзЭтапы);
	
	Возврат Новый Структура("тзДанные, тзЭтапы", тзДанные, тзЭтапы);
	
КонецФункции // ПолучитьТаблицуДанных()     

Функция РассчитатьПоля(тзДанныеЗапрос, тзЭтапы) 
	
	МассивСтадийУКонструктора = омЗадачиПКДПовтор.СтадииКонструктора(Истина);
	
	ТипСтрока 	= Новый ОписаниеТипов("Строка");
	ТипДата 	= Новый ОписаниеТипов("Дата");
	ТипБулево 	= Новый ОписаниеТипов("Булево");
	ТипЧисло 	= Новый ОписаниеТипов("Число");
	
	тзДанные = Новый ТаблицаЗначений;
	тзДанные.Колонки.Добавить("ПроектНаименование", 			ТипСтрока);
	тзДанные.Колонки.Добавить("Номер",							ТипСтрока);
	тзДанные.Колонки.Добавить("КомплектКомпозиция");
	тзДанные.Колонки.Добавить("ИзделиеЗаказчика", 				ТипСтрока);
	тзДанные.Колонки.Добавить("КомплектКомпозицияНаименование", ТипСтрока);
	тзДанные.Колонки.Добавить("Помещение");
	тзДанные.Колонки.Добавить("ПомещениеНаименование", 			ТипСтрока);
	тзДанные.Колонки.Добавить("Согласовано", 					ТипДата);
	тзДанные.Колонки.Добавить("СогласованоАрхитектор", 			ТипСтрока);
	тзДанные.Колонки.Добавить("Приоритет");
	тзДанные.Колонки.Добавить("Конструктор",					Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	тзДанные.Колонки.Добавить("Состояние",						Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	тзДанные.Колонки.Добавить("СостояниеСтрока",				ТипСтрока);
	тзДанные.Колонки.Добавить("КрайТЗ", 						ТипДата);
	тзДанные.Колонки.Добавить("ДатаГотовностиЧертежа",			ТипДата);
	тзДанные.Колонки.Добавить("КрайСогласования", 				ТипДата);
	тзДанные.Колонки.Добавить("КрайПроектирование", 			ТипДата);
	тзДанные.Колонки.Добавить("КрайПроизводство", 				ТипДата);
	тзДанные.Колонки.Добавить("КрайРКД", 						ТипДата);
	тзДанные.Колонки.Добавить("КрайМонтаж", 					ТипДата);
	тзДанные.Колонки.Добавить("Договор", 						ТипДата);
	тзДанные.Колонки.Добавить("Редакция");
	тзДанные.Колонки.Добавить("ПодрядПроект",					ТипБулево);
	тзДанные.Колонки.Добавить("ПодрядРКД",						ТипБулево);
	тзДанные.Колонки.Добавить("ПодрядПроизводство",				ТипБулево);
	тзДанные.Колонки.Добавить("ЭтоКомпозиция",					ТипБулево);
	тзДанные.Колонки.Добавить("СогласованДизайнером",			ТипБулево);
	тзДанные.Колонки.Добавить("ОтгрузкаЧислом",					ТипЧисло); //0 - не отгружен, 1 - частичная отгрузка, 2 полностью отгружен
	тзДанные.Колонки.Добавить("Дней_в_стадии",					ТипЧисло);
	тзДанные.Колонки.Добавить("ОсновнойЭтап");
	
	НомерКомпозиции 		= 0;   
	Номер			 		= 1;
	НомерВнутриКомпозиции 	= 0;
	
	мКомплект 			= Новый Массив;
	мИзделиеКомплект 	= Новый Массив;
	
	ТД 						= НачалоДня(ТекущаяДата());
	СекундВНеделе 			= 3600 * 24 * 7;
	ПустаяДата				= Дата(1, 1, 1);
	
	текущаяКомпозиция 	= Неопределено;
	текущийПроект 		= Неопределено;
	
	Для каждого х Из тзДанныеЗапрос Цикл 
		
		Если НЕ тзДанные.Найти(х.ИзделиеКомплект, "КомплектКомпозиция") = Неопределено Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		Если НЕ текущийПроект = х.Проект  Тогда
			
			НС = тзДанные.Добавить();
			НС.ПроектНаименование = Строка(х.ПроектНомер) + " " + х.ПроектНаименование; 
			текущийПроект = х.Проект; 
			Номер 			= 0;
			НомерКомпозиции = 0;
			НомерВнутриКомпозиции = 0;
			
		КонецЕсли;
		
		Если НЕ текущаяКомпозиция = х.Композиция И ЗначениеЗаполнено(х.Композиция) Тогда
			
			Номер = Номер + 1;
			
			НомерВнутриКомпозиции = 1;
			
			НС = тзДанные.Добавить();
			
			НомерКомпозиции 					= Номер;
			текущаяКомпозиция 					= х.Композиция;	
			НС.Номер 							= НомерКомпозиции;
			НС.КомплектКомпозиция 				= х.Композиция;
			НС.КомплектКомпозицияНаименование 	= х.КомпозицииНаименование;
			НС.Помещение 						= х.ПомещениеКомпозиции;
			НС.ПомещениеНаименование		 	= х.ПомещениеКомпозицииНаименование;
			НС.Приоритет 						= х.ПриоритетКомпозиция;
			НС.Конструктор 						= х.КонструкторКомпозиция;
			НС.Состояние		 				= х.ТекущаяСтадияКомпозиция;
			НС.СостояниеСтрока	 				= х.ТекущаяСтадияКомпозицияСтрока;
			НС.КрайПроектирование 				= х.ВнешняяДатаОкончаниеПроектированияКомпозиции;
			НС.КрайТЗ 							= х.ВнешняяДатаОкончаниеТЗКомпозиции;
			НС.КрайСогласования 				= х.ВнешняяДатаОкончаниеСогласованияКомпозиции;
			НС.ОсновнойЭтап			 			= х.ОсновнойЭтапКомпозиции;
			НС.ПодрядРКД						= х.ПодрядРКДКомпозиции;
			НС.ПодрядПроект						= х.ПодрядПроектКомпозиции;
			НС.ПодрядПроизводство				= х.ПодрядПроизводствоКомпозиции;
			НС.ЭтоКомпозиция					= Истина;
			НС.ДатаГотовностиЧертежа			= ПолучитьДатуГотовностиЧертежа(х.Композиция, х.ТекущаяСтадияКомпозиция, МассивСтадийУКонструктора, ТД);
			
			мКомплект.Добавить(х.Композиция);
			
		КонецЕсли;
		
		НС = тзДанные.Добавить();
		
		Если ЗначениеЗаполнено(х.Композиция) Тогда
			
			НомерВнутриКомпозиции = НомерВнутриКомпозиции + 1;
			
			НС.Номер 							=  Строка(НомерКомпозиции) + "." + НомерВнутриКомпозиции;
			НС.КомплектКомпозицияНаименование 	= "   " + х.КомплектНаименование;
			НС.КрайПроектирование 				= ПустаяДата;
			НС.КрайТЗ 							= ПустаяДата;
			НС.КрайСогласования 				= ПустаяДата;
			
		Иначе	
			
			Номер = Номер + 1;
			
			НС.Номер 							= Номер;
			НС.КомплектКомпозицияНаименование 	= х.КомплектНаименование;
			НС.КрайПроектирование 				= х.ВнешняяДатаОкончаниеПроектирования;
			НС.КрайТЗ 							= х.ВнешняяДатаОкончаниеТЗ;
			НС.КрайСогласования 				= х.ВнешняяДатаОкончаниеСогласования;
			
		КонецЕсли;
		
		НС.КомплектКомпозиция 				= х.ИзделиеКомплект;
		НС.Помещение 						= х.Помещение;                  
		НС.ПомещениеНаименование		 	= х.ПомещениеНаименование;
		НС.Приоритет 						= х.Приоритет;
		НС.Состояние		 				= х.ТекущаяСтадия;
		НС.СостояниеСтрока	 				= х.ТекущаяСтадияСтрока;
		НС.КрайПроизводство 				= х.ВнешняяДатаОкончаниеПроизводства;
		НС.КрайМонтаж 						= х.ВнешняяДатаОкончаниеМонтажа;
		НС.КрайРКД 							= х.ВнешняяДатаОкончаниеРКД;
		НС.ОсновнойЭтап			 			= х.ОсновнойЭтап;
		НС.СогласованДизайнером				= х.СогласованДизайнером;
		НС.ПодрядРКД						= х.ПодрядРКД;
		НС.ПодрядПроект						= х.ПодрядПроект;
		НС.ПодрядПроизводство				= х.ПодрядПроизводство;
		НС.Конструктор 						= х.Конструктор;
		НС.ЭтоКомпозиция					= Ложь;
		НС.ДатаГотовностиЧертежа			= ПолучитьДатуГотовностиЧертежа(х.ИзделиеКомплект, х.ТекущаяСтадия, МассивСтадийУКонструктора, ТД);
		
		мКомплект.Добавить(х.ИзделиеКомплект);
		мИзделиеКомплект.Добавить(х.ИзделиеКомплект);
		
	КонецЦикла;
	
	тзДанные.Индексы.Добавить("КомплектКомпозиция");    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
		|	ЧастичнаяОтгрузка.ИзделиеКомплект КАК ИзделиеКомплект
		|ИЗ
		|	Справочник.ЧастичнаяОтгрузка КАК ЧастичнаяОтгрузка
		|ГДЕ
		|	ЧастичнаяОтгрузка.ИзделиеКомплект В(&ИзделиеКомплект)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЧастичнаяОтгрузка.ИзделиеКомплект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтгрузкаГотовойПродукцииИзделияКомплекты.ИзделиеКомплект КАК ИзделиеКомплект
		|ИЗ
		|	Документ.ОтгрузкаГотовойПродукции.ИзделияКомплекты КАК ОтгрузкаГотовойПродукцииИзделияКомплекты
		|ГДЕ
		|	ОтгрузкаГотовойПродукцииИзделияКомплекты.ИзделиеКомплект В(&ИзделиеКомплект)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтгрузкаГотовойПродукцииИзделияКомплекты.ИзделиеКомплект";
	
	Запрос.УстановитьПараметр("ИзделиеКомплект", мКомплект);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденаяСтрока = тзДанные.Найти(Выборка.ИзделиеКомплект, "КомплектКомпозиция");
		Если НЕ НайденаяСтрока = Неопределено Тогда
			НайденаяСтрока.ОтгрузкаЧислом = 1;	
		КонецЕсли;
	КонецЦикла;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденаяСтрока = тзДанные.Найти(Выборка.ИзделиеКомплект, "КомплектКомпозиция");
		Если НЕ НайденаяСтрока = Неопределено Тогда
			НайденаяСтрока.ОтгрузкаЧислом = 2;	
		КонецЕсли;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыСогласования.ДатаСогласованияАрхитектором КАК ДатаСогласованияАрхитектором,
		|	ДатыСогласования.ДатаСогласованияЗаказчиком КАК ДатаСогласованияЗаказчиком,
		|	ДатыСогласования.ДатаСогласованияДизайнером КАК ДатаСогласования,
		|	ДатыСогласования.Комплект КАК Комплект
		|ИЗ
		|	РегистрСведений.ДатыСогласования КАК ДатыСогласования
		|ГДЕ
		|	ДатыСогласования.Комплект В(&Комплект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК Комплект,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокМонтажаВНеделях КАК СрокМонтажаВНеделях,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокПроизводстваВНеделях КАК СрокПроизводстваВНеделях,
		|	МАКСИМУМ(ЕСТЬNULL(СостояниеЗамера.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаПринятияПомещения
		|ИЗ
		|	Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеЗамера КАК СостояниеЗамера
		|		ПО ИзделияКомплектИзделияЭлемент.Ссылка.ОсновноеПомещение = СостояниеЗамера.ОбъектЗамера
		|			И (СостояниеЗамера.СтатусЗамера = &СтатусЗамера)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК ПриложенияКДоговорамИзделияЗаказчика
		|			ПО (ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика = ИзделияЗаказчикаИзделияЭлемент.Ссылка)
		|		ПО ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент = ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент
		|ГДЕ
		|	ИзделияКомплектИзделияЭлемент.Ссылка В(&Комплект)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияКомплектИзделияЭлемент.Ссылка,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокМонтажаВНеделях,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокПроизводстваВНеделях
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК Комплект,
		|	ДанныеИзделияЗаказчика.НаименованиеСАртикулом КАК ИзделияЗаказчикаНаименование
		|ИЗ
		|	Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
		|			ПО ИзделияЗаказчикаИзделияЭлемент.Ссылка = ДанныеИзделияЗаказчика.ИзделиеЗаказчика
		|		ПО ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент = ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент
		|ГДЕ
		|	ИзделияКомплектИзделияЭлемент.Ссылка В(&мИзделиеКомплект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеКомплекта.Комплект КАК Комплект,
		|	ДанныеКомплекта.ТекущаяСтадия.ОсновнойЭтап КАК ОсновнойЭтап,
		|	МАКСИМУМ(ДанныеКомплекта.Период) КАК Начало
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|ГДЕ
		|	ДанныеКомплекта.Комплект В(&Комплект)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеКомплекта.Комплект,
		|	ДанныеКомплекта.ТекущаяСтадия.ОсновнойЭтап
		|
		|УПОРЯДОЧИТЬ ПО
		|	Начало";
	
	Запрос.УстановитьПараметр("СтатусЗамера", 		Перечисления.СтатусыЗамера.Строительный);
	Запрос.УстановитьПараметр("Комплект", 			мКомплект);
	Запрос.УстановитьПараметр("мИзделиеКомплект", 	мИзделиеКомплект);
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[0].Выбрать();
	
	тзЭтапы = Результат[3].Выгрузить();
	тзЭтапы.Индексы.Добавить("Комплект");
	
	ОтборЭтапа = Новый Структура("ОсновнойЭтап, Комплект", Перечисления.ОсновныеЭтапы.Согласование); 
	
	Пока Выборка.Следующий() Цикл
		
		НайденаяСтрока = тзДанные.Найти(Выборка.Комплект, "КомплектКомпозиция");
		НайденаяСтрока.Согласовано = Выборка.ДатаСогласования;
		НайденаяСтрока.СогласованоАрхитектор = ?(Выборка.ДатаСогласованияАрхитектором = ПустаяДата, "", Формат(Выборка.ДатаСогласованияАрхитектором, "ДФ=dd.MM.yyyy"))
		+ " / "
		+ ?(Выборка.ДатаСогласованияЗаказчиком = ПустаяДата, "", Формат(Выборка.ДатаСогласованияЗаказчиком, "ДФ=dd.MM.yyyy"));
		
		
		ОтборЭтапа.Комплект = Выборка.Комплект;
		НайденыеСтроки = тзЭтапы.НайтиСтроки(ОтборЭтапа); 
		
		Для каждого СтрокаЭтапа Из НайденыеСтроки Цикл
			СтрокаЭтапа.Начало = Выборка.ДатаСогласования;		
		КонецЦикла;
	КонецЦикла;
	
	Выборка = Результат[2].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НайденаяСтрока = тзДанные.Найти(Выборка.Комплект, "КомплектКомпозиция");
		Если НЕ ПустаяСтрока(НайденаяСтрока.ИзделиеЗаказчика) Тогда
			НайденаяСтрока.ИзделиеЗаказчика = НайденаяСтрока.ИзделиеЗаказчика + ", " + Символы.ПС;
		КонецЕсли;
		НайденаяСтрока.ИзделиеЗаказчика = НайденаяСтрока.ИзделиеЗаказчика + Выборка.ИзделияЗаказчикаНаименование;
	КонецЦикла;
	
	Возврат тзДанные;
	
КонецФункции

Функция ЗаполнитьКомплектыИзделий()
	
	УИД_доски_ТЗ = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("НаименованиеДоскиДляТЗ");
	
	
	
	//Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции // ЗаполнитьКомплектыИзделий()


