&НаКлиенте
Перем стКоэффициенты, стИнтервал, 	КоличествоСекундВДне;

Процедура ЗаполнитьТЗЗадачи(МассивЗадачи, ПустаяДата)
	
	СекундВДне = 3600 * 24;
	
	стОтбор 		= Новый Структура("Помещение", );
	стОтборКомплект = Новый Структура("Комплект", );
	
	Для каждого х Из МассивЗадачи Цикл
		
		Если НЕ х.НачалоМонтажа = ПустаяДата И НЕ х.ОкончаниеМонтажа = ПустаяДата  Тогда
			
			НС 							= ТЗЗадачи.Добавить();
			НС.Комплект 				= х.Комплект;
			НС.Этап 					= "Монтаж";
			НС.НаименованиеКомплект 	= х.НаименованиеКомплект;
			НС.ДатаНачала 				= х.НачалоМонтажа;
			НС.ДатаОкончания 			= х.ОкончаниеМонтажа; 
			НС.ПродолжительностьВДнях   = Окр((НС.ДатаОкончания - НС.ДатаНачала) / СекундВДне, 0);
			НС.Помещение 				= х.Помещение; 
			НС.ПомещениеНаименование	= х.ПомещениеНаименование; 
			
		КонецЕсли;	
		
		Если НЕ х.НачалоПроектирования = ПустаяДата И НЕ х.ОкончаниеПроектирования = ПустаяДата  Тогда
			
			НС 							= ТЗЗадачи.Добавить();
			НС.Комплект 				= х.Комплект;
			НС.Этап 					= "Проектирование";
			НС.НаименованиеКомплект 	= х.НаименованиеКомплект;
			НС.ДатаНачала 				= х.НачалоПроектирования;
			НС.ДатаОкончания 			= х.ОкончаниеПроектирования; 
			НС.ПродолжительностьВДнях   = Окр((НС.ДатаОкончания - НС.ДатаНачала) / СекундВДне, 0);
			НС.Помещение 				= х.Помещение; 
			НС.ПомещениеНаименование	= х.ПомещениеНаименование; 
			
		КонецЕсли;	
		
		Если НЕ х.НачалоПроизводства = ПустаяДата И НЕ х.ОкончаниеПроизводства = ПустаяДата  Тогда
			
			НС 							= ТЗЗадачи.Добавить();
			НС.Комплект 				= х.Комплект;
			НС.Этап 					= "Производство";
			НС.НаименованиеКомплект 	= х.НаименованиеКомплект;
			НС.ДатаНачала 				= х.НачалоПроизводства;
			НС.ДатаОкончания 			= х.ОкончаниеПроизводства; 
			НС.ПродолжительностьВДнях   = Окр((НС.ДатаОкончания - НС.ДатаНачала) / СекундВДне, 0);
			НС.Помещение 				= х.Помещение; 
			НС.ПомещениеНаименование	= х.ПомещениеНаименование; 
			
		КонецЕсли;	
		
		Если НЕ х.НачалоСогласования = ПустаяДата И НЕ х.ОкончаниеСогласования = ПустаяДата  Тогда
			
			НС 							= ТЗЗадачи.Добавить();
			НС.Комплект 				= х.Комплект;
			НС.Этап 					= "Согласование";
			НС.НаименованиеКомплект 	= х.НаименованиеКомплект;
			НС.ДатаНачала 				= х.НачалоСогласования;
			НС.ДатаОкончания 			= х.ОкончаниеСогласования; 
			НС.ПродолжительностьВДнях   = Окр((НС.ДатаОкончания - НС.ДатаНачала) / СекундВДне, 0);
			НС.Помещение 				= х.Помещение; 
			НС.ПомещениеНаименование	= х.ПомещениеНаименование; 
			
		КонецЕсли;
		
		стОтбор.Помещение = х.Помещение;
		НайденыеСтроки = тзПомещения.НайтиСтроки(стОтбор);
		Если НайденыеСтроки.Количество() = 0 Тогда
		
			НС = тзПомещения.Добавить();
			НС.Помещение 				= х.Помещение; 
			НС.ПомещениеНаименование 	= х.ПомещениеНаименование; 
		
		КонецЕсли;
		
		стОтборКомплект.Комплект = х.Комплект;
		
		НайденыеСтроки = тзКомплекты.НайтиСтроки(стОтборКомплект);
		Если НайденыеСтроки.Количество() = 0 Тогда
		
			НС = тзКомплекты.Добавить();
			НС.Комплект 				= х.Комплект; 
			НС.НаименованиеКомплект 	= х.НаименованиеКомплект; 
		
		КонецЕсли;
	КонецЦикла;
	
	тзПомещения.Сортировать("ПомещениеНаименование");
	тзКомплекты.Сортировать("НаименованиеКомплект");
	ТЗЗадачи.Сортировать("ПомещениеНаименование, НаименованиеКомплект");
	
	НомерСтроки = 3;
	
	текПомещение = Неопределено;
	
	Для каждого х Из ТЗЗадачи Цикл
	
		Если НЕ текПомещение = х.Помещение Тогда
			стОтбор.Помещение = х.Помещение;
			НайденыеСтроки = тзПомещения.НайтиСтроки(стОтбор);
			Если НайденыеСтроки.Количество() > 0 Тогда
				
				НайденыеСтроки[0].НомерСтроки = НомерСтроки;
				НомерСтроки = НомерСтроки + 1;
				
			КонецЕсли;
			
		КонецЕсли;
		
		х.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	
	КонецЦикла;  
	
	Для каждого х Из ТЗЗадачи Цикл
		
	КонецЦикла;  
	ТЗЗадачи.Сортировать("ПомещениеНаименование");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПустаяДата 		= Дата(1,1,1);                    
	МасштабНаПечать = 100;
	Проект = Параметры.Проект;
	ЗаполнитьТЗЗадачи(Параметры.МассивЗадачи, ПустаяДата);
	
	
	тзЦвета.Загрузить(омДиаграммаГанта.ПолучитьТаблицуЦветов());

	омМесяц.ЗаполнитьСписокМесяцами(спМесяцы);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИнтервалДиаграммы(тзЗадачи)
	
	ПустаяДата = Дата(1,1,1);
	стИнтервал = Новый Структура("ДатаНачала,ДатаОкончания,мДаты",ПустаяДата,ПустаяДата, Новый Массив);
	
	Для каждого х Из тзЗадачи Цикл
		Если стИнтервал.ДатаОкончания < х.ДатаОкончания Тогда
			стИнтервал.ДатаОкончания = х.ДатаОкончания;
		КонецЕсли;
		
	    Если х.ДатаНачала > ПустаяДата Тогда
			Если стИнтервал.ДатаНачала = ПустаяДата Тогда
				стИнтервал.ДатаНачала = х.ДатаНачала;
			ИначеЕсли стИнтервал.ДатаНачала > х.ДатаНачала Тогда
				стИнтервал.ДатаНачала = х.ДатаНачала;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ДеньНеделиДатаНачала = ДеньНедели(стИнтервал.ДатаНачала);
	
	Если Интервалы = 0 И ДеньНеделиДатаНачала > 1 Тогда
		стИнтервал.ДатаНачала = стИнтервал.ДатаНачала - (ДеньНеделиДатаНачала - 1) * КоличествоСекундВДне;
	КонецЕсли;
	
	текДата = стИнтервал.ДатаНачала;

	Пока текДата <= стИнтервал.ДатаОкончания Цикл
		стИнтервал.мДаты.Добавить(текДата);
		
	    текДата = текДата + КоличествоСекундВДне; 
	КонецЦикла;
	
	Возврат стИнтервал;
	
КонецФункции // ПолучитьИнтервалДиаграммы()

&НаКлиенте
Процедура ПолучитьКоэффициенты()

	КоличествоМиллиметровВПикселе = омТабличныйДокументСерверПовтор.ПолучитьКоличествоМиллиметровВПикселе();
	КоличествоДней = Окр((Период.ДатаОкончания - Период.ДатаНачала) / (24 * 3600), 0);
	мИнформацияОЭкране = ПолучитьИнформациюЭкрановКлиента();
	
	Если мИнформацияОЭкране = Неопределено Тогда
		DPI = 60;
		ШиринаЭкрана = 600;
	Иначе
		DPI = мИнформацияОЭкране[0].DPI;
		ШиринаЭкрана = мИнформацияОЭкране[0].Ширина;
	КонецЕсли;
	
	стКоэффициенты =  Новый Структура("КоличествоМиллиметровВПикселе,КоличествоДней,DPI,ШиринаЭкрана,КоличествоИнтервалов"
						,КоличествоМиллиметровВПикселе,КоличествоДней,DPI,ШиринаЭкрана,0);
КонецПроцедуры // ПолучитьКоэффициенты()

&НаКлиенте
Процедура МасштабПриИзменении(Элемент)
	ВывестиДиаграмму();
КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КоличествоСекундВДне = 24 * 3600;
	ВывестиДиаграмму();
КонецПроцедуры

&НаСервере
Процедура ОчиститьТаблицу()

	ЭтаФорма.ПолеВывода.Очистить(); 

КонецПроцедуры // ОчиститьТаблицу()

&НаКлиенте
Процедура ВывестиДиаграмму()
	
	стИнтервал = ПолучитьИнтервалДиаграммы(тзЗадачи);

	ЗаполнитьТаблицыДанных(стИнтервал);
	
	Период.ДатаНачала 		= стИнтервал.ДатаНачала;
	Период.ДатаОкончания 	= стИнтервал.ДатаОкончания;

	Если НЕ ПолеВывода.ВысотаТаблицы = 0 Тогда
		ОчиститьТаблицу();	
	КонецЕсли;
	
	ПолучитьКоэффициенты();
	Если стКоэффициенты.КоличествоДней = 0 Тогда
		Возврат;
	КонецЕсли;

	УстановитьШиринуКолонок();
	
	ПолеВывода.ФиксацияСлева = 2;
	
	ВывестиШапку();
	
	НомерСтроки = 3;
	
	Если тзДаты.Количество() = 0 Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	ВывестиДанные(); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ВывестиДанные()

	МаксимальныйНомерДаты = тзДаты[тзДаты.Количество() - 1].НомерДаты;
	
	текПроект 	= Неопределено;
	текРодиель	= Неопределено;
	
	ЦветБелый 	= Новый Цвет(255,255,255);
	стЦвета = Новый Структура("Производство, Монтаж, Пересечение, Согласование, Конструирование, Помещение",
								ЦветБелый, ЦветБелый, ЦветБелый, ЦветБелый, ЦветБелый, ЦветБелый);
	
	ЦветПроекта			= ЦветБелый;
	ЦветРодитель 		= ЦветБелый;
	КомпозицияЭлемент 	= ЦветБелый;
	
	Для каждого х Из тзЦвета Цикл
		Если х.НаименованиеЭтапа = "Композиция" Тогда
			ЦветРодитель = х.Цвет;
		ИначеЕсли х.НаименованиеЭтапа = "Пересечение" Тогда
			стЦвета.Пересечение 	= х.Цвет;
		ИначеЕсли х.НаименованиеЭтапа = "Производство" Тогда
			стЦвета.Производство 	= х.Цвет;
		ИначеЕсли х.НаименованиеЭтапа = "Монтаж" Тогда
			стЦвета.Монтаж 	= х.Цвет;
		ИначеЕсли х.НаименованиеЭтапа = "Согласование" Тогда
			стЦвета.Согласование 	= х.Цвет;
		ИначеЕсли х.НаименованиеЭтапа = "Помещение" Тогда
			стЦвета.Помещение 	= х.Цвет;
		ИначеЕсли х.НаименованиеЭтапа = "Конструирование" Тогда
			стЦвета.Конструирование = х.Цвет;
		КонецЕсли;	
	КонецЦикла; 
	
	смещениеКолонок = 3;  
	
	МакНомерСроки = 0;
	

	стПараметровОбласти = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров();
	стПараметровОбласти.ЦветРамки 		= "210210210";
	стПараметровОбласти.ГраницаСправа 	= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 0);
	стПараметровОбласти.ГраницаСлева 	= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 0);
	
	стПараметровОбластиПроект = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров();
	стПараметровОбластиПроект.НомерКолонки 				= 2;
	стПараметровОбластиПроект.ЦветРамки 				= "210210210";
	стПараметровОбластиПроект.ЦветФона 					= ЦветПроекта;
	стПараметровОбластиПроект.ГоризонтальноеПоложение 	= ГоризонтальноеПоложение.Лево;
	
	стПараметровОбластиКомп = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров();
	стПараметровОбластиКомп.НомерКолонки 				= 2;
	стПараметровОбластиКомп.ЦветРамки 					= "210210210";
	стПараметровОбластиКомп.ЦветФона 					= ЦветРодитель;
	стПараметровОбластиКомп.ГоризонтальноеПоложение 	= ГоризонтальноеПоложение.Лево;
	
	стПараметровОбластиКонстр = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров();
	стПараметровОбластиКонстр.НомерКолонки 				= 3;
	стПараметровОбластиКонстр.ГоризонтальноеПоложение 	= ГоризонтальноеПоложение.Лево;
	
	стОтбор 			= Новый Структура("ОбъектДанных", );
	стОтборДата			= Новый Структура("Дата", );
	стОтборПомещение 	= Новый Структура("Помещение",);

	
	Для каждого текПомещение Из тзПомещения Цикл 
		
		
		МакНомерСроки = Макс(МакНомерСроки, текПомещение.НомерСтроки);
		
		КешЦвета 				= Неопределено; 
		стПараметровОбласти.Расшифровка				= текПомещение.Помещение;
		стПараметровОбласти.НомерСтроки 			= текПомещение.НомерСтроки;
		стПараметровОбласти.НомерКолонки 			= 2;
		стПараметровОбласти.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
		
		стПараметровОбласти.Текст 					= текПомещение.ПомещениеНаименование;
		стПараметровОбласти.ЦветФона 				= ЦветБелый;
		
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти, КешЦвета);
		
		КешЦвета 				= Неопределено;
		
		стОтборПомещение.Помещение = текПомещение.Помещение;
		НайденыеСтроки = тзПомещения.НайтиСтроки(стОтборПомещение);
		
		стПараметровОбласти.Текст = "";
		//ВыводОбъекта(НайденыеСтроки, текПомещение, КешЦвета, стПараметровОбласти, смещениеКолонок, стЦвета);
		
	КонецЦикла;  
	
КонецПроцедуры // ВывестиДанные(МаксимальныйНомерДаты) 

&НаКлиенте
Процедура ВыводОбъекта(НайденыеСтроки, текКомплект, КешЦвета, стПараметровОбласти, смещениеКолонок, стЦвета = Неопределено)
	
	Для каждого текДата Из НайденыеСтроки Цикл
		
		КешЦвета = Неопределено;
		
		Если текДата.СтруктураДанных.Количество() = 0 Тогда
			Продолжить;
		ИначеЕсли текДата.СтруктураДанных.Количество() > 1 Тогда
			стПараметровОбласти.ЦветФона 		= стЦвета.Пересечение;
		Иначе	
			стПараметровОбласти.ЦветФона 		= ПолучитьЦветЭтапа(текДата.СтруктураДанных[0].Значение.ВидОбъекта, стЦвета);
		КонецЕсли;
		стПараметровОбласти.НомерСтроки 	= текКомплект.НомерСтроки;	
		стПараметровОбласти.НомерКолонки 	= текДата.НомерДаты + смещениеКолонок;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти, КешЦвета); 
		
	КонецЦикла;	
	
КонецПроцедуры // ВыводОбъекта()  

&НаКлиенте
Функция ПолучитьЦветЭтапа(Этап, стЦвета)

	Возврат стЦвета[Этап];	

КонецФункции // ПолучитьЦветЭтапа()

&НаКлиенте
Функция ПолучитьИзДатыКлюч(текДата)

	Возврат "_" + Формат(День(текДата),"ЧЦ=2; ЧВН=; ЧГ=0") + Формат(Месяц(текДата),"ЧЦ=2; ЧВН=; ЧГ=0") + Формат(Год(текДата),"ЧЦ=4; ЧВН=; ЧГ=0");	

КонецФункции // ПолучитьИздатыКлюч(Дата)()

&НаКлиенте
Процедура ВывестиШапку()
	
	КешЦвета = Неопределено;

	стПараметровОбласти = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров();
	стПараметровОбласти.НомерКолонки 	= 2;
	стПараметровОбласти.НомерСтроки 	= 1;
	стПараметровОбласти.ВысотаОбласти 	= 2;
	стПараметровОбласти.Полужирный 		= Истина;
	стПараметровОбласти.Текст 			= "Комплекты"; 
	омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти, КешЦвета);

	НомерКолонки = 3;
	
	стПараметровОбласти.РазмерШрифта 	= 6;
	стПараметровОбласти.НомерСтроки 	= 2;
	стПараметровОбласти.ВысотаОбласти 	= 1;
	
	стПараметровОбластиМесяц = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров();
	стПараметровОбластиМесяц.Полужирный 	= Истина;
	стПараметровОбластиМесяц.НомерКолонки 	= НомерКолонки;
	
	НомерДаты = -1;
	НачалоКолонки = НомерКолонки;
	
	стПараметровОбластиРамка = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров();
	стПараметровОбластиРамка.ЦветРамки 		= "230230230";
	стПараметровОбластиРамка.Объединять 	= Ложь;
	КоличествоСтрок = ПолучитьВысотуТаблицы();
	
	
	Если тзДаты.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли; 
	
	текМесяц = тзДаты[0].Месяц;
	КешЦветаРамка = Неопределено;
	
	Для каждого х Из тзДаты Цикл
		
		
		Если НЕ текМесяц = х.Месяц Тогда
			стПараметровОбластиМесяц.ДлинаОбласти 	= НомерКолонки - НачалоКолонки;		
			стПараметровОбластиМесяц.Текст 			= спМесяцы.НайтиПоЗначению(Месяц(текМесяц)).Представление; 
			омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбластиМесяц, КешЦвета);
			
			стПараметровОбластиМесяц.НомерКолонки 	= НомерКолонки;
			НачалоКолонки 							= НомерКолонки;  
			текМесяц = х.Месяц;
		КонецЕсли;

		Если НомерДаты = х.НомерДаты Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		стПараметровОбласти.НомерКолонки 	= НомерКолонки;
		стПараметровОбласти.Текст 			= ?(НеОтображатьЧисла,"",х.Представление);
		
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбласти, КешЦвета);
		
		НомерДаты = х.НомерДаты;
		
		стПараметровОбластиРамка.НомерКолонки 	= НомерКолонки;
		стПараметровОбластиРамка.НомерСтроки 	= 3;
		стПараметровОбластиРамка.ВысотаОбласти  = КоличествоСтрок;
		
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбластиРамка, КешЦветаРамка);
		
		НомерКолонки = НомерКолонки + 1;
	КонецЦикла;
	
	Если НЕ НомерКолонки = НачалоКолонки Тогда
		стПараметровОбластиМесяц.ДлинаОбласти 	= НомерКолонки - НачалоКолонки;		
		стПараметровОбластиМесяц.Текст 			= спМесяцы.НайтиПоЗначению(Месяц(текМесяц)).Представление; 
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ПолеВывода, стПараметровОбластиМесяц, КешЦвета);
	КонецЕсли;
	
	ПолеВывода.ФиксацияСверху = 2;

КонецПроцедуры // ВывестиШапку()

Функция ПолучитьВысотуТаблицы()

	Возврат ТЗЗадачи.Количество() + тзПомещения.Количество() + 2;
	
КонецФункции // ПолучитьВысотуТаблицы()

&НаКлиенте
Функция УстановитьШиринуКолонок()
	
	Если ЭтаФорма.Интервалы = 0 Тогда
		КоличествоИнтервалов = стКоэффициенты.КоличествоДней / 7 + 2;
		КоличествоИнтервалов = ?(КоличествоИнтервалов - Цел(КоличествоИнтервалов) = 0, КоличествоИнтервалов, Цел(КоличествоИнтервалов) + 1);
	Иначе
		КоличествоИнтервалов = стКоэффициенты.КоличествоДней; 
	КонецЕсли;
	
	стКоэффициенты.КоличествоИнтервалов = КоличествоИнтервалов;
	
	мШиринаКолонок = Новый Массив(КоличествоИнтервалов + 2);
	мШиринаКолонок[0] = 2;
	мШиринаКолонок[1] = 30;
	
	ШиринаКолонок = (стКоэффициенты.КоличествоМиллиметровВПикселе * стКоэффициенты.ШиринаЭкрана / (КоличествоИнтервалов * 3)) * (МасштабНаПечать / 100) * 1.2; 
	
	ШиринаКолонок = ?(Интервалы = 0, 1, 4) * ШиринаКолонок;
	Для х = 2 По КоличествоИнтервалов + 1 Цикл
		мШиринаКолонок[х] = ШиринаКолонок;
	КонецЦикла;
	
	омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(ЭтаФорма.ПолеВывода, мШиринаКолонок);
	
КонецФункции // УстановитьШиринуКолонок()

&НаКлиенте
Процедура НеОтображатьЧислаПриИзменении(Элемент)
	ВывестиДиаграмму();
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалыПриИзменении(Элемент)
	ВывестиДиаграмму();
КонецПроцедуры

Функция ЗаполнитьТаблицыДанных(стИнтервал)

	тзДаты.Очистить();
	тзВывод.Очистить();
	
	ДатаНачала   	= стИнтервал.ДатаНачала;
	ДатаОкончания 	= стИнтервал.ДатаОкончания;
	
	Если НЕ (ЗначениеЗаполнено(ДатаНачала) И (ЗначениеЗаполнено(ДатаОкончания))) Тогда
		Возврат 0;	
	КонецЕсли;
	
	МаксимальныйНомерДаты = ЗаполнитьТаблицуДата(ДатаНачала, ДатаОкончания);
	
	ЗаполнитьТаблицуВывода();
	
	Возврат МаксимальныйНомерДаты;
	
КонецФункции // ЗаполнитьТаблицыДанных()

Процедура ЗаполнитьТаблицуВывода()
	
	стОтбор 				= Новый Структура("НомерДаты, ОбъектДанных", );
	стОтборДата 			= Новый Структура("Дата", );
	КоличествоСекундВДне 	= 24 * 3600;
	
	мКешСделок 				= Новый Массив;
	
	Для каждого строка_тзЗадач Из ТЗЗадачи Цикл
		ЗаполнитьПомещение(строка_тзЗадач, стОтбор, стОтборДата, КоличествоСекундВДне, мКешСделок);
		ЗаполнитьКомплект(строка_тзЗадач, стОтбор, стОтборДата, КоличествоСекундВДне);	
	КонецЦикла;
	
	ДоЗаполнитьПроекты(мКешСделок, стОтборДата, стОтбор);
	
КонецПроцедуры // ЗаполнитьТаблицуВывода()

Процедура ДоЗаполнитьПроекты(мКешСделок, стОтборДата, стОтбор)

	Для каждого данныеСдеки Из мКешСделок Цикл
		СтруктураДанных = Новый Структура("ВидОбъекта, ЗначениеОбъекта","Проект", данныеСдеки.Проект);
		
		стОтборДата.Дата 	= данныеСдеки.ДатаМинимум;
		НомерДатыМин 		= тзДаты.НайтиСтроки(стОтборДата)[0].НомерДаты;
		
		стОтборДата.Дата 	= данныеСдеки.ДатаМаксимум;
		НомерДатыМакс 		= тзДаты.НайтиСтроки(стОтборДата)[0].НомерДаты;
		
		стОтбор.ОбъектДанных = данныеСдеки.Проект;
		
		Для НомерДаты = НомерДатыМин По НомерДатыМакс Цикл
			стОтбор.НомерДаты = НомерДаты; 
			найденыеСтроки = тзВывод.НайтиСтроки(стОтбор);
			
			Если найденыеСтроки.Количество() = 0 Тогда
				НС = тзВывод.Добавить();
				НС.НомерДаты 	= НомерДаты;
				НС.ОбъектДанных = стОтбор.ОбъектДанных;
				НС.СтруктураДанных = Новый Структура("ВидОбъекта, ЗначениеОбъекта", "Проект", стОтбор.ОбъектДанных);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;		
	
КонецПроцедуры // ДоЗаполнитьПроекты(мКешСделок)

Процедура ЗаполнитьКомплект(строка_тзЗадач, стОтбор, стОтборДата, КоличествоСекундВДне)
	
	стОтбор.ОбъектДанных = строка_тзЗадач.Комплект;

	датаНачала = строка_тзЗадач.ДатаНачала;
	
	Если датаНачала < тзДаты[0].Дата Тогда
		датаНачала = тзДаты[0].Дата;	
	КонецЕсли;
	
	Если строка_тзЗадач.ДатаОкончания > Дата(1, 1, 1) Тогда
		
		Пока датаНачала <= строка_тзЗадач.ДатаОкончания Цикл
			стОтборДата.Дата = датаНачала;
			НомерДаты = тзДаты.НайтиСтроки(стОтборДата)[0].НомерДаты;
			стОтбор.НомерДаты = НомерДаты;
			
			найденыеСтроки = тзВывод.НайтиСтроки(стОтбор);
			
			Если найденыеСтроки.Количество() = 0 Тогда
				
				НС = тзВывод.Добавить();
				НС.НомерДаты 	= НомерДаты;
				НС.ОбъектДанных = стОтбор.ОбъектДанных;
				спДанные = Новый СписокЗначений;
				НС.СтруктураДанных = спДанные;
			Иначе
				НС = найденыеСтроки[0];	
			КонецЕсли;
			
			ДанныеУжеЗаполнены = Ложь;
			
			Для каждого текСписок Из НС.СтруктураДанных Цикл
				Если текСписок.Значение.ВидОбъекта = строка_тзЗадач.Этап Тогда
					ДанныеУжеЗаполнены = Истина; 
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ ДанныеУжеЗаполнены Тогда
				стДанных = Новый Структура("ВидОбъекта, ЗначениеОбъекта", строка_тзЗадач.Этап, строка_тзЗадач.Комплект);
				
				НС.СтруктураДанных.Добавить(стДанных); 
			КонецЕсли;
			
			датаНачала = датаНачала + КоличествоСекундВДне;
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьКомплект(строка_тзЗадач, стОтбор, стОтборДата, КоличествоСекундВДне)

Процедура ЗаполнитьПомещение(строка_тзЗадач, стОтбор, стОтборДата, КоличествоСекундВДне, мКешСделок)
	
	стОтбор.ОбъектДанных = строка_тзЗадач.Помещение;
	
	КэшНайден = Ложь;
	Для каждого х Из мКешСделок Цикл
		Если х.Проект = стОтбор.ОбъектДанных Тогда
			КэшНайден 		= Истина;
			ЭлементМассива 	= х;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ КэшНайден Тогда
		ЭлементМассива 	= Новый Структура("Проект, ДатаМинимум, ДатаМаксимум",стОтбор.ОбъектДанных, Дата(1,1,1), Дата(1,1,1));
		мКешСделок.Добавить(ЭлементМассива);
	КонецЕсли;
	
	датаНачала = строка_тзЗадач.ДатаНачала;
	
	Если ЭлементМассива.ДатаМинимум = Неопределено И ЗначениеЗаполнено(датаНачала) Тогда
		ЭлементМассива.ДатаМинимум = датаНачала;
	ИначеЕсли ЭлементМассива.ДатаМинимум > датаНачала ИЛИ НЕ ЗначениеЗаполнено(ЭлементМассива.ДатаМинимум) Тогда	
		ЭлементМассива.ДатаМинимум = датаНачала;
	КонецЕсли;
	
	Если ЭлементМассива.ДатаМаксимум < строка_тзЗадач.ДатаОкончания Тогда
		ЭлементМассива.ДатаМаксимум = строка_тзЗадач.ДатаОкончания;
	КонецЕсли;
	
	Если тзДаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если датаНачала < тзДаты[0].Дата Тогда
		датаНачала = тзДаты[0].Дата;	
	КонецЕсли;
	
	Если строка_тзЗадач.ДатаОкончания > Дата(1,1,1) Тогда
		
		Пока датаНачала <= строка_тзЗадач.ДатаОкончания Цикл
			
			стОтборДата.Дата = датаНачала;
			НомерДаты = тзДаты.НайтиСтроки(стОтборДата)[0].НомерДаты;
			стОтбор.НомерДаты = НомерДаты;
			
			найденыеСтроки = тзВывод.НайтиСтроки(стОтбор);
			
			Если найденыеСтроки.Количество() = 0 Тогда
				
				НС = тзВывод.Добавить();
				НС.НомерДаты 	= НомерДаты;
				НС.ОбъектДанных = стОтбор.ОбъектДанных;
				НС.СтруктураДанных = Новый Структура("ВидОбъекта, ЗначениеОбъекта","Проект", стОтбор.ОбъектДанных);
			КонецЕсли;
			
			датаНачала = датаНачала + КоличествоСекундВДне;
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры // ЗаполнитьПроект(строка_тзЗадач, стОтбор, стОтборДата, КоличествоСекундВДне, мКешСделок)

Функция ЗаполнитьТаблицуДата(ДатаНачала, ДатаОкончания)

	КоличествоСекундВДне = 24 * 3600; 
	текНомерДаты = 1;
	Если Интервалы = 0 Тогда
		
		Смещение = (ДатаНачала - НачалоНедели(ДатаНачала)) / КоличествоСекундВДне;
	
		ДатаНачала = ДатаНачала - КоличествоСекундВДне * Смещение;
		Представление = День(ДатаНачала);
		
		текСч = 1;
		Пока ДатаНачала <= ДатаОкончания Цикл
			НС = тзДаты.Добавить();
			НС.Дата 			= ДатаНачала;
			НС.НомерДаты 		= текНомерДаты;
			НС.Представление 	= Представление;
			НС.Месяц 			= НачалоМесяца(НС.Дата);
			
			ДатаНачала = ДатаНачала + КоличествоСекундВДне;
			текСч = текСч + 1;
			
			Если текСч = 8 Тогда
				текСч = 1;
				текНомерДаты = текНомерДаты + 1;
				Представление = День(ДатаНачала);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Пока ДатаНачала <= ДатаОкончания Цикл
			НС = тзДаты.Добавить();
			НС.Дата 			= ДатаНачала;
			НС.НомерДаты 		= текНомерДаты;
			НС.Представление 	= День(ДатаНачала);
			НС.Месяц 			= НачалоМесяца(НС.Дата);
			
			ДатаНачала = ДатаНачала + КоличествоСекундВДне;
			текНомерДаты = текНомерДаты + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции // ЗаполнитьТаблицуДата()

