
&НаКлиенте
Процедура УдалениеДоОпределеннойДаты(Команда)
	
	ДатаНапоминания = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТекущуюДатуСеанса() - 60*60*24*7;
	Подсказка = "Введите дату, по которую будет удален лог";
	ЧастьДаты = ЧастиДаты.Дата;
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДаты", ЭтотОбъект, Параметры);
	ПоказатьВводДаты(Оповещение, ДатаНапоминания, Подсказка, ЧастьДаты);
	
КонецПроцедуры                                           

&НаКлиенте
Процедура ПослеВводаДаты(Дата, Параметры) Экспорт
    Если НЕ Дата = Неопределено Тогда
		УдалениеЛогаСервер(Дата);
		Элементы.Список.Обновить();
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалениеЛогаСервер(Дата)

	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	Б24_К_Логирование.Период КАК Период
	|ИЗ
	|	РегистрСведений.Б24_К_Логирование КАК Б24_К_Логирование
	|
	|СГРУППИРОВАТЬ ПО
	|	Б24_К_Логирование.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		
		ДатаКонца = НачалоДня(Дата);
		
		Выборка = ВыполненныйЗапрос.Выбрать(); 
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Период <= ДатаКонца Тогда
				
				НаборЗаписей = РегистрыСведений.Б24_К_Логирование.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
				
				НаборЗаписей.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
