&НаСервере
Процедура ЗаполнитьРеквизитыСтандартные(Объект) Экспорт
	 Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Автор") Тогда
	    Если Не ЗначениеЗаполнено(Объект.Автор) Тогда
			Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
	 КонецЕсли;
КонецПроцедуры // ЗаполнитьРеквизитыСтандартные()


Функция ПолучитьСокращенноеНазвание(ОбъектДокумента) Экспорт
	
	НаименованиеОбъекта = ОбъектДокумента.Метаданные().Синоним + " " + ОбъектДокумента.Номер;	
	
	Возврат НаименованиеОбъекта;
	
КонецФункции // ПолучитьПолучитьСокращенноеНазвание()
