
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.РасширениеВБезопасномРежиме() Тогда
		ПоказатьПредупреждение(, "Расширение модуля в безопасном режиме. Продолжение невозможно",10);
		Возврат;
	КонецЕсли;
	
	КоличествоНастроек = ПолучитьКоличествоНастроекПодключенияСинхронизации();

	Если КоличествоНастроек > 1 Тогда
		
		ВыбЗнач 	= Неопределено;
		
		Массив 		= Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Б24_К_НастройкиПодключения"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтотОбъект);

		ПоказатьВводЗначения(Оповещение, ВыбЗнач, "Укажите настройку подключения", ОписаниеТипов);	
		
	Иначе
		Параметры = Новый Структура;	
		ПослеВводаЗначения(ПолучитьНастройкуПодключенияПоУмолчаниюСинхронизации(), Параметры);	
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеВводаЗначения(ВыбЗнач, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбЗнач) Тогда

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НастройкаПодключения"	, ВыбЗнач);
		ПараметрыФормы.Вставить("ВидСинхронизации"		, 7);
		ПараметрыФормы.Вставить("ПолнаяСинхронизация"	, Ложь);
		
		ОткрытьФорму("РегистрСведений.Б24_КС_НастройкиСинхронизации.Форма.ФормаВыполнениеСинхронизации", ПараметрыФормы, , ВыбЗнач);

	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Функция ПолучитьКоличествоНастроекПодключенияСинхронизации()
	Возврат РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьКоличествоНастроекПодключенияСинхронизации();
КонецФункции

&НаСервере 
Функция ПолучитьНастройкуПодключенияПоУмолчаниюСинхронизации()
	Возврат РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьНастройкуПодключенияПоУмолчаниюСинхронизации();
КонецФункции

