
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Параметры.Свойство("Комплект", Комплект);
	
	Если НЕ ЗначениеЗаполнено(Комплект) Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	КодPDM = омPDMНаСервере.ПолучитьКодPDM(Комплект);
	
	Если КодPDM = 0 Тогда
	
		Отказ = Истина;
		Возврат;
	
	КонецЕсли;
	
	АдресРезультата = ПоместитьВоВременноеХранилище("", УникальныйИдентификатор);
	
	ПараметрыФункции 	= Новый Массив(2);
	ПараметрыФункции[0] = КодPDM;	
	ПараметрыФункции[1] = АдресРезультата;	
	
	Задание = ФоновыеЗадания.Выполнить("омФайлыPDM.ИнформацияОФайлеPDM", ПараметрыФункции, , "ИнформацияОФайлеPDM");
	ЗаданиеУникальныйИдентификатор = Задание.УникальныйИдентификатор;
	
	Элементы.ГруппаДанных.Видимость = Ложь;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ПроверкаВыполненияФоновогоЗадания", 1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаВыполненияФоновогоЗадания()

	ДанныеВыполнения = ПроверитьВыполнениеФоновогоЗаданияНаСервере(ЗаданиеУникальныйИдентификатор);
	
	Если ДанныеВыполнения.Активно Тогда
		ПодключитьОбработчикОжидания("ПроверкаВыполненияФоновогоЗадания", 0.5, Истина)
	Иначе
		
		СтрокаХМЛ = ПолучитьИзВременногоХранилища(АдресРезультата);
		
		Элементы.ДекорацияДлительноеОжидание.Видимость 	= Ложь;

		Если ПустаяСтрока(СтрокаХМЛ) Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияОповещения", ЭтаФорма);
		    ПоказатьПредупреждение(ОписаниеОповещения, "Не удалось получить данные");
		Иначе	
			ЗаполнитьДанные(СтрокаХМЛ);  
			Элементы.ГруппаДанных.Видимость 				= Истина;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте 
Процедура ЗаполнитьДанные(СтрокаХМЛ)

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаХМЛ);
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "file_information" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Для х = 0 по ЧтениеXML.КоличествоАтрибутов() - 1 Цикл
			
				ИмяАтрибута 		= ЧтениеXML.ИмяАтрибута(х);		
				ЗначениеАтрибута 	= ЧтениеXML.ЗначениеАтрибута(х);	
				
				Если ИмяАтрибута = "error" Тогда
				
					Если ПустаяСтрока(ЗначениеАтрибута) Тогда
						Продолжить;
					КонецЕсли;
					
					ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияОповещения", ЭтаФорма);
					ПоказатьПредупреждение(ОписаниеОповещения, "Ошибка данных из PDM");
					Прервать;
				
				ИначеЕсли ИмяАтрибута = "Name" Тогда
					ИмяФайла = ЗначениеАтрибута
				ИначеЕсли ИмяАтрибута = "Path" Тогда
					ПутьКФайлу = ЗначениеАтрибута;
				ИначеЕсли ИмяАтрибута = "LockedByUserName" Тогда
					КемЗаблокирован = ЗначениеАтрибута;
				ИначеЕсли ИмяАтрибута = "Version" Тогда
					Версия = ЗначениеАтрибута;
				ИначеЕсли ИмяАтрибута = "FileDate" Тогда
					ДатаФайла = ЗначениеАтрибута;
				КонецЕсли;
			
			КонецЦикла;
			
        КонецЕсли;
    КонецЦикла;
	
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		Элементы.ОткрытьФайл.Видимость 					= Ложь;
	Иначе 
		
		Элементы.ОткрытьФайл.Видимость 					= Истина;
		ЗаполнитьТаблицуПути();
		
	КонецЕсли; 
	
	Если ПустаяСтрока(КемЗаблокирован) Тогда
		Элементы.ГруппаБлокировка.Видимость 			= Ложь;
	КонецЕсли; 
	
КонецПроцедуры // ЗаполнитьДанные()

&НаКлиенте
Процедура ЗаполнитьТаблицуПути()

	МассивПутей = СтрРазделить(ПутьКФайлу, "\");
	
	КоличествоЭлементов = МассивПутей.Количество();
	
	Если КоличествоЭлементов > 1 Тогда
	
		НС = Пути_к_каталогам.Добавить();
		НС.Путь = МассивПутей[0] + "\" + МассивПутей[1];
	
	КонецЕсли; 
	
	Для х = 2 По КоличествоЭлементов - 2 Цикл
	
		НС = Пути_к_каталогам.Добавить();
		НС.Путь = Пути_к_каталогам[х - 2].Путь  + "\" + МассивПутей[х];
	
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТаблицуПути()


&НаКлиенте
Процедура ПослеЗакрытияОповещения(ДополнительныеПараметры) Экспорт

	Закрыть();	

КонецПроцедуры // ПослеЗакрытияОповещения()

&НаСервереБезКонтекста
Функция ПроверитьВыполнениеФоновогоЗаданияНаСервере(ЗаданиеУникальныйИдентификатор)
	
	ДанныеВыполнения = Новый Структура("Активно, Сообщение", );
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ЗаданиеУникальныйИдентификатор);
	ДанныеВыполнения.Активно = Задание.Состояние = СостояниеФоновогоЗадания.Активно;
	
	Если НЕ ДанныеВыполнения.Активно Тогда
		
		Для Каждого Сообщение Из Задание.ПолучитьСообщенияПользователю(Истина) Цикл
			ДанныеВыполнения.Сообщение = Сообщение;
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат ДанныеВыполнения;

КонецФункции // ПроверитьВыполнениеФоновогоЗаданияНаСервере()

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ЗапуститьПриложение(ПутьКФайлу);
	
КонецПроцедуры

&НаКлиенте
Процедура НаписатьСообщение(Команда)
	ОткрытьФорму("Задача.ЗадачиОбщие.ФормаОбъекта", Новый Структура("ОбъектАдресации", Комплект)); 
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПутКФайлуПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПутКФайлуПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПутКФайлуПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина; 
	
	ТД = Элементы.Пути_к_каталогам.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ТД.Путь);
	
	Если Файл.Существует() Тогда
		ФайловаяСистемаКлиент.ОткрытьПроводник(ТД.Путь);
	Иначе
		ПоказатьПредупреждение(, "Не существует файла " + ТД.Путь);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ФормуЗакрыть(Команда)
	Закрыть();
КонецПроцедуры


