&НаКлиенте
Перем НомерСтрокиПозиции1С, НомерСтрокиБитрикс;

Процедура ЗаполнитьТаблицуНаСервере()
	тзДанныеСБитрикс = Справочники.Подразделения.ПолучитьДанныеПодразделенийСБитрикс();
	
	Если ТипЗнч(тзДанныеСБитрикс) = Тип("ТаблицаЗначений") Тогда
		тзДанныеСБитрикс.Колонки.Добавить("Обработана", Новый ОписаниеТипов("Булево"));
		ЗаполнитьТекущимиПодразделениями(тзДанныеСБитрикс);
	Иначе
		Сообщить("Не настроен обмен с Битрикс");
	КонецЕсли;
КонецПроцедуры 

Процедура ЗаполнитьТекущимиПодразделениями(тзДанныеСБитрикс)
	
	ТаблицаСопоставлений.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подразделения.Ссылка КАК Подразделение,
		|	Подразделения.id_Битрикс КАК id1С,
		|	Подразделения.Наименование КАК НаименованиеВ1С,
		|	Подразделения.Родитель КАК РодительВ1С,
		|	Подразделения.Родитель.Наименование КАК РодительВ1С1Наименование,
		|	ЕСТЬNULL(Подразделения.Родитель.id_Битрикс, ""0"") КАК idРодителя1С
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	стОтбор = Новый Структура("idБитрикс", );
	
	Пока Выборка.Следующий() Цикл
		
		стОтбор.idБитрикс = Выборка.id1С; 
		НайденыеСтроки = тзДанныеСБитрикс.НайтиСтроки(стОтбор);
		
		Если НайденыеСтроки.Количество() > 0 Тогда
			НС = ТаблицаСопоставлений.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Выборка);
			ЗаполнитьЗначенияСвойств(НС, НайденыеСтроки[0]);
			НайденыеСтроки[0].Обработана = Истина;
		Иначе
			НС = Подразделения1С.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Выборка);
		КонецЕсли;
		
	КонецЦикла;
	
	стОтбор = Новый Структура("Обработана", Ложь); 
	
	НайденыеСтроки = тзДанныеСБитрикс.НайтиСтроки(стОтбор);
	
	Для каждого х Из НайденыеСтроки Цикл
		НС = ПодразделенияБитрикс.Добавить();
		ЗаполнитьЗначенияСвойств(НС, х);
	КонецЦикла;

КонецПроцедуры



&НаКлиенте
Процедура ТаблицаСопоставленийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленийПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Пдразделения1СПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Пдразделения1СПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Пдразделения1СПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТД = Элементы.Подразделения1С;
	
	Позиция1С 				= ТД.ТекущиеДанные.НаименованиеВ1С;
	НомерСтрокиПозиции1С 	= ТД.ТекущаяСтрока;
	
	
	НастройкаВидимостиКнопок();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияБитриксПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияБитриксПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПозицию1С(Команда)
	Позиция1С 				= "";
	НомерСтрокиПозиции1С 	= -1;
	
	НастройкаВидимостиКнопок();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НомерСтрокиПозиции1С 	= -1;
	НомерСтрокиБитрикс		= -1;
	
	НастройкаВидимостиКнопок();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПозициюБитрикс(Команда) 
	ПозицияБитрикс		= "";
	НомерСтрокиБитрикс	= -1;
	
	НастройкаВидимостиКнопок();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияБитриксПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТД = Элементы.ПодразделенияБитрикс;
	
	ПозицияБитрикс		= ТД.ТекущиеДанные.НаименованиеВБитрикс;
	НомерСтрокиБитрикс 	= ТД.ТекущаяСтрока;
	
	НастройкаВидимостиКнопок();
КонецПроцедуры   

&НаКлиенте
Процедура НастройкаВидимостиКнопок()
	
	Если НомерСтрокиБитрикс	= -1 И НомерСтрокиПозиции1С = -1 Тогда
		
		Элементы.СопоставитьПодразделения.Видимость = Ложь;
		Элементы.СоздатьВБитрикс.Видимость 			= Ложь;
		Элементы.СоздатьВ1С.Видимость 				= Ложь;
		
	ИначеЕсли НомерСтрокиПозиции1С > -1 И НомерСтрокиБитрикс = -1 Тогда 

		Элементы.СопоставитьПодразделения.Видимость = Ложь;
		Элементы.СоздатьВБитрикс.Видимость 			= Истина;
		Элементы.СоздатьВ1С.Видимость 				= Ложь;
		
	ИначеЕсли НомерСтрокиПозиции1С = -1 И НомерСтрокиБитрикс > -1 Тогда 

		Элементы.СопоставитьПодразделения.Видимость = Ложь;
		Элементы.СоздатьВБитрикс.Видимость 			= Ложь;
		Элементы.СоздатьВ1С.Видимость 				= Истина;
		
	Иначе
		
		Элементы.СопоставитьПодразделения.Видимость = Истина;
		Элементы.СоздатьВБитрикс.Видимость 			= Ложь;
		Элементы.СоздатьВ1С.Видимость 				= Ложь;
		
	КонецЕсли;

КонецПроцедуры // НастройкаВидимостиКнопок()


&НаСервереБезКонтекста
Процедура ИзменитьПодразделениеНаСервере(idБитрикс, Подразделение)

	обПодразделение 			= Подразделение.ПолучитьОбъект();
	обПодразделение.id_Битрикс 	= idБитрикс;
	
	обПодразделение.Записать();

КонецПроцедуры // ИзменитьПодразделениеНаСервере()


&НаКлиенте
Процедура СопоставитьПодразделения(Команда)
	
	idБитрикс 		= Элементы.ПодразделенияБитрикс.ДанныеСтроки(НомерСтрокиБитрикс).idБитрикс;
	Подразделение 	= Элементы.Подразделения1С.ДанныеСтроки(НомерСтрокиПозиции1С).Подразделение;
	
	ИзменитьПодразделениеНаСервере(idБитрикс, Подразделение);
	
	ЗаполнитьТаблицуНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьВБитрикс(Команда)
	Подразделение 	= Элементы.Подразделения1С.ДанныеСтроки(НомерСтрокиПозиции1С).Подразделение;
	idРодителя1С 	= Элементы.Подразделения1С.ДанныеСтроки(НомерСтрокиПозиции1С).idРодителя1С;
	НаименованиеВ1С = Элементы.Подразделения1С.ДанныеСтроки(НомерСтрокиПозиции1С).НаименованиеВ1С;
	
	СоздатьПодразделениеВБитрикс(Подразделение, idРодителя1С, НаименованиеВ1С);

	ЗаполнитьТаблицуНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьПодразделениеВБитрикс(Подразделение, idРодителя1С, НаименованиеВ1С)

	Справочники.Подразделения.СоздатьПодразделениеВБитрикс(Подразделение, idРодителя1С, НаименованиеВ1С);	

КонецПроцедуры // СоздатьПодразделениеВБитрикс(Подразделение, idРодителя1С, НаименованиеВ1С)



&НаКлиенте
Процедура СоздатьВ1С(Команда)
	
	idБитрикс 				= Элементы.ПодразделенияБитрикс.ДанныеСтроки(НомерСтрокиБитрикс).idБитрикс;
	idБитриксРодитель 		= Элементы.ПодразделенияБитрикс.ДанныеСтроки(НомерСтрокиБитрикс).idБитриксРодитель;
	НаименованиеВБитрикс 	= Элементы.ПодразделенияБитрикс.ДанныеСтроки(НомерСтрокиБитрикс).НаименованиеВБитрикс;
	
	СоздатьПодразделение1СНаСервере(idБитрикс, idБитриксРодитель, НаименованиеВБитрикс);
	
	ЗаполнитьТаблицуНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьПодразделение1СНаСервере(idБитрикс, idБитриксРодитель, НаименованиеВБитрикс)

	Если idБитриксРодитель = "0" Тогда
		РодительПодразделения = Справочники.Подразделения.ПустаяСсылка();
	Иначе
		РодительПодразделения = Справочники.Подразделения.НайтиПоРеквизиту("id_Битрикс", idБитриксРодитель); 
	КонецЕсли;
	
	обПодразделение = Справочники.Подразделения.СоздатьЭлемент();
	
	обПодразделение.Родитель 		= РодительПодразделения;
	обПодразделение.Наименование 	= НаименованиеВБитрикс;
	обПодразделение.id_Битрикс 		= idБитрикс;
	
	обПодразделение.Записать();

КонецПроцедуры // СоздатьПодразделение1СНаСервере(idБитрикс, idБитриксРодитель, НаименованиеВБитрикс)


