Функция ПоставитьЗадачуВОчередьPDM_API(ТипыОбменаPDM, СтруктураПараметров) Экспорт
	 
    Если ТипыОбменаPDM = Перечисления.ТипыОбменаPDM.ПереносФайла Тогда
		Возврат ПоставитьВОчередьПереносФайла(СтруктураПараметров);
	Иначе
	
		
	
	КонецЕсли;
	
	Возврат "";

КонецФункции


Функция ПоставитьВОчередьПереносФайла(СтруктураПараметров) //СтруктураПараметров это структура 
	//"ОбъектВыгрузки 	- Объект выгрузки
	//"АдресХранилища 	- адрес во временном хранилище
	//"ИмяФайла" 		- имя файла в PDM с расширением
	//"ПутьКФайлу" 		- Путь к файлу в структуре PDM
	
	НаименованиеОшибки 	= "Перенос файла";
	КодОшибки				= "";
	ПроизвольноеОписание	= "";
	
	УИД = Строка(Новый УникальныйИдентификатор());
	
	Попытка
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(СтруктураПараметров.АдресХранилища);
		ПутьКФайлу = КаталогВременныхФайлов() + УИД;
		
	Исключение
		КодОшибки 				= "00001";
		ПроизвольноеОписание 	= ОписаниеОшибки();
	КонецПопытки;
	
	//Если ПустаяСтрока(КодОшибки) Тогда
	//	
	//	Попытка
	//		COMОбъектPDM_1C_COM = омPDMНаСервереПовтор.ПодключитьБиблиотекуPDM();	
	//	Исключение
	//		КодОшибки 				= "00002";
	//		ПроизвольноеОписание 	= ОписаниеОшибки();
	//	КонецПопытки;
	//	
	//	Если COMОбъектPDM_1C_COM = Неопределено Тогда
	//	
	//		КодОшибки 				= "00003";
	//		ПроизвольноеОписание 	= "Ошибка получении PDM_1C_COM";
	//	
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	Если ПустаяСтрока(КодОшибки) Тогда
		
		МенеджерЗаписи 							= РегистрыСведений.ОчередьВыгрузкиPDM.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Автор					= ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.ДатаОчередь 				= ТекущаяДата();
		МенеджерЗаписи.ДополнительныйПараметр 	= СтруктураПараметров.ИмяФайла; //Имя временного файла
		МенеджерЗаписи.ДополнительныйПараметр 	= СтруктураПараметров.ПутьКФайлу; //Имя временного файла
		МенеджерЗаписи.ОбъектВыгрузки 			= СтруктураПараметров.ОбъектВыгрузки;
        МенеджерЗаписи.ТипОбмена 				= Перечисления.ТипыОбменаPDM.ПереносФайла;
		МенеджерЗаписи.УИД 						= УИД;
		
		МенеджерЗаписи.Записать();
			
	Иначе
		
		омЖурналСобытий.ЗаписатьВЖурналСобытий(2,"ом_PDM_API_Сервер.ПоставитьВОчередьПереносФайла"
			,омЖурналСобытий.ЗаполнитьПараметрыЖурналаСобытий(НаименованиеОшибки, КодОшибки)
			,ПроизвольноеОписание
			,Перечисления.СтатусСобытий.Ошибка
			,Перечисления.ТипыСобытий.ОшибкаОбменаPDM);
		
	КонецЕсли;
	
	
КонецФункции // ПоставитьВОчередьПереносФайла(СтруктураПараметров)
