
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Проект") Тогда
		
		Проект = Параметры.Проект;
		Элементы.Проект.ТолькоПросмотр = Истина;
		
		Список.Параметры.УстановитьЗначениеПараметра("Проект", Параметры.Проект);
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		
	КонецЕсли;

	Если Параметры.Свойство("НеПоказыватьПомещения") Тогда
		
		Список.Параметры.УстановитьЗначениеПараметра("НеПоказыватьПомещения",		Истина);
		Список.Параметры.УстановитьЗначениеПараметра("СписокПомещенийНеПоказывать",	Параметры.НеПоказыватьПомещения);
		
	Иначе
		
		Список.Параметры.УстановитьЗначениеПараметра("НеПоказыватьПомещения",		Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("СписокПомещенийНеПоказывать",	Новый Массив);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СделкаПриИзмененииНаСервере()
	Список.Параметры.УстановитьЗначениеПараметра("Проект",ЭтаФорма.Проект);
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	СделкаПриИзмененииНаСервере();
КонецПроцедуры


