
Процедура НазначитьНаСервере()

	ИзменитьКонструктораКомплекта(Объект.Комплект, Объект.НовыйКонструктор);
	
	Для каждого х Из Объект.Комплекты Цикл
		Если ТекущийКонструктор = х.ТекущийКонструктор Тогда
			ИзменитьКонструктораКомплекта(х.Комплект, Объект.НовыйКонструктор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры  

Процедура ИзменитьКонструктораКомплекта(Комплект, НовыйКонструктор)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", 	Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.ДанныеКомплекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Комплект.Установить(Комплект);
	НоваяЗапись = НаборЗаписей.Добавить();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
	КонецЦикла;
	
	НоваяЗапись.Период 		= ТекущаяДата();
	НоваяЗапись.Автор 		= Объект.Автор;
	НоваяЗапись.Комплект 	= Комплект;
	НоваяЗапись.Конструктор = НовыйКонструктор;
	
	НаборЗаписей.Записать(); 
	
	омКонструктор.ИзменитьИсполнителяВЗадаче(Комплект, НовыйКонструктор);	
	
КонецПроцедуры


&НаКлиенте
Процедура Назначить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.НовыйКонструктор) Тогда
	
		ПоказатьПредупреждение(, "Не заполнен конструктор");
		Возврат;
	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Комплект) Тогда
	
		ПоказатьПредупреждение(, "Не заполнен комплект");
		Возврат;
	
	КонецЕсли; 
	
	НазначитьНаСервере();
	
	Записать();
	
	Закрыть();
	
КонецПроцедуры

Процедура КомплектПриИзмененииНаСервере()
	
	ТекущаяСтадия 			= Справочники.СтадииКомплекта.ПустаяСсылка();
	ТекущийКонструктор 		= Справочники.Сотрудники.ПустаяСсылка();
	ТекущиеСостояниеЗадачи 	= Перечисления.СостоянияЗадач.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Объект.Комплект) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
			|	ДанныеКомплектаСрезПоследних.Конструктор КАК ТекущийКонструктор
			|ИЗ
			|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние,
			|	ТаймингЗадачСрезПоследних.Задача КАК Задача,
			|	ТаймингЗадачСрезПоследних.Задача.ТипЗадачи КАК ТипЗадачи
			|ИЗ
			|	РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
			|ГДЕ
			|	ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ = &Комплект
			|	И НЕ ТаймингЗадачСрезПоследних.Задача.Выполнена";
		
		Запрос.УстановитьПараметр("Комплект", Объект.Комплект);
		
		Результат = Запрос.ВыполнитьПакет();
		Выборка = Результат[0].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
		КонецЦикла; 
		
		Выборка = Результат[1].Выбрать();
		
		ТекущиеСостояниеЗадачи = Перечисления.СостоянияЗадач.ОжиданиеКонструктором;		
		
		Пока Выборка.Следующий() Цикл
			ТекущиеСостояниеЗадачи 	= Выборка.Состояние;
			ТекущаяЗадача 			= Выборка.Задача;
			ТипЗадачи 				= Выборка.ТипЗадачи;
		КонецЦикла; 
		
	КонецЕсли;
	
	Если ТекущиеСостояниеЗадачи = Перечисления.СостоянияЗадач.ОжиданиеКонструктором Тогда
	
		Элементы.ФормаНазначить.Доступность = Истина;
		Элементы.Декорация1.Видимость		= Ложь; 
		
		Для каждого х Из Объект.Комплекты Цикл
		
			Если ТекущийКонструктор = х.ТекущийКонструктор Тогда
				
				Если х.ТекущиеСостояниеЗадачи = Перечисления.СостоянияЗадач.ОжиданиеКонструктором Тогда
					
					Элементы.ФормаНазначить.Доступность = Ложь;
					Элементы.Декорация1.Видимость		= Истина;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЕсли;	
		
		КонецЦикла;
		
	Иначе
		
		Элементы.ФормаНазначить.Доступность = Ложь;
		Элементы.Декорация1.Видимость		= Истина;
	
	КонецЕсли; 
	
	Объект.Комплекты.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Комплект) И Тип("СправочникСсылка.Композиции") = ТипЗнч(Объект.Комплект) Тогда
		
	 	Объект.Комплекты.Загрузить(омКомпозицииСервер.ПолучитьКомплектыСКонструкторами(Объект.Комплект));
			
	КонецЕсли;	

	
КонецПроцедуры

&НаКлиенте
Процедура КомплектПриИзменении(Элемент)
	ВидимостьТаблицы();
	КомплектПриИзмененииНаСервере();
КонецПроцедуры


Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
КонецПроцедуры 

&НаКлиенте
Процедура ВидимостьТаблицы()

	Если ЗначениеЗаполнено(Объект.Комплект) И Тип("СправочникСсылка.Композиции") = ТипЗнч(Объект.Комплект) Тогда
	
		Элементы.Комплект.Заголовок = "Композиция";
		Элементы.Комплекты.Видимость = Истина;
			
	Иначе
	
		Элементы.Комплект.Заголовок = "Комплект";
		Элементы.Комплекты.Видимость = Ложь;
		
	КонецЕсли;	

КонецПроцедуры // ВидимостьТаблицы()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Декорация1.Видимость					= Параметры.Ключ.Пустая();
	Элементы.КомплектыТекущийКонструктор.Видимость	= Элементы.Декорация1.Видимость;
	Элементы.КомплектыТекущаяЗадача.Видимость		= Элементы.Декорация1.Видимость;
	Элементы.КомплектыТекущаяСтадия.Видимость		= Элементы.Декорация1.Видимость;
	Элементы.ФормаНазначить.Доступность 			= Элементы.Декорация1.Видимость;
	
	ТолькоПросмотр 									= НЕ Элементы.Декорация1.Видимость;
	
	Если Элементы.Декорация1.Видимость Тогда
		
		КомплектПриИзмененииНаСервере();
		
	КонецЕсли;
	
	ВидимостьТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТД = Элементы.Комплекты.ТекущиеДанные;
	
	Если НЕ ТД = Неопределено Тогда
		
		Если Элемент.ТекущийЭлемент.Имя = "КомплектыТекущийКонструктор" Тогда
			ОткрытьФорму("Справочник.ИзделияКомплект.ФормаОбъекта", Новый Структура("Ключ", ТД.Комплект), ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "КомплектыТекущийКонструктор" И ЗначениеЗаполнено(ТД.ТекущийКонструктор) Тогда
			ОткрытьФорму("Справочник.Сотрудники.ФормаОбъекта", Новый Структура("Ключ", ТД.ТекущийКонструктор), ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "КомплектыТекущаяЗадача" И ЗначениеЗаполнено(ТД.ТекущаяЗадача) Тогда
			Если ТипЗнч(ТД.ТекущаяЗадача) = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
				СтрокаТипа = "Задача.Задачи_ПКД.ФормаОбъекта";	
			Иначе
				СтрокаТипа = "Задача.Задачи_РКД.ФормаОбъекта";	
			КонецЕсли;
			
			ОткрытьФорму(СтрокаТипа, Новый Структура("Ключ", ТД.ТекущаяЗадача), ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	КомплектПриИзмененииНаСервере();
КонецПроцедуры


