
Функция ПолучитьТекущегоСотрудника() Экспорт

	Возврат ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	
КонецФункции // ПолучитьТекущегоСотрудника()

Функция ПолучитьТекущегоПользователя() Экспорт

	Возврат ПараметрыСеанса.ТекущийПользователь;

КонецФункции // ПолучитьТекущегоПользователя()

// Если ВозвратВТаблице истина, то всегда возвращается таблица значений,
//если ложь, 
//	то тогда если мСотрудники массив возвращается массив структур,
//	если элемент справочника, то структура
Функция ПолучитьКонтактыСотрудников(мСотрудники, ВозвратВТаблице = Ложь) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиКонтактнаяИнформация.Ссылка КАК Сотрудник,
		|	СотрудникиКонтактнаяИнформация.АдресЭП КАК АдресЭП,
		|	СотрудникиКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
		|ГДЕ
		|	СотрудникиКонтактнаяИнформация.Ссылка В(&мСотрудники)
		|	И СотрудникиКонтактнаяИнформация.Тип В(&Тип)";
	
	Запрос.УстановитьПараметр("мСотрудники", мСотрудники);
	Запрос.УстановитьПараметр("Тип", ПолучитьТипыКонтактнойИнформации());
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ВозвратВТаблице Тогда
	
		ДанныеВозврата = Новый ТаблицаЗначений;
		
		ДанныеВозврата.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
		ДанныеВозврата.Колонки.Добавить("АдресЭП", Новый ОписаниеТипов("Строка"));
		ДанныеВозврата.Колонки.Добавить("НомерТелефона", Новый ОписаниеТипов("Строка"));
	
	Иначе
		Если ТипЗнч(мСотрудники) = Тип("Массив") Тогда
			ВозвратВМассиве = Истина;
			
			ДанныеВозврата = Новый Массив;
		Иначе
			ВозвратВМассиве = Ложь;
			
			ДанныеВозврата = Новый Структура("АдресЭП,НомерТелефона","","");
		КонецЕсли;
	КонецЕсли;
	
	
	Пока Выборка.Следующий() Цикл
		Если ВозвратВТаблице Тогда
			НайденаяСтрока = ДанныеВозврата.Найти(Выборка.Сотрудник, "Сотрудник");
			
			Если НайденаяСтрока = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ДанныеВозврата.Добавить(), Выборка);
			Иначе	
				Если НЕ ПустаяСтрока(Выборка.АдресЭП) Тогда
					НайденаяСтрока.АдресЭП 			= Выборка.АдресЭП;
				КонецЕсли;	
				Если НЕ ПустаяСтрока(Выборка.НомерТелефона) Тогда
					НайденаяСтрока.НомерТелефона 	= Выборка.НомерТелефона;
				КонецЕсли;	
			КонецЕсли;

		Иначе
			
			Если ВозвратВМассиве Тогда
				СотрудникУжеСуществует = Ложь;
				
				Для каждого текСтруктура Из ДанныеВозврата Цикл
					Если текСтруктура.Сотрудник = Выборка.Сотрудник Тогда
						Если НЕ ПустаяСтрока(Выборка.АдресЭП) Тогда
							текСтруктура.АдресЭП 			= Выборка.АдресЭП;
						КонецЕсли;	
						Если НЕ ПустаяСтрока(Выборка.НомерТелефона) Тогда
							текСтруктура.НомерТелефона 	= Выборка.НомерТелефона;
						КонецЕсли;	
					КонецЕсли;
					СотрудникУжеСуществует = Истина;
				КонецЦикла; 
				
				Если НЕ СотрудникУжеСуществует Тогда
					стДанные = Новый Структура("АдресЭП,НомерТелефона,Сотрудник","","");
					ЗаполнитьЗначенияСвойств(стДанные, Выборка);
					ДанныеВозврата.Добавить(стДанные);
				КонецЕсли;
			Иначе
				Если НЕ ПустаяСтрока(Выборка.АдресЭП) Тогда
					ДанныеВозврата.АдресЭП 			= Выборка.АдресЭП;
				КонецЕсли;	
				Если НЕ ПустаяСтрока(Выборка.НомерТелефона) Тогда
					ДанныеВозврата.НомерТелефона 	= Выборка.НомерТелефона;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеВозврата; 
КонецФункции // ПолучитьКонтактыСотрудников()

Функция ПолучитьТипыКонтактнойИнформации() Экспорт

	мТипыИнформации = Новый Массив(2);
	
	мТипыИнформации[0] = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	мТипыИнформации[1] = Перечисления.ТипыКонтактнойИнформации.Телефон;
	
	Возврат мТипыИнформации; 	

КонецФункции // ПолучитьТипыКонтактнойИнформации()

//ТекущийОбъект Композиция, ИзделиеКомплект
Функция СотрудникиОбъекта(ТекущийОбъект, ВозвращатьПользователей = Истина) Экспорт
	
	ПустойСотрудник = ?(ВозвращатьПользователей, Справочники.Пользователи.ПустаяСсылка(), Справочники.Сотрудники.ПустаяСсылка());
	
	стСотрудники = Новый Структура("Конструктор, Менеджер, ВедущийКонструктор, Дизайнер, Замерщик"
		, ПустойСотрудник, ПустойСотрудник, ПустойСотрудник, ПустойСотрудник, ПустойСотрудник);
	
	СотрудникиКомплекты(ТекущийОбъект, стСотрудники);
	
	Если ВозвращатьПользователей Тогда
		
		мСотрудники = Новый Массив;
		
		Если ЗначениеЗаполнено(стСотрудники.Замерщик) Тогда
			мСотрудники.Добавить(стСотрудники.Замерщик);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стСотрудники.Конструктор) Тогда
			мСотрудники.Добавить(стСотрудники.Конструктор);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стСотрудники.Менеджер) Тогда
			мСотрудники.Добавить(стСотрудники.Менеджер);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стСотрудники.ВедущийКонструктор) Тогда
			мСотрудники.Добавить(стСотрудники.ВедущийКонструктор);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стСотрудники.Дизайнер) Тогда
			мСотрудники.Добавить(стСотрудники.Дизайнер);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Пользователи.Сотрудник КАК Сотрудник,
			|	Пользователи.Ссылка КАК Пользователь
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|ГДЕ
			|	Пользователи.Сотрудник В(&мСотрудники)";
		
		Запрос.УстановитьПараметр("мСотрудники", мСотрудники);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Для каждого текЭлемент Из стСотрудники Цикл
				
				Если текЭлемент.Значение = Выборка.Сотрудник Тогда
					
					стСотрудники[текЭлемент.Ключ] = Выборка.Пользователь;
					Прервать;
					
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	
	Возврат стСотрудники;
	
КонецФункции // СотрудникиОбъекта()

Функция СотрудникиКомплекты(Комплект, стСотрудники)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ДанныеКомплектаСрезПоследних.Конструктор, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Конструктор,
	|	ИзделияКомплект.Проект.ВедущийКонструктор КАК ВедущийКонструктор,
	|	ИзделияКомплект.Проект.Дизайнер КАК Дизайнер,
	|	ИзделияКомплект.Проект.Менеджер КАК Менеджер,
	|	ИзделияКомплект.Проект.Замерщик КАК Замерщик
	|ИЗ
	|	Справочник.ИзделияКомплект КАК ИзделияКомплект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних
	|		ПО (ДанныеКомплектаСрезПоследних.Комплект = ИзделияКомплект.Ссылка)
	|ГДЕ
	|	ИзделияКомплект.Ссылка = &Комплект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзменениеСотрудникаСрезПоследних.Менеджер КАК Менеджер,
	|	ИзменениеСотрудникаСрезПоследних.ВедущийКонструктор КАК ВедущийКонструктор,
	|	ИзменениеСотрудникаСрезПоследних.Дизайнер КАК Дизайнер
	|ИЗ
	|	РегистрСведений.ИзменениеСотрудника.СрезПоследних(, ОбъектИзменения = &Комплект) КАК ИзменениеСотрудникаСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Если ТипЗнч(Комплект) = Тип("СправочникСсылка.Композиции") Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ИзделияКомплект", "Справочник.Композиции");	
	
	КонецЕсли;
	
	Результат 	= Запрос.ВыполнитьПакет();
	Выборка 	= Результат[0].Выбрать();
	тз 			= Результат[1].Выгрузить();
	
	Пока Выборка.Следующий() Цикл
		
		Если тз.Количество() = 0 Тогда
			
			стСотрудники.Конструктор 		= Выборка.Конструктор;
			стСотрудники.ВедущийКонструктор	= Выборка.ВедущийКонструктор;
			стСотрудники.Менеджер 			= Выборка.Менеджер;
			стСотрудники.Дизайнер 			= Выборка.Дизайнер;
			стСотрудники.Замерщик 			= Выборка.Замерщик;
			
		Иначе
			
			стСотрудники.ВедущийКонструктор	= ?(ЗначениеЗаполнено(тз[0].ВедущийКонструктор), 	тз[0].ВедущийКонструктор, 		Выборка.ВедущийКонструктор);
			стСотрудники.Менеджер 			= ?(ЗначениеЗаполнено(тз[0].Менеджер), 				тз[0].Менеджер, 				Выборка.Менеджер);
			стСотрудники.Дизайнер 			= ?(ЗначениеЗаполнено(тз[0].Дизайнер), 				тз[0].Дизайнер, 				Выборка.Дизайнер);
			стСотрудники.Замерщик 			= Выборка.Замерщик;
			стСотрудники.Конструктор 		= Выборка.Конструктор;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат стСотрудники;
	
КонецФункции // СотрудникиКомпозиции(ТекущийОбъект, стСотрудники)

Функция ПолучитьКонструктораРазработки(Задача) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеКомплекта.Конструктор КАК Конструктор
	|ИЗ
	|	Задача.Задачи_ПКД КАК Задачи_ПКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплекта
	|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплекта.Комплект
	|ГДЕ
	|	Задачи_ПКД.Ссылка = &Задача";
	
	Если ТипЗнч(Задача) = Тип("ЗадачаСсылка.Задачи_РКД") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Задачи_ПКД", "Задачи_РКД");	
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат омСотрудники.ПолучитьПользователяПоСотруднтку(Выборка.Конструктор);
	КонецЦикла;
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
КонецФункции // ПолучитьКонструктораРазработки()

Функция ПолучитьКонструктораРазработкиЗадач(мЗадачи) Экспорт
	
	Если НЕ ТипЗнч(мЗадачи) = Тип("Массив") Тогда
	
		Возврат Новый ТаблицаЗначений;	
	
	КонецЕсли;
	
	Если мЗадачи.Количество() = 0 Тогда
	
		Возврат Новый ТаблицаЗначений;	
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплекта.Конструктор КАК Конструктор,
		|	Задачи_ПКД.Ссылка КАК Задача
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплекта.Комплект
		|ГДЕ
		|	Задачи_ПКД.Ссылка В(&мЗадачи)";
	
	Если ТипЗнч(мЗадачи[0]) = Тип("ЗадачаСсылка.Задачи_РКД") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Задачи_ПКД", "Задачи_РКД");	
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("мЗадачи", мЗадачи);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьКонструктораРазработкиЗадач(Задачи)

Функция ПолучитьСотруднткаПоПользователю(Пользователь) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Сотрудник КАК Сотрудник
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Сотрудник;
	КонецЦикла;
	
	
КонецФункции // ПолучитьПользователяПоСотруднику()

Функция ПолучитьПользователяПоСотруднтку(Сотрудник) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		
		Возврат Справочники.Пользователи.ПустаяСсылка();	
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
КонецФункции // ПолучитьПользователяПоСотруднтку(Сотрудник)

Функция ПолучитьИсполнителяОбъекта(ОбъектАдресации, ДолжностьИсполнителя, ВозвращатьПользователей = Истина) Экспорт

	ПустойСотрудник = ?(ВозвращатьПользователей, Справочники.Пользователи.ПустаяСсылка(), Справочники.Сотрудники.ПустаяСсылка());
	Если  ПустаяСтрока(ДолжностьИсполнителя) ИЛИ ДолжностьИсполнителя = "Нет" ИЛИ НЕ ЗначениеЗаполнено(ОбъектАдресации) Тогда
		Возврат ПустойСотрудник;
	КонецЕсли;
	
	ТипОбъекта 		= ТипЗнч(ОбъектАдресации);
	ТекущийПроект	= Справочники.Проекты.ПустаяСсылка();
	
	Если ТипОбъекта = Тип("СправочникСсылка.ИзделияКомплект")
		ИЛИ ТипОбъекта = Тип("СправочникСсылка.Композиции") Тогда
	
		СтруктураДанных = СотрудникиОбъекта(ОбъектАдресации, ВозвращатьПользователей);
		
		Если ДолжностьИсполнителя = "Конструктор" Тогда
			Возврат СтруктураДанных.Конструктор; 
		ИначеЕсли ДолжностьИсполнителя = "Дизайнер" Тогда
			Возврат СтруктураДанных.Дизайнер;
		ИначеЕсли ДолжностьИсполнителя = "Менеджер" Тогда
			Возврат СтруктураДанных.Менеджер;
		ИначеЕсли ДолжностьИсполнителя = "Замерщик" Тогда
			Возврат СтруктураДанных.Замерщик;
		ИначеЕсли ДолжностьИсполнителя = "Ведущий конструктор" Тогда
			Возврат СтруктураДанных.ВедущийКонструктор;
		Иначе
			Возврат ПустойСотрудник;
		КонецЕсли;
	
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Проекты") Тогда
		ТекущийПроект = ОбъектАдресации;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Помещения")
		ИЛИ ТипОбъекта = Тип("СправочникСсылка.ИзделияЗаказчика")Тогда
		ТекущийПроект = ОбъектАдресации.Проект;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущийПроект) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА &ДолжностьИсполнителя = ""Менеджер""
			|			ТОГДА Проекты.Менеджер
			|		КОГДА &ДолжностьИсполнителя = ""Дизайнер""
			|			ТОГДА Проекты.Дизайнер
			|		КОГДА &ДолжностьИсполнителя = ""Замерщик""
			|			ТОГДА Проекты.Замерщик
			|		КОГДА &ДолжностьИсполнителя = ""Ведущий конструктор""
			|			ТОГДА Проекты.ВедущийКонструктор
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|	КОНЕЦ КАК Сотрудник
			|ПОМЕСТИТЬ втСотрудник
			|ИЗ
			|	Справочник.Проекты КАК Проекты
			|ГДЕ
			|	Проекты.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втСотрудник.Сотрудник КАК Сотрудник,
			|	ЕСТЬNULL(Пользователи.Ссылка, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Пользователь
			|ИЗ
			|	втСотрудник КАК втСотрудник
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО втСотрудник.Сотрудник = Пользователи.Сотрудник
			|			И (НЕ втСотрудник.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))";
		
		Запрос.УстановитьПараметр("Ссылка", ТекущийПроект);
		Запрос.УстановитьПараметр("ДолжностьИсполнителя", ДолжностьИсполнителя);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат ?(ВозвращатьПользователей, Выборка.Пользователь, Выборка.Сотрудник);
			
		КонецЦикла;
		
	КонецЕсли;
	
    Возврат ПустойСотрудник;
	
КонецФункции // ПолучитьМсолнителяОбъекта()

Функция ПолучитьРабочееВремяСотрудников(мСотрудники, ВозвратМассивом = Истина) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.НачалаПерерыва КАК НачалаПерерыва,
		|	Сотрудники.НачалаРабочегоДня КАК НачалаРабочегоДня,
		|	Сотрудники.ОкончаниеПерерыва КАК ОкончаниеПерерыва,
		|	Сотрудники.ОкончаниеРабочегоДня КАК ОкончаниеРабочегоДня
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)
		|	И НастройкиПроекта.НомерНастройки = 0
		|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", мСотрудники);
	
	Возврат ЗаполнитьТаблицуРабочееВремя(Запрос, Истина, ВозвратМассивом);
	

КонецФункции // ПолучитьРабочиеВремяСотрудников()

Функция ПолучитьРабочееВремяПользователи(мПользователи, ВозвратМассивом = Истина) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.НачалаПерерыва КАК НачалаПерерыва,
		|	Сотрудники.НачалаРабочегоДня КАК НачалаРабочегоДня,
		|	Сотрудники.ОкончаниеПерерыва КАК ОкончаниеПерерыва,
		|	Сотрудники.ОкончаниеРабочегоДня КАК ОкончаниеРабочегоДня,
		|	Пользователи.Ссылка КАК Пользователь
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО Пользователи.Сотрудник = Сотрудники.Ссылка
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)
		|	И НастройкиПроекта.НомерНастройки = 0
		|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", мПользователи);
	
	Возврат ЗаполнитьТаблицуРабочееВремя(Запрос, Ложь, ВозвратМассивом);

КонецФункции // ПолучитьРабочиеВремяСотрудников()

Функция ЗаполнитьТаблицуРабочееВремя(Запрос, Сотрудник, ВозвратМассивом)

	ОбъектНастроек = Отчеты.ОбщиеНастройки.Создать();
	
	ИменаНастроек = Новый Массив(4);
	ИменаНастроек[0] = ОбъектНастроек.ПолучитьНачалаРабочегоДня();
	ИменаНастроек[1] = ОбъектНастроек.ПолучитьОкончаниеРабочегоДня();
	ИменаНастроек[2] = ОбъектНастроек.ПолучитьНачалаПерерыва();
	ИменаНастроек[3] = ОбъектНастроек.ПолучитьОкончаниеПерерыва();
	
	Запрос.УстановитьПараметр("ИмяНастройки", 	ИменаНастроек);
	Результат = Запрос.ВыполнитьПакет();
	
	ПустаяДата = Дата(1, 1, 1);
	ВремяПоУмолчанию = Новый Структура("НачалаПерерыва, НачалаРабочегоДня, ОкончаниеПерерыва, ОкончаниеРабочегоДня"
							, ПустаяДата
							, ПустаяДата
							, ПустаяДата);
	
	Выборка = Результат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИмяНастройки = ИменаНастроек[0] Тогда
			ВремяПоУмолчанию.НачалаРабочегоДня = Выборка.Значение;	
		ИначеЕсли Выборка.ИмяНастройки = ИменаНастроек[1] Тогда
			ВремяПоУмолчанию.ОкончаниеРабочегоДня = Выборка.Значение;	
		ИначеЕсли Выборка.ИмяНастройки = ИменаНастроек[2] Тогда
			ВремяПоУмолчанию.НачалаПерерыва = Выборка.Значение;	
		ИначеЕсли Выборка.ИмяНастройки = ИменаНастроек[3] Тогда
			ВремяПоУмолчанию.ОкончаниеПерерыва = Выборка.Значение;	
		КонецЕсли;
	КонецЦикла;

	КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Время);
    ОписаниеВремя = Новый ОписаниеТипов("Дата", , , , ,КвалификаторыДаты);    
 
	РабочиеВремя = Новый ТаблицаЗначений;
	Если Сотрудник Тогда
		РабочиеВремя.Колонки.Добавить("Сотрудник", 		Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Иначе
		РабочиеВремя.Колонки.Добавить("Пользователь", 	Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	КонецЕсли;
	РабочиеВремя.Колонки.Добавить("НачалаПерерыва", 		ОписаниеВремя);
	РабочиеВремя.Колонки.Добавить("НачалаРабочегоДня", 		ОписаниеВремя);
	РабочиеВремя.Колонки.Добавить("ОкончаниеПерерыва", 		ОписаниеВремя);
	РабочиеВремя.Колонки.Добавить("ОкончаниеРабочегоДня", 	ОписаниеВремя);
	
	Выборка = Результат[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = РабочиеВремя.Добавить();
		
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		НС.НачалаПерерыва 		= ?(НС.НачалаПерерыва 			= ПустаяДата, ВремяПоУмолчанию.НачалаПерерыва, 			НС.НачалаПерерыва); 
		НС.НачалаРабочегоДня 	= ?(НС.НачалаРабочегоДня 		= ПустаяДата, ВремяПоУмолчанию.НачалаРабочегоДня, 		НС.НачалаРабочегоДня); 
		НС.ОкончаниеПерерыва 	= ?(НС.ОкончаниеПерерыва 		= ПустаяДата, ВремяПоУмолчанию.ОкончаниеПерерыва, 		НС.ОкончаниеПерерыва); 
		НС.ОкончаниеРабочегоДня = ?(НС.ОкончаниеРабочегоДня 	= ПустаяДата, ВремяПоУмолчанию.ОкончаниеРабочегоДня, 	НС.ОкончаниеРабочегоДня); 
	КонецЦикла;
	
	Возврат ?(ВозвратМассивом, ОбщегоНазначения.ТаблицаЗначенийВМассив(РабочиеВремя), РабочиеВремя);

КонецФункции // ЗаполнитьТаблицуРабочееВремя()



