
Функция ПолучитьТекущегоСотрудника() Экспорт

	Возврат ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	
КонецФункции // ПолучитьТекущегоСотрудника()

Функция ПолучитьТекущегоПользователя() Экспорт

	Возврат ПараметрыСеанса.ТекущийПользователь;

КонецФункции // ПолучитьТекущегоПользователя()


// Если ВозвратВТаблице истина, то всегда возвращается таблица значений,
//если ложь, 
//	то тогда если мСотрудники массив возвращается массив структур,
//	если элемент справочника, то структура
Функция ПолучитьКонтактыСотрудников(мСотрудники, ВозвратВТаблице = Ложь) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиКонтактнаяИнформация.Ссылка КАК Сотрудник,
		|	СотрудникиКонтактнаяИнформация.АдресЭП КАК АдресЭП,
		|	СотрудникиКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
		|ГДЕ
		|	СотрудникиКонтактнаяИнформация.Ссылка В(&мСотрудники)
		|	И СотрудникиКонтактнаяИнформация.Тип В(&Тип)";
	
	Запрос.УстановитьПараметр("мСотрудники", мСотрудники);
	Запрос.УстановитьПараметр("Тип", ПолучитьТипыКонтактнойИнформации());
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ВозвратВТаблице Тогда
	
		ДанныеВозврата = Новый ТаблицаЗначений;
		
		ДанныеВозврата.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
		ДанныеВозврата.Колонки.Добавить("АдресЭП", Новый ОписаниеТипов("Строка"));
		ДанныеВозврата.Колонки.Добавить("НомерТелефона", Новый ОписаниеТипов("Строка"));
	
	Иначе
		Если ТипЗнч(мСотрудники) = Тип("Массив") Тогда
			ВозвратВМассиве = Истина;
			
			ДанныеВозврата = Новый Массив;
		Иначе
			ВозвратВМассиве = Ложь;
			
			ДанныеВозврата = Новый Структура("АдресЭП,НомерТелефона","","");
		КонецЕсли;
	КонецЕсли;
	
	
	Пока Выборка.Следующий() Цикл
		Если ВозвратВТаблице Тогда
			НайденаяСтрока = ДанныеВозврата.Найти(Выборка.Сотрудник, "Сотрудник");
			
			Если НайденаяСтрока = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ДанныеВозврата.Добавить(), Выборка);
			Иначе	
				Если НЕ ПустаяСтрока(Выборка.АдресЭП) Тогда
					НайденаяСтрока.АдресЭП 			= Выборка.АдресЭП;
				КонецЕсли;	
				Если НЕ ПустаяСтрока(Выборка.НомерТелефона) Тогда
					НайденаяСтрока.НомерТелефона 	= Выборка.НомерТелефона;
				КонецЕсли;	
			КонецЕсли;

		Иначе
			
			Если ВозвратВМассиве Тогда
				СотрудникУжеСуществует = Ложь;
				
				Для каждого текСтруктура Из ДанныеВозврата Цикл
					Если текСтруктура.Сотрудник = Выборка.Сотрудник Тогда
						Если НЕ ПустаяСтрока(Выборка.АдресЭП) Тогда
							текСтруктура.АдресЭП 			= Выборка.АдресЭП;
						КонецЕсли;	
						Если НЕ ПустаяСтрока(Выборка.НомерТелефона) Тогда
							текСтруктура.НомерТелефона 	= Выборка.НомерТелефона;
						КонецЕсли;	
					КонецЕсли;
					СотрудникУжеСуществует = Истина;
				КонецЦикла; 
				
				Если НЕ СотрудникУжеСуществует Тогда
					стДанные = Новый Структура("АдресЭП,НомерТелефона,Сотрудник","","");
					ЗаполнитьЗначенияСвойств(стДанные, Выборка);
					ДанныеВозврата.Добавить(стДанные);
				КонецЕсли;
			Иначе
				Если НЕ ПустаяСтрока(Выборка.АдресЭП) Тогда
					ДанныеВозврата.АдресЭП 			= Выборка.АдресЭП;
				КонецЕсли;	
				Если НЕ ПустаяСтрока(Выборка.НомерТелефона) Тогда
					ДанныеВозврата.НомерТелефона 	= Выборка.НомерТелефона;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеВозврата; 
КонецФункции // ПолучитьКонтактыСотрудников()

Функция ПолучитьТипыКонтактнойИнформации() Экспорт

	мТипыИнформации = Новый Массив(2);
	
	мТипыИнформации[0] = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	мТипыИнформации[1] = Перечисления.ТипыКонтактнойИнформации.Телефон;
	
	Возврат мТипыИнформации; 	

КонецФункции // ПолучитьТипыКонтактнойИнформации()

//ТекущийОбъект Композиция, ИзделиеКомплект
Функция СотрудникиОбъекта(ТекущийОбъект, ВозвращатьПользователей = Истина) Экспорт
	
	ПустойСотрудник = ?(ВозвращатьПользователей, Справочники.Пользователи.ПустаяСсылка(), Справочники.Сотрудники.ПустаяСсылка());
	
	стСотрудники = Новый Структура("Конструктор, Менеджер, ВедущийКонструктор, Дизайнер"
					, ПустойСотрудник, ПустойСотрудник, ПустойСотрудник, ПустойСотрудник);
	
	 Если ТипЗнч(ТекущийОбъект) = Тип("СправочникСсылка.Композиции") Тогда
		 СотрудникиКомпозиции(ТекущийОбъект, стСотрудники);
	 Иначе
		 СотрудникиКомплекты(ТекущийОбъект, стСотрудники);
	 КонецЕсли;
	 
	 Если ВозвращатьПользователей Тогда
	 
	 	мСотрудники = Новый Массив;
		
		Если ЗначениеЗаполнено(стСотрудники.Конструктор) Тогда
			мСотрудники.Добавить(стСотрудники.Конструктор);
		КонецЕсли;
	 
		Если ЗначениеЗаполнено(стСотрудники.Менеджер) Тогда
			мСотрудники.Добавить(стСотрудники.Менеджер);
		КонецЕсли;
	 
		Если ЗначениеЗаполнено(стСотрудники.ВедущийКонструктор) Тогда
			мСотрудники.Добавить(стСотрудники.ВедущийКонструктор);
		КонецЕсли;
	 
		Если ЗначениеЗаполнено(стСотрудники.Дизайнер) Тогда
			мСотрудники.Добавить(стСотрудники.Дизайнер);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Пользователи.Сотрудник КАК Сотрудник,
			|	Пользователи.Ссылка КАК Пользователь
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|ГДЕ
			|	Пользователи.Сотрудник В(&мСотрудники)";
		
		Запрос.УстановитьПараметр("мСотрудники", мСотрудники);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Для каждого текЭлемент Из стСотрудники Цикл
			
				Если текЭлемент.Значение = Выборка.Сотрудник Тогда

					стСотрудники[текЭлемент.Ключ] = Выборка.Пользователь;
					Прервать;
				
				КонецЕсли;	
			
			КонецЦикла;
			
		КонецЦикла;
		
		
	 КонецЕсли;
	 
	 
	 Возврат стСотрудники;

КонецФункции // СотрудникиОбъекта()

Функция СотрудникиКомплекты(Комплект, стСотрудники)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.ВедущийКонструктор КАК ВедущийКонструктор,
		|	Проекты.Дизайнер КАК Дизайнер,
		|	Проекты.Менеджер КАК Менеджер,
		|	ЕСТЬNULL(ИзменениеСотрудникаСрезПоследних.Менеджер, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Менеджер1,
		|	ЕСТЬNULL(ИзменениеСотрудникаСрезПоследних.ВедущийКонструктор, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК ВедущийКонструктор1,
		|	ЕСТЬNULL(ИзменениеСотрудникаСрезПоследних.Дизайнер, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Дизайнер1,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект КАК ИзделияКомплект
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|			ПО ИзделияКомплект.Проект = Проекты.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИзменениеСотрудника.СрезПоследних(, ОбъектИзменения = &Комплект) КАК ИзменениеСотрудникаСрезПоследних
		|			ПО (ИзменениеСотрудникаСрезПоследних.ОбъектИзменения = ИзделияКомплект.Ссылка)
		|		ПО ДанныеКомплектаСрезПоследних.Комплект = ИзделияКомплект.Ссылка
		|ГДЕ
		|	ИзделияКомплект.Ссылка = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		стСотрудники.Конструктор 		= Выборка.Конструктор;
		стСотрудники.ВедущийКонструктор	= ?(ЗначениеЗаполнено(Выборка.ВедущийКонструктор1), Выборка.ВедущийКонструктор1, 	Выборка.ВедущийКонструктор);
		стСотрудники.Менеджер 			= ?(ЗначениеЗаполнено(Выборка.Менеджер1), 			Выборка.Менеджер1, 				Выборка.Менеджер);
		стСотрудники.Дизайнер 			= ?(ЗначениеЗаполнено(Выборка.Дизайнер1), 			Выборка.Дизайнер1, 				Выборка.Дизайнер);

	КонецЦикла;
	
	Возврат стСотрудники;
	
КонецФункции // СотрудникиКомпозиции(ТекущийОбъект, стСотрудники)

Функция СотрудникиКомпозиции(Композиция, стСотрудники)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.ВедущийКонструктор КАК ВедущийКонструктор,
		|	Проекты.Дизайнер КАК Дизайнер,
		|	Проекты.Менеджер КАК Менеджер,
		|	ЕСТЬNULL(ИзменениеСотрудникаСрезПоследних.Менеджер, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Менеджер1,
		|	ЕСТЬNULL(ИзменениеСотрудникаСрезПоследних.ВедущийКонструктор, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК ВедущийКонструктор1,
		|	ЕСТЬNULL(ИзменениеСотрудникаСрезПоследних.Дизайнер, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Дизайнер1,
		|	ДанныеКомпозицииСрезПоследних.Конструктор КАК Конструктор
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Композиция) КАК ДанныеКомпозицииСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Композиции КАК Композиции
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|			ПО Композиции.Проект = Проекты.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИзменениеСотрудника.СрезПоследних(, ОбъектИзменения = &Композиция) КАК ИзменениеСотрудникаСрезПоследних
		|			ПО (ИзменениеСотрудникаСрезПоследних.ОбъектИзменения = Композиции.Ссылка)
		|		ПО ДанныеКомпозицииСрезПоследних.Комплект = Композиции.Ссылка
		|ГДЕ
		|	Композиции.Ссылка = &Композиция";
	
	Запрос.УстановитьПараметр("Композиция", Композиция);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		стСотрудники.Конструктор 		= Выборка.Конструктор;
		стСотрудники.ВедущийКонструктор	= ?(ЗначениеЗаполнено(Выборка.ВедущийКонструктор1), Выборка.ВедущийКонструктор1, 	Выборка.ВедущийКонструктор);
		стСотрудники.Менеджер 			= ?(ЗначениеЗаполнено(Выборка.Менеджер1), 			Выборка.Менеджер1, 				Выборка.Менеджер);
		стСотрудники.Дизайнер 			= ?(ЗначениеЗаполнено(Выборка.Дизайнер1), 			Выборка.Дизайнер1, 				Выборка.Дизайнер);

	КонецЦикла;
	
	Возврат стСотрудники;
	
КонецФункции // СотрудникиКомпозиции(ТекущийОбъект, стСотрудники)Конструктор, Менеджер, ВедущийКонструктор, Дизайнер

Функция ПолучитьКонструктораРазработки(Задача) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадач.Исполнитель КАК Исполнитель,
		|	МАКСИМУМ(ТаймингЗадач.Период) КАК Период
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|ГДЕ
		|	ТаймингЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ВРаботеКонструктора)
		|	И ТаймингЗадач.Задача = &Задача
		|	И ТаймингЗадач.Исполнитель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаймингЗадач.Исполнитель";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Исполнитель;
	КонецЦикла;
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
КонецФункции // ПолучитьКонструктораРазработки()

Функция ПолучитьСотруднткаПоПользователю(Пользователь) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Сотрудник КАК Сотрудник
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Сотрудник;
	КонецЦикла;
	

КонецФункции // ПолучитьПользователяПоСотруднику()

Функция ПолучитьПользователяПоСотруднтку(Сотрудник) Экспорт

	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
	
		Возврат Справочники.Пользователи.ПустаяСсылка();	
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
КонецФункции // ПолучитьПользователяПоСотруднтку(Сотрудник)
