&НаКлиенте
Перем РабочееВремя;

//ИнформацияОДата структура с полями: КоличестивоРабочихЧасовВДне, ВыходныеДни, РабочееВремя
Функция ЗаполнитьТаблицуВывода(ТаблицаВыводаОбъектаТЗ, ТаблицаТайминга, Отбор, СекундВСутках, Период, ИнформацияОДата)
	
	ДанныеВозврата = Новый Структура("Норма, Факт, План, ОписаниеОбъектаТЗ", 0, 0, 0, "");
	
	ВремяПаузы 							= 0;
	ВремяОжидания 						= 0;
	ВремяОжиданияКонструктором 			= 0;
	ВремяПаузыВЧасах					= 0;
	ВремяОжиданияВЧасах 				= 0;
	ВремяОжиданияКонструкторомВЧасах 	= 0;
	
	ТаблицаВыводаОбъектаТЗ.Очистить(); 
	
	НайденыеСтроки = ТаблицаТайминга.НайтиСтроки(Отбор);
	
	МаксимальныйИндекс = НайденыеСтроки.Количество() - 1;
	
	ОжиданиеРаботы = Истина; 
	
	ПериодРаботы = Новый Структура("ДатаНачала, ДатаОкончания",); 
	
	Смещение = 0;

	Для х = 0 По МаксимальныйИндекс Цикл
		
		СтрокаТайминга = НайденыеСтроки[х - Смещение];
		
		Если СтрокаТайминга.ДатаНачала < Период.ДатаНачала Тогда
			Продолжить;	
		КонецЕсли;  
		
		Если х < МаксимальныйИндекс 
			И СтрокаТайминга.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда
			
			СтрокаТаймингаСледующая 	= НайденыеСтроки[х + 1];
			
			Если  СтрокаТаймингаСледующая.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда
				Смещение = Смещение + 1;
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;  
		
		НС = ТаблицаВыводаОбъектаТЗ.Добавить();
		НС.ДатаСтрокой 			= СтрокаТайминга.ДатаСтрокой;
		НС.ДатаНачала 			= СтрокаТайминга.ДатаНачала;
		НС.Норма 				= СтрокаТайминга.НормаВремени;
		НС.Стадия 				= СтрокаТайминга.Стадия;
		НС.СтадияНаименование	= СтрокаТайминга.СтадияНаименование;
		НС.ВРаботе 				= СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ВРаботеКонструктора;
		НС.ДругиеРаботы			= Ложь;
		Если НС.ВРаботе Тогда
			НС.СтруктураНорма	= Новый Структура("Период, Задача, НормаВремени", НС.ДатаНачала, СтрокаТайминга.Задача, НС.Норма);
		Иначе
		   	НС.СтруктураНорма	= Неопределено;
		КонецЕсли;
		
		Если х < МаксимальныйИндекс Тогда
			
			СтрокаТаймингаСледующая 	= НайденыеСтроки[х + 1];
			НС.Факт 					= Окр((СтрокаТаймингаСледующая.ДатаНачала - СтрокаТайминга.ДатаНачала) / СекундВСутках, 2);
			ПериодРаботы.ДатаНачала 	= СтрокаТайминга.ДатаНачала;
			ПериодРаботы.ДатаОкончания 	= СтрокаТаймингаСледующая.ДатаНачала;
			НС.ФактЧасы					= РегистрыСведений.ТаймингЗадач.РабочихЧасовВИнтервале(ПериодРаботы ,ИнформацияОДата);
			
			Если СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ПриостановкаКонструктором Тогда
			
				ВремяПаузы 			= ВремяПаузы 		+ НС.Факт;	
				ВремяПаузыВЧасах 	= ВремяПаузыВЧасах 	+ НС.ФактЧасы;	
			
			ИначеЕсли СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ОжиданиеКонструктором Тогда
				
				ВремяОжидания 			= ВремяОжидания 		+ НС.Факт;	
				ВремяОжиданияВЧасах 	= ВремяОжиданияВЧасах 	+ НС.ФактЧасы;	
			
			ИначеЕсли СтрокаТайминга.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда
				
				ВремяОжиданияКонструктором 			= ВремяОжиданияКонструктором 		+ НС.Факт;	
				ВремяОжиданияКонструкторомВЧасах 	= ВремяОжиданияКонструкторомВЧасах 	+ НС.ФактЧасы;	
				
				НС.СтадияНаименование	= "Другие работы";
				НС.ДругиеРаботы			= Истина;
			
			КонецЕсли;
			
		ИначеЕсли СтрокаТайминга.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда
			
			НС.СтадияНаименование	= "Другие работы";
			НС.ДругиеРаботы			= Истина;
			
		КонецЕсли; 
		
		Смещение = 0;

	КонецЦикла;
	
	МаксимальныйИндекс = ТаблицаВыводаОбъектаТЗ.Количество() - 1;
	
	Для х = 0 По МаксимальныйИндекс Цикл
		
		СтрокаВывода = ТаблицаВыводаОбъектаТЗ[МаксимальныйИндекс - х];
		
		Если СтрокаВывода.СтадияНаименование = "Другие работы" Тогда
			
			Если СтрокаВывода.ДатаНачала > Период.ДатаОкончания Тогда
				ТаблицаВыводаОбъектаТЗ.Удалить(СтрокаВывода);
			Иначе	
			    Прервать;
			КонецЕсли;
			
		Иначе	
			ТаблицаВыводаОбъектаТЗ.Удалить(СтрокаВывода);
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция СоздатьТаблицуВывода()

	ОписаниеЧисла5_2 	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеБулево		= Новый ОписаниеТипов("Булево");
	
	ТаблицаВыводаОбъектаТЗ = Новый ТаблицаЗначений;
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Стадия", 				Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("СтадияНаименование", 	Новый ОписаниеТипов("Строка"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДатаСтрокой", 			Новый ОписаниеТипов("Строка"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДатаНачала", 			Новый ОписаниеТипов("Дата"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Факт", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ФактЧасы", 			ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("План", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Норма", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("СтруктураНорма",		);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ВРаботе", 				ОписаниеБулево);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДругиеРаботы",			ОписаниеБулево);

	Возврат ТаблицаВыводаОбъектаТЗ;
	
КонецФункции // СоздатьТаблицуВывода()  ДругиеРаботы


Функция ПолучитьВыходныеДниВПериоде()
	
	ВыходныеДни = Новый Массив;
	
	Отбор = Новый Структура("РабочиеЧасы", 0);
	
	Для каждого х Из омДаты.ПолучитьРабочиеДни(Период.ДатаНачала, Период.ДатаОкончания, Ложь).НайтиСтроки(Отбор) Цикл
		ВыходныеДни.Добавить(х.Дата);
	КонецЦикла;
	
	Возврат ВыходныеДни;
	
КонецФункции // ПолучитьВыходныеДниВПериоде()

#Область Команды
	
&НаКлиенте
Процедура Обновить(Команда)
	СформироватьОтчет(РабочееВремя);
КонецПроцедуры

#КонецОбласти

#Область ИсполнениеКоманд
	
Процедура СформироватьОтчет(РабочееВремя)

	ПолеВывода.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Конструктор) Тогда
		Возврат;
	КонецЕсли;
	
	СекундВСутках = 3600 * 24;
	
	МенеджерОтчета = Отчеты.ЗавершенныеРаботыКонструктра;
	
	Макет = МенеджерОтчета.ПолучитьМакет("Макет");
	
	ТекущаяОбласть = Макет.ПолучитьОбласть("Шапка");
	ТекущаяОбласть.Параметры.Заполнить(ЭтаФорма);
	ПолеВывода.Вывести(ТекущаяОбласть);
	ПолеВывода.ФиксацияСверху = ПолеВывода.ВысотаТаблицы;
	
	МенеджерРегистра = РегистрыСведений.ТаймингЗадач;
	
	ТекущаяОбласть 		= Макет.ПолучитьОбласть("Строка");
	ОбъектТЗОбласть 	= Макет.ПолучитьОбласть("ОбъектТЗ");
	ВРаботеОбласть 		= Макет.ПолучитьОбласть("ВРаботе");
	ДругиеРаботыОбласть = Макет.ПолучитьОбласть("ДругиеРаботы");
	
	ТаблицаТайминга 	= МенеджерРегистра.ПолучитьТаймингиЗадачКонструктор(Период,Конструктор).ТайминЗадач;
	
	ОбъектыТЗКонструктора = омТЧ_НаКлиентеСервере.КолонкуВМассив(ТаблицаТайминга, "ОбъектТЗ");
	
	ТаблицаТайминга.Сортировать("ОбъектТЗНаименование, ДатаНачала");
	Отбор = Новый Структура("ОбъектТЗ", );
	
	КоличестивоРабочихЧасовВДне = МенеджерРегистра.КоличествоРабочихЧасовСотрудника(РабочееВремя);
	ВыходныеДни					= ПолучитьВыходныеДниВПериоде();
	ИнформацияОДата = Новый Структура("КоличестивоРабочихЧасовВДне, ВыходныеДни, РабочееВремя", КоличестивоРабочихЧасовВДне, ВыходныеДни, РабочееВремя);
	
	
	ТекущийОбъектТЗ = Неопределено; 
	
	ТаблицаВыводаОбъектаТЗ = СоздатьТаблицуВывода();
	
	Для каждого СтрокаЗадач Из ТаблицаТайминга Цикл
		
		Если НЕ ТекущийОбъектТЗ = СтрокаЗадач.ОбъектТЗ Тогда
		
			Отбор.ОбъектТЗ = СтрокаЗадач.ОбъектТЗ;
			ЗаполнитьТаблицуВывода(ТаблицаВыводаОбъектаТЗ, ТаблицаТайминга, Отбор, СекундВСутках, Период, ИнформацияОДата);
			
			Если ТаблицаВыводаОбъектаТЗ.Количество() = 0 Тогда
				Продолжить;	
			КонецЕсли;
			
			ТекущийОбъектТЗ = СтрокаЗадач.ОбъектТЗ;	
		    ОбъектТЗОбласть.Параметры.Заполнить(СтрокаЗадач);
			ПолеВывода.Вывести(ОбъектТЗОбласть); 
			
			Для каждого х Из ТаблицаВыводаОбъектаТЗ Цикл
				
				Если х.Вработе Тогда
					ВРаботеОбласть.Параметры.Заполнить(х);
					ПолеВывода.Вывести(ВРаботеОбласть);
				ИначеЕсли х.ДругиеРаботы Тогда
					ДругиеРаботыОбласть.Параметры.Заполнить(х);
					ПолеВывода.Вывести(ДругиеРаботыОбласть);
				Иначе
					ТекущаяОбласть.Параметры.Заполнить(х);
					ПолеВывода.Вывести(ТекущаяОбласть);
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;	
		
	КонецЦикла;

КонецПроцедуры 

#КонецОбласти

#Область СобытияФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ГлавныйКонструктор") Тогда
		
		Если Параметры.Свойство("Конструктор") Тогда
			
			Конструктор = Параметры.Конструктор;	
			
		КонецЕсли;
		
	Иначе
		
		Конструктор = ПараметрыСеанса.ТекущийПользователь;	
		
	КонецЕсли;
	
	Период.ДатаОкончания 	= КонецДня(ТекущаяДата());
	Период.ДатаНачала		= НачалоМесяца(ДобавитьМесяц(Период.ДатаОкончания, -1));
	
КонецПроцедуры
	
&НаКлиенте
Процедура КонструкторПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Конструктор) Тогда
		РабочееВремя = омСотрудники.ПолучитьРабочееВремяПользователи(Конструктор)[0];
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	Если ЗначениеЗаполнено(Конструктор) Тогда
		РабочееВремя = омСотрудники.ПолучитьРабочееВремяПользователи(Конструктор)[0];
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыводаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
	
		СтандартнаяОбработка = Ложь;
		
		
		СтруктураПараметры = Новый Структура("Расшифровка, ТекущаяОбласть", Расшифровка, Элемент.ТекущаяОбласть);
		
		ОписаниеОповещания = Новый ОписаниеОповещения("ПослеВводаНормы", ЭтаФорма, СтруктураПараметры);
		ПоказатьВводЧисла(ОписаниеОповещания, Расшифровка.НормаВремени, "Норма", 4, 1);
	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти  

&НаКлиенте
Процедура ПослеВводаНормы(Норма, ДополнительныеПараметры) Экспорт

	Если Норма = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	Если ДополнительныеПараметры.Расшифровка.НормаВремени = Норма Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.ТекущаяОбласть.Текст = Норма;
	ДополнительныеПараметры.ТекущаяОбласть.Расшифровка.НормаВремени = Норма;
	
	ЗписатьВРегистрНаСервере(ДополнительныеПараметры.Расшифровка);

КонецПроцедуры // ПослеВводаНормы()


&НаСервереБезКонтекста
Процедура ЗписатьВРегистрНаСервере(Расшифровка)


	МенеджерЗаписи = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Расшифровка.Период;
	МенеджерЗаписи.Задача = Расшифровка.Задача;
	
	МенеджерЗаписи.Прочитать();

	МенеджерЗаписи.Период 		= Расшифровка.Период;
	МенеджерЗаписи.Задача 		= Расшифровка.Задача;
	МенеджерЗаписи.НормаВремени = Расшифровка.НормаВремени;
	
	МенеджерЗаписи.Записать();

КонецПроцедуры // ЗписатьВРегистрНаСервере(Расшифровка)
