
&НаКлиенте
Процедура ЗагрузитьСтатусыИзPDM(Команда)
	ОписаниеОшибки = ЗагрузитьСтатусыНасервере();
	Элементы.Список.Обновить();
	
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Сообщить(ОписаниеОшибки);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьСтатусыНасервере()

	ДанныеЗапроса = омPDMНаСервере.ПолучитьСтатусыПрямымЗапросом();
	
	Если ПустаяСтрока(ДанныеЗапроса.ОписаниеОшибки) Тогда
		
		мКодыСтатусов = Новый Массив;
		
		Для каждого х Из ДанныеЗапроса.Результат Цикл 
			
			мКодыСтатусов.Добавить(х.StatusID);
			
		КонецЦикла; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыPDM.Наименование КАК Name,
		|	СтатусыPDM.IconName КАК IconName,
		|	СтатусыPDM.WorkflowID КАК WorkflowID,
		|	СтатусыPDM.Код КАК StatusID,
		|	СтатусыPDM.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтатусыPDM КАК СтатусыPDM
		|ГДЕ
		|	СтатусыPDM.Код В(&Код)";
		
		Запрос.УстановитьПараметр("Код", мКодыСтатусов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		КоличествоЭлементов = ДанныеЗапроса.Результат.Количество() - 1;
		
		Пока Выборка.Следующий() Цикл
			
			Для х = 0 По КоличествоЭлементов Цикл 
				
				ЭлементPDM = ДанныеЗапроса.Результат[х];
			
				Если ЭлементPDM.StatusID = Выборка.StatusID Тогда
					
					СправочникНайден = Истина;
					
					Если НЕ (ЭлементPDM.Name = Выборка.Name И ЭлементPDM.IconName = Выборка.IconName И ЭлементPDM.WorkflowID = Выборка.WorkflowID) Тогда
						
						ОбъектСправочник 			= ЭлементPDM.Ссылка;
						ОбъектСправочник.IconName 	= ЭлементPDM.IconName;
						ОбъектСправочник.Name 		= ЭлементPDM.Name;
						ОбъектСправочник.WorkflowID = ЭлементPDM.WorkflowID;
						
						ОбъектСправочник.Записать();
						
					КонецЕсли; 
					
					ДанныеЗапроса.Результат.Удалить(х);
					
					Прервать;
					
				КонецЕсли;	
				
			КонецЦикла;
			
			
		КонецЦикла;
		
	Иначе
		Возврат ДанныеЗапроса.ОписаниеОшибки;
	КонецЕсли;
	
	Для каждого х Из ДанныеЗапроса.Результат Цикл
		
		ОбъектСправочник = Справочники.СтатусыPDM.СоздатьЭлемент();
		
		ОбъектСправочник.Код 			= х.StatusID;
		ОбъектСправочник.Наименование	= х.Name;
		ОбъектСправочник.IconName 		= х.IconName;
		ОбъектСправочник.WorkflowID 	= х.WorkflowID;
		
		ОбъектСправочник.Записать();
		
	КонецЦикла;
	
КонецФункции // ЗагрузитьСтатусыНасервере()

