#Область ПрограммныйИнтерфейс

Процедура НачатьКонтрольФайлаВыгрузкиВPDM() Экспорт 
	
	КоличествоПопыток =	омВыгрузкаCRMНаСевере.УстановитьСчетчикПоискаФайлаОтветаВыгрузкиPDM();
	
	Если КоличествоПопыток = 0 Тогда
		ом_ПДМ_на_клиенте.УправлениеКонтроляВыгрузкиВPDM();
		Возврат;
	КонецЕсли;

	стДанныеВыгрузки = омВыгрузкаCRMНаСевере.ПолучитьДанныеВыгрузки();
	
	Если ПустаяСтрока(стДанныеВыгрузки.ПутьКФайлуЗагрузки) Тогда
		Возврат;	
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьСценарийЧтениеФайлов", ом_ПДМ_на_клиенте);
	НачатьПоискФайлов(Оповещение, стДанныеВыгрузки.ПутьКФайлуЗагрузки, "*.txt"); 
	

КонецПроцедуры // НачатьКонтрольФайлаВыгрузкиВPDM()     

#КонецОбласти
