Функция ПолучитьПутьКФайлуПДМ(Объект, Проект = Неопределено, НаименованиКомплекта = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипОбъекта = ТипЗнч(Объект);
	
	Если ТипОбъекта = Тип("СправочникСсылка.ИзделияКомплект") Тогда
	
		ПутьКФайлу = ПолучитьПутьКФайлуКомплект(Объект, Проект, НаименованиКомплекта);	
	
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ГабаритныеЧертежи") Тогда
	
		ПутьКФайлу = ПолучитьПутьКФайлуГабаритныеЧертежи(Объект, Проект);
		
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Композиции") Тогда
	
		ПутьКФайлу = ПолучитьПутьКФайлуКомпозиции(Объект, Проект, НаименованиКомплекта);
	
	КонецЕсли; 
	
	Если ПустаяСтрока(ПутьКФайлу) Тогда
	
		Возврат ПутьКФайлу;	
	
	КонецЕсли;
	
	ОбъектОбщиеНастройки = Отчеты.ОбщиеНастройки.Создать();
	
	ИмяНастройкиКореньПДМ = ОбъектОбщиеНастройки.ПолучитьИмяПутьККорневойПапкеPDM();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПроекта.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
	|ГДЕ
	|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки
	|	И НастройкиПроекта.НомерНастройки = 0
	|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ИмяНастройкиКореньПДМ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КореньПДМ = "";
	
	Пока Выборка.Следующий() Цикл
		
		КореньПДМ = Выборка.Значение; 
		
	КонецЦикла;
	
	КонтрольЗнакаРазделителяПапок(КореньПДМ);
	
	Возврат КореньПДМ + ПутьКФайлу;
	

КонецФункции // ПолучитьПутьКФайлу(Объект)

Функция ПолучитьПутьКФайлуКомпозиции(Композиция, Проект, НаименованиКомплекта)

	Если ЗначениеЗаполнено(Проект) Тогда
	
		стПути = омПроектыСерверПовтор.ПолучитьПутьКИменамПапокПроекта(Проект);
		КонтрольЗнакаРазделителяПапок(стПути.ИмяКорневойПапкиВPDM);
		КонтрольЗнакаРазделителяПапок(стПути.ИмяПапкиКомпозицииВPDM);
		
		Возврат стПути.ИмяКорневойПапкиВPDM + стПути.ИмяПапкиКомпозицииВPDM + СокрЛП(НаименованиКомплекта);	
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Композиции.Проект.ИмяПапкиКомпозицииВPDM КАК ПроектИмяПапкиКомпозицииВPDM
		|ИЗ
		|	Справочник.Композиции КАК Композиции
		|ГДЕ
		|	Композиции.Ссылка = &Ссылка
		|	И НЕ Композиции.Проект.ИмяПапкиКомпозицииВPDM = """"";
	
	Запрос.УстановитьПараметр("Ссылка", Композиция);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПутьКФайлу = "";
	
	Пока Выборка.Следующий() Цикл 
		ПроектИмяПапкиКомпозицииВPDM = Выборка.ПроектИмяПапкиКомпозицииВPDM;
		КонтрольЗнакаРазделителяПапок(ПроектИмяПапкиКомпозицииВPDM);
		ПутьКФайлу = ПроектИмяПапкиКомпозицииВPDM + СокрЛП(НаименованиКомплекта);	
	КонецЦикла;
	
	Возврат ПутьКФайлу;
	
КонецФункции // ПолучитьПутьКФайлуКомплект(Объект) 

Функция ПолучитьПутьКФайлуГабаритныеЧертежи(ГЧ, Проект)

	Если ЗначениеЗаполнено(Проект) Тогда
		
		стПути = омПроектыСерверПовтор.ПолучитьПутьКИменамПапокПроекта(Проект);
		КонтрольЗнакаРазделителяПапок(стПути.ИмяКорневойПапкиВPDM);
		
		Возврат стПути.ИмяКорневойПапкиВPDM + СокрЛП(стПути.ИмяПапкиГЧВPDM);	
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежи.Проект.ИмяПапкиГЧВPDM КАК ПроектИмяПапкиГЧВPDM
		|ИЗ
		|	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
		|ГДЕ
		|	ГабаритныеЧертежи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ГЧ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПутьКФайлу = "";
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ПустаяСтрока(Выборка.ПроектИмяПапкиГЧВPDM) Тогда
			
			ПутьКФайлу = Выборка.ПроектИмяПапкиГЧВPDM;	
		
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПутьКФайлу;
	
КонецФункции // ПолучитьПутьКФайлуКомплект(Объект) 

Функция ПолучитьПутьКФайлуКомплект(Комплект, Проект, НаименованиКомплекта)

	ПутьКФайлу = "";
	
	Если ЗначениеЗаполнено(Проект) И ЗначениеЗаполнено(НаименованиКомплекта) Тогда
	
		ПроектИмяКорневойПапкиВPDM = омПроектыСерверПовтор.ПолучитьПутьКИменамПапокПроекта(Проект).ИмяКорневойПапкиВPDM;
		Наименование = НаименованиКомплекта;
		
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИзделияКомплект.Наименование КАК Наименование,
			|	ИзделияКомплект.Проект.ИмяКорневойПапкиВPDM КАК ПроектИмяКорневойПапкиВPDM
			|ИЗ
			|	Справочник.ИзделияКомплект КАК ИзделияКомплект
			|ГДЕ
			|	ИзделияКомплект.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Комплект);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ПроектИмяКорневойПапкиВPDM 	= Выборка.ПроектИмяКорневойПапкиВPDM;
			Наименование 				= Выборка.Наименование;
			
		КонецЦикла;
	КонецЕсли;
	
		
		Если НЕ (ПустаяСтрока(ПроектИмяКорневойПапкиВPDM) ИЛИ ПустаяСтрока(Наименование)) Тогда
			
			ПроектИмяКорневойПапкиВPDM = ПроектИмяКорневойПапкиВPDM;
			
			КонтрольЗнакаРазделителяПапок(ПроектИмяКорневойПапкиВPDM);
			
			ПутьКФайлу = ПроектИмяКорневойПапкиВPDM + СокрЛП(Наименование);	
		
		КонецЕсли;
		
	
	Возврат ПутьКФайлу;
	
КонецФункции // ПолучитьПутьКФайлуКомплект(Объект) 

Процедура КонтрольЗнакаРазделителяПапок(ПутьКФайлу)

	ПутьКФайлу = СокрЛП(ПутьКФайлу);
	
	Если НЕ Прав(ПутьКФайлу, 1) = "\" Тогда
		
		ПутьКФайлу = ПутьКФайлу + "\";	
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьМаксимальныйРазмерФайла() Экспорт

	Возврат РаботаСФайлами.МаксимальныйРазмерФайлаОбщий();	

КонецФункции // ПолучитьМаксимальныйРазмерФайла()

