&НаСервере
Функция ПолучитьКарточкаКанбанаНаВкладке(Стадия) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КарточкиЭтапы.КарточкаКанбана КАК КарточкаКанбана
		|ИЗ
		|	РегистрСведений.ПоследовательностьЭтаповКанбан КАК ПоследовательностьЭтаповКанбан
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПроектЭтап КАК ПроектЭтап
		|		ПО ПоследовательностьЭтаповКанбан.ЭтапКанбан = ПроектЭтап.Этап
		|ГДЕ
		|	ПоследовательностьЭтаповКанбан.Стадия = &Стадия";
	
	Запрос.УстановитьПараметр("Стадия", Стадия);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Проект");

КонецФункции // ПолучитьПроектыНаВкладке()                                    