
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Задача 								= Параметры.Задача;
	Объект 								= Параметры.Объект;
	Исполнитель 						= Параметры.Исполнитель;
	ТипДействия 						= Параметры.ТипДействия;
	сзКомплектыДляАналогичногоДействия.ЗагрузитьЗначения(Параметры.мКомплектыДляАналогичногоДействия);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	ТД = ТекущаяДата();
	
	Статус = ?(ТипДействия = Перечисления.СостоянияЗадач.ВнешнееСогласование, Перечисления.СтатусыЗадач.Согласование, Перечисления.СтатусыЗадач.Запрос);
	
	Менеджер = омСотрудники.СотрудникиОбъекта(ЭтаФорма.Объект).Менеджер;
	
	ОбъектЗадача = Задача.ПолучитьОбъект();
	ОбъектЗадача.Дата 			= ТД;
	ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ОжиданиеМенеджером;
	ОбъектЗадача.Исполнитель 	= Менеджер;
	ОбъектЗадача.СтатусЗадачи 	= Статус;
	ОбъектЗадача.Записать();
	
	ТаймингЗадач = РегистрыСведений.ТаймингЗадач;
	стДанные = ТаймингЗадач.ПолучитьСтруктуруДанных(ТипДействия, ОбъектЗадача.Исполнитель, Статус, ОбъектЗадача.ТипЗадачи);
	ТаймингЗадач.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
	
	Если сзКомплектыДляАналогичногоДействия.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Задачи_ПКД.Ссылка КАК Задача,
			|	Задачи_ПКД.ОбъектТЗ КАК Объект
			|ИЗ
			|	Задача.Задачи_ПКД КАК Задачи_ПКД
			|ГДЕ
			|	Задачи_ПКД.ОбъектТЗ В(&ОбъектТЗ)";
			
		Запрос.УстановитьПараметр("ОбъектТЗ", сзКомплектыДляАналогичногоДействия.ВыгрузитьЗначения());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ПустойМассив = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			Менеджер = омСотрудники.СотрудникиОбъекта(ЭтаФорма.Объект).Менеджер;
			
			Статус = ?(ТипДействия = Перечисления.СостоянияЗадач.ВнешнееСогласование, Перечисления.СтатусыЗадач.Согласование, Перечисления.СтатусыЗадач.Запрос);
			
			ОбъектЗадача 				= Выборка.Задача.ПолучитьОбъект();
			ОбъектЗадача.Дата 			= ТД;
			ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ОжиданиеМенеджером;
			ОбъектЗадача.Исполнитель 	= Менеджер;
			ОбъектЗадача.СтатусЗадачи 	= Статус;
			ОбъектЗадача.Записать();
			
			ТаймингЗадач = РегистрыСведений.ТаймингЗадач;
			стДанные = ТаймингЗадач.ПолучитьСтруктуруДанных(ТипДействия, ОбъектЗадача.Исполнитель, Статус, ОбъектЗадача.ТипЗадачи);
			ТаймингЗадач.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
			
		КонецЦикла;
		
	КонецЕсли;
	
	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(ОбъектЗадача.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если КонтрольнаяДата = Дата(1, 1, 1) Тогда
		
		ПоказатьПредупреждение(, "Не заполнена контрольная дата.");
		Возврат;
		
	КонецЕсли;
	
	Если ПустаяСтрока(Комментарий) Тогда
		
		ПоказатьПредупреждение(, "Не заполнен комментарий.");
		Возврат;
		
	КонецЕсли;
	
	СохранитьНаСервере(); 
	
	Оповестить("ИзменениеПКД", Объект);
	
	Если Открыта() Тогда
		
		Закрыть();		
		
	КонецЕсли;
	
КонецПроцедуры 

