&НаКлиенте
Процедура ОткрытьПодборИзделияЗаказчика(Объект,ЭтаФорма,СтандартнаяОбработка = Ложь,ДополнительныеПараметры = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;
	
	СделкаЗаказчика = Объект.Проект;
	
	Если Не ЗначениеЗаполнено(СделкаЗаказчика) Тогда
		ПоказатьПредупреждение(,"Не заполнена Проект.");	
		Возврат;	
	КонецЕсли;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ПриложенияКДоговорам") Тогда
		СсылкаДоговор 	= Объект.Ссылка;
	Иначе
		СсылкаДоговор 	= Неопределено;
	КонецЕсли; 

	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзделияЗаказчика",ЭтаФорма,ДополнительныеПараметры);
	
	стПараметры = Новый Структура("Проект,ТолькоНеИспользованые,ТекущиеИзделияЗаказчика,СсылкаДоговор,Отказ,НомерПоПорядку"
					,СделкаЗаказчика
					,Истина
					,омТЧ_НаКлиентеСервере.КолонкуВМассив(Объект.ИзделияЗаказчика,"ИзделиеЗаказчика")
					,СсылкаДоговор
					,ДополнительныеПараметры.Отказ
					,ДополнительныеПараметры.НомерПоПорядку);
	
	ОткрытьФорму("Справочник.ИзделияЗаказчика.ФормаВыбора",стПараметры,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

КонецПроцедуры // ОткрытьПодборИзделий()

