
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Попытка
		
		НачатьТранзакцию();

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.Табель");
		ЭлементБлокировки.УстановитьЗначение("Сотрудник", Сотрудник);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		ТекущиеДвижения = ПолучитьТекущиеДвижения();
		ТекущиеДвижения.Индексы.Добавить("Сотрудник, Дата, ТипДня");
		
		
		УдалитьНеСоответствующиеЗаписи(ТекущиеДвижения);
		
		УдалитьАвтоматическиеЗаписи();
		
		ДобавитьНеобходимые(ТекущиеДвижения);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры 

Процедура ДобавитьНеобходимые(ТекущиеДвижения)

	Отбор = Новый Структура("ЗаписьПроверина, Сотрудник, ТипДня, Дата", Истина, Сотрудник, ТипДня);
	
	ДатаН = ДатаНачала;
	
	СекундВСутках = 24 * 3600;
	
	Пока ДатаН <= ДатаОкончания Цикл
		
		Отбор.Дата = ДатаН;
		
		Если ТекущиеДвижения.НайтиСтроки(Отбор).Количество() = 0 Тогда
		
			МенеджерЗаписи = РегистрыСведений.Табель.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Сотрудник 			= Сотрудник;
			МенеджерЗаписи.Дата 				= ДатаН;
			МенеджерЗаписи.ТипДня 				= ТипДня; 
			МенеджерЗаписи.ДокументОтклонения 	= Ссылка;
			МенеджерЗаписи.КоличествоЧасов 		= КоличествоЧасов;
			
			МенеджерЗаписи.Записать();
			
			
		КонецЕсли;			
		
		ДатаН = ДатаН + СекундВСутках;
		
	КонецЦикла;
	
	
КонецПроцедуры 

Процедура УдалитьАвтоматическиеЗаписи()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Табель.Сотрудник КАК Сотрудник,
		|	Табель.Дата КАК Дата,
		|	Табель.ТипДня КАК ТипДня
		|ИЗ
		|	РегистрСведений.Табель КАК Табель
		|ГДЕ
		|	Табель.Сотрудник = &Сотрудник
		|	И Табель.Дата >= &ДатаНачала
		|	И Табель.Дата <= &ДатаОкончания
		|	И Табель.ДокументОтклонения = ЗНАЧЕНИЕ(Документ.ОтклоненияРабочихДней.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.Табель.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Сотрудник 	= Выборка.Сотрудник;
		МенеджерЗаписи.Дата 		= Выборка.Дата;
		МенеджерЗаписи.ТипДня 		= Выборка.ТипДня;
		
		МенеджерЗаписи.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры


Функция ПолучитьТекущиеДвижения()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Табель.Сотрудник КАК Сотрудник,
		|	Табель.Дата КАК Дата,
		|	Табель.ТипДня КАК ТипДня,
		|	Табель.КоличествоЧасов КАК КоличествоЧасов,
		|	ЛОЖЬ КАК ЗаписьПроверина
		|ИЗ
		|	РегистрСведений.Табель КАК Табель
		|ГДЕ
		|	Табель.ДокументОтклонения = &ДокументОтклонения";
	
	Запрос.УстановитьПараметр("ДокументОтклонения", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТекущиеДвижения()

Процедура УдалитьНеСоответствующиеЗаписи(ТекущиеДвижения)

    Для каждого ЗаписьТабеля Из ТекущиеДвижения Цикл
		
		НадоУдалять = Ложь;
		
		Если ЗаписьТабеля.Сотрудник = Сотрудник Тогда
			
			Если ЗаписьТабеля.ТипДня = ТипДня Тогда
				
				Если ЗаписьТабеля.КоличествоЧасов = КоличествоЧасов Тогда
					
					Если ЗаписьТабеля.Дата < ДатаНачала ИЛИ ЗаписьТабеля.Дата > ДатаОкончания Тогда
						НадоУдалять = Истина;
					Иначе
						
						ЗаписьТабеля.ЗаписьПроверина = Истина;
						
					КонецЕсли;	
					
				Иначе
					НадоУдалять = Истина;	
				КонецЕсли;	
			Иначе
				НадоУдалять = Истина;	
			КонецЕсли;	
			
		Иначе
			НадоУдалять = Истина;	
		КонецЕсли;
		
		Если НадоУдалять Тогда
		
			МенеджерЗаписи = РегистрыСведений.Табель.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Сотрудник 	= ЗаписьТабеля.Сотрудник;
			МенеджерЗаписи.Дата 		= ЗаписьТабеля.Дата;
			МенеджерЗаписи.ТипДня 		= ЗаписьТабеля.ТипДня;
			
			МенеджерЗаписи.Удалить();
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Для каждого х Из ПолучитьТекущиеДвижения() Цикл
		
		МенеджерЗаписи = РегистрыСведений.Табель.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, х);	
		МенеджерЗаписи.Удалить();
		
	КонецЦикла;
КонецПроцедуры

