
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТекущиеДвижения = ПолучитьТекущиеДвижения();
	
	УдалитьНеСоответствующиеЗаписи(ТекущиеДвижения);
	
КонецПроцедуры

Функция ПолучитьТекущиеДвижения()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Табель.Сотрудник КАК Сотрудник,
		|	Табель.Дата КАК Дата,
		|	Табель.ТипДня КАК ТипДня,
		|	Табель.КоличествоЧасов КАК КоличествоЧасов
		|ИЗ
		|	РегистрСведений.Табель КАК Табель
		|ГДЕ
		|	Табель.ДокументОтклонения = &ДокументОтклонения";
	
	Запрос.УстановитьПараметр("ДокументОтклонения", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТекущиеДвижения()

Процедура УдалитьНеСоответствующиеЗаписи(ТекущиеДвижения)

    Для каждого ЗаписьТабеля Из ТекущиеДвижения Цикл
		
		НадоУдалять = Ложь;
		
		Если ЗаписьТабеля.Сот Тогда
		
			
		
		КонецЕсли;	
	
	КонецЦикла;
	
КонецПроцедуры

