
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если Параметры.Свойство("ЗадачаРКДДляЗапуска") Тогда
			НС = Объект.ЗадачиРКД.Добавить();
			НС.ЗадачаРКД = Параметры.ЗадачаРКДДляЗапуска;
			омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
		Иначе
			
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
	Иначе
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК ЗадачаРКД
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО Задачи_РКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|ГДЕ
		|	ТаймингЗадачСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ОжиданиеГЧ)
		|	И НЕ Задачи_РКД.Выполнена";
	
	
	Объект.ЗадачиРКД.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	мКомплектов = ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ЗадачиРКД.Количество() > 0 Тогда
		ЗадачаРКД = Объект.ЗадачиРКД[0].ЗадачаРКД;	
	КонецЕсли;
	
КонецПроцедуры 




