
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	мНастройкиСинхронизации = Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьМассивНастроекПодключения();
	Для Каждого Выборка Из мНастройкиСинхронизации Цикл	
		
		Если НЕ ЗначениеЗаполнено(Выборка.Портал) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Элементы.Портал.СписокВыбора.НайтиПоЗначению(Выборка.Портал) = Неопределено Тогда
			Элементы.Портал.СписокВыбора.Добавить(Выборка.Портал);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры


#КонецОбласти


