
// Возвращает организацию по умолчанию.
// Если в ИБ есть только одна организация, которая не помечена на удаление и не является предопределенной,
// то будет возвращена ссылка на нее, иначе будет возвращена пустая ссылка.
//
// Возвращаемое значение:
//     СправочникСсылка.Организации - ссылка на организацию.
//
Функция ОрганизацияПоУмолчанию() Экспорт
	
	Организация = Справочники.Организации.ПустаяСсылка();
	
	Возврат Организация;

КонецФункции


Функция ПолучитьДанныеОрганизации(Организация = Неопределено, Параметр = Неопределено) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
		"ВЫБРАТЬ
		|	Организации.Финдиректор КАК Финдиректор
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ОсновнаяОрганизация";
	
	Если НЕ Организация = Неопределено Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организации.ОсновнаяОрганизация", "Организации.Ссылка = &Организация"); 
        Запрос.УстановитьПараметр("Организация", Организация);

	КонецЕсли; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПустаяСсылкаСотрудники = Справочники.Сотрудники.ПустаяСсылка();
	
	СтруктураВозврата = Новый Структура("Финдиректор", ПустаяСсылкаСотрудники);
	
	
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЦикла;
	
	Если Параметр = Неопределено Тогда
		Возврат СтруктураВозврата; 
	КонецЕсли; 
	
	Если СтруктураВозврата.Свойство(Параметр) Тогда
		Возврат СтруктураВозврата[Параметр];	
	КонецЕсли;
	
	Возврат ПустаяСсылкаСотрудники;
	
КонецФункции 

Функция ПолучитьФиндиректораОрганизации(Организация = Неопределено, ВозвращатьПользователя = Истина) Экспорт

	Возврат омСотрудники.ПолучитьПользователяПоСотруднтку(Справочники.Организации.ПолучитьДанныеОрганизации(Организация, "Финдиректор"));	

КонецФункции // ПолучитьФиндиректораОрганизации()


