
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПустаяДата 				= Дата(1, 1, 1);
	ПустаяСсылкаДокумент 	= Документы.СогласованиеКомплектовЗаказчиком.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыСогласования.Комплект КАК Комплект
		|ИЗ
		|	РегистрСведений.ДатыСогласования КАК ДатыСогласования
		|ГДЕ
		|	ДатыСогласования.ДокументИзменения = &ДокументИзменения
		|	И НЕ ДатыСогласования.Комплект В (&Комплект)
		|	И ДатыСогласования.ДатаСогласованияЗаказчиком > ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("ДокументИзменения", Ссылка);
	Запрос.УстановитьПараметр("Комплект", Комплекты.ВыгрузитьКолонку("Комплект"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ДатыСогласования.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Комплект = Выборка.Комплект;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.ДатаСогласованияЗаказчиком 	= ПустаяДата;
		МенеджерЗаписи.ДокументИзменения 			= ПустаяСсылкаДокумент;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	
	Для каждого ТекущаяСтрока Из Комплекты Цикл
	
		МенеджерЗаписи = РегистрыСведений.ДатыСогласования.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Комплект = ТекущаяСтрока.Комплект;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.ДокументИзменения 			= Ссылка;
		МенеджерЗаписи.Комплект 					= ТекущаяСтрока.Комплект;
		МенеджерЗаписи.ДатаСогласованияЗаказчиком 	= ТекущаяСтрока.ДатаСогласования;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
