
&НаСервере
Функция ПолучитьДанныеСотрудникаИзПДМ(Сотрудник) Экспорт
	
	стВозврата = Новый Структура("UserID, EnabledPDM, Username", 0, Ложь, "");
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат стВозврата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеСотрудникаВPDM.UserID КАК UserID,
		|	ДанныеСотрудникаВPDM.Enabled КАК EnabledPDM,
		|	ДанныеСотрудникаВPDM.Username КАК Username
		|ИЗ
		|	Справочник.ДанныеСотрудникаВPDM КАК ДанныеСотрудникаВPDM
		|ГДЕ
		|	ДанныеСотрудникаВPDM.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата,Выборка);
	КонецЦикла;
	
	Возврат стВозврата; 
КонецФункции // ПолучитьДанныеСотрудникаИзПДМ()
