Функция ПолучитьДанныеВыгрузки() Экспорт
	
	мНастроек = ПолучитьНаименованиеНастроек();
	стДанныеВыгрузки = Новый Структура();
	
	Для каждого х Из мНастроек Цикл
		стДанныеВыгрузки.Вставить(х,"");
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
	|	НастройкиПроекта.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
	|ГДЕ
	|	НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)
	|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И НастройкиПроекта.НомерНастройки = 0";
		
	Запрос.УстановитьПараметр("ИмяНастройки", мНастроек);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стДанныеВыгрузки[Выборка.ИмяНастройки] = Выборка.Значение;
	КонецЦикла;
	
	Возврат стДанныеВыгрузки;
	
КонецФункции // ПолучитьДанныеВыгрузки() 

Функция ПолучитьНаименованиеНастроек() 
	
	мНаименованиеНастроек = Новый Массив(14);
	мНаименованиеНастроек[0] 	= "ПутьКФайлуEXE";	
	мНаименованиеНастроек[1] 	= "ПутьКФайлуЗагрузки";	
	мНаименованиеНастроек[2] 	= "ПутьКФайлуEXEПроекта";	
	мНаименованиеНастроек[3] 	= "ПутьКФайлуEXEКонструктор";	
	мНаименованиеНастроек[4] 	= "ПутьКФайлуEXEКомпозиция";	
	мНаименованиеНастроек[5] 	= "ПутьКФайлуEXEГабаритныйЧерчеж";	
	мНаименованиеНастроек[6] 	= "ПутьКФайлуEXEИзменениеСтатусаГЧ";	
	мНаименованиеНастроек[7] 	= "ПутьКФайлуEXEЗагрузкаТЗ";	
	мНаименованиеНастроек[8] 	= "ПутьКФайлуEXEРаздатьПрава";	
	мНаименованиеНастроек[9] 	= "ПутьКФайлуEXEЗабратьПрава";	
	мНаименованиеНастроек[10] 	= "ПутьКФайлуEXEЕстьРазрегестрированные";	
	мНаименованиеНастроек[11] 	= "ПутьКФайлуEXEРаздатьПраваКомпозиции";	
	мНаименованиеНастроек[12] 	= "ПутьКФайлуEXEЗабратьПраваКомпозиции";	
	мНаименованиеНастроек[13] 	= "ВремяОпросаФайлов";	
	
	Возврат мНаименованиеНастроек;
	
КонецФункции // ПолучитьНаименованиеНастроек()    

Функция ПодключитьБиблиотекуPDM() Экспорт
	
	Попытка
		
		COMОбъектPDM_1C_COM = Новый COMОбъект("PDM_1C_COM.clPDM_1C_COM");
		
		Возврат COMОбъектPDM_1C_COM;
		
	Исключение
		
		Возврат Неопределено;

	КонецПопытки;
	
КонецФункции // ПодключитьБиблиотекуPDM()

Функция ПолучитьИмяПапкиДляФайловТЗ() Экспорт

	УстановитьПривилегированныйРежим(Истина);
		
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.НаименованиеПапкаДляРазмещенияТЗ());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Возврат Выборка.Значение;
		
	КонецЦикла;
	
	Возврат "";

КонецФункции // ПолучитьИмяПапкиДляФайловИзменений()

Функция ПолучитьИмяПапкиДляФайловКомпозиций() Экспорт

	УстановитьПривилегированныйРежим(Истина);
		
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.НаименованиеПапкаДляРазмещенияКомпозиций());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Возврат Выборка.Значение;
		
	КонецЦикла;
	
	Возврат "";

КонецФункции // ПолучитьИмяПапкиДляФайловИзменений()
