
Функция ПолучитьИсториюТЗ(МассивКомплектовКомпозиций, НужноОбщееОписание = Ложь) Экспорт

	УИД_доски_ТЗ = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиДляТЗ");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКарточки.Ресурс КАК Ресурс,
		|	КанбанПереходКарточки.Период КАК Дата,
		|	КанбанКолонки.Наименование КАК НаименованиеСтатус,
		|	КанбанКолонки.Статус КАК Статус,
		|	КанбанПереходКарточки.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанПереходКарточки КАК КанбанПереходКарточки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|			ПО КанбанПереходКарточки.УИДКудаКолонка = КанбанКолонки.УИД
		|		ПО КанбанКарточки.УИД = КанбанПереходКарточки.УИДКарточка
		|ГДЕ
		|	КанбанКарточки.Ресурс В(&Ресурс)
		|	И КанбанКарточки.Доска = &Доска
		|	И КанбанКолонки.Доска = &Доска
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Доска", УИД_доски_ТЗ);
	Запрос.УстановитьПараметр("Ресурс", МассивКомплектовКомпозиций);
	
	ТЗИстория = Запрос.Выполнить().Выгрузить();
	
	Если НужноОбщееОписание Тогда
	
		Возврат Новый Структура("ТЗИстория, ОбщееОписание", ТЗИстория, ПолучитьОбщееОписание(ТЗИстория));	
	
	Иначе
	
		Возврат ТЗИстория;	
	
	КонецЕсли;
	
КонецФункции // ПолучитьТаблицуКарточек() 

Функция ПолучитьОбщееОписание(ТЗИстория)

	ТаблицаОбщееОжидание = ПолучитьТаблицуОбщееОжидание();
	
	МаксимальныйИндекс = ТЗИстория.Количество() - 1; 
	
	Если МаксимальныйИндекс = -1 Тогда
		Возврат ТаблицаОбщееОжидание;	
	КонецЕсли;
	
	СекундВСутках = 3600 * 24;
	
	Для НомерСтроки = 0 По МаксимальныйИндекс Цикл
	
		Если НомерСтроки < МаксимальныйИндекс Тогда
			
			Дни = Окр((ТЗИстория[НомерСтроки + 1].Дата - ТЗИстория[НомерСтроки].Дата) / СекундВСутках, 1);	
			
		КонецЕсли;	
	
	КонецЦикла;
	
	Возврат ТаблицаОбщееОжидание;

КонецФункции // ПолучитьОбщееОписание(ТЗИстория)

Функция ПолучитьТаблицуОбщееОжидание()

	ТаблицаОбщееОжидание = Новый ТаблицаЗначений;
	ТаблицаОбщееОжидание.Колонки.Добавить("Стадия", 		Новый ОписаниеТипов("Строка"));
	ТаблицаОбщееОжидание.Колонки.Добавить("Дни", 			Новый ОписаниеТипов("Число"));
	ТаблицаОбщееОжидание.Колонки.Добавить("Пользователь", 	Новый ОписаниеТипов("СправочникСсылка.Пользователи"));

КонецФункции // ПолучитьТаблицуОбщееОжидание()

