&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзделиеКомплект =  Параметры.ИзделиеКомплект;
	УИД_доски 		=  Параметры.УИД_доски;
	
	ПолучитьРазделыМеню(Отказ);
	
КонецПроцедуры            

Процедура ПолучитьРазделыМеню(Отказ)

	ТипКанбана = ОпределитьТипКанбана(Отказ);
	
	Если ТипКанбана = "Производство" Тогда
		Элементы.ОтгрузкаКомплекта.Видимость 			= Истина;		
		Элементы.ПередачаВЧастичныйПодряд.Видимость 	= Истина;		
		Элементы.СнятьТегГЧПереведенВРабочее.Видимость 	= 
					омКанбанДоскиНаСервере.ПроверитьНаличиеТега(ИзделиеКомплект, Справочники.Теги.ГЧ_переведен_в_рабочее, УИД_доски);		
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьТипКанбана(Отказ)

	Если УИД_Доски = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство") Тогда
		Возврат "Производство";
	ИначеЕсли УИД_Доски = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство") Тогда
		Возврат "ТЗ";
	КонецЕсли;
	
	Отказ = Истина;
	
	Возврат "";

КонецФункции // ОпределитьТипКанбана()
 
&НаКлиенте
Процедура ПередачаВЧастичныйПодряд(Команда)
	Закрыть();
	ОткрытьФорму("Обработка.ПередачаВЧастичныйПодряд.Форма"
		, Новый Структура("ИзделиеКомплект", ИзделиеКомплект), , , , , ,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СнятьТегГЧПереведенВРабочее(Команда)
	УдалитьТегНаСервере(УИД_доски, ИзделиеКомплект);
	Закрыть();
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура УдалитьТегНаСервере(УИД_доски, ИзделиеКомплект)

	УИДКарточка = омКанбанДоскиНаСервере.ПолучитьУИДКарточки(УИД_доски, ИзделиеКомплект);
	
	Если НЕ ПустаяСтрока(УИДКарточка) Тогда
		омКанбанДоскиНаСервере.УдалитьТег(Справочники.Теги.ГЧ_переведен_в_рабочее, УИДКарточка) 
	КонецЕсли;

КонецПроцедуры // УдалитьТегНаСервере(УИД_доски, ИзделиеКомплект)


&НаКлиенте
Процедура ОтгрузкаКомплекта(Команда)
	СоздатьОтгрузкуНаСервере(ИзделиеКомплект); 
	Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьОтгрузкуНаСервере(ИзделиеКомплект)

	ДокументОтгузки = Документы.ОтгрузкаГотовойПродукции.СоздатьДокумент();
	ДокументОтгузки.Автор = ПараметрыСеанса.ТекущийПользователь;
	ДокументОтгузки.Дата = ТекущаяДата();
	НС = ДокументОтгузки.ИзделияКомплекты.Добавить();
	НС.ИзделиеКомплект = ИзделиеКомплект;
	
	ДокументОтгузки.Записать(РежимЗаписиДокумента.Запись,);

КонецПроцедуры // СоздатьОтгрузкуНаСервере()
 

