&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзделиеКомплект =  Параметры.ИзделиеКомплект;
	УИД_доски 		=  Параметры.УИД_доски;
	
	ПолучитьРазделыМеню(Отказ);
	
КонецПроцедуры            

Процедура ПолучитьРазделыМеню(Отказ)

	ТипКанбана = ОпределитьТипКанбана(Отказ);
	
	Элементы.ГруппаЧастичнаяОтгрузка.Видимость 	= Ложь;
	Элементы.ГруппаОтчетЧастичная.Видимость 	= Ложь;
	
	Если ТипКанбана = "Производство" Тогда
		Элементы.ОтгрузкаКомплекта.Видимость 			= Истина;		
		Элементы.ПередачаВЧастичныйПодряд.Видимость 	= Истина;		 
		Элементы.СнятьТегГЧПереведенВРабочее.Видимость 	= 
					омКанбанДоскиНаСервере.ПроверитьНаличиеТега(ИзделиеКомплект, Справочники.Теги.ГЧ_переведен_в_рабочее, УИД_доски);		
		Элементы.ОтчетПоОтгрузке.Видимость 	= 
					омКанбанДоскиНаСервере.ПроверитьНаличиеТега(ИзделиеКомплект, Справочники.Теги.ЧастичнаяОтгрузка, УИД_доски);		
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьТипКанбана(Отказ)

	Если УИД_Доски = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство") Тогда
		Возврат "Производство";
	ИначеЕсли УИД_Доски = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство") Тогда
		Возврат "ТЗ";
	КонецЕсли;
	
	Отказ = Истина;
	
	Возврат "";

КонецФункции // ОпределитьТипКанбана()
 
&НаКлиенте
Процедура ПередачаВЧастичныйПодряд(Команда)
	Закрыть();
	ОткрытьФорму("Обработка.ПередачаВЧастичныйПодряд.Форма"
		, Новый Структура("ИзделиеКомплект", ИзделиеКомплект), , , , , ,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СнятьТегГЧПереведенВРабочее(Команда)
	УдалитьТегНаСервере(УИД_доски, ИзделиеКомплект);
	Закрыть();
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура УдалитьТегНаСервере(УИД_доски, ИзделиеКомплект)

	УИДКарточка = омКанбанДоскиНаСервере.ПолучитьУИДКарточки(УИД_доски, ИзделиеКомплект);
	
	Если НЕ ПустаяСтрока(УИДКарточка) Тогда
		омКанбанДоскиНаСервере.УдалитьТег(Справочники.Теги.ГЧ_переведен_в_рабочее, УИДКарточка) 
	КонецЕсли;

КонецПроцедуры // УдалитьТегНаСервере(УИД_доски, ИзделиеКомплект)


&НаКлиенте
Процедура ОтгрузкаКомплекта(Команда)
	СоздатьОтгрузкуНаСервере(ИзделиеКомплект); 
	Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьОтгрузкуНаСервере(ИзделиеКомплект)

	ДокументОтгузки = Документы.ОтгрузкаГотовойПродукции.СоздатьДокумент();
	ДокументОтгузки.Автор = ПараметрыСеанса.ТекущийПользователь;
	ДокументОтгузки.Дата = ТекущаяДата();
	НС = ДокументОтгузки.ИзделияКомплекты.Добавить();
	НС.ИзделиеКомплект = ИзделиеКомплект;
	
	ДокументОтгузки.Записать(РежимЗаписиДокумента.Запись,);

КонецПроцедуры // СоздатьОтгрузкуНаСервере()

&НаКлиенте
Процедура ЧастичнаяОтгрузка(Команда)
	
	Элементы.ГруппаЧастичнаяОтгрузка.Видимость 	= Истина;
	Элементы.ГруппаКнопкиПроизводство.Видимость = Ложь;
	
КонецПроцедуры



&НаСервереБезКонтекста
Процедура СоздатьЧастичнуюОтгрузкуНаСервере(ИзделиеКомплект, МасссивПредметов)

	ЧастичнаяОтгрузка = Справочники.ЧастичнаяОтгрузка.СоздатьЭлемент();
	ЧастичнаяОтгрузка.Автор = ПараметрыСеанса.ТекущийПользователь;
	ЧастичнаяОтгрузка.Дата = ТекущаяДата();
	ЧастичнаяОтгрузка.ИзделиеКомплект = ИзделиеКомплект;
	ЧастичнаяОтгрузка.Наименование = ИзделиеКомплект;
	
	Для каждого х Из МасссивПредметов Цикл
	
		ЧастичнаяОтгрузка.ПредметыОтгрузки.Добавить().ПредметОтгрузки = х;;
	
	КонецЦикла;
	
	ЧастичнаяОтгрузка.Записать();
	
	УИД_Доски = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
	УИД_Карточка = омКанбанДоскиНаСервере.ПолучитьУИДКарточки(УИД_Доски, ИзделиеКомплект);
	
	Если НЕ ПустаяСтрока(УИД_Карточка) Тогда
		омКанбанДоскиНаСервере.ЗаписатьТег(Справочники.Теги.ЧастичнаяОтгрузка, УИД_Карточка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЧастичнуюОтгрузку(Команда)
	
	МасссивПредметов = Новый Массив;
	
	Для каждого х Из ПредметыОтгрузки Цикл
		МасссивПредметов.Добавить(х.ПредметОтгрузки);	
	КонецЦикла;
	
	СоздатьЧастичнуюОтгрузкуНаСервере(ИзделиеКомплект, МасссивПредметов);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметыОтгрузкиПриИзменении(Элемент)
	Элементы.СоздатьЧастичнуюОтгрузку.Доступность = НЕ ПредметыОтгрузки.Количество() = 0;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтчетПоОтгрузкеНаСервере(ИзделиеКомплект)
	// Вставить содержимое обработчика.
КонецФункции

&НаКлиенте
Процедура ОтчетПоОтгрузке(Команда)
	Элементы.ГруппаОтчетЧастичная.Видимость 	= Истина;
	Элементы.ГруппаКнопкиПроизводство.Видимость = Ложь;
	
	ФормаОтчета = ОтчетПоОтгрузкеНаСервере(ИзделиеКомплект); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОтчет(Команда)
	Закрыть();
КонецПроцедуры

 

