
&НаСервере
Процедура ОбновитьНаСервере()
	
	ПолеВывода.Очистить();
	
	ТаблцаВывода = омКонструктор.ЗаполнитьКомплектыКонструктора(Проект, Конструктор);
	
	Для каждого ТекущийКомплект  Из омКонструктор.ЗаполнитьЗадачи_РКД_ПКД(Проект, Конструктор) Цикл
		              
		НС = ТаблцаВывода.Добавить();
		
		НС.Комплект 						= ТекущийКомплект.ОбъектТЗ; 
		НС.ОбъектТЗНаименование				= ТекущийКомплект.ОбъектТЗНаименование; 
		НС.Сотрудник 						= ТекущийКомплект.ИсполнительСотрудник; 
		НС.СотрудникНаименование			= ТекущийКомплект.ИсполнительСотрудникНаименование; 
		НС.ТекущаяСтадияПолноеНаименование	= ТекущийКомплект.ТекущаяСтадия; 
		
	КонецЦикла;
	
	ТаблцаВывода.Сортировать("СотрудникНаименование, ОбъектТЗНаименование");
	
	Макет = Отчеты.КомплектыУКонструктора.ПолучитьМакет("Макет");
	
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.ДатаПечати = "Дата печати: " + Формат(ТекущаяДата(), "ДЛФ=DDT");
	ПолеВывода.Вывести(Область);	

	ОбластьКонструктор	= Макет.ПолучитьОбласть("Конструктор");
	Область				= Макет.ПолучитьОбласть("Комплект");
	
	ТекущийКонструктор = Неопределено;
	
	Номер = 1;
	
	Для каждого х Из ТаблцаВывода Цикл
	
		Если НЕ ТекущийКонструктор = х.Сотрудник Тогда
			
			ОбластьКонструктор.Параметры.Заполнить(х);
			ТекущийКонструктор = х.Сотрудник;
			
			ПолеВывода.Вывести(ОбластьКонструктор);	
			
		КонецЕсли;
		
		Область.Параметры.Заполнить(х);
		Область.Параметры.Номер = Номер;
		ПолеВывода.Вывести(Область);
		
		Номер = Номер + 1;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонструкторПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры


