
Процедура ОбновитьНаСервере()
	
	ПолеВывода.Очистить();
	
	МассивКонструкторы = Новый Массив;
	Для каждого х Из Конструкторы Цикл
	
		Если х.Пометка Тогда
			МассивКонструкторы.Добавить(х.Значение);	
		КонецЕсли;
	
	КонецЦикла;
	
	ТаблцаВывода = омКонструктор.ЗаполнитьКомплектыКонструктора(Проект, Конструкторы);
	
	Для каждого ТекущийКомплект  Из омКонструктор.ЗаполнитьЗадачи_РКД_ПКД(Проект, Конструкторы) Цикл
		              
		НС = ТаблцаВывода.Добавить();
		
		НС.Комплект 						= ТекущийКомплект.ОбъектТЗ; 
		НС.ОбъектТЗНаименование				= ТекущийКомплект.ОбъектТЗНаименование; 
		НС.Сотрудник 						= ТекущийКомплект.ИсполнительСотрудник; 
		НС.СотрудникНаименование			= ТекущийКомплект.ИсполнительСотрудникНаименование; 
		НС.ТекущаяСтадияПолноеНаименование	= ТекущийКомплект.ТекущаяСтадия;
		НС.ТекущаяСтадия					= ТекущийКомплект.ТекущаяСтадияСсылка;
		
	КонецЦикла;
	
	ТаблцаВывода.Сортировать("СотрудникНаименование, ОбъектТЗНаименование");        
	
	СтадииВРаботеУКонструктора = омСтадииКомплектаПовтор.ПолучитьСтадииВРаботеУКонструктора();
	
	Макет = Отчеты.КомплектыУКонструктора.ПолучитьМакет("Макет");
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.ДатаПечати = "Дата печати: " + Формат(ТекущаяДата(), "ДЛФ=DDT");
	ПолеВывода.Вывести(Область);	

	ОбластьКонструктор	= Макет.ПолучитьОбласть("Конструктор");
	Область				= Макет.ПолучитьОбласть("Комплект");
	Область1			= Макет.ПолучитьОбласть("Комплект1");
	
	ТекущийКонструктор = Неопределено;
	
	Номер = 1;
	
	Для каждого х Из ТаблцаВывода Цикл
	
		Если НЕ ТекущийКонструктор = х.Сотрудник Тогда
			
			ОбластьКонструктор.Параметры.Заполнить(х);
			ТекущийКонструктор = х.Сотрудник;
			
			ПолеВывода.Вывести(ОбластьКонструктор);	
			
		КонецЕсли;
		
		Если СтадииВРаботеУКонструктора.Найти(х.ТекущаяСтадия) = Неопределено Тогда
			текОбласть = Область;	
		Иначе
			текОбласть = Область1;	
		КонецЕсли;
		
		текОбласть.Параметры.Заполнить(х);
		текОбласть.Параметры.Номер = Номер;
		ПолеВывода.Вывести(текОбласть);
		
		Номер = Номер + 1;
		
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьСписокВедущихКонструкторов()

	Для каждого Ведущий Из омСотрудники.ЗаполнитьСписокСотрудниковПоДолжностям(Истина, Истина, Перечисления.Должности.ВедущийКонструктор) Цикл
	
		Для каждого х Из Ведущий.Значение Цикл
			Элементы.ВедущийКонструктор.СписокВыбора.Добавить(х.Сотрудник, х.Наименование);			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокВедущихКонструкторов();
	Параметры.Свойство("ВедущийКонструктор", ВедущийКонструктор);
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонструкторПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКонструкторов()
	
	Для каждого х Из омСотрудники.ПолучитьКонструкторовПоВедущемуКонструкторуПользователь(ВедущийКонструктор) Цикл
		Если х.Ключ = "Подразделение" Тогда
			Подразделение = х.Значение;	
		КонецЕсли;
		
		Если х.Ключ = "СписокСотрудников" Тогда
			
			Для каждого ТекущийПользователь Из х.Значение Цикл
				Конструкторы.Добавить(ТекущийПользователь.Значение, ТекущийПользователь.Представление, Истина);	
			КонецЦикла; 
			
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВедущийКонструкторПриИзменении(Элемент)
	
	Конструкторы.Очистить();
	Подразделение = Неопределено;
	
	Если ЗначениеЗаполнено(ВедущийКонструктор) Тогда
		ЗаполнитьКонструкторов();
	КонецЕсли; 
	
	ОбновитьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВедущийКонструкторПриИзменении(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура КонструкторыПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры


