&НаКлиенте
Функция РасчетНачалаДатыМонтажа(стДаты) Экспорт

	ПустаяДата = Дата(1,1,1);
	
	СекундВСутках = 24 * 3600;
	
	МинДата = ПустаяДата;
	
	НормаВремени 	= 0;
	ДатаОкончания 	= ПустаяДата;
	ДатаНачала 		= ПустаяДата;
	
	Если НЕ стДаты.КрайМонтажа = ПустаяДата Тогда
		НормаВремени 	= стДаты.НормаВремениМонтажа;
		ДатаНачала 		= стДаты.КрайМонтажа - стДаты.НормаВремениМонтажа * СекундВСутках;
		ДатаОкончания 	= стДаты.КрайМонтажа;
	КонецЕсли;
	
	
    Если НЕ ДатаНачала = ПустаяДата Тогда
	
		Возврат омДаты.ДобавитьДниСУчетомВыходных(ДатаОкончания, -НормаВремени);	
	
	КонецЕсли; 
	
	Возврат ПустаяДата;
КонецФункции // РасчетНачалаДатыПроизводства()
