
Функция ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель = Неопределено) Экспорт
	
	МенеджерРегистра = РегистрыСведений.ТаймингЗадач;

	ОбъектЗадача 				= Задача.ПолучитьОбъект();
	ОбъектЗадача.Дата 			= ТекущаяДата();
	ОбъектЗадача.СтатусЗадачи   = Перечисления.СтатусыЗадач.Замер;
	
	Если Действие = "История" Тогда
		Возврат МенеджерРегистра.ПолучитьОбщиеЗадачи(Задача);
	ИначеЕсли Действие = "НачатьВыполнение" Тогда
		
		СтрокаХМЛ = омФайлыPDM.Перевести_ГЧ_в_изменение_статус(ОбъектЗадача.ОбъектТЗ);
		СтруктураОтвета = омФайлыPDM.ПреобразоватьОтветОСменеСтатусаГЧВСтруктуру(СтрокаХМЛ);
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ЗамерИзменение;
		ОбъектЗадача.Исполнитель 	= Исполнитель;
		
		ОбъектЗадача.Записать();
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ПустаяСсылка(), Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
	ИначеЕсли Действие = "ЗавершитьВыполнение" Тогда
		
		СтрокаХМЛ = омФайлыPDM.Перевести_ГЧ_в_проектный_статус(ОбъектЗадача.ОбъектТЗ);
		СтруктураОтвета = омФайлыPDM.ПреобразоватьОтветОСменеСтатусаГЧВСтруктуру(СтрокаХМЛ);
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Завершение;
		ОбъектЗадача.Исполнитель 	= Исполнитель;
		ОбъектЗадача.Выполнена		= Истина;
		
		ОбъектЗадача.Записать();
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ПустаяСсылка(), Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
	ИначеЕсли Действие = "Сброс" Тогда
		
		СтрокаХМЛ = омФайлыPDM.Перевести_ГЧ_в_проектный_статус(ОбъектЗадача.ОбъектТЗ);
		СтруктураОтвета = омФайлыPDM.ПреобразоватьОтветОСменеСтатусаГЧВСтруктуру(СтрокаХМЛ);
		
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ЗамерПроектный;
		ОбъектЗадача.Исполнитель 	= Исполнитель;
		
		ОбъектЗадача.Записать();
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ПустаяСсылка(), Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		
	КонецЕсли;
	
	СсылкаНаЗадачу = ОбъектЗадача.Ссылка;
	
	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(СсылкаНаЗадачу);

	Возврат СтруктураОтвета;
	
КонецФункции // ДействияНаСервере()

