
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДокументВыезда = Параметры.ДокументВыезда;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыездНаЗамерПричинаИзменени.Автор КАК Автор,
		|	ВыездНаЗамерПричинаИзменени.Дата КАК Дата,
		|	ВыездНаЗамерПричинаИзменени.ДатаПредыдущая КАК ДатаПредыдущая,
		|	ВыездНаЗамерПричинаИзменени.ПричинаИзменения КАК ПричинаИзменения
		|ИЗ
		|	Документ.ВыездНаЗамер.ПричинаИзменени КАК ВыездНаЗамерПричинаИзменени
		|ГДЕ
		|	ВыездНаЗамерПричинаИзменени.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыездНаЗамер.ДатаВыездаПлан КАК ДатаВыездаПлан
		|ИЗ
		|	Документ.ВыездНаЗамер КАК ВыездНаЗамер
		|ГДЕ
		|	ВыездНаЗамер.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументВыезда);
	
	Если ТипЗнч(ДокументВыезда) = тип("ДокументСсылка.ЗаявкаНаЗамер") Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".ВыездНаЗамер", ".ЗаявкаНаЗамер");	
	
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	
	Причины.Загрузить(Результат[0].Выгрузить()); 
	
	Выборка = Результат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ТекущаяПлановаяДатаВыезда = Выборка.ДатаВыездаПлан;	
	
	КонецЦикла;
	
КонецПроцедуры
