
#Область ИзменениеФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыводитьПроект 	= Истина;
	СтруктураДанных = ОбновитьГантНаСервере();
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	омДиаграммаГантаСерверПовтор.НачальноеЗаполнениеЦвета();
	
	Если Параметры.Свойство("Проект") Тогда
		Проект 		= Параметры.Проект;
	КонецЕсли;
	
	Диаграмма.ОтображатьЛегенду = Ложь;
	ВыводитьПроект 				= Истина;
	

КонецПроцедуры

#КонецОбласти 


#Область Диаграмма
	
Функция ОбновитьГантНаСервере(Обновить = Ложь)
	
	Если НЕ Обновить Тогда
		Диаграмма.Очистить();
	КонецЕсли;
	
	Диаграмма.Обновление = Ложь;

	стПараметры = Новый Структура("Диаграмма, Проект, ВыводитьПроект, Обновить"
		, Диаграмма, Проект, ВыводитьПроект, Обновить);
		
	СтруктураДанных = омГантПроизводстваНаСервере.ОбновитьГантНаСервере(стПараметры);
	
	Диаграмма.Обновление = Истина;
	
	Возврат СтруктураДанных;
	
КонецФункции 

Процедура ОбновитьПроектНаСервере(ТекущийПроект, мДанныеГантаПроект)
	
	стПараметры = Новый Структура("Диаграмма, Проект, ВыводитьПроект, Обновить, тзДанныеГанта"
		, Диаграмма, ТекущийПроект, ВыводитьПроект, Истина, мДанныеГантаПроект);
	
	Диаграмма.Обновление = Ложь;
	омГантКонструкторовНаСервере.ВывестиПроект(стПараметры, ТекущийПроект);
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

Процедура ОбновитьИсполнителяНаСервере(ТекущийИсполнитель, ТекущийПроект, мДанныеГантаИсполнитель)
	
	
	стПараметры = Новый Структура("Диаграмма, Проект, Подразделение, ВыводитьПроект, Обновить, тзДанныеГанта"
		, Диаграмма, ТекущийПроект, ВыводитьПроект, Истина, мДанныеГантаИсполнитель);
	
	Диаграмма.Обновление = Ложь;
	омГантКонструкторовНаСервере.ВывестиИсполнитель(стПараметры, ТекущийИсполнитель);
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДобавитьПроект(Команда)
	
	ОповещениеВыбора = Новый ОписаниеОповещения("ПосеВыбораПроекта", ЭтаФорма);
	СтруктораПараметров = Новый Структура("НеВыводитьНаДиаграмму", Истина);
	
	ОткрытьФорму("Справочник.Проекты.ФормаВыбора", СтруктораПараметров, ЭтаФорма, , , , ОповещениеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПосеВыбораПроекта(ВыбранныйПроект, ДополнительныеПараметры) Экспорт

    Если ВыбранныйПроект = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	ОповещениеВыбораДаты = Новый ОписаниеОповещения("ПослеВыбораДаты", ЭтаФорма);
	ПоказатьВводДаты(ОповещениеВыбораДаты, ТекущаяДата(), "Дата создания", ЧастиДаты.Дата);
	
КонецПроцедуры // ПосеВыбораПроекта()

Процедура ПослеВыбораДаты(ВыбраннаяДата, ДополнительныеПараметры) Экспорт

    Если ВыбраннаяДата = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	

КонецПроцедуры //ПослеВыбораДаты


