
#Область ИзменениеФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СтруктураДанных = ОбновитьГантНаСервере();
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	омДиаграммаГантаСерверПовтор.НачальноеЗаполнениеЦвета();
	
	Диаграмма.ОтображатьЛегенду = Ложь;
	ВыводитьПроект 				= Истина;
	
КонецПроцедуры

#КонецОбласти 


#Область Диаграмма
	
Функция ОбновитьГантНаСервере(Обновить = Ложь)
	
	Если НЕ Обновить Тогда
		Диаграмма.Очистить();
	КонецЕсли;
	
	Диаграмма.Обновление = Ложь;

	стПараметры = Новый Структура("Диаграмма, Проекты, ВыводитьПроект, Обновить, Период"
		, Диаграмма, Проекты, ВыводитьПроект, Обновить, Период);
		
	СтруктураДанных = омГантПроизводстваНаСервере.ОбновитьГантНаСервере(стПараметры);
	
	Диаграмма.Обновление = Истина;
	
	Возврат СтруктураДанных;
	
КонецФункции 

Процедура ОбновитьПроектНаСервере(ТекущийПроект, мДанныеГантаПроект)
	
	стПараметры = Новый Структура("Диаграмма, Проект, ВыводитьПроект, Обновить, тзДанныеГанта"
		, Диаграмма, ТекущийПроект, ВыводитьПроект, Истина, мДанныеГантаПроект);
	
	Диаграмма.Обновление = Ложь;
	омГантКонструкторовНаСервере.ВывестиПроект(стПараметры, ТекущийПроект);
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДобавитьПроект(Команда)
	
	ОповещениеВыбора = Новый ОписаниеОповещения("ПосеВыбораПроекта", ЭтаФорма);
	СтруктораПараметров = Новый Структура("НеВыводитьНаДиаграмму", Истина);
	
	ОткрытьФорму("Справочник.Проекты.ФормаВыбора", СтруктораПараметров, ЭтаФорма, , , , ОповещениеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПосеВыбораПроекта(ВыбранныйПроект, ДополнительныеПараметры) Экспорт

    Если ВыбранныйПроект = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	ОповещениеВыбораДаты = Новый ОписаниеОповещения("ПослеВыбораДаты", ЭтаФорма, ВыбранныйПроект);
	ПоказатьВводДаты(ОповещениеВыбораДаты, ТекущаяДата(), "Дата создания", ЧастиДаты.Дата);
	
КонецПроцедуры // ПосеВыбораПроекта()

Процедура ПослеВыбораДаты(ВыбраннаяДата, ВыбранныйПроект) Экспорт

    Если ВыбраннаяДата = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	ЗаполнитьГантНаСервере(ВыбраннаяДата, ВыбранныйПроект);

КонецПроцедуры //ПослеВыбораДаты 

Процедура ЗаполнитьГантНаСервере(ВыбраннаяДата, ВыбранныйПроект)

	МенеджерРегистра 	= РегистрыСведений.ДанныеКомплекта;
	ДатаНачала			= НачалоНедели(ВыбраннаяДата) + 24 * 3600;
	ДатаОкончания		= НачалоДня(КонецНедели(ДатаНачала));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплекта.Комплект КАК Комплект,
		|	ДанныеКомплекта.ВнешняяДатаОкончаниеПроизводства КАК ВнешняяДатаОкончаниеПроизводства,
		|	ДанныеКомплекта.ВнешняяДатаНачалоПроизводства КАК ВнешняяДатаНачалоПроизводства,
		|	ДанныеКомплекта.ВнешняяПродолжительностьПроизводства КАК ВнешняяПродолжительностьПроизводства
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплекта
		|ГДЕ
		|	ДанныеКомплекта.Комплект.Проект = &Проект
		|	И ДанныеКомплекта.Комплект ССЫЛКА Справочник.ИзделияКомплект
		|	И (ДанныеКомплекта.ВнешняяДатаНачалоПроизводства = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ДанныеКомплекта.ВнешняяПродолжительностьПроизводства = 0
		|			ИЛИ ДанныеКомплекта.ВнешняяДатаОкончаниеПроизводства = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("Проект", ВыбранныйПроект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураПараметров = Новый Структура("Комплект, ВнешняяПродолжительностьПроизводства, ВнешняяДатаНачалоПроизводства, ВнешняяДатаОкончаниеПроизводства", );
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураПараметров.Комплект 								= Выборка.Комплект;
		СтруктураПараметров.ВнешняяПродолжительностьПроизводства 	= 1;
		СтруктураПараметров.ВнешняяДатаНачалоПроизводства 			= ДатаНачала;
		СтруктураПараметров.ВнешняяДатаОкончаниеПроизводства 		= ДатаОкончания;
		
		МенеджерРегистра.ИзменитьДанныеКомплекта(СтруктураПараметров);
	КонецЦикла;
	
	
	ОбновитьГантНаСервере(Истина);

КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ЗаполнитьПроектыНаСервере(мДобавленныеПроекты)
	
	Возврат Отчеты.СостояниеПроекта.ЗаполнитьПроектыНаСервере(мДобавленныеПроекты);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПроекты(Команда)
	
	Для каждого ТекущийПроект Из ЗаполнитьПроектыНаСервере(Проекты.ВыгрузитьЗначения()) Цикл
		Проекты.Добавить(ТекущийПроект.Значение, ТекущийПроект.Представление);
	КонецЦикла;
	
КонецПроцедуры



