
#Область ИзменениеФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СтруктураДанных = ОбновитьГантНаСервере();
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	омДиаграммаГантаСерверПовтор.НачальноеЗаполнениеЦвета();
	омГантНаСервере.ВключитьИнтервалНеделяНаГанте(Диаграмма);
	
	Диаграмма.ОтображатьЛегенду = Ложь;
	
	ВыводитьПроект 				= Истина;
	
КонецПроцедуры

#КонецОбласти 

#Область Диаграмма
	
Функция ОбновитьГантНаСервере(Обновить = Ложь)
	
	Если НЕ Обновить Тогда
		Диаграмма.Очистить();
	КонецЕсли;
	
	Диаграмма.Обновление = Ложь;

	стПараметры = Новый Структура("Диаграмма, Проекты, ВыводитьПроект, Обновить"
		, Диаграмма, Проекты, ВыводитьПроект, Обновить);
		
	СтруктураДанных = омГантПроизводстваНаСервере.ОбновитьГантНаСервере(стПараметры);
	
	Диаграмма.Обновление = Истина;
	
	Возврат СтруктураДанных;
	
КонецФункции 

Процедура ОбновитьПроектНаСервере(ТекущийПроект, мДанныеГантаПроект)
	
	стПараметры = Новый Структура("Диаграмма, Проект, ВыводитьПроект, Обновить, тзДанныеГанта"
		, Диаграмма, ТекущийПроект, ВыводитьПроект, Истина, мДанныеГантаПроект);
	
	Диаграмма.Обновление = Ложь;
	омГантКонструкторовНаСервере.ВывестиПроект(стПараметры, ТекущийПроект);
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаОбработкаРасшифровки(Элемент, Расшифровки, СтандартнаяОбработка, Дата)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаВыбор(Элемент, Значения, СтандартнаяОбработка, Дата)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаПриОкончанииРедактированияИнтервала(Элемент, Интервал, ОтменаРедактирования)
	
	СтруктураОтбора = Новый Структура("Комплект", Интервал.Расшифровка.СсылкаКомплект);
	НайденыеСтроки = ИзмененныеЗначения.НайтиСтроки(СтруктураОтбора);
	
	Если НайденыеСтроки.Количество() = 0 Тогда
		ТекущаяСтрока = ИзмененныеЗначения.Добавить();
		ТекущаяСтрока.Комплект = СтруктураОтбора.Комплект;
	Иначе
		ТекущаяСтрока = ИзмененныеЗначения[0];
	КонецЕсли;
	
	СекундВСутках = 24 * 3600;
	
	ТекущаяСтрока.ВнешняяДатаНачалоПроизводства 		= НачалоНедели(Интервал.Начало) + СекундВСутках;
	ТекущаяСтрока.ВнешняяДатаОкончаниеПроизводства 		= КонецНедели(Интервал.Конец);
	ТекущаяСтрока.ВнешняяПродолжительностьПроизводства 	= Окр((ТекущаяСтрока.ВнешняяДатаОкончаниеПроизводства - ТекущаяСтрока.ВнешняяДатаНачалоПроизводства) /  (СекундВСутках * 7), 0);
	
	Интервал.Начало = ТекущаяСтрока.ВнешняяДатаНачалоПроизводства;
	Интервал.Конец 	= ТекущаяСтрока.ВнешняяДатаОкончаниеПроизводства;
	
	Если ВыводитьПроект Тогда
		
		ПроектСтрокой = Интервал.Значение.Точка.Родитель.Значение;
		Серия = Диаграмма.Серии.Получить(0);
		
		Значение 	= Диаграмма.ПолучитьЗначение(Интервал.Значение.Точка.Родитель, Серия);
		
		Если Значение.Количество() = 0 Тогда
			ИнтервалПроект = Значение.Добавить();
		Иначе	
			Для каждого х Из Значение Цикл
				ИнтервалПроект = х;
			КонецЦикла;
		КонецЕсли; 
		
		ПустаяСтрока = Дата(1, 1, 1);
		
		СтруктураИнтервал = Новый Структура("ДатаНачала, ДатаОкончания", ПустаяСтрока, ПустаяСтрока);
		
		Для каждого ТочкиПроект Из Диаграмма.Точки Цикл
		
			Если ТочкиПроект.Значение = Интервал.Значение.Точка.Родитель.Значение Тогда
				
				Для каждого ТочкаПроект Из ТочкиПроект.Точки Цикл
					
						Для каждого х Из Диаграмма.ПолучитьЗначение(ТочкаПроект, Серия) Цикл
							
							Если СтруктураИнтервал.ДатаНачала = ПустаяСтрока ИЛИ СтруктураИнтервал.ДатаНачала > х.Начало Тогда
								СтруктураИнтервал.ДатаНачала = х.Начало;
							КонецЕсли;
							
							Если СтруктураИнтервал.ДатаОкончания < х.Конец Тогда
								СтруктураИнтервал.ДатаОкончания = х.Конец;
							КонецЕсли;
							
						КонецЦикла;
					
				КонецЦикла;
				
			КонецЕсли;	         
		
		КонецЦикла;
		
		Если НЕ (СтруктураИнтервал.ДатаОкончания = ПустаяСтрока ИЛИ СтруктураИнтервал.ДатаНачала = ПустаяСтрока) Тогда
		
			ИнтервалПроект.Начало 	= СтруктураИнтервал.ДатаНачала;	
			ИнтервалПроект.Конец 	= СтруктураИнтервал.ДатаОкончания;	
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  

#Область Команды

&НаКлиенте
Процедура ДобавитьПроект(Команда)
	
	ОповещениеВыбора = Новый ОписаниеОповещения("ПослеВыбораПроекта", ЭтаФорма);
	СтруктораПараметров = Новый Структура("НеВыводитьНаДиаграмму", Истина);
	
	ОткрытьФорму("Справочник.Проекты.ФормаВыбора", СтруктораПараметров, ЭтаФорма, , , , ОповещениеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроекты(Команда)
	
	Для каждого ТекущийПроект Из ЗаполнитьПроектыНаСервере(Проекты.ВыгрузитьЗначения()) Цикл
		Проекты.Добавить(ТекущийПроект.Значение, ТекущийПроект.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьГантНаСервере();
КонецПроцедуры

#КонецОбласти  

&НаКлиенте
Процедура ПослеВыбораПроекта(ВыбранныйПроект, ДополнительныеПараметры) Экспорт

    Если ВыбранныйПроект = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	ОповещениеВыбораДаты = Новый ОписаниеОповещения("ПослеВыбораДаты", ЭтаФорма, ВыбранныйПроект);
	ПоказатьВводДаты(ОповещениеВыбораДаты, ТекущаяДата(), "Дата создания", ЧастиДаты.Дата);
	
КонецПроцедуры // ПослеВыбораПроекта()

Процедура ПослеВыбораДаты(ВыбраннаяДата, ВыбранныйПроект) Экспорт

    Если ВыбраннаяДата = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	ЗаполнитьГантНаСервере(ВыбраннаяДата, ВыбранныйПроект);

КонецПроцедуры //ПослеВыбораДаты 

Процедура ЗаполнитьГантНаСервере(ВыбраннаяДата, ВыбранныйПроект)

	МенеджерРегистра 	= РегистрыСведений.ДанныеКомплекта;
	ДатаНачала			= НачалоНедели(ВыбраннаяДата) + 24 * 3600;
	ДатаОкончания		= НачалоДня(КонецНедели(ДатаНачала));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ДанныеКомплекта.ВнешняяДатаОкончаниеПроизводства, ДАТАВРЕМЯ(1, 1, 1)) КАК ВнешняяДатаОкончаниеПроизводства,
		|	ЕСТЬNULL(ДанныеКомплекта.ВнешняяДатаНачалоПроизводства, ДАТАВРЕМЯ(1, 1, 1)) КАК ВнешняяДатаНачалоПроизводства,
		|	ЕСТЬNULL(ДанныеКомплекта.ВнешняяПродолжительностьПроизводства, 0) КАК ВнешняяПродолжительностьПроизводства,
		|	ИзделияКомплект.Ссылка КАК Комплект
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплекта
		|		ПО (ДанныеКомплекта.Комплект = ИзделияКомплект.Ссылка)
		|ГДЕ
		|	(ИзделияКомплект.Ссылка.Проект = &Проект
		|				И ДанныеКомплекта.Комплект ССЫЛКА Справочник.ИзделияКомплект
		|				И (ДанныеКомплекта.ВнешняяДатаНачалоПроизводства = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ ДанныеКомплекта.ВнешняяДатаНачалоПроизводства ЕСТЬ NULL
		|					ИЛИ ДанныеКомплекта.ВнешняяПродолжительностьПроизводства = 0
		|					ИЛИ ДанныеКомплекта.ВнешняяПродолжительностьПроизводства ЕСТЬ NULL
		|					ИЛИ ДанныеКомплекта.ВнешняяДатаОкончаниеПроизводства = ДАТАВРЕМЯ(1, 1, 1))
		|			ИЛИ ДанныеКомплекта.ВнешняяДатаОкончаниеПроизводства ЕСТЬ NULL)
		|	И НЕ ИзделияКомплект.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Проект", ВыбранныйПроект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураПараметров = Новый Структура("Комплект, ВнешняяПродолжительностьПроизводства, ВнешняяДатаНачалоПроизводства, ВнешняяДатаОкончаниеПроизводства", );
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураПараметров.Комплект 								= Выборка.Комплект;
		СтруктураПараметров.ВнешняяПродолжительностьПроизводства 	= 1;
		СтруктураПараметров.ВнешняяДатаНачалоПроизводства 			= ДатаНачала;
		СтруктураПараметров.ВнешняяДатаОкончаниеПроизводства 		= ДатаОкончания;
		
		МенеджерРегистра.ИзменитьДанныеКомплекта(СтруктураПараметров);
		
	КонецЦикла;
	
	ОбновитьГантНаСервере();

КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ЗаполнитьПроектыНаСервере(мДобавленныеПроекты)
	
	Возврат Отчеты.СостояниеПроекта.ЗаполнитьПроектыНаСервере(мДобавленныеПроекты);
	
КонецФункции

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ТаблицаИзменений = ИзмененныеЗначения.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоПроизводства КАК ВнешняяДатаНачалоПроизводства,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеПроизводства КАК ВнешняяДатаОкончаниеПроизводства,
		|	ДанныеКомплектаСрезПоследних.ВнешняяПродолжительностьПроизводства КАК ВнешняяПродолжительностьПроизводства,
		|	ДанныеКомплектаСрезПоследних.Комплект КАК Комплект
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект В (&Комплекты)) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплекты", ТаблицаИзменений.ВыгрузитьКолонку("Комплект"));
	
	ТекущиеЗначения = Запрос.Выполнить().Выгрузить();
	ТекущиеЗначения.Индексы.Добавить("Комплект");
	
	СтруктураОтбор 	= Новый Структура("Комплект", );
	стПараметры 	= Новый Структура("Комплект, ВнешняяПродолжительностьПроизводства, ВнешняяДатаНачалоПроизводства, ВнешняяДатаОкончаниеПроизводства", );
	
	МенеджерРегистра = РегистрыСведений.ДанныеКомплекта;
	
	Для каждого х Из ТаблицаИзменений Цикл 
		
		СтруктураОтбор.Комплект = х.Комплект;
	
		НайденоеЗначение = ТекущиеЗначения.НайтиСтроки(СтруктураОтбор);
		
		Если НайденоеЗначение.Количество() > 0 Тогда
		
			стр = НайденоеЗначение[0];
			
			Если стр.ВнешняяДатаНачалоПроизводства = х.ВнешняяДатаНачалоПроизводства
				И стр.ВнешняяДатаОкончаниеПроизводства = х.ВнешняяДатаОкончаниеПроизводства
				И стр.ВнешняяПродолжительностьПроизводства = х.ВнешняяПродолжительностьПроизводства Тогда
			
				Продолжить;
			
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(стПараметры, х);
		
		МенеджерРегистра.ИзменитьДанныеКомплекта(стПараметры);
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры



