Функция ПолучитьСтадиюОкончаниеПКД() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплектаРеквизитыСтадии.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|ГДЕ
		|	СтадииКомплектаРеквизитыСтадии.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ПКД)
		|	И СтадииКомплектаРеквизитыСтадии.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.Завершение)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка()
	
КонецФункции // ПолучитьСтадиюОкончаниеПКД()

Функция ПолучитьСтадиюВнешнееПКД() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтадииКомплектаРеквизитыСтадии.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|ГДЕ
		|	СтадииКомплектаРеквизитыСтадии.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.ВнешнееПКД)";
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка()

КонецФункции // ПолучитьСтадиюВнешнееПКД()
