Функция ПолучитьСтадиюОкончаниеПКД() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплектаРеквизитыСтадии.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|ГДЕ
		|	СтадииКомплектаРеквизитыСтадии.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ПКД)
		|	И СтадииКомплектаРеквизитыСтадии.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.Завершение)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка()
	
КонецФункции // ПолучитьСтадиюОкончаниеПКД()

Функция ПолучитьСтадиюВнешнееПКД() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтадииКомплектаРеквизитыСтадии.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|ГДЕ
		|	СтадииКомплектаРеквизитыСтадии.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.ВнешнееПКД)";
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка()

КонецФункции // ПолучитьСтадиюВнешнееПКД()

Функция ПолучитСтадииРазработкиПКД_РКД() Экспорт

	СтруктураСтадий = Новый Структура("Стадия_разработка_ПКД, Стадия_разработка_РКД", );
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтадииКомплектаРеквизитыСтадии.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|ГДЕ
		|	СтадииКомплектаРеквизитыСтадии.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.Разработка)
		|	И СтадииКомплектаРеквизитыСтадии.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ВРаботеКонструктора)
		|	И СтадииКомплектаРеквизитыСтадии.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.Разработка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтадииКомплектаРеквизитыСтадии.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|ГДЕ
		|	СтадииКомплектаРеквизитыСтадии.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.РКД)
		|	И СтадииКомплектаРеквизитыСтадии.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ВРаботеКонструктора)
		|	И СтадииКомплектаРеквизитыСтадии.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.Разработка)";
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[0].Выбрать;
	
	Пока Выборка.Следующий() Цикл
		СтруктураСтадий.Стадия_разработка_ПКД = Выборка.Ссылка;
	КонецЦикла;
	
	Выборка = Результат[1].Выбрать;
	
	Пока Выборка.Следующий() Цикл
		СтруктураСтадий.Стадия_разработка_РКД = Выборка.Ссылка;
	КонецЦикла;
	
	Возврат СтруктураСтадий;
	
КонецФункции // ПолучитСтадииРазработкиПКД_РКД()


