
&НаСервере
Процедура ДопРасходыПриИзмененииНаСервере()
	ОбщаяСуммаДопРасхода = Объект.ДопРасходы.Итог("СуммаСНДС");
	ОбщаяСуммаМатериала = Объект.Материалы.Итог("Сумма");
	УчтеннаяСумма = 0; 
	Если ОбщаяСуммаМатериала > 0 Тогда
		Для каждого Строка Из Объект.Материалы цикл
			Строка.ДопРасходы = Строка.Сумма / ОбщаяСуммаМатериала * ОбщаяСуммаДопРасхода;
			УчтеннаяСумма = УчтеннаяСумма + Строка.ДопРасходы 
		КонецЦикла;
		Если УчтеннаяСумма <> ОбщаяСуммаДопРасхода Тогда
			Строка.ДопРасходы = Строка.ДопРасходы - (УчтеннаяСумма - ОбщаяСуммаДопРасхода);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыПриИзменении(Элемент)
	ДопРасходыПриИзмененииНаСервере();
	ОбщаяСуммаДопРасхода = Объект.ДопРасходы.Итог("СуммаСНДС");
	ОбщаяСуммаМатериала = Объект.Материалы.Итог("Сумма");
	ОбщаяСумма = ОбщаяСуммаДопРасхода + ОбщаяСуммаМатериала;
КонецПроцедуры 

&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	ДопРасходыПриИзмененииНаСервере();
	ОбщаяСуммаДопРасхода = Объект.ДопРасходы.Итог("СуммаСНДС");
	ОбщаяСуммаМатериала = Объект.Материалы.Итог("Сумма");
	ОбщаяСумма = ОбщаяСуммаДопРасхода + ОбщаяСуммаМатериала;
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьРасходы(Команда)
	ДопРасходыПриИзмененииНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ДопРасходы.ТекущиеДанные;
	ТекущаяСтрока.СуммаСНДС = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ДопРасходы.ТекущиеДанные;
	ТекущаяСтрока.СуммаСНДС = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщаяСуммаДопРасхода 	= Объект.ДопРасходы.Итог("СуммаСНДС");
	ОбщаяСуммаМатериала 	= Объект.Материалы.Итог("Сумма");
	ОбщаяСумма 				= ОбщаяСуммаДопРасхода + ОбщаяСуммаМатериала;
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
	Если НЕ РольДоступна("ЦеныЗакупки") Тогда
	
		ЭтаФорма.Элементы.МатериалыЦена.Видимость 			= Ложь;	
		ЭтаФорма.Элементы.МатериалыСуммаСНДС.Видимость 		= Ложь;	
		ЭтаФорма.Элементы.ГруппаДопРасходы.Видимость 		= Ложь;	
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ПоступлениеМатериалов", ПараметрыЗаписи, Новый Структура("Ссылка",Объект.Ссылка));
	Оповестить("ИзменениеЦены", Новый Структура("Номенклатура",омТЧ_НаКлиентеСервере.КолонкуВМассив(Объект.Материалы, "Номенклатура")));
КонецПроцедуры

&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	омЕдиницыКлиент.ЗаполнитьЕдиницуПриИзмененииМатериала(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдИзмНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ТД = Элементы.Материалы.ТекущиеДанные;
	Элемент.СписокВыбора.ЗагрузитьЗначения(омЕдиницыИзмерения.ЕдиницыИзмеренийНоменклатурыДляВыбора(ТД.Номенклатура));
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдИзмПриИзменении(Элемент)
	омЕдиницыКлиент.ЗаполнитьКоэффициентПриИзмененииЕдиницы(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	//ВидимостьПолейОбъект();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//омВидимостьСделки.КонтрольУникальностиОбъект(Объект, ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура МатериалыОбъектПриИзменении(Элемент)
	//ВидимостьПолейОбъект();
КонецПроцедуры


