
Функция ПолучитьИспользуемыеСущностиВРазрезеНастроекПодключения() Экспорт
	
	Результат = Новый Соответствие;
	
	мНастройкиПодключения = РегистрыСведений.Б24_КБ_НастройкиИнтеграцииСервисов.ПолучитьМассивНастроекИнтеграцийСервисов("РаботаИзОдногоОкна", Истина);
	Для Каждого НастройкаПодключения Из мНастройкиПодключения Цикл
		
		НастройкиИнтеграцииСервисов = РегистрыСведений.Б24_КБ_НастройкиИнтеграцииСервисов.ПолучитьНастройкиИнтеграцииСервисовПоНастройкеПодключения(НастройкаПодключения);
		
		СохраненныеНастройки = НастройкиИнтеграцииСервисов.Настройки.Получить();
		Если СохраненныеНастройки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		мСущности = Новый Массив;
		Для каждого ТекСтрока Из СохраненныеНастройки.СущностиДляРаботыИзОдногоОкна Цикл 
			
			Если ТекСтрока.Компании ИЛИ ТекСтрока.Контакты ИЛИ ТекСтрока.Лиды ИЛИ ТекСтрока.Проекты Тогда
				мСущности.Добавить(ТекСтрока.ИмяСущности);
			КонецЕсли;
			
		КонецЦикла;
		
		Результат.Вставить(НастройкаПодключения, мСущности);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьСохраненнуюНастройкуИнтеграцииСервисовПоНастройкеПодключения(НастройкаПодключения, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт

	Возврат РегистрыСведений.Б24_КБ_НастройкиИнтеграцииСервисов.ПолучитьСохраненнуюНастройкуИнтеграцииСервисовПоНастройкеПодключения(НастройкаПодключения, Ключ, ЗначениеПоУмолчанию);

КонецФункции


