Функция ПеревестиЗадачуВОжидание(ЗадачаРКД, УстановитьСтадиюКомплекта = Ложь, стДанные = Неопределено) Экспорт
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;

	Если стДанные = Неопределено Тогда
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(,,Перечисления.СтатусыЗадач.РКД);
	КонецЕсли;
	
	
	Конструктор = омСотрудники.ПолучитьКонструктораРазработки(ЗадачаРКД);
	
	ОбъектЗадача 				= ЗадачаРКД.ПолучитьОбъект(); 
	ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + ".РКД.Доработка";
	ОбъектЗадача.Дата			= ТекущаяДата();
	ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.РКД;
	ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором;
	ОбъектЗадача.Исполнитель 	= Конструктор;
	
	ОбъектЗадача.Записать();
	
	стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
	стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
	стДанные.Состояние 		= Перечисления.СостоянияЗадач.ОжиданиеКонструктором;
	
	МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ЗадачаРКД, стДанные);
	
	Если УстановитьСтадиюКомплекта Тогда
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(ЗадачаРКД);
	КонецЕсли;
	
КонецФункции // ПеревестиЗадачуВОжидание()

Функция ПеревестиЗадачуВОжиданиеСогласования(ЗадачаРКД, УстановитьСтадиюКомплекта = Ложь, стДанные = Неопределено) Экспорт
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;

	Если стДанные = Неопределено Тогда
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(,,Перечисления.СтатусыЗадач.РКД_ожидание_согласования);
	КонецЕсли;
	
	
	Конструктор = омСотрудники.ПолучитьКонструктораРазработки(ЗадачаРКД);
	
	ОбъектЗадача 				= ЗадачаРКД.ПолучитьОбъект(); 
	ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + ".РКД.ОжиданиеСогласования";
	ОбъектЗадача.Дата			= ТекущаяДата();
	ОбъектЗадача.СтатусЗадачи	= стДанные.Статус;
	ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором;
	ОбъектЗадача.Исполнитель 	= Конструктор;
	
	ОбъектЗадача.Записать();
	
	стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
	стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
	стДанные.Состояние 		= Перечисления.СостоянияЗадач.ОжиданиеКонструктором;
	
	МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ЗадачаРКД, стДанные);
	
	Если УстановитьСтадиюКомплекта Тогда
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(ЗадачаРКД);
	КонецЕсли;
	
КонецФункции // ПеревестиЗадачуВОжидание()

Процедура ЗавершениеЗадачиРКД(Задача, стДанные = Неопределено, НеИзменяетСтадию = Ложь) Экспорт
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;

	Если стДанные = Неопределено Тогда
	
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(,,Перечисления.СтатусыЗадач.РКД);
	
	КонецЕсли;
	
	ОбъектЗадача 				= Задача.ПолучитьОбъект();
	ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + ".РКД.Завершена";
	ОбъектЗадача.Дата			= ТекущаяДата();
	ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.РКД;
	ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Завершение;
	ОбъектЗадача.Выполнена      = Истина;
	
	ОбъектЗадача.Записать(); 
	
	стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
	стДанные.Состояние 		= Перечисления.СостоянияЗадач.ПустаяСсылка();
	стДанные.Статус 		= ОбъектЗадача.СтатусЗадачи;
	
	МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
	
	РекламацияСсылка = ЗакрытьРекламацию(ОбъектЗадача.ОбъектТЗ);
	
	УИДДоскиПроизводство = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
	УИДКарточка = омКанбанДоскиНаСервере.ПолучитьУИДКарточки(УИДДоскиПроизводство, ОбъектЗадача.ОбъектТЗ);
	
	Если НЕ ПустаяСтрока(УИДКарточка) Тогда
		
		Если омКанбанДоскиНаСервере.УдалитьТег(Справочники.Теги.ДосрочныйЗапускВПроизводство, УИДКарточка) Тогда
			омКанбанДоскиНаСервере.ЗаписатьТег(Справочники.Теги.ГЧ_переведен_в_рабочее, УИДКарточка);	
		КонецЕсли;
		
		МассивТегов = Новый Массив(1);
		МассивТегов[0] = Справочники.Теги.Рекламация;
		
		ДанныеВПроизводстве = омКанбанДоскиНаСервере.ПолучитьКарточкиКанбанаСКолонкамиИТегами(УИДДоскиПроизводство, ОбъектЗадача.ОбъектТЗ, МассивТегов);
		
		Если ДанныеВПроизводстве.Количество() > 0 Тогда
			
			Если СтрДлина(ДанныеВПроизводстве[0].УИДКудаКолонка) > 10 Тогда
				
				омКанбанДоскиНаСервере.УдалитьТег(Справочники.Теги.Рекламация, УИДКарточка);
				омКанбанДоскиНаСервере.ЗаписатьТег(Справочники.Теги.РекламацияЗавершена, УИДКарточка);	
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


Функция ЗакрытьРекламацию(ОбъектТЗ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рекламации.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Рекламации КАК Рекламации
		|ГДЕ
		|	Рекламации.Комплект = &Комплект
		|	И НЕ Рекламации.РКДВыполнено";
	
	Запрос.УстановитьПараметр("Комплект", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	РекламацияСсылка = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		РекламацияСсылка = Выборка.Ссылка;
		
		ОбъектРекламация 				= РекламацияСсылка.ПолучитьОбъект();
		ОбъектРекламация.РКДВыполнено 	= Истина;
		ОбъектРекламация.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
	КонецЦикла;
	
	Возврат РекламацияСсылка; 
	
КонецФункции // ЗакрытьРекламацию()

