Функция ПеревестиЗадачуВОжидание(ЗадачаРКД, УстановитьСтадиюКомплекта = Ложь, стДанные = Неопределено) Экспорт
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;

	Если стДанные = Неопределено Тогда
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(,,Перечисления.СтатусыЗадач.РКД);
	КонецЕсли;
	
	
	Конструктор = омСотрудники.ПолучитьКонструктораРазработки(ЗадачаРКД);
	
	ОбъектЗадача 				= ЗадачаРКД.ПолучитьОбъект(); 
	ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + ".РКД.Доработка";
	ОбъектЗадача.Дата			= ТекущаяДата();
	ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.РКД;
	ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором;
	ОбъектЗадача.Исполнитель 	= Конструктор;
	
	ОбъектЗадача.Записать();
	
	стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
	стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
	стДанные.Состояние 		= Перечисления.СостоянияЗадач.ОжиданиеКонструктором;
	
	МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ЗадачаРКД, стДанные);
	
	Если УстановитьСтадиюКомплекта Тогда
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(ЗадачаРКД);
	КонецЕсли;
	
КонецФункции // ПеревестиЗадачуВОжидание()

Функция ПеревестиЗадачуВОжиданиеСогласования(ЗадачаРКД, УстановитьСтадиюКомплекта = Ложь, стДанные = Неопределено) Экспорт
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;

	Если стДанные = Неопределено Тогда
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(,,Перечисления.СтатусыЗадач.РКД_ожидание_согласования);
	КонецЕсли;
	
	
	Конструктор = омСотрудники.ПолучитьКонструктораРазработки(ЗадачаРКД);
	
	ОбъектЗадача 				= ЗадачаРКД.ПолучитьОбъект(); 
	ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + ".РКД.ОжиданиеСогласования";
	ОбъектЗадача.Дата			= ТекущаяДата();
	ОбъектЗадача.СтатусЗадачи	= стДанные.Статус;
	ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором;
	ОбъектЗадача.Исполнитель 	= Конструктор;
	
	ОбъектЗадача.Записать();
	
	стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
	стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
	стДанные.Состояние 		= Перечисления.СостоянияЗадач.ОжиданиеКонструктором;
	
	МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ЗадачаРКД, стДанные);
	
	Если УстановитьСтадиюКомплекта Тогда
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(ЗадачаРКД);
	КонецЕсли;
	
КонецФункции // ПеревестиЗадачуВОжидание()
