Функция ПеревестиЗадачуВОжидание(ЗадачаРКД, УстановитьСтадиюКомплекта = Ложь, стДанные = Неопределено) Экспорт
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;

	Если стДанные = Неопределено Тогда
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(,,Перечисления.СтатусыЗадач.РКД);
	КонецЕсли;
	
	
	Конструктор = омСотрудники.ПолучитьКонструктораРазработки(ЗадачаРКД);
	
	ОбъектЗадача 				= ЗадачаРКД.ПолучитьОбъект(); 
	ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + ".РКД.Доработка";
	ОбъектЗадача.Дата			= ТекущаяДата();
	ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.РКД;
	ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором;
	ОбъектЗадача.Исполнитель 	= Конструктор;
	
	ОбъектЗадача.Записать();
	
	стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
	стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
	стДанные.Состояние 		= Перечисления.СостоянияЗадач.ОжиданиеКонструктором;
	
	МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ЗадачаРКД, стДанные);
	
	Если УстановитьСтадиюКомплекта Тогда
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(ЗадачаРКД);
	КонецЕсли;
	
КонецФункции // ПеревестиЗадачуВОжидание()

Функция ПеревестиЗадачуВОжиданиеСогласования(ЗадачаРКД, УстановитьСтадиюКомплекта = Ложь, стДанные = Неопределено) Экспорт
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;

	Если стДанные = Неопределено Тогда
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(,,Перечисления.СтатусыЗадач.РКД_ожидание_согласования);
	КонецЕсли;
	
	
	Конструктор = омСотрудники.ПолучитьКонструктораРазработки(ЗадачаРКД);
	
	ОбъектЗадача 				= ЗадачаРКД.ПолучитьОбъект(); 
	ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + ".РКД.ОжиданиеСогласования";
	ОбъектЗадача.Дата			= ТекущаяДата();
	ОбъектЗадача.СтатусЗадачи	= стДанные.Статус;
	ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором;
	ОбъектЗадача.Исполнитель 	= Конструктор;
	
	ОбъектЗадача.Записать();
	
	стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
	стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
	стДанные.Состояние 		= Перечисления.СостоянияЗадач.ОжиданиеКонструктором;
	
	МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(ЗадачаРКД, стДанные);
	
	Если УстановитьСтадиюКомплекта Тогда
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(ЗадачаРКД);
	КонецЕсли;
	
КонецФункции // ПеревестиЗадачуВОжидание()

Процедура ЗавершениеЗадачиРКД(Задача, стДанные = Неопределено) Экспорт
	
	ОбъектТЗ = ЗакрытьЗадачуРКД(Задача, стДанные);
	
	УИДДоскиПроизводство 	= омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
	УИДКарточка 			= омКанбанДоскиНаСервере.ПолучитьУИДКарточки(УИДДоскиПроизводство, ОбъектТЗ);
	
	Если НЕ ПустаяСтрока(УИДКарточка) Тогда
		
		Если омКанбанДоскиНаСервере.УдалитьТег(Справочники.Теги.ДосрочныйЗапускВПроизводство, УИДКарточка) Тогда
			омКанбанДоскиНаСервере.ЗаписатьТег(Справочники.Теги.ГЧ_переведен_в_рабочее, УИДКарточка);	
		КонецЕсли;
		
		Если омКанбанДоскиНаСервере.УдалитьТег(Справочники.Теги.Пересогласование, УИДКарточка) Тогда
			омКанбанДоскиНаСервере.ЗаписатьТег(Справочники.Теги.ПересогласованиеЗавершено, УИДКарточка);
			ПердыдущаяКолонка = омКанбанОбщие.ПредыдущиеСостояниеКанбана(УИДКарточка, УИДДоскиПроизводство); 
			
			Если СтрДлина(ПердыдущаяКолонка) > 3 Тогда
				
				стПараметрыПерехода = омКанбанНачальноеЗаполнение.ПолучитьСтруктуруДляЭлементовКанбана("ПереходКарточки", "Окончание согласования");
				
				стПараметрыПерехода.Доска 			= УИДДоскиПроизводство;
				стПараметрыПерехода.НомерВКолонке 	= 0;
				стПараметрыПерехода.УИДКудаКолонка 	= ПердыдущаяКолонка;
				стПараметрыПерехода.УИДКудаДорожка 	= омКанбанДоскиНаСервереПовтор.ПолучитьУИДДорожки(УИДДоскиПроизводство);
				стПараметрыПерехода.УИДКарточка 	= УИДКарточка;
				
				УИДПерехода = омКанбанНачальноеЗаполнение.СоздатьДвижениеКарточки(стПараметрыПерехода); 
			
			КонецЕсли;
			
		КонецЕсли;
		
		МассивТегов 	= Новый Массив(1);
		МассивТегов[0] 	= Справочники.Теги.Рекламация;
		
		ДанныеВПроизводстве = омКанбанДоскиНаСервере.ПолучитьКарточкиКанбанаСКолонкамиИТегами(УИДДоскиПроизводство, ОбъектТЗ, МассивТегов);
		
		Если ДанныеВПроизводстве.Количество() > 0 Тогда
			
			Если СтрДлина(ДанныеВПроизводстве[0].УИДКудаКолонка) > 10 Тогда
				
				омКанбанДоскиНаСервере.УдалитьТег(Справочники.Теги.Рекламация, 				УИДКарточка);
				омКанбанДоскиНаСервере.ЗаписатьТег(Справочники.Теги.РекламацияЗавершена, 	УИДКарточка);	
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗакрытьЗадачуРКД(ЗадачаРКД, стДанные = Неопределено, Комментарий = "", ПереместитьКарточкуПроизводстваВПриостановку = Ложь, ЗначениеТега = Неопределено) Экспорт 
	
	ОбъектЗадача 				= ЗадачаРКД.ПолучитьОбъект();
	ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ОбъектТЗ)  + ".РКД.Завершена";
	ОбъектЗадача.Дата			= ТекущаяДата();
	ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.РКД;
	ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Завершение;
	ОбъектЗадача.Выполнена      = Истина;
	
	НС = ОбъектЗадача.Комментарии.Вставить(0);
	НС.Автор 	= ПараметрыСеанса.ТекущийПользователь;
	НС.Дата 	= ОбъектЗадача.Дата;
	НС.Текст 	= Комментарий;
	
	ОбъектЗадача.Записать(); 
	
	Если стДанные = Неопределено Тогда
		стДанные = РегистрыСведений.ТаймингЗадач.ПолучитьСтруктуруДанных(,,Перечисления.СтатусыЗадач.РКД);
	КонецЕсли;

	стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
	стДанные.Состояние 		= Перечисления.СостоянияЗадач.ПустаяСсылка();
	стДанные.Статус 		= ОбъектЗадача.СтатусЗадачи;
	
	РегистрыСведений.ТаймингЗадач.УстановитьСостояниеИсполнительЗадачи(ЗадачаРКД, стДанные);
	
	Если НЕ ОбъектЗадача.НеИзменяетСтадию Тогда
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(ЗадачаРКД);
	КонецЕсли;
	
	Если ПереместитьКарточкуПроизводстваВПриостановку И омКанбанПроизводство.РесурсВПроизводстве(ОбъектЗадача.ОбъектТЗ) Тогда
		
		УИДКарточка = "";
		омКанбанПроизводство.ПеревестиКарточкуВПриостановку(ОбъектЗадача.ОбъектТЗ, , УИДКарточка);
		
		Если ЗначениеЗаполнено(ЗначениеТега) Тогда
			омКанбанДоскиНаСервере.ЗаписатьТег(ЗначениеТега, УИДКарточка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОбъектЗадача.ОбъектТЗ;
	
КонецФункции

Функция ЗакрытьРекламацию(ОбъектТЗ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рекламации.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Рекламации КАК Рекламации
		|ГДЕ
		|	Рекламации.Комплект = &Комплект
		|	И НЕ Рекламации.РКДВыполнено";
	
	Запрос.УстановитьПараметр("Комплект", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	РекламацияСсылка = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		РекламацияСсылка = Выборка.Ссылка;
		
		ОбъектРекламация 				= РекламацияСсылка.ПолучитьОбъект();
		ОбъектРекламация.РКДВыполнено 	= Истина;
		ОбъектРекламация.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
	КонецЦикла;
	
	Возврат РекламацияСсылка; 
	
КонецФункции // ЗакрытьРекламацию()

Функция ЗадачиУКонструктора(МассивКомплектов) Экспорт
	
	СтадииКомплектов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.ТипЗадачи КАК ТипЗадачи,
		|	ДанныеКомплекта.ТекущаяСтадия.ПолноеНаименование КАК ТекущаяСтадия,
		|	Задачи_ПКД.ОбъектТЗ КАК ОбъектТЗ,
		|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплекта
		|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплекта.Комплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО Задачи_ПКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|ГДЕ
		|	Задачи_ПКД.ОбъектТЗ В(&МассивКомплектов)
		|	И НЕ Задачи_ПКД.Выполнена";
	
	Запрос.УстановитьПараметр("МассивКомплектов", МассивКомплектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТипыЗакадачУКонструктора = омЗадачиПКДПовтор.ТипыЗадачКонструктора();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура("ТекущаяСтадия, ОбъектТЗ, УКонструктора", ); 
		
		ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
		
		СтруктураДанных.УКонструктора = НЕ (ТипыЗакадачУКонструктора.Найти(Выборка.ТипЗадачи) = Неопределено ИЛИ Выборка.Состояние = Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
		
		СтадииКомплектов.Добавить(СтруктураДанных); 
		
		ИндексВМассиве = МассивКомплектов.Найти(Выборка.ОбъектТЗ);
		
		Если НЕ ИндексВМассиве = Неопределено Тогда
			МассивКомплектов.Удалить(ИндексВМассиве);
		КонецЕсли;
		
		
	КонецЦикла;
	
	Если МассивКомплектов.Количество() > 0 Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Задачи_РКД.ТипЗадачи КАК ТипЗадачи,
			|	ДанныеКомплекта.ТекущаяСтадия.ПолноеНаименование КАК ТекущаяСтадия,
			|	Задачи_РКД.ОбъектТЗ КАК ОбъектТЗ,
			|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние
			|ИЗ
			|	Задача.Задачи_РКД КАК Задачи_РКД
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплекта
			|		ПО Задачи_РКД.ОбъектТЗ = ДанныеКомплекта.Комплект
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
			|		ПО Задачи_РКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
			|ГДЕ
			|	Задачи_РКД.ОбъектТЗ В(&МассивКомплектов)
			|	И НЕ Задачи_РКД.Выполнена";
		
		Запрос.УстановитьПараметр("МассивКомплектов", МассивКомплектов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураДанных = Новый Структура("ТекущаяСтадия, ОбъектТЗ, УКонструктора", ); 
			
			ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
			
			СтруктураДанных.УКонструктора = НЕ (ТипыЗакадачУКонструктора.Найти(Выборка.ТипЗадачи) = Неопределено ИЛИ Выборка.Состояние = Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
			
			СтадииКомплектов.Добавить(СтруктураДанных); 
			
			
			ИндексВМассиве = МассивКомплектов.Найти(Выборка.ОбъектТЗ);
			
			Если НЕ ИндексВМассиве = Неопределено Тогда
				МассивКомплектов.Удалить(ИндексВМассиве);
			КонецЕсли; 
			
		КонецЦикла;
		
		Если МассивКомплектов.Количество() > 0 Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеКомплекта.ТекущаяСтадия.ПолноеНаименование КАК ТекущаяСтадия,
			|	ИзделияКомплект.Ссылка КАК ОбъектТЗ
			|ИЗ
			|	Справочник.ИзделияКомплект КАК ИзделияКомплект
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплекта
			|		ПО ИзделияКомплект.Ссылка = ДанныеКомплекта.Комплект
			|ГДЕ
			|	ИзделияКомплект.Ссылка В(&МассивКомплектов)";
			
			Запрос.УстановитьПараметр("МассивКомплектов", МассивКомплектов);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				СтруктураДанных = Новый Структура("УКонструктора, ТекущаяСтадия, ОбъектТЗ", Ложь); 
				
				ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
				
				СтадииКомплектов.Добавить(СтруктураДанных); 
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтадииКомплектов;
	
КонецФункции // ЗадачиУКонструктора(МассивЗадач)
