
&НаКлиенте
Процедура ДобавитьНаименованиеОтчета(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВводаНаименованияОтчета", ЭтотОбъект);
	ПоказатьВводСтроки(Оповещение, "", "Наименование отчета", 150);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНаименованияОтчета(Результат, ДопПараметры) Экспорт

	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеОтчета = СтрЗаменить(Результат, " ", "_");
	
	Если Элементы.НаименованиеОтчета.СписокВыбора.НайтиПоЗначению(НаименованиеОтчета) = Неопределено Тогда
	
		Элементы.НаименованиеОтчета.СписокВыбора.Добавить(НаименованиеОтчета, Результат);
		Элементы.НаименованиеОтчета.СписокВыбора.СортироватьПоЗначению();
		КолонкиОтчета.Очистить();
	
	Иначе
	
		ПоказатьПредупреждение(, "Наименование отчета " + Результат + " уже существует.");	
	
	КонецЕсли;

КонецПроцедуры // ПослеВводаНаименованияОтчета()


&НаКлиенте
Процедура НаименованиеОтчетаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
