//Описание НаименованиеПараметра 
//Поле комплект пустое. НП#1 (Префикс НП НаименованиеПроекта, номер перечень наименований проектов)
//Поле комплект пустое. НК#(НомерОтчета)#(НомерКолонки)?Н в параметре НаименованиеКолонки
//Поле комплект пустое. НК#(НомерОтчета)#(НомерКолонки)?Сор в параметре Число сортровка
//Поле комплект пустое. НК#(НомерОтчета)#(НомерКолонки)?РЗ в параметре булево показывать ручные значение

&НаКлиенте
Перем ПередыдущиеНаименованиеОтчета;

&НаКлиенте
Процедура ДобавитьНаименованиеОтчета(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВводаНаименованияОтчета", ЭтотОбъект);
	ПоказатьВводСтроки(Оповещение, "", "Наименование отчета", 150);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНаименованияОтчета(Результат, ДопПараметры) Экспорт

	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ПередыдущиеНаименованиеОтчета = НаименованиеОтчета;
	НаименованиеОтчета = СтрЗаменить(Результат, " ", "_");
	
	Если Элементы.НаименованиеОтчета.СписокВыбора.НайтиПоЗначению(НаименованиеОтчета) = Неопределено Тогда
	
		Элементы.НаименованиеОтчета.СписокВыбора.Добавить(НаименованиеОтчета, Результат);
		Элементы.НаименованиеОтчета.СписокВыбора.СортироватьПоЗначению();
		
		Если НЕ ПустаяСтрока(ПередыдущиеНаименованиеОтчета) Тогда
			Отбор = Новый Структура("НаименованиеОтчета", ПередыдущиеНаименованиеОтчета);
			ПеренестиДанныеВОбщуюТаблицу(Отбор);
		КонецЕсли;
		
		ПередыдущиеНаименованиеОтчета = НаименованиеОтчета;
		
		КолонкиОтчета.Очистить();
		
	Иначе
		
		ПоказатьПредупреждение(, "Наименование отчета " + Результат + " уже существует.");	
	
	КонецЕсли;

КонецПроцедуры // ПослеВводаНаименованияОтчета()

&НаКлиенте
Процедура НаименованиеОтчетаПриИзменении(Элемент)
	
	Если ПустаяСтрока(ПередыдущиеНаименованиеОтчета) Тогда
		Отбор = Новый Структура("НаименованиеОтчета", НаименованиеОтчета); 
	Иначе	
		Отбор = Новый Структура("НаименованиеОтчета", ПередыдущиеНаименованиеОтчета);
		ПеренестиДанныеВОбщуюТаблицу(Отбор);

		Отбор.НаименованиеОтчета = НаименованиеОтчета;
	КонецЕсли;
	
	ПередыдущиеНаименованиеОтчета = НаименованиеОтчета;

	КолонкиОтчета.Очистить();
	
	Для каждого х Из КолонкиОтчетаОбщие.НайтиСтроки(Отбор) Цикл
		ЗаполнитьЗначенияСвойств(КолонкиОтчета.Добавить(), х);	
	КонецЦикла;
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПеренестиДанныеВОбщуюТаблицу(Отбор)
	
	Для каждого х Из КолонкиОтчетаОбщие.НайтиСтроки(Отбор) Цикл
		КолонкиОтчетаОбщие.Удалить(х);	
	КонецЦикла;
	
	Для каждого х Из КолонкиОтчета Цикл
		НС = КолонкиОтчетаОбщие.Добавить();
		ЗаполнитьЗначенияСвойств(НС, х);
		НС.НаименованиеОтчета = ПередыдущиеНаименованиеОтчета;
	КонецЦикла;

КонецПроцедуры // ПеренестиДанныеВОбщуюТаблицу(Отбор)

&НаКлиенте
Процедура КолонкиОтчетаПриИзменении(Элемент)
	
	ТД = Элементы.КолонкиОтчета.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ТД.Изменена = Истина;
	
	НомерКолонки = 0;
	
	Для каждого х Из КолонкиОтчета Цикл
	
		Если НЕ х.НомерКолонки = НомерКолонки Тогда
			
			х.НомерКолонки = НомерКолонки;
			х.Изменена = Истина;
			
		КонецЕсли;
		
		НомерКолонки = НомерКолонки + 1;
	
	КонецЦикла;
	
	КолонкиОтчетаПриАктивизацииСтроки(Неопределено);
	
КонецПроцедуры 

Процедура СохранитьНаСервере()
	СписокОтчетовВБазе = СохранитьНаименованиеОтчетов();
	СохранитьКолонки(СписокОтчетовВБазе);
КонецПроцедуры

Процедура СохранитьКолонки(СписокОтчетовВБазе)

	ИзмененыеОтчеты = ПолучитьИзмененыеОтчеты();
	
	Если ИзмененыеОтчеты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланДатыСрезПоследних.НаименованиеПараметра КАК НаименованиеПараметра
		|ИЗ
		|	РегистрСведений.ПланДаты.СрезПоследних(, Комплект = НЕОПРЕДЕЛЕНО) КАК ПланДатыСрезПоследних
		|ГДЕ
		|	ПланДатыСрезПоследних.Параметр <> ""&&&&""
		|	И (";
		
		
	НомерПараметра = 1;	
	Для каждого х Из ИзмененыеОтчеты Цикл
		
		х.ПрефиксКолонки = СтрЗаменить(х.НаименованиеПараметра, "П", "К") + "#";
		
		Если НомерПараметра > 1 Тогда
			Запрос.Текст = Запрос.Текст + " ИЛИ ";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|	ПланДатыСрезПоследних.НаименованиеПараметра ПОДОБНО """ +  х.ПрефиксКолонки + """";
		
	    НомерПараметра = НомерПараметра + 1;
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + ")";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	ТД = ТекущаяДатаСеанса();
	Автор = ПараметрыСеанса.ТекущийПользователь;
	Отбор = Новый Структура("Изменена", Истина);
	Для каждого х Из КолонкиОтчетаОбщие.НайтиСтроки(Отбор) Цикл
		
		НомерКолонкиСтрокой = Формат(х.НомерКолонки, "ЧН=0; ЧГ=0") + "?";

		ДанныеОтчета = ИзмененыеОтчеты.Найти(х.НаименованиеОтчета, "Параметр");
		
		ИмяПрефиксаКолонки = ДанныеОтчета.ПрефиксКолонки;
		
		МенеджерЗаписи = РегистрыСведений.ПланДаты.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Комплект = Неопределено;
		МенеджерЗаписи.Период 					= ТД;
		МенеджерЗаписи.НаименованиеПараметра 	= ИмяПрефиксаКолонки + НомерКолонкиСтрокой + "Н";
		МенеджерЗаписи.Параметр 				= х.НаименованиеКолонки;
		МенеджерЗаписи.Автор 					= Автор;
		МенеджерЗаписи.ТипКолонки 				= ?(ЗначениеЗаполнено(х.ТипКолонки), х.ТипКолонки, Перечисления.ТипыКолонок.Строка);
		МенеджерЗаписи.ТипРасчетныхЗначений 	= х.ТипРасчетногоЗначения;
		
		МенеджерЗаписи.Записать();
	
		МенеджерЗаписи = РегистрыСведений.ПланДаты.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Комплект = Неопределено;
		МенеджерЗаписи.Период = ТД;
		МенеджерЗаписи.Автор 					= Автор;
		МенеджерЗаписи.НаименованиеПараметра 	= ИмяПрефиксаКолонки + НомерКолонкиСтрокой + "Сор";
		МенеджерЗаписи.Параметр 				= х.Сортировка;
		
		МенеджерЗаписи.Записать();
	
		МенеджерЗаписи = РегистрыСведений.ПланДаты.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Комплект = Неопределено;
		МенеджерЗаписи.Период = ТД;
		МенеджерЗаписи.Автор 					= Автор;
		МенеджерЗаписи.НаименованиеПараметра 	= ИмяПрефиксаКолонки + НомерКолонкиСтрокой + "РЗ";
		МенеджерЗаписи.Параметр 				= х.ПоказыватьРучныеЗначения;
		
		МенеджерЗаписи.Записать();
	
	КонецЦикла;
	
КонецПроцедуры  

Функция ПолучитьИзмененыеОтчеты()

	ИменаОтчетов = Новый Массив;
	
	Отбор = Новый Структура("Изменена", Истина);
	
	Для каждого х Из КолонкиОтчетаОбщие.НайтиСтроки(Отбор) Цикл
	
		Если ИменаОтчетов.Найти(х.НаименованиеОтчета) = Неопределено Тогда
			ИменаОтчетов.Добавить(х.НаименованиеОтчета);
		КонецЕсли;
	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланДатыСрезПоследних.НаименованиеПараметра КАК НаименованиеПараметра,
		|	ПланДатыСрезПоследних.Параметр КАК Параметр,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(10)) КАК ПрефиксКолонки
		|ИЗ
		|	РегистрСведений.ПланДаты.СрезПоследних КАК ПланДатыСрезПоследних
		|ГДЕ
		|	ПланДатыСрезПоследних.Комплект = НЕОПРЕДЕЛЕНО
		|	И ПланДатыСрезПоследних.Параметр В(&ИменаОтчетов)";
	
	Запрос.УстановитьПараметр("ИменаОтчетов", ИменаОтчетов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьИзмененыеОтчеты()

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если ЗначениеЗаполнено(НаименованиеОтчета) Тогда
		
		Отбор = Новый Структура("НаименованиеОтчета", НаименованиеОтчета);
		ПеренестиДанныеВОбщуюТаблицу(Отбор);
		
	КонецЕсли;
	
	СохранитьНаСервере();
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПередыдущиеНаименованиеОтчета = "";
КонецПроцедуры

Функция СохранитьНаименованиеОтчетов()
	
	СписокОтчетовВБазе = Новый СписокЗначений;
	Отчеты.ОтчетМенеджера.ПолучитьНаименованияПроектов(СписокОтчетовВБазе, Истина);
	
	НовыеОтчеты 		= Новый Массив;
	ОтчетыДляУдаления 	= Новый Массив;
	
	Для каждого ЭлементБазы Из СписокОтчетовВБазе Цикл
		
		ЭлементНайден = Ложь;
		
		Для каждого ТекущийЭлементСписка Из Элементы.НаименованиеОтчета.СписокВыбора Цикл
			Если ЭлементБазы.Представление = ТекущийЭлементСписка.Представление Тогда
				ЭлементНайден = Истина;
				Прервать;
			КонецЕсли;
			
			
		КонецЦикла;
		
		Если НЕ ЭлементНайден Тогда
			ОтчетыДляУдаления.Добавить(ЭлементБазы.Значение);	
		КонецЕсли; 
		
	КонецЦикла;
	
	Для каждого ТекущийЭлементСписка Из Элементы.НаименованиеОтчета.СписокВыбора Цикл
		
		ЭлементНайден = Ложь;
		
		Для каждого ЭлементБазы Из СписокОтчетовВБазе Цикл
			Если ЭлементБазы.Представление = ТекущийЭлементСписка.Представление Тогда
				ЭлементНайден = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЭлементНайден Тогда
			НовыеОтчеты.Добавить(ТекущийЭлементСписка.Представление);	
		КонецЕсли; 
		
	КонецЦикла;
	
	НомерОтчета = СписокОтчетовВБазе.Количество() + 1;
	
	Для каждого х Из НовыеОтчеты Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПланДаты.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Автор 					= ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.Период 					= ТекущаяДатаСеанса();
		МенеджерЗаписи.Комплект 				= Неопределено;
		МенеджерЗаписи.НаименованиеПараметра 	= "НП#" + Формат(НомерОтчета, "ЧГ=0");
		МенеджерЗаписи.Параметр 				= СтрЗаменить(х, " ", "_");
	
		МенеджерЗаписи.Записать();
		СписокОтчетовВБазе.Добавить(МенеджерЗаписи.НаименованиеПараметра, МенеджерЗаписи.Параметр);
		
		НомерОтчета = НомерОтчета + 1;
		
	КонецЦикла;
	
	Возврат СписокОтчетовВБазе;
	
КонецФункции

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСПараметрамиИменаОтчетов = Новый СписокЗначений;
	Отчеты.ОтчетМенеджера.ПолучитьНаименованияПроектов(Элементы.НаименованиеОтчета.СписокВыбора, ,СписокСПараметрамиИменаОтчетов);
	ЗаполнитьОбщиеКолонки(СписокСПараметрамиИменаОтчетов);
	
КонецПроцедуры  

Процедура ЗаполнитьОбщиеКолонки(СписокСПараметрамиИменаОтчетов)
	//НК# НП# НК#1#0?РЗ
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланДатыСрезПоследних.Параметр КАК Параметр,
		|	ПланДатыСрезПоследних.НаименованиеПараметра КАК НаименованиеПараметра,
		|	ПланДатыСрезПоследних.ТипКолонки КАК ТипКолонки,
		|	ПланДатыСрезПоследних.ТипРасчетныхЗначений КАК ТипРасчетныхЗначений,
		|	ПланДатыСрезПоследних.ТипРасчетныхЗначений.ТипКолонки КАК ТипРасчетныхЗначенийТипКолонки
		|ИЗ
		|	РегистрСведений.ПланДаты.СрезПоследних КАК ПланДатыСрезПоследних
		|ГДЕ
		|	ПланДатыСрезПоследних.Комплект = НЕОПРЕДЕЛЕНО
		|	И ПланДатыСрезПоследних.Параметр <> ""&&&&""
		|	И ПланДатыСрезПоследних.НаименованиеПараметра ПОДОБНО ""НК#%""";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Отбор = Новый Структура("НаименованиеОтчета, НомерКолонки", );
		
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Отчеты.ОтчетМенеджера.ПреробразоватьПараметрКолонкиВСтруктуру(Выборка.НаименованиеПараметра, СписокСПараметрамиИменаОтчетов);
		
		Если СтруктураДанных = Неопределено Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		Отбор.НаименованиеОтчета 	= СтруктураДанных.НаименованиеОтчета;
		Отбор.НомерКолонки 			= СтруктураДанных.НомерКолонки;
		
		НайденыеСтроки = КолонкиОтчетаОбщие.НайтиСтроки(Отбор);
		
		Если НайденыеСтроки.Количество() = 0 Тогда
			НС = КолонкиОтчетаОбщие.Добавить();
			НС.НаименованиеОтчета 	= СтруктураДанных.НаименованиеОтчета;
			НС.НомерКолонки 		= СтруктураДанных.НомерКолонки;
		Иначе
		   	НС = НайденыеСтроки[0];
		КонецЕсли;
		
		Если СтруктураДанных.ТипПараметра = "Н" Тогда
			НС.НаименованиеКолонки = Выборка.Параметр;
			НС.ТипКолонки = Выборка.ТипКолонки;
			НС.ТипРасчетногоЗначения = Выборка.ТипРасчетныхЗначений;
			НС.ТипКолонки = ?(ЗначениеЗаполнено(Выборка.ТипРасчетныхЗначений), Выборка.ТипРасчетныхЗначенийТипКолонки, Выборка.ТипКолонки);
		ИначеЕсли СтруктураДанных.ТипПараметра = "Сор" Тогда
			НС.Сортировка = Выборка.Параметр;
		ИначеЕсли СтруктураДанных.ТипПараметра = "РЗ" Тогда
			НС.ПоказыватьРучныеЗначения = Выборка.Параметр;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура КолонкиОтчетаПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.КолонкиОтчета.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Элементы.КолонкиОтчетаТипКолонки.Доступность = НЕ ЗначениеЗаполнено(ТД.ТипРасчетногоЗначения);
	
КонецПроцедуры  




