//Описание НаименованиеПараметра 
//Поле комплект пустое. НП_1 (Префикс НП НаименованиеПроекта, номер перечень наименований проектов)
//Поле комплект пустое. НК_(НомерОтчета)_(НомерКолонк)_Н в параметре НаименованиеКолонки
//Поле комплект пустое. НК_(НомерОтчета)_(НомерКолонк)_ТРЗ в параметре СправочникСсылка.ТипыРасчетныхЗначений
//Поле комплект пустое. НК_(НомерОтчета)_(НомерКолонк)_Сор в параметре Число сортровка
//Поле комплект пустое. НК_(НомерОтчета)_(НомерКолонк)_РЗ в параметре булево показывать ручные значение

&НаКлиенте
Перем ПередыдущиеНаименованиеОтчета;

&НаКлиенте
Процедура ДобавитьНаименованиеОтчета(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВводаНаименованияОтчета", ЭтотОбъект);
	ПоказатьВводСтроки(Оповещение, "", "Наименование отчета", 150);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНаименованияОтчета(Результат, ДопПараметры) Экспорт

	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеОтчета = СтрЗаменить(Результат, " ", "_");
	
	Если Элементы.НаименованиеОтчета.СписокВыбора.НайтиПоЗначению(НаименованиеОтчета) = Неопределено Тогда
	
		Элементы.НаименованиеОтчета.СписокВыбора.Добавить(НаименованиеОтчета, Результат);
		Элементы.НаименованиеОтчета.СписокВыбора.СортироватьПоЗначению();
		КолонкиОтчета.Очистить();
	
	Иначе
	
		ПоказатьПредупреждение(, "Наименование отчета " + Результат + " уже существует.");	
	
	КонецЕсли;

КонецПроцедуры // ПослеВводаНаименованияОтчета()

&НаКлиенте
Процедура НаименованиеОтчетаПриИзменении(Элемент)
	
	Если ПустаяСтрока(ПередыдущиеНаименованиеОтчета) Тогда
		Отбор = Новый Структура("НаименованиеОтчета", НаименованиеОтчета);
	Иначе	
		Отбор = Новый Структура("НаименованиеОтчета", ПередыдущиеНаименованиеОтчета);
		ПеренестиДанныеВОбщуюТаблицу(Отбор);

		Отбор.НаименованиеОтчета = НаименованиеОтчета;
	КонецЕсли;
	
	КолонкиОтчета.Очистить();
	
	Для каждого х Из КолонкиОтчетаОбщие.НайтиСтроки(Отбор) Цикл
		ЗаполнитьЗначенияСвойств(КолонкиОтчета.Добавить(), х);	
	КонецЦикла;
	
	ПередыдущиеНаименованиеОтчета = НаименованиеОтчета;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПеренестиДанныеВОбщуюТаблицу(Отбор)
	
	Для каждого х Из КолонкиОтчетаОбщие.НайтиСтроки(Отбор) Цикл
		КолонкиОтчетаОбщие.Удалить(х);	
	КонецЦикла;
	
	Для каждого х Из КолонкиОтчета Цикл
		НС = КолонкиОтчетаОбщие.Добавить();
		ЗаполнитьЗначенияСвойств(НС, х);
		НС.НаименованиеОтчета = НаименованиеОтчета;
	КонецЦикла;

КонецПроцедуры // ПеренестиДанныеВОбщуюТаблицу(Отбор)


&НаКлиенте
Процедура КолонкиОтчетаПриИзменении(Элемент)
	
	ТД = Элементы.КолонкиОтчета.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ТД.Изменена = Истина;
	
	НомерКолонки = 0;
	
	Для каждого х Из КолонкиОтчета Цикл
	
		Если НЕ х.НомерКолонки = НомерКолонки Тогда
			
			х.НомерКолонки = НомерКолонки;
			х.Изменена = Истина;
			
		КонецЕсли;
		
		НомерКолонки = НомерКолонки + 1;
	
	КонецЦикла;
	
КонецПроцедуры 

Функция ПолучитьНаименованияПроектов(СписокВыбора, ПоказатьВсе = Ложь)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланДатыСрезПоследних.Параметр КАК Параметр,
		|	ПланДатыСрезПоследних.НаименованиеПараметра КАК НаименованиеПараметра
		|ИЗ
		|	РегистрСведений.ПланДаты.СрезПоследних КАК ПланДатыСрезПоследних
		|ГДЕ
		|	ПланДатыСрезПоследних.Комплект = НЕОПРЕДЕЛЕНО
		|	И ПланДатыСрезПоследних.Параметр <> """"
		|	И ПланДатыСрезПоследних.НаименованиеПараметра ПОДОБНО ""НП_%""
		|
		|УПОРЯДОЧИТЬ ПО
		|	Параметр";
	
	Если ПоказатьВсе Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПланДатыСрезПоследних.Параметр <> """"", "");	
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(?(ПоказатьВсе, Выборка.НаименованиеПараметра, Выборка.Параметр), СтрЗаменить(Выборка.Параметр, "_", " "));
	КонецЦикла;
	
КонецФункции // ПолучитьНаименованияПроектов()

Процедура СохранитьНаСервере()
	СписокОтчетовВБазе = СохранитьНаименованиеОтчетов();
	СохранитьКолонки(СписокОтчетовВБазе);
КонецПроцедуры

Процедура СохранитьКолонки(СписокОтчетовВБазе)

	ИзмененыеОтчеты = ПолучитьИзмененыеОтчеты();	

КонецПроцедуры  

Функция ПолучитьИзмененыеОтчеты()

	ИменаОтчетов = Новый Массив;
	
	Отбор = Новый Структура("Изменена", Истина);
	
	Для каждого х Из КолонкиОтчетаОбщие.НайтиСтроки(Отбор) Цикл
	
		ИмяОтчета = СтрЗаменить(х.НаименованиеОтчета, " ", "_");
		
		Если ИменаОтчетов.Найти(ИмяОтчета) = Неопределено Тогда
			ИменаОтчетов.Добавить(ИмяОтчета);
		КонецЕсли;
	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланДатыСрезПоследних.НаименованиеПараметра КАК НаименованиеПараметра,
		|	ПланДатыСрезПоследних.Параметр КАК Параметр
		|ИЗ
		|	РегистрСведений.ПланДаты.СрезПоследних КАК ПланДатыСрезПоследних
		|ГДЕ
		|	ПланДатыСрезПоследних.Комплект = НЕОПРЕДЕЛЕНО
		|	И ПланДатыСрезПоследних.Параметр В(&ИменаОтчетов)";
	
	Запрос.УстановитьПараметр("ИменаОтчетов", ИменаОтчетов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	

КонецФункции // ПолучитьИзмененыеОтчеты()


&НаКлиенте
Процедура Сохранить(Команда)
	
	Если ЗначениеЗаполнено(НаименованиеОтчета) Тогда
		
		Отбор = Новый Структура("НаименованиеОтчета", НаименованиеОтчета);
		ПеренестиДанныеВОбщуюТаблицу(Отбор);
		
	КонецЕсли;
	
	СохранитьНаСервере();
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПередыдущиеНаименованиеОтчета = "";
КонецПроцедуры

Функция СохранитьНаименованиеОтчетов()
	
	СписокОтчетовВБазе = Новый СписокЗначений;
	ПолучитьНаименованияПроектов(СписокОтчетовВБазе, Истина);
	
	НовыеОтчеты 		= Новый Массив;
	ОтчетыДляУдаления 	= Новый Массив;
	
	Для каждого ЭлементБазы Из СписокОтчетовВБазе Цикл
		
		ЭлементНайден = Ложь;
		
		Для каждого ТекущийЭлементСписка Из Элементы.НаименованиеОтчета.СписокВыбора Цикл
			Если ЭлементБазы.Представление = ТекущийЭлементСписка.Представление Тогда
				ЭлементНайден = Истина;
				Прервать;
			КонецЕсли;
			
			
		КонецЦикла;
		
		Если НЕ ЭлементНайден Тогда
			ОтчетыДляУдаления.Добавить(ЭлементБазы.Значение);	
		КонецЕсли; 
		
	КонецЦикла;
	
	Для каждого ТекущийЭлементСписка Из Элементы.НаименованиеОтчета.СписокВыбора Цикл
		
		ЭлементНайден = Ложь;
		
		Для каждого ЭлементБазы Из СписокОтчетовВБазе Цикл
			Если ЭлементБазы.Представление = ТекущийЭлементСписка.Представление Тогда
				ЭлементНайден = Истина;
				Прервать;
			КонецЕсли;
			
			
		КонецЦикла;
		
		Если НЕ ЭлементНайден Тогда
			НовыеОтчеты.Добавить(ТекущийЭлементСписка.Представление);	
		КонецЕсли; 
		
	КонецЦикла;
	
	НомерОтчета = СписокОтчетовВБазе.Количество() + 1;
	
	Для каждого х Из НовыеОтчеты Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПланДаты.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Автор 					= ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.Период 					= ТекущаяДатаСеанса();
		МенеджерЗаписи.Комплект 				= Неопределено;
		МенеджерЗаписи.НаименованиеПараметра 	= "НП_" + Формат(НомерОтчета, "ЧГ=0");
		МенеджерЗаписи.Параметр 				= СтрЗаменить(х, " ", "_");
	
		МенеджерЗаписи.Записать();
		
		НомерОтчета = НомерОтчета + 1;
		
	КонецЦикла;
	
	Возврат СписокОтчетовВБазе;
	
КонецФункции

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьНаименованияПроектов(Элементы.НаименованиеОтчета.СписокВыбора);
КонецПроцедуры


