//Описание НаименованиеПараметра 
//Поле комплект пустое. НП_1 (Префикс НП НаименованиеПроекта, номер перечень наименований проектов)
//Поле комплект пустое. НП_(НомерОтчета)_НК(НомерКолонк)_Н в параметре НаименованиеКолонки
//Поле комплект пустое. НП_(НомерОтчета)_НК(НомерКолонк)_ТРЗ в параметре СправочникСсылка.ТипыРасчетныхЗначений
//Поле комплект пустое. НП_(НомерОтчета)_НК(НомерКолонк)_Сор в параметре Число сортровка
//Поле комплект пустое. НП_(НомерОтчета)_НК(НомерКолонк)_РЗ в параметре булево показывать ручные значение

&НаКлиенте
Перем ПередыдущиеНаименованиеОтчета;

&НаКлиенте
Процедура ДобавитьНаименованиеОтчета(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВводаНаименованияОтчета", ЭтотОбъект);
	ПоказатьВводСтроки(Оповещение, "", "Наименование отчета", 150);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНаименованияОтчета(Результат, ДопПараметры) Экспорт

	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеОтчета = СтрЗаменить(Результат, " ", "_");
	
	Если Элементы.НаименованиеОтчета.СписокВыбора.НайтиПоЗначению(НаименованиеОтчета) = Неопределено Тогда
	
		Элементы.НаименованиеОтчета.СписокВыбора.Добавить(НаименованиеОтчета, Результат);
		Элементы.НаименованиеОтчета.СписокВыбора.СортироватьПоЗначению();
		КолонкиОтчета.Очистить();
	
	Иначе
	
		ПоказатьПредупреждение(, "Наименование отчета " + Результат + " уже существует.");	
	
	КонецЕсли;

КонецПроцедуры // ПослеВводаНаименованияОтчета()

&НаКлиенте
Процедура НаименованиеОтчетаПриИзменении(Элемент)
	
	Если ПустаяСтрока(ПередыдущиеНаименованиеОтчета) Тогда
		Отбор = Новый Структура("НаименованиеОтчета", НаименованиеОтчета);
	Иначе	
		Отбор = Новый Структура("НаименованиеОтчета", ПередыдущиеНаименованиеОтчета);
		
		Для каждого х Из КолонкиОтчетаОбщие.НайтиСтроки(Отбор) Цикл
			КолонкиОтчетаОбщие.Удалить(х);	
		КонецЦикла;
		
		Для каждого х Из КолонкиОтчета Цикл
			НС = КолонкиОтчетаОбщие.Добавить();
			ЗаполнитьЗначенияСвойств(НС, х);
			НС.НаименованиеОтчета = ПередыдущиеНаименованиеОтчета;
		КонецЦикла;
		
	   Отбор.НаименованиеОтчета = НаименованиеОтчета;
	КонецЕсли;
	
	КолонкиОтчета.Очистить();
	
	Для каждого х Из КолонкиОтчетаОбщие.НайтиСтроки(Отбор) Цикл
		ЗаполнитьЗначенияСвойств(КолонкиОтчета.Добавить(), х);	
	КонецЦикла;
	
	ПередыдущиеНаименованиеОтчета = НаименованиеОтчета;
	
КонецПроцедуры

&НаКлиенте
Процедура КолонкиОтчетаПриИзменении(Элемент)
	
	ТД = Элементы.КолонкиОтчета.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ТД.Изменена = Истина;
	
КонецПроцедуры 

Функция ПолучитьНаименованияПроектов(СписокВыбора, ПоказатьВсе = Ложь)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланДатыСрезПоследних.Параметр КАК Параметр,
		|	ПланДатыСрезПоследних.НаименованиеПараметра КАК НаименованиеПараметра
		|ИЗ
		|	РегистрСведений.ПланДаты.СрезПоследних КАК ПланДатыСрезПоследних
		|ГДЕ
		|	ПланДатыСрезПоследних.Комплект = НЕОПРЕДЕЛЕНО
		|	И ПланДатыСрезПоследних.Параметр <> """"
		|	И ПланДатыСрезПоследних.НаименованиеПараметра ПОДОБНО ""НП_%""
		|
		|УПОРЯДОЧИТЬ ПО
		|	Параметр";
	
	Если ПоказатьВсе Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПланДатыСрезПоследних.Параметр <> """"", "");	
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(?(ПоказатьВсе, Выборка.НаименованиеПараметра, Выборка.Параметр), СтрЗаменить(Выборка.Параметр, "_", " "));
	КонецЦикла;
	
КонецФункции // ПолучитьНаименованияПроектов()


&НаСервере
Процедура СохранитьНаСервере()
	СохранитьНаименованиеОтчетов();
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПередыдущиеНаименованиеОтчета = "";
КонецПроцедуры


Процедура СохранитьНаименованиеОтчетов()
	
	СписокОтчетовВБазе = Новый СписокЗначений;
	ПолучитьНаименованияПроектов(СписокОтчетовВБазе, Истина);
	
	НовыеОтчеты 		= Новый Массив;
	ОтчетыДляУдаления 	= Новый Массив;
	
	Для каждого ЭлементБазы Из СписокОтчетовВБазе Цикл
		
		ЭлементНайден = Ложь;
		
		Для каждого ТекущийЭлементСписка Из Элементы.НаименованиеОтчета.СписокВыбора Цикл
			Если ЭлементБазы.Представление = ТекущийЭлементСписка.Представление Тогда
				ЭлементНайден = Истина;
				Прервать;
			КонецЕсли;
			
			
		КонецЦикла;
		
		Если НЕ ЭлементНайден Тогда
			ОтчетыДляУдаления.Добавить(ЭлементБазы.Значение);	
		КонецЕсли; 
		
	КонецЦикла;
	
	Для каждого ТекущийЭлементСписка Из Элементы.НаименованиеОтчета.СписокВыбора Цикл
		
		ЭлементНайден = Ложь;
		
		Для каждого ЭлементБазы Из СписокОтчетовВБазе Цикл
			Если ЭлементБазы.Представление = ТекущийЭлементСписка.Представление Тогда
				ЭлементНайден = Истина;
				Прервать;
			КонецЕсли;
			
			
		КонецЦикла;
		
		Если НЕ ЭлементНайден Тогда
			НовыеОтчеты.Добавить(ТекущийЭлементСписка.Представление);	
		КонецЕсли; 
		
	КонецЦикла;
	
	НомерОтчета = СписокОтчетовВБазе.Количество() + 1;
	
	Для каждого х Из НовыеОтчеты Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПланДаты.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Автор 					= ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.Период 					= ТекущаяДатаСеанса();
		МенеджерЗаписи.Комплект 				= Неопределено;
		МенеджерЗаписи.НаименованиеПараметра 	= "НП_" + Формат(НомерОтчета, "ЧГ=0");
		МенеджерЗаписи.Параметр 				= СтрЗаменить(х, " ", "_");
	
		МенеджерЗаписи.Записать();
		
		НомерОтчета = НомерОтчета + 1;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьНаименованияПроектов(Элементы.НаименованиеОтчета.СписокВыбора);
КонецПроцедуры


