Функция ОтправкаВзаимодействиеНаПочту(Взаимодействие, ТекущийИсполнитель) Экспорт

	СписокАдресов = омРабочийСтол.СписокАдресовДляОтправкиВзаимодействия(ТекущийИсполнитель);
	
	Если ПустаяСтрока(СписокАдресов) Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	МассивЕмайлов = СтрРазделить(СписокАдресов, ";");
	
	СтруктураПараметров = ПолучитьСтруктуруДляОтправкиПисьма();
	
	Для каждого ТекущаяНастройка Из омВзаимодействиеСерверПовтор.ПолучитьНастройкиОтправкиСообщения() Цикл
		
		Если ТекущаяНастройка.Представление = "УчетнаяЗаписьОтправкиСообщения" Тогда
			СтруктураПараметров.УчетнаяЗапись = ТекущаяНастройка.Значение;
		ИначеЕсли ТекущаяНастройка.Представление = "ТемаОтправкиСообщения" Тогда
			СтруктураПараметров.Тема = ТекущаяНастройка.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиОбщие.Сообщение КАК СообщениеЗадачи,
		|	ЗадачиОбщие.Автор.Наименование КАК АвторНаименование,
		|	ЗадачиОбщие.Дата КАК Дата,
		|	ЗадачиОбщие.ОжидаемаяДатаВыполнения КАК ОжидаемаяДатаВыполнения,
		|	ЗадачиОбщие.КартинкаЕсть КАК КартинкаЕсть,
		|	ЕСТЬNULL(КартинкиНоменклатуры.ИмяФайла, """") КАК ИмяФайла
		|ИЗ
		|	Задача.ЗадачиОбщие КАК ЗадачиОбщие
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КартинкиНоменклатуры КАК КартинкиНоменклатуры
		|		ПО (КартинкиНоменклатуры.ИзделиеЭлемент = ЗадачиОбщие.Ссылка)
		|ГДЕ
		|	ЗадачиОбщие.Ссылка = &Взаимодействие";
	
	Запрос.УстановитьПараметр("Взаимодействие", Взаимодействие);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураПараметров.ТексПисьма = Формат(Выборка.Дата, "ДЛФ=DDT") + Символы.ВК +
		Выборка.СообщениеЗадачи + Символы.ВК + Выборка.АвторНаименование;
		
		Если Выборка.КартинкаЕсть Тогда
			КлючКартинки = РегистрыСведений.КартинкиНоменклатуры.СоздатьКлючЗаписи(Новый Структура("ИзделиеЭлемент", Взаимодействие));
			АдресКартинки = ПолучитьНавигационнуюСсылку(КлючКартинки, "Картинка");
		КонецЕсли;  
		
	КонецЦикла;
	
    ОтправитьСообщение(СтруктураПараметров, МассивЕмайлов);
	
КонецФункции // ТеребуетсяОтправкаВзаимодействиеНаПочту()


Функция ПолучитьСтруктуруДляОтправкиПисьма() Экспорт

	СтруктураПараметров = Новый Структура("ИспользоватьОтчет, СобытиеОповещения, УчетнаяЗапись, Шаблон, Тема", );
	СтруктураПараметров.Вставить("Автор", 			Пользователи.ТекущийПользователь());
	СтруктураПараметров.Вставить("Ответственный", 	СтруктураПараметров.Автор);
	СтруктураПараметров.Вставить("АдресКартинки", 	Неопределено);
	СтруктураПараметров.Вставить("ТексПисьма", 		"");
	СтруктураПараметров.Вставить("ИмяКартинки", 	"");
	
	Возврат СтруктураПараметров;

КонецФункции // ПолучитьСтруктуруДляОтправвкиПисьма()     


Функция ОтправитьСообщение(СтруктураПараметров, МассивЕмайлов) Экспорт

	Письмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
	
	Письмо.Автор            = СтруктураПараметров.Автор;
	Письмо.Ответственный	= СтруктураПараметров.Ответственный;
	Письмо.Тема             = СтруктураПараметров.Тема;
	Письмо.Текст			= СтруктураПараметров.ТексПисьма;
	Письмо.Дата             = ТекущаяДатаСеанса();
	
	ТипСтрока = Тип("Строка");
	
	Для каждого х Из МассивЕмайлов Цикл
	
		НС 					= Письмо.ПолучателиПисьма.Добавить();
		
		Если ТипСтрока = ТипЗнч(х) Тогда
			
			НС.Адрес 			= х;
			
		Иначе
			
			НС.Адрес 			= х.E_mail;
			НС.Представление 	= х.ПредставлениеE_mail;
			
		КонецЕсли;
	
	КонецЦикла;
	
	ИмяФайла = "";
	
	Если СтруктураПараметров.ИспользоватьОтчет = Перечисления.ОтчетыБазы.СостояниеПроекта Тогда
		АдресОтчета = Отчеты.СостояниеПроекта.ПолучитьФайлНаСервере(, ИмяФайла);
	Иначе
		АдресОтчета = Неопределено;
	КонецЕсли;
	
	ПараметрыПисьма = Новый Структура;

	Взаимодействия.ДобавитьВПараметрАдресатов(Письмо, ПараметрыПисьма,"Кому",         "ПолучателиПисьма");
	Взаимодействия.ДобавитьВПараметрАдресатов(Письмо, ПараметрыПисьма,"Копии",        "ПолучателиКопий");
	Взаимодействия.ДобавитьВПараметрАдресатов(Письмо, ПараметрыПисьма,"СкрытыеКопии", "ПолучателиСкрытыхКопий");
	Взаимодействия.ДобавитьВПараметрАдресатов(Письмо, ПараметрыПисьма,"АдресОтвета",  "ПолучателиОтвета");
	
	ПараметрыПисьма.Вставить("Тема", Письмо.Тема);
	ПараметрыПисьма.Вставить("Тело", ?(Письмо.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст,
	                                   Письмо.Текст, Письмо.ТекстHTML));
	ПараметрыПисьма.Вставить("Кодировка", Письмо.Кодировка);
	ПараметрыПисьма.Вставить("Важность",  УправлениеЭлектроннойПочтой.ПолучитьВажность(Письмо.Важность));
	ПараметрыПисьма.Вставить("ТипТекста", Письмо.ТипТекста);
	
	Если Не ПустаяСтрока(Письмо.ИдентификаторыОснований) Тогда
		ПараметрыПисьма.Вставить("ИдентификаторыОснований", Письмо.ИдентификаторыОснований);
	КонецЕсли;
	
	МассивВложений = Новый Массив;
	
	ПараметрыПисьма.Вставить("Вложения", МассивВложений);
	ПараметрыПисьма.Вставить("ОбрабатыватьТексты", Ложь);
	
	ПараметрыПисьма.Вставить("УведомитьОДоставке", Письмо.УведомитьОДоставке); 
	ПараметрыПисьма.Вставить("УведомитьОПрочтении", Письмо.УведомитьОПрочтении);
	
	ПараметрыПисьма.Вставить("АдресОтвета", "");
	ПараметрыПисьма.Вставить("Картинки", Новый Массив);
	ПараметрыПисьма.Вставить("Вложения", Новый Массив);
	
	ПараметрыДоставки = РассылкаОтчетов.ПараметрыДоставки();
	ПараметрыДоставки.Получатели = Новый Соответствие;
	
	Для каждого х Из МассивЕмайлов Цикл    
	
		Если ТипСтрока = ТипЗнч(х) Тогда
			ПараметрыДоставки.Получатели.Вставить("", 					 х);
		Иначе
			ПараметрыДоставки.Получатели.Вставить(х.ПредставлениеE_mail, х.E_mail);
		КонецЕсли;
	
	КонецЦикла;
	
	Сообщение1 = РассылкаОтчетов.ПараметрыСообщенияДляПодсистемыВзаимодействия(ПараметрыДоставки, ПараметрыПисьма);
	
	Если ЗначениеЗаполнено(АдресОтчета) Тогда
		
		СтрокаВложение 								= Сообщение1.Вложения.Добавить();
		СтрокаВложение.АдресВоВременномХранилище 	= АдресОтчета;
		СтрокаВложение.Представление 				= ИмяФайла;
	
	КонецЕсли;
	
	Если НЕ СтруктураПараметров.АдресКартинки = Неопределено Тогда
		
		СтрокаВложение 								= Сообщение1.Вложения.Добавить();
		СтрокаВложение.АдресВоВременномХранилище 	= СтруктураПараметров.АдресКартинки;
		СтрокаВложение.Представление 				= СтруктураПараметров.ИмяКартинки;
	
	КонецЕсли;
	
	РезультатОтправки = Взаимодействия.СоздатьПисьмо(Сообщение1, СтруктураПараметров.УчетнаяЗапись, Истина);
	

КонецФункции // ОтправитьСообщение()

