
Функция УстановитьСтадиюКомплекта(Задача) Экспорт
	
	стТекущиеСостояние = ТекущиеСостояниеЗадачи(Задача);	
	НоваяСтадия = ПолучитьСтадиюКомплеткаНаОснованииПараметров(стТекущиеСостояние);
	
	Если ЗначениеЗаполнено(НоваяСтадия) Тогда
		
		стПараметры = Новый Структура("Комплект, Конструктор, ТекущаяСтадия", стТекущиеСостояние.ОбъектТЗ, "", НоваяСтадия);
		РегистрыСведений.ДанныеКомплекта.ИзменитьДанныеКомплекта(стПараметры);
		
	КонецЕсли;
	
КонецФункции // УстановитьСтадиюКомплетка(Задача)

Функция ПолучитьСтадиюКомплеткаНаОснованииПараметров(стТекущиеСостояние)

	СтадияКомплекта = Справочники.СтадииКомплекта.ПустаяСсылка();
	
	тзСтадии = омЗадачиПКДПовтор.ПолучитьСтадииКомплектов();
	
	стОтбор = Новый Структура("Статус, ТипЗадачи, Состояние"
								, стТекущиеСостояние.ТекущийСтатус
								, стТекущиеСостояние.ТекущийТипЗадачи
								, стТекущиеСостояние.ТекущиеСостояние); 
								
								
    НайденыеСтроки = тзСтадии.НайтиСтроки(стОтбор);
	
	Если НайденыеСтроки.Количество() > 0 Тогда
		Возврат НайденыеСтроки[0].Стадия;	
	КонецЕсли;
	
	стОтбор.Состояние = Перечисления.СостоянияЗадач.ПустаяСсылка();
								
    НайденыеСтроки = тзСтадии.НайтиСтроки(стОтбор);
	
	Если НайденыеСтроки.Количество() > 0 Тогда
		Возврат НайденыеСтроки[0].Стадия;	
	КонецЕсли;
	
	стОтбор.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПустаяСсылка();
								
    НайденыеСтроки = тзСтадии.НайтиСтроки(стОтбор);
	
	Если НайденыеСтроки.Количество() > 0 Тогда
		Возврат НайденыеСтроки[0].Стадия;	
	КонецЕсли;
	
	стОтбор.Статус = Перечисления.СтатусыЗадач.ПустаяСсылка();
								
    НайденыеСтроки = тзСтадии.НайтиСтроки(стОтбор);
	
	Если НайденыеСтроки.Количество() > 0 Тогда
		Возврат НайденыеСтроки[0].Стадия;	
	КонецЕсли;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка();

КонецФункции // ПолучитьСтадиюКомплеткаНаОснованииПараметров(Задача)

Функция ТекущиеСостояниеЗадачи(Задача)

	стТекущиеСостояние = Новый Структура("ТекущиеСостояние, ТекущийТипЗадачи, ТекущийСтатус, ОбъектТЗ", );
	
	Если ТипЗнч(Задача) = Тип("Строка") Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КанбанКолонки.Статус КАК Статус,
			|	КанбанКарточки.Ресурс КАК Ресурс
			|ИЗ
			|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКолонки КАК КанбанКолонки
			|			ПО КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = КанбанКолонки.УИД
			|		ПО КанбанКарточки.УИД = КанбанПереходКарточкиСрезПоследних.УИДКарточка
			|ГДЕ
			|	КанбанКарточки.УИД = &УИД";
		
		Запрос.УстановитьПараметр("УИД", Задача);  // Строковый УИД карточки каебана
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			стТекущиеСостояние.ТекущийСтатус 	= Выборка.Статус;	
			стТекущиеСостояние.ОбъектТЗ 		= Выборка.Ресурс;	
		КонецЦикла;
	
	Иначе //Задача
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаймингЗадач.Состояние КАК ТекущиеСостояние,
			|	ТаймингЗадач.Задача.ТипЗадачи КАК ТекущийТипЗадачи,
			|	ТаймингЗадач.Задача.ОбъектТЗ КАК ОбъектТЗ,
			|	ТаймингЗадач.Задача.СтатусЗадачи КАК ТекущийСтатус
			|ИЗ
			|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадач
			|ГДЕ
			|	ТаймингЗадач.Задача = &Задача";	
		
		Запрос.УстановитьПараметр("Задача", Задача);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(стТекущиеСостояние, Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат стТекущиеСостояние;
		
КонецФункции // ТекущиеСостояниеЗадачи()

Процедура ПроверкаОбобщеннойЗадачи(Задача) Экспорт

    Если ТипЗнч(Задача) = Тип("Массив") Тогда
	
		ПроверитьМассивЗадач(Задача);	
	
	Иначе
	
		ПроверитьЕдинственнуюЗадачу(Задача);	
	
	КонецЕсли;
	

КонецПроцедуры // ПроверкаОбобщеннойЗадачи()

Процедура ПроверитьМассивЗадач(мЗадач, мОбработанныеКомпозиции = Неопределено)
	
	ТипКомпозиция = Тип("СправочникСсылка.Композиции");
	Если мОбработанныеКомпозиции = Неопределено Тогда
		мОбработанныеКомпозиции = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Задачи_ПКД.ОбъектТЗ КАК ОбъектТЗ,
	|	Задачи_ПКД.ОбобщеннаяЗадача КАК ОбобщеннаяЗадача,
	|	Задачи_ПКД.Ссылка КАК Ссылка,
	|	Задачи_ПКД.Композиция КАК Композиция,
	|	ТИПЗНАЧЕНИЯ(Задачи_ПКД.ОбъектТЗ) КАК Тип
	|ИЗ
	|	Задача.Задачи_ПКД КАК Задачи_ПКД
	|ГДЕ
	|	Задачи_ПКД.Ссылка В(&мЗадач)";
	
	Запрос.УстановитьПараметр("мЗадач", мЗадач);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	мКомпозиции = Новый Массив;
	мКомплекты 	= Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Если ТипКомпозиция = Выборка.Тип Тогда
			
			Если мОбработанныеКомпозиции.Найти(Выборка.ОбъектТЗ) = Неопределено Тогда
				
				мОбработанныеКомпозиции.Добавить(Выборка.ОбъектТЗ);	
				мКомпозиции.Добавить(Выборка.ОбъектТЗ);	
				
			КонецЕсли;
			
		Иначе
			
			мКомплекты.Добавить(Выборка.ОбъектТЗ);	
			
		КонецЕсли;		
	КонецЦикла;
	
	ПроверитьМассивКомпозиций(мКомпозиции, мОбработанныеКомпозиции);
	ПроверитьМассивКомплектов(мКомплекты);
	
КонецПроцедуры

Процедура ПроверитьМассивКомплектов(мКомплекты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Задача
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект В (&мКомплекты)) КАК ДанныеКомплектаСрезПоследних
		|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	НЕ ДанныеКомплектаСрезПоследних.Конструктор = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|	И (ДанныеКомплектаСрезПоследних.Конструктор = ДанныеКомплектаСрезПоследних.Конструктор
		|				И НЕ Задачи_ПКД.ОбобщеннаяЗадача
		|			ИЛИ НЕ ДанныеКомплектаСрезПоследних.Конструктор = ДанныеКомплектаСрезПоследних.Конструктор
		|				И Задачи_ПКД.ОбобщеннаяЗадача)";
	
	Запрос.УстановитьПараметр("мКомплекты", мКомплекты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбъектЗадача = Выборка.Задача.ПолучитьОбъект();
		ОбъектЗадача.ОбобщеннаяЗадача = НЕ ОбъектЗадача.ОбобщеннаяЗадача;
		
		ОбъектЗадача.ДополнительныеСвойства.Вставить("НеПроверятьОбобщеность", Истина);
		ОбъектЗадача.Записать();                                            	
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ПроверитьМассивКомпозиций(мКомпозиции, мОбработанныеКомпозиции)
	
	
	
КонецПроцедуры 
 
Процедура ПроверитьЕдинственнуюЗадачу(Задача)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.ОбъектТЗ КАК ОбъектТЗ,
		|	Задачи_ПКД.Композиция КАК Композиция,
		|	Задачи_ПКД.ОбобщеннаяЗадача КАК ОбобщеннаяЗадача
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.Ссылка = &Задача";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИзменитьОбобщение = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.ОбъектТЗ) = Тип("СправочникСсылка.Композиции") Тогда
			ИзменитьОбобщение = Выборка.ОбобщеннаяЗадача;
			мЗадачиКомплекты = ПолучитьПодчиненыеКомплекты(Выборка.ОбъектТЗ);
			мОбработанныеКомпозиции = Новый Массив;
			мОбработанныеКомпозиции.Добавить(Выборка.ОбъектТЗ);
			
			ПроверитьМассивЗадач(мЗадачиКомплекты, мОбработанныеКомпозиции);
			
		ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.Композиция) Тогда
			ИзменитьОбобщение = Выборка.ОбобщеннаяЗадача;
		Иначе
			мКонструкторы = ПолучитьКонстукторов(Выборка.Композиция, Задача.ОбъектТЗ);
			
			КонструкторКомпозиции 	= мКонструкторы[0];
			КонструкторКомплекта	= мКонструкторы[1];
			
			Если КонструкторКомплекта = КонструкторКомпозиции Тогда
				ИзменитьОбобщение = НЕ Выборка.ОбобщеннаяЗадача;
			Иначе
				ИзменитьОбобщение = Выборка.ОбобщеннаяЗадача;
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИзменитьОбобщение Тогда
		
		ОбъектЗадача = Задача.ПолучитьОбъект();
		ОбъектЗадача.ОбобщеннаяЗадача = НЕ ОбъектЗадача.ОбобщеннаяЗадача;
		
		ОбъектЗадача.ДополнительныеСвойства.Вставить("НеПроверятьОбобщеность", Истина);
		ОбъектЗадача.Записать();                                            	
		
	КонецЕсли;
	
КонецПроцедуры 

Функция ПолучитьПодчиненыеКомплекты(Композиция)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.Композиция = &Композиция
		|	И Задачи_ПКД.ОбъектТЗ <> &Композиция";
	
	Запрос.УстановитьПараметр("Композиция", Композиция);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьКонстукторов(Композиция, ОбъектТЗ)
	
	мКонструкторы = Новый Массив(2);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплекта.Конструктор КАК Конструктор
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплекта
		|ГДЕ
		|	ДанныеКомплекта.Комплект = &Композиция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеКомплекта.Конструктор КАК Конструктор
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплекта
		|ГДЕ
		|	ДанныеКомплекта.Комплект = &ОбъектТЗ";
	
	Запрос.УстановитьПараметр("Композиция", Композиция);
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		мКонструкторы[0] = Выборка.Конструктор;	
	
	КонецЦикла;
	
	Выборка = Результат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		мКонструкторы[1] = Выборка.Конструктор;	
	
	КонецЦикла;
	
	Возврат мКонструкторы;
	
КонецФункции // ПолучитьКонстукторов(Выборка.Композиция, мКомплекты)

