
&НаКлиенте
Процедура СделкаПриИзменении(Элемент)
	СделкаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СделкаПриИзмененииНаСервере()
	Список.Параметры.УстановитьЗначениеПараметра("Проект",ЭтаФорма.Проект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Проект") Тогда
		
		Проект 							= Параметры.Проект;
		Элементы.Проект.ТолькоПросмотр 	= Истина;
		
		Список.Параметры.УстановитьЗначениеПараметра("Проект",ЭтаФорма.Параметры.Проект);
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		
	КонецЕсли;

	Если Параметры.Свойство("НеПоказыватьГЧ") Тогда
		
		Список.Параметры.УстановитьЗначениеПараметра("НеПоказыватьГЧ",			Истина);
		Список.Параметры.УстановитьЗначениеПараметра("СписокГЧНеПоказывать",	Параметры.НеПоказыватьГЧ);
		
	Иначе
		
		Список.Параметры.УстановитьЗначениеПараметра("НеПоказыватьГЧ",			Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("СписокГЧНеПоказывать",	Новый Массив);
		
	КонецЕсли;
	
КонецПроцедуры
