
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ПриемНаРаботу.Записывать = Истина;
	Движение 			= Движения.ПриемНаРаботу.Добавить();
	Движение.Период 	= ДатаПриема;
	Движение.Сотрудник 	= Сотрудник;
	Движение.Работает 	= Истина;
	
	МенеджерЗаписи = РегистрыСведений.Подразделения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период 				= ДатаПриема;
	МенеджерЗаписи.НомерСтрокиТаблицы 	= 1;
	МенеджерЗаписи.Сотрудник 			= Сотрудник;
	МенеджерЗаписи.Подразделение 		= Подразделение;
	
    МенеджерЗаписи.Записать();
КонецПроцедуры

