&НаКлиенте
Процедура ПриОкончанииРедактированияИнтервала(Элемент, Интервал, ОтменаРедактирования) Экспорт
	
	Интервал.Начало = НачалоДня(Интервал.Начало);
	
	Если Интервал.Начало < НачалоДня(ТекущаяДата()) Тогда
		ОтменаРедактирования = Истина;		
		Возврат;
	КонецЕсли;
	
	Продолжительность = ?(Интервал.Расшифровка.Продолжительность = 0, 1, Интервал.Расшифровка.Продолжительность);
	Интервал.Конец 	= омДаты.ДобавитьДниСУчетомВыходных(Интервал.Начало, Продолжительность);
	
	Если Интервал.Расшифровка.Свойство("Задача") Тогда
		ЗаписатьИзменениеВРегистр(Интервал.Начало, Интервал.Расшифровка.Задача, Продолжительность);
		
		Для каждого х Из тзДанныеГанта Цикл
			Если Интервал.Расшифровка.Задача = х.Задача И Интервал.Расшифровка.Этап = х.Этап Тогда
				х.ДатаНачала = Интервал.Начало;
				
				ОбновитьПроектНаСервере(Интервал.Расшифровка.Проект);
				ОбновитьИсполнителяНаСервере(Интервал.Расшифровка.Исполнитель, Интервал.Расшифровка.Проект);

			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

