

Процедура ОбработкаРасшифровки(Расшифровки) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Для каждого текЭлемент Из Расшифровки Цикл
		
		Если текЭлемент = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		Если текЭлемент.Свойство("Задача") Тогда
			
			Если ЗначениеЗаполнено(текЭлемент.Задача) Тогда
				ПоказатьЗначение(,текЭлемент.Задача);	
			КонецЕсли;	
			
		КонецЕсли;
	
	КонецЦикла; 
	
КонецПроцедуры

Процедура ДиаграммаВыбор(Значения, СтандартнаяОбработка) Экспорт
	Если Тип("ТочкаДиаграммыГанта") = ТипЗнч(Значения) Тогда
		Если Тип("СправочникСсылка.ИзделияКомплект") = ТипЗнч(Значения.Значение) ИЛИ 
			Тип("СправочникСсылка.Композиции") = ТипЗнч(Значения.Значение) ИЛИ
			Тип("СправочникСсылка.Проекты") = ТипЗнч(Значения.Значение) Тогда
				СтандартнаяОбработка = Ложь;
				ПоказатьЗначение(,Значения.Значение);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

