Функция ПолучитьСтадиюПоСобытию(Событие) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтадииКомплекта.Ссылка КАК Стадия
		|ИЗ
		|	Справочник.СтадииКомплекта КАК СтадииКомплекта
		|ГДЕ
		|	СтадииКомплекта.Событие = &Событие";
	
	Запрос.УстановитьПараметр("Событие", Событие);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Стадия; 
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка();
	
КонецФункции // ПолучитьСтадиюПоСобытию()
