
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр КомплектыУПодрядчика Расход
	Движения.КомплектыУПодрядчика.Записывать = Истина;
	Для Каждого ТекСтрокаИзделияКомплекты Из ИзделияКомплекты Цикл
		Движение = Движения.КомплектыУПодрядчика.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
		Движение.Период 			= Дата;
		Движение.Подрядчик 			= Подрядчик;
		Движение.ИзделиеКомплект 	= ТекСтрокаИзделияКомплекты.ИзделиеКомплект;
		Движение.Количество 		= 1;
	КонецЦикла;

КонецПроцедуры
