&НаСервере
Функция ЗапретВыгрузкиВБитрикс() Экспорт
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	ИмяНастройкиВыключитьСинхронизациюСБитрикс = ОбъектОтчета.ПолучитьИмяНастройкиВыключитьСинхронизациюСБитрикс();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(НастройкиПроекта.Значение, ЛОЖЬ) КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ИмяНастройкиВыключитьСинхронизациюСБитрикс);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Значение;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции // ЗапретВыгрузкиВБитрикс()
