
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗначениеОтсутствующиеВПланированииСделки = Ложь;
	Если Параметры.Свойство("ОтсутствующиеВПланированииСделки", ЗначениеОтсутствующиеВПланированииСделки) Тогда
		ИспользоватьОтбор = ЗначениеОтсутствующиеВПланированииСделки;
		Если ИспользоватьОтбор Тогда
			НеСуществуютВПланировании = ПолучитьСуществующиеПланирования(Параметры.НаименованиеСрока);
		Иначе
			НеСуществуютВПланировании = Новый Массив;
		КонецЕсли;
	Иначе
		ИспользоватьОтбор 			= Ложь;
		НеСуществуютВПланировании 	= Новый Массив;
	КонецЕсли;
	
	НеПоказыватьСделки = Ложь;
	Если Параметры.Свойство("НеПоказыватьСделки", НеПоказыватьСделки) Тогда
		
		Если НеПоказыватьСделки Тогда

			ИспользоватьОтбор 			= Истина;
			НеСуществуютВПланировании 	= Параметры.МассивПроектовПоказывать;
		
		КонецЕсли;
	
	КонецЕсли; 
	
	НеВыводитьНаДиаграмму = Ложь;
	Параметры.Свойство("НеВыводитьНаДиаграмму", НеВыводитьНаДиаграмму);
	
	Список.Параметры.УстановитьЗначениеПараметра("ИспользоватьОтбор",			ИспользоватьОтбор);
	Список.Параметры.УстановитьЗначениеПараметра("НеСуществуютВПланировании",	НеСуществуютВПланировании);
	Список.Параметры.УстановитьЗначениеПараметра("НеВыводитьНаДиаграмму",		НеВыводитьНаДиаграмму);
	
КонецПроцедуры

Функция ПолучитьСуществующиеПланирования(НаименованиеСрока)
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапускВРаботу КАК ЗапускВРаботу
		|		ПО ЗапускВРаботу.Проект = Проекты.Ссылка
		|ГДЕ
		|	ЗапускВРаботу.Ссылка ЕСТЬ NULL";
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ЗапускВРаботу", НаименованиеСрока);	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции // ПолучитьСущетвующиеПланирования()
