
Процедура ПриЗаписи(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеЗадачиСрезПоследних.Исполнитель КАК Исполнитель
		|ИЗ
		|	РегистрСведений.ДанныеЗадачи.СрезПоследних(, Задача = &Задача) КАК ДанныеЗадачиСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекущийПользователь = Выборка.Исполнитель;
	КонецЦикла;
	
	Если НЕ ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь Тогда
	
		РегистрыСведений.ВерсииОбщихЗадач.УвеличитьВерсию(Перечисления.ТипыВерсийСообщений.ОбщаяЗадача);	
	
	КонецЕсли;
	
КонецПроцедуры
