
Процедура ПриЗаписи(Отказ)  
	
	УИДДоски = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
	ИмяДоски = омКанбанДоскиНаСервереПовтор.ПолучитьИмяДоски("НаименованиеДоскиПроизводство");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДосрочныйЗапускВПроизводствоЗадачиРКД.ЗадачаРКД.ОбъектТЗ КАК Ресурс,
		|	ДосрочныйЗапускВПроизводствоЗадачиРКД.ЗадачаРКД.ОбъектТЗ.Проект КАК Проект
		|ИЗ
		|	Документ.ДосрочныйЗапускВПроизводство.ЗадачиРКД КАК ДосрочныйЗапускВПроизводствоЗадачиРКД
		|ГДЕ
		|	ДосрочныйЗапускВПроизводствоЗадачиРКД.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТаблицаРесурсов = Запрос.Выполнить().Выгрузить();
	МассивРесурсов = ТаблицаРесурсов.ВыгрузитьКолонку("Ресурс");
	
	МассивТегов = Новый Массив(2);
	МассивТегов[0] = Справочники.Теги.ГЧ_переведен_в_рабочее;
	МассивТегов[1] = Справочники.Теги.ДосрочныйЗапускВПроизводство;
	
	ТаблицаСуществующихКарточекПроизводства 
		= омКанбанДоскиНаСервере.ПолучитьКарточкиКанбанаСКолонкамиИТегами(УИДДоски, МассивРесурсов, МассивТегов); 
	
	стРазделители = Новый Структура("Сотрудник, Проект", Неопределено); 
	
	Для каждого ТекущийРесурс Из ТаблицаРесурсов Цикл
		
		
		НайденаяСтрока = ТаблицаСуществующихКарточекПроизводства.Найти(ТекущийРесурс.Ресурс, "Ресурс");
		
		Если НайденаяСтрока = Неопределено Тогда
			
			МассивКомплектов = Новый Массив(1);
			МассивКомплектов[0] = ТекущийРесурс.Ресурс;
			
			стРазделители.Проект = ТекущийРесурс.Проект;
			МассивУИД = омКанбанНачальноеЗаполнение.ЗаполнитьНачальноеЗаполнениеКанбана(ИмяДоски, стРазделители, МассивКомплектов, "До срочный запуск в производство"); 
			
			Если МассивУИД.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			
			УИДКарточка = МассивУИД[0].УИДКарточка;
			
			омКанбанПроизводство.ПереместитьРеквизитВОжидание(ТекущийРесурс.Ресурс);
			
			Тег = Справочники.Теги.ПустаяСсылка();
			
		Иначе
			//"1"  выполнена. "100"  корзина. "200" приостановлена.
			Если НайденаяСтрока.УИДКудаКолонка = "200" Тогда
				Возврат;
			КонецЕсли;
			
			Если НайденаяСтрока.УИДКудаКолонка = "100" ИЛИ НайденаяСтрока.УИДКудаКолонка = "1" ИЛИ ПустаяСтрока(НайденаяСтрока.УИДКудаКолонка) Тогда
				омКанбанПроизводство.ПереместитьРеквизитВОжидание(ТекущийРесурс.Ресурс);
			КонецЕсли;
			
			УИДКарточка = НайденаяСтрока.УИДКарточка;
			
			Тег = НайденаяСтрока.Тег;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Тег) Тогда
			омКанбанДоскиНаСервере.ЗаписатьТег(Справочники.Теги.ДосрочныйЗапускВПроизводство, УИДКарточка); 
		КонецЕсли;
		
		Если НЕ (ПустаяСтрока(УИДКарточка) ИЛИ ПустаяСтрока(Комментарий))  Тогда
			омКанбанТЗ.СоздатьКомментарий(УИДКарточка, Комментарий);	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
