
Процедура ПриЗаписи(Отказ)  
	
	УИДДоски 	= омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("НаименованиеДоскиПроизводство");
	
	Для каждого ТекущаяЗадача Из ЗадачиРКД Цикл
	
		омЗадачиРКДНаСервере.ЗавершениеЗадачиРКД(ТекущаяЗадача.ЗадачаРКД);
		
		Если НЕ ПустаяСтрока(Комментарий) Тогда
			
			УИДКарточка = омКанбанДоскиНаСервере.ПолучитьУИДКарточки(УИДДоски, ТекущаяЗадача.ЗадачаРКД.ОбъектТЗ);
			Если НЕ ПустаяСтрока(УИДКарточка)  Тогда
				омКанбанТЗ.СоздатьКомментарий(УИДКарточка, Комментарий);	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
