
Процедура ПередВыполнением(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриВыполнении(Отказ)
	Если СтатусИзменен = 1 Тогда
		
		ТД = ТекущаяДата();
		
		МенеджнерЗаписей = РегистрыСведений.СостояниеЗамера.СоздатьМенеджерЗаписи();
		МенеджнерЗаписей.Период 			= ТД;
		МенеджнерЗаписей.ОбъектЗамера 		= ГабаритныйЧертеж;
		МенеджнерЗаписей.ОбъектИзменения 	= Ссылка;
		
		МенеджнерЗаписей.Прочитать();
		
		МенеджнерЗаписей.Период 			= ТД;
		МенеджнерЗаписей.ОбъектЗамера 		= ГабаритныйЧертеж;
		МенеджнерЗаписей.ОбъектИзменения 	= Ссылка;
		МенеджнерЗаписей.СтатусЗамера 		= НовыйСтатус;
		
		МенеджнерЗаписей.Записать();
		
	Иначе
		
		ИсполнительИзменения = Справочники.Пользователи.ПустаяСсылка(); 
		КомментарийИзменения = "";
		КрайняяДатаИсполнения = ТекущаяДата();
		
		Для каждого х Из ДополнительныеДанные Цикл
		
			Если х.Наименование = "ИсправитьПрользователь" Тогда
			
				ИсполнительИзменения = х.Значение;

			ИначеЕсли х.Наименование = "ИсправитьКомментарий" Тогда
				
				КомментарийИзменения = х.Значение;
				
			ИначеЕсли х.Наименование = "КрайняяДатаИсполнения" Тогда
				
				КрайняяДатаИсполнения = х.Значение;
				
			КонецЕсли;		
		
		КонецЦикла;
		
		ПроверитьГабаритныеЧертежи = Задачи.ПроверитьГабаритныеЧертежи.СоздатьЗадачу();
		ПроверитьГабаритныеЧертежи.Дата 					= ТекущаяДата();
		ПроверитьГабаритныеЧертежи.ГабаритныйЧертеж 		= ГабаритныйЧертеж;
		ПроверитьГабаритныеЧертежи.Исполнитель 				= ИсполнительИзменения;
		ПроверитьГабаритныеЧертежи.Комментарий 				= КомментарийИзменения;
		ПроверитьГабаритныеЧертежи.КрайняяДатаИсполнения 	= КрайняяДатаИсполнения;
		ПроверитьГабаритныеЧертежи.Наименование 			= "Исправить " + ГабаритныйЧертеж;
		ПроверитьГабаритныеЧертежи.Основание 				= Ссылка;
		ПроверитьГабаритныеЧертежи.Проект 					= Проект;
		
		ПроверитьГабаритныеЧертежи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередИнтерактивнымВыполнением(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	РегистрыСведений.СтатусыЗадач.НазначитьСтатусЗадачи(Ссылка);
КонецПроцедуры
