
Процедура ПередВыполнением(Отказ)
	
	//Если НовыйСтатус = Перечисления.СтатусыЗамера.Проектный Тогда
	//	СтрокаХМЛ = омФайлыPDM.Перевести_ГЧ_в_проектный_статус(ГабаритныйЧертеж);
	//ИначеЕсли НовыйСтатус = Перечисления.СтатусыЗамера.Рабочий Тогда
	//	СтрокаХМЛ = омФайлыPDM.Перевести_ГЧ_в_фактический_статус(ГабаритныйЧертеж);
	//Иначе	
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	//
	//ЗаполнитьДанные(СтрокаХМЛ);
	
КонецПроцедуры

Процедура ПриВыполнении(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если СтатусИзменен = 1 Тогда
		
		ТД = ТекущаяДата();
		
		МенеджнерЗаписей = РегистрыСведений.СостояниеЗамера.СоздатьМенеджерЗаписи();
		МенеджнерЗаписей.Период 			= ТД;
		МенеджнерЗаписей.ОбъектЗамера 		= ГабаритныйЧертеж;
		МенеджнерЗаписей.ОбъектИзменения 	= Ссылка;
		
		МенеджнерЗаписей.Прочитать();
		
		МенеджнерЗаписей.Период 			= ТД;
		МенеджнерЗаписей.ОбъектЗамера 		= ГабаритныйЧертеж;
		МенеджнерЗаписей.ОбъектИзменения 	= Ссылка;
		МенеджнерЗаписей.СтатусЗамера 		= НовыйСтатус;
		
		МенеджнерЗаписей.Записать(); 
		
		Если НовыйСтатус = Перечисления.СтатусыЗамера.Рабочий Тогда
		
			ПеревестиЗадачуРКДВОжидание();		
		
		КонецЕсли;
		
	Иначе
		
		ИсполнительИзменения = Справочники.Пользователи.ПустаяСсылка(); 
		КомментарийИзменения = "";
		КрайняяДатаИсполнения = ТекущаяДата();
		
		Для каждого х Из ДополнительныеДанные Цикл
		
			Если х.Наименование = "ИсправитьПрользователь" Тогда
			
				ИсполнительИзменения = х.Значение;

			ИначеЕсли х.Наименование = "ИсправитьКомментарий" Тогда
				
				КомментарийИзменения = х.Значение;
				
			ИначеЕсли х.Наименование = "КрайняяДатаИсполнения" Тогда
				
				КрайняяДатаИсполнения = х.Значение;
				
			КонецЕсли;		
		
		КонецЦикла;
		
		ПроверитьГабаритныеЧертежи = Задачи.ПроверитьГабаритныеЧертежи.СоздатьЗадачу();
		ПроверитьГабаритныеЧертежи.Дата 					= ТекущаяДата();
		ПроверитьГабаритныеЧертежи.ГабаритныйЧертеж 		= ГабаритныйЧертеж;
		ПроверитьГабаритныеЧертежи.Исполнитель 				= ИсполнительИзменения;
		ПроверитьГабаритныеЧертежи.Комментарий 				= КомментарийИзменения;
		ПроверитьГабаритныеЧертежи.КрайняяДатаИсполнения 	= КрайняяДатаИсполнения;
		ПроверитьГабаритныеЧертежи.Наименование 			= "Исправить " + ГабаритныйЧертеж;
		ПроверитьГабаритныеЧертежи.Основание 				= Ссылка;
		ПроверитьГабаритныеЧертежи.Проект 					= Проект;
		
		ПроверитьГабаритныеЧертежи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПеревестиЗадачуРКДВОжидание() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК ЗадачаРКД
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	(Задачи_РКД.ОбъектТЗ.ГабаритныйЧертеж = &ГабаритныйЧертеж
		|			ИЛИ Задачи_РКД.ОбъектТЗ.Родитель.ГабаритныйЧертеж = &ГабаритныйЧертеж)
		|	И НЕ Задачи_РКД.Выполнена
		|	И Задачи_РКД.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.ГЧОжидание)
		|
		|СГРУППИРОВАТЬ ПО
		|	Задачи_РКД.Ссылка";
	
	Запрос.УстановитьПараметр("ГабаритныйЧертеж", ГабаритныйЧертеж);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		омЗадачиРКДНаСервере.ПеревестиЗадачуВОжидание(Выборка.ЗадачаРКД, Истина);
	КонецЦикла;
	
КонецПроцедуры


Процедура ПередИнтерактивнымВыполнением(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	РегистрыСведений.СтатусыЗадач.НазначитьСтатусЗадачи(Ссылка);
КонецПроцедуры

Процедура ЗаполнитьДанные(СтрокаХМЛ)

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаХМЛ);
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "file_information" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Для х = 0 по ЧтениеXML.КоличествоАтрибутов() - 1 Цикл
			
				ИмяАтрибута 		= ЧтениеXML.ИмяАтрибута(х);		
				ЗначениеАтрибута 	= ЧтениеXML.ЗначениеАтрибута(х);	
				
				Если ИмяАтрибута = "ErrorDescription" Тогда
				
					Если ПустаяСтрока(ЗначениеАтрибута) Тогда
						Продолжить;
					КонецЕсли;
					
					Прервать;
				
				ИначеЕсли ИмяАтрибута = "Name" Тогда
					ИмяФайла = ЗначениеАтрибута
				ИначеЕсли ИмяАтрибута = "Path" Тогда
					ПутьКФайлу = ЗначениеАтрибута;
				ИначеЕсли ИмяАтрибута = "LockedByUserName" Тогда
					КемЗаблокирован = ЗначениеАтрибута;
				ИначеЕсли ИмяАтрибута = "Version" Тогда
					Версия = ЗначениеАтрибута;
				ИначеЕсли ИмяАтрибута = "FileDate" Тогда
					ДатаФайла = ЗначениеАтрибута;
				ИначеЕсли ИмяАтрибута = "StateName" Тогда
					Статус = ЗначениеАтрибута;
				ИначеЕсли ИмяАтрибута = "LockedOnComputer" Тогда
					ИмяКомпьютера = ЗначениеАтрибута;
				ИначеЕсли ИмяАтрибута = "ParentFolderID" Тогда
					IDРодительскойПапки = ЗначениеАтрибута;
				КонецЕсли;
			
			КонецЦикла;
			
        КонецЕсли;
    КонецЦикла;     
	
	
КонецПроцедуры // ЗаполнитьДанные()   

