
Процедура ПередВыполнением(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриВыполнении(Отказ)
	Если СтатусИзменен = 1 Тогда
		
		ТД = ТекущаяДата();
		
		МенеджнерЗаписей = РегистрыСведений.СостояниеЗамера.СоздатьМенеджерЗаписи();
		МенеджнерЗаписей.Период 			= ТД;
		МенеджнерЗаписей.ОбъектЗамера 		= ГабаритныйЧертеж;
		МенеджнерЗаписей.ОбъектИзменения 	= Ссылка;
		
		МенеджнерЗаписей.Прочитать();
		
		МенеджнерЗаписей.Период 			= ТД;
		МенеджнерЗаписей.ОбъектЗамера 		= ГабаритныйЧертеж;
		МенеджнерЗаписей.ОбъектИзменения 	= Ссылка;
		МенеджнерЗаписей.СтатусЗамера 		= НовыйСтатус;
		
		МенеджнерЗаписей.Записать(); 
		
		Если НовыйСтатус = Перечисления.СтатусыЗамера.Рабочий Тогда
		
			ПеревестиЗадачуРКДВОжидание();		
		
		КонецЕсли;
		
	Иначе
		
		ИсполнительИзменения = Справочники.Пользователи.ПустаяСсылка(); 
		КомментарийИзменения = "";
		КрайняяДатаИсполнения = ТекущаяДата();
		
		Для каждого х Из ДополнительныеДанные Цикл
		
			Если х.Наименование = "ИсправитьПрользователь" Тогда
			
				ИсполнительИзменения = х.Значение;

			ИначеЕсли х.Наименование = "ИсправитьКомментарий" Тогда
				
				КомментарийИзменения = х.Значение;
				
			ИначеЕсли х.Наименование = "КрайняяДатаИсполнения" Тогда
				
				КрайняяДатаИсполнения = х.Значение;
				
			КонецЕсли;		
		
		КонецЦикла;
		
		ПроверитьГабаритныеЧертежи = Задачи.ПроверитьГабаритныеЧертежи.СоздатьЗадачу();
		ПроверитьГабаритныеЧертежи.Дата 					= ТекущаяДата();
		ПроверитьГабаритныеЧертежи.ГабаритныйЧертеж 		= ГабаритныйЧертеж;
		ПроверитьГабаритныеЧертежи.Исполнитель 				= ИсполнительИзменения;
		ПроверитьГабаритныеЧертежи.Комментарий 				= КомментарийИзменения;
		ПроверитьГабаритныеЧертежи.КрайняяДатаИсполнения 	= КрайняяДатаИсполнения;
		ПроверитьГабаритныеЧертежи.Наименование 			= "Исправить " + ГабаритныйЧертеж;
		ПроверитьГабаритныеЧертежи.Основание 				= Ссылка;
		ПроверитьГабаритныеЧертежи.Проект 					= Проект;
		
		ПроверитьГабаритныеЧертежи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПеревестиЗадачуРКДВОжидание()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК ЗадачаРКД
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ.ГабаритныйЧертеж = &ГабаритныйЧертеж
		|	И НЕ Задачи_РКД.Выполнена
		|	И Задачи_РКД.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.ГЧОжидание)
		|
		|СГРУППИРОВАТЬ ПО
		|	Задачи_РКД.Ссылка";
	
	Запрос.УстановитьПараметр("ГабаритныйЧертеж", ГабаритныйЧертеж);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		омЗадачиРКДНаСервере.ПеревестиЗадачуВОжидание(Выборка.ЗадачаРКД, Истина);
	КонецЦикла;
	
КонецПроцедуры


Процедура ПередИнтерактивнымВыполнением(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	РегистрыСведений.СтатусыЗадач.НазначитьСтатусЗадачи(Ссылка);
КонецПроцедуры
