&НаСервере
Функция ОстаткиПоДоговору(Сделка, НомерПоПорядку = Неопределено) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИтогоПроекта.ИзделияЗаказчика КАК ИзделияЗаказчика,
	|	СУММА(ИтогоПроекта.Количество) КАК Количество
	|ИЗ
	|	РегистрСведений.ИтогоПроекта КАК ИтогоПроекта
	|ГДЕ
	|	ИтогоПроекта.Проект = &Проект
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтогоПроекта.ИзделияЗаказчика";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Если НомерПоПорядку = Неопределено Тогда
		Возврат Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	тзТекущиеОстатки =  Запрос.Выполнить().Выгрузить();
	
	тзВозврата = тзТекущиеОстатки.СкопироватьКолонки();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИтогоПроекта.ИзделияЗаказчика КАК ИзделияЗаказчика,
		|	СУММА(ИтогоПроекта.Количество) КАК Количество
		|ИЗ
		|	РегистрСведений.ИтогоПроекта КАК ИтогоПроекта
		|ГДЕ
		|	ИтогоПроекта.Проект = &Проект
		|	И ИтогоПроекта.Договор.НомерПоПорядку < &НомерПоПорядку
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтогоПроекта.ИзделияЗаказчика";
	
	Запрос.УстановитьПараметр("НомерПоПорядку", НомерПоПорядку);
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НайденаяСтрока = тзТекущиеОстатки.Найти(Выборка.ИзделияЗаказчика,"ИзделияЗаказчика");
		
		Если НайденаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		текКоличестао = Мин(Выборка.Количество, НайденаяСтрока.Количество);
		
		Если текКоличестао = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НС = тзВозврата.Добавить();
		НС.ИзделияЗаказчика = НайденаяСтрока.ИзделияЗаказчика;
		НС.Количество 		= текКоличестао;
	КонецЦикла;
	
    Возврат тзВозврата;
КонецФункции // ОстаткиПоДоговору()
