
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыездНаЗамер") Тогда
		Автор 		= ПараметрыСеанса.ТекущийПользователь;
		Проект 		= ДанныеЗаполнения.Проект;
		Основание 	= ДанныеЗаполнения.Ссылка;
		
		Для Каждого ТекСтрокаГабаритныеЧерчежи Из ДанныеЗаполнения.ГабаритныеЧертежи Цикл
			Если ТекСтрокаГабаритныеЧерчежи.ЗамерПроизведен Тогда
				
				НоваяСтрока 					= ГабаритныеЧертежи.Добавить();
				НоваяСтрока.ГабаритныйЧертеж 	= ТекСтрокаГабаритныеЧерчежи.ГабаритныйЧертеж;
				НоваяСтрока.Комментарий 		= ТекСтрокаГабаритныеЧерчежи.Комментарий;
				
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПолучитьГЧДляИзменения();
КонецПроцедуры

Процедура ПолучитьГЧДляИзменения()
	
    Если Проведен Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
		|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж.Наименование КАК ГабаритныйЧертежНаименование,
		|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж.Проект КАК Проект
		|ИЗ
		|	Документ.АктПриемкиГабаритныхЧертежей.ГабаритныеЧертежи КАК АктПриемкиГабаритныхЧертежейГабаритныеЧертежи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.СоздатьМодельГабаритногоЧертежа КАК СоздатьМодельГабаритногоЧертежа
		|		ПО АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж = СоздатьМодельГабаритногоЧертежа.ОбъектТЗ
		|			И (НЕ СоздатьМодельГабаритногоЧертежа.Выполнена)
		|ГДЕ
		|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.Ссылка = &Ссылка
		|	И СоздатьМодельГабаритногоЧертежа.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НазначениеАвтораДляЗадачи.Исполнитель КАК Исполнитель
		|ИЗ
		|	Справочник.НазначениеАвтораДляЗадачи КАК НазначениеАвтораДляЗадачи
		|ГДЕ
		|	НазначениеАвтораДляЗадачи.ОбъектЗадачи = ЗНАЧЕНИЕ(Перечисление.ОбъектыЗадач.ПроверятьГабаритныеЧерчежи)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.ВыполнитьПакет(); 
	
	Исполнитель = Неопределено;
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Исполнитель = Выборка.Исполнитель;
	КонецЦикла;
	
	Выборка = Результат[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		Задачи.ПроверитьГабаритныеЧертежи.СоздатьЗадачуПроверитьГабаритныеЧертежи(Выборка.ГабаритныйЧертеж, Исполнитель, Выборка.Проект, Ссылка);
	КонецЦикла;
	
КонецПроцедуры // ПолучитьГЧДляИзменения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		Префикс = Проект.Префикс + "-";
		УстановитьНовыйНомер(Префикс); 
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	Отказ = Истина;
КонецПроцедуры
 
