
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыездНаЗамер") Тогда
		// Заполнение шапки
		Автор 		= ПараметрыСеанса.ТекущийПользователь;
		Проект 		= ДанныеЗаполнения.Проект;
		Основание 	= ДанныеЗаполнения.Ссылка;
		
		Для Каждого ТекСтрокаГабаритныеЧерчежи Из ДанныеЗаполнения.ГабаритныеЧертежи Цикл
			Если ТекСтрокаГабаритныеЧерчежи.ЗамерПроизведен Тогда
				
				НоваяСтрока 					= ГабаритныеЧертежи.Добавить();
				НоваяСтрока.ГабаритныйЧертеж 	= ТекСтрокаГабаритныеЧерчежи.ГабаритныйЧертеж;
				НоваяСтрока.Комментарий 		= ТекСтрокаГабаритныеЧерчежи.Комментарий;
				
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПолучитьГЧДляИзменения();
КонецПроцедуры

Функция ПолучитьГЧДляИзменения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежиТЧ.ГабаритныйЧертеж КАК ГабаритныйЧертеж
		|ПОМЕСТИТЬ ГабаритныеЧертежиТЧ
		|ИЗ
		|	&ГабаритныеЧертежиТЧ КАК ГабаритныеЧертежиТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГабаритныеЧертежиТЧ.ГабаритныйЧертеж КАК ГабаритныйЧертеж
		|ПОМЕСТИТЬ НЕСозданныеЗадачиПоГЧ
		|ИЗ
		|	ГабаритныеЧертежиТЧ КАК ГабаритныеЧертежиТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ПроверитьГабаритныеЧертежи КАК ПроверитьГабаритныеЧертежи
		|		ПО ГабаритныеЧертежиТЧ.ГабаритныйЧертеж = ПроверитьГабаритныеЧертежи.ОбъектТЗ
		|			И (ПроверитьГабаритныеЧертежи.Основание = &Ссылка)
		|ГДЕ
		|	ПроверитьГабаритныеЧертежи.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НЕСозданныеЗадачиПоГЧ.ГабаритныйЧертеж КАК ГабаритныйЧертеж
		|ПОМЕСТИТЬ втГЧ
		|ИЗ
		|	НЕСозданныеЗадачиПоГЧ КАК НЕСозданныеЗадачиПоГЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктПриемкиГабаритныхЧертежей.ГабаритныеЧертежи КАК АктПриемкиГабаритныхЧертежейГабаритныеЧертежи
		|		ПО (АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж = НЕСозданныеЗадачиПоГЧ.ГабаритныйЧертеж)
		|			И (АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.Ссылка.Проведен)
		|			И (АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.Ссылка.Дата > &Дата)
		|ГДЕ
		|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втГЧ.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
		|	ЕСТЬNULL(СостояниеЗамераСрезПоследних.СтатусЗамера, ЗНАЧЕНИЕ(Перечисление.СтатусыЗамера.ПустаяСсылка)) КАК Статус
		|ИЗ
		|	втГЧ КАК втГЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеЗамера.СрезПоследних(&Дата, ОбъектЗамера В (&ГабаритныйЧертеж)) КАК СостояниеЗамераСрезПоследних
		|		ПО втГЧ.ГабаритныйЧертеж = СостояниеЗамераСрезПоследних.ОбъектЗамера
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НазначениеАвтораДляЗадачи.Исполнитель КАК Исполнитель
		|ИЗ
		|	Справочник.НазначениеАвтораДляЗадачи КАК НазначениеАвтораДляЗадачи
		|ГДЕ
		|	НазначениеАвтораДляЗадачи.ОбъектЗадачи = ЗНАЧЕНИЕ(Перечисление.ОбъектыЗадач.ПроверятьГабаритныеЧерчежи)";
	
	Запрос.УстановитьПараметр("ГабаритныеЧертежиТЧ", 	ГабаритныеЧертежи.Выгрузить(, "ГабаритныйЧертеж"));
	Запрос.УстановитьПараметр("ГабаритныйЧертеж", 		ГабаритныеЧертежи.ВыгрузитьКолонку("ГабаритныйЧертеж"));
	Запрос.УстановитьПараметр("Дата", 					Дата);
	Запрос.УстановитьПараметр("СтатусЗамера", 			НовыйСтатус);
	Запрос.УстановитьПараметр("Ссылка", 				Ссылка);
	
	Результат = Запрос.ВыполнитьПакет(); 
	
	Исполнитель = Неопределено;
	Выборка = Результат[4].Выбрать();
	Пока Выборка.Следующий() Цикл
		Исполнитель = Выборка.Исполнитель;
	КонецЦикла;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
	//	|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж.Наименование КАК ГабаритныйЧертежНаименование,
	//	|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.ГабаритныйЧертеж.Проект КАК Проект
	//	|ИЗ
	//	|	Документ.АктПриемкиГабаритныхЧертежей.ГабаритныеЧертежи КАК АктПриемкиГабаритныхЧертежейГабаритныеЧертежи
	//	|ГДЕ
	//	|	АктПриемкиГабаритныхЧертежейГабаритныеЧертежи.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка = Результат[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		Задачи.ПроверитьГабаритныеЧертежи.СоздатьЗадачуПроверитьГабаритныеЧертежи(Выборка.ГабаритныйЧертеж, Исполнитель, Выборка.Проект, Ссылка);
	КонецЦикла;
	
КонецФункции // ПолучитьГЧДляИзменения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		Префикс = Проект.Префикс + "-";
		УстановитьНовыйНомер(Префикс); 
	КонецЕсли;
КонецПроцедуры
 
