
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент;
	НаименованиеТабличногоДокумента = ПечатьКраткое(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать(НаименованиеТабличногоДокумента);
КонецПроцедуры

&НаСервере
Функция ПечатьКраткое(ТабДок, ПараметрКоманды)
	Справочники.ПриложенияКДоговорам.ПечатьКраткое(ТабДок, ПараметрКоманды);
	Возврат Справочники.ПриложенияКДоговорам.ПолучитНаименованиеТабличногоДокумента(ПараметрКоманды);
КонецФункции