&НаСервере
Функция СохранитьДанные() Экспорт

	

КонецФункции // СохранитьДанные()

&НаСервере
Функция ПолучитьМассивНомеровОписаний(ПредварительнаяНоменклатура) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартинкиПредварительнойНоменклатуры.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.КартинкиПредварительнойНоменклатуры КАК КартинкиПредварительнойНоменклатуры
		|ГДЕ
		|	КартинкиПредварительнойНоменклатуры.ПредварительнаяНоменклатура = &ПредварительнаяНоменклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер";
	
	Запрос.УстановитьПараметр("ПредварительнаяНоменклатура", ПредварительнаяНоменклатура);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номер");
	

КонецФункции // ПолучитьУИД_Описаний()


&НаСервере
Функция ПолучитьДанныеОписания(ПредварительнаяНоменклатура,НомерОписание) Экспорт

	стВозврата = Новый Структура("ЕстьКартинка,URL,Описание",Ложь,"","");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартинкиПредварительнойНоменклатуры.URL КАК URL,
		|	КартинкиПредварительнойНоменклатуры.Описание КАК Описание,
		|	КартинкиПредварительнойНоменклатуры.ЕстьКартинка КАК ЕстьКартинка
		|ИЗ
		|	РегистрСведений.КартинкиПредварительнойНоменклатуры КАК КартинкиПредварительнойНоменклатуры
		|ГДЕ
		|	КартинкиПредварительнойНоменклатуры.ПредварительнаяНоменклатура = &ПредварительнаяНоменклатура
		|	И КартинкиПредварительнойНоменклатуры.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", НомерОписание);
	Запрос.УстановитьПараметр("ПредварительнаяНоменклатура", ПредварительнаяНоменклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата,Выборка);
	КонецЦикла;
	
	Возврат стВозврата;


КонецФункции // ПолучитьДанныеОписания()
