Процедура ЗаписатьПлановоеЗначениеЗадачи(Задача, ДатаНачала = Неопределено, ПланРазработкиВДнях = Неопределено, Комментарий = "") Экспорт

	ТД = ТекущаяДата(); 
	
	Если ДатаНачала = Неопределено ИЛИ ПланРазработкиВДнях = Неопределено Тогда
		
		ДатаНачала 			= ТД;
		ПланРазработкиВДнях = 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПлановоеЗначениеПроектированияСрезПоследних.ДатаНачала КАК ДатаНачала,
			|	ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях КАК ПланРазработкиВДнях
			|ИЗ
			|	РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних(, Задача = &Задача) КАК ПлановоеЗначениеПроектированияСрезПоследних";
		
		Запрос.УстановитьПараметр("Задача", Задача);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДатаНачала 			= Выборка.ДатаНачала;
			ПланРазработкиВДнях = Выборка.ПланРазработкиВДнях;
		КонецЦикла;
		
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ПлановоеЗначениеПроектирования.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача 					= Задача;
	МенеджерЗаписи.Период 					= ТД;
	МенеджерЗаписи.Автор 					= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.ДатаНачала 				= ДатаНачала;
	МенеджерЗаписи.ПланРазработкиВДнях 		= ПланРазработкиВДнях;                        
	МенеджерЗаписи.ОкончанияВРабочих 		= омДаты.ДобавитьДниСУчетомВыходных(ДатаНачала, ПланРазработкиВДнях);
	МенеджерЗаписи.ОкончанияВКалендарных 	= ДатаНачала + 86400 * ПланРазработкиВДнях;
	МенеджерЗаписи.Комментарий 				= Комментарий;
	
	МенеджерЗаписи.Записать();

КонецПроцедуры
