Процедура ЗаписатьПлановоеЗначениеЗадачи(Задача, ДатаНачала = Неопределено, ПланРазработкиВДнях = Неопределено, Комментарий = "", ДатаЗаписи = Неопределено) Экспорт

	ТД = ТекущаяДата();
	
	Если ДатаЗаписи = Неопределено Тогда
		Период = ТД;
	Иначе
		Период = ДатаЗаписи;
	КонецЕсли;
	
	Если ДатаНачала = Неопределено Тогда
		ДатаНачалаЗадачи = ТД;
	Иначе
		ДатаНачалаЗадачи = ДатаНачала;
	КонецЕсли;
	
	Если ПланРазработкиВДнях = Неопределено Тогда
		ПланРазработкиВДняхЗадачи = 1;
	Иначе
		ПланРазработкиВДняхЗадачи = ПланРазработкиВДнях;
	КонецЕсли;
	
	Если ДатаНачала = Неопределено ИЛИ ПланРазработкиВДнях = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПлановоеЗначениеПроектированияСрезПоследних.ДатаНачала КАК ДатаНачала,
			|	ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях КАК ПланРазработкиВДнях
			|ИЗ
			|	РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних(, Задача = &Задача) КАК ПлановоеЗначениеПроектированияСрезПоследних";
		
		Запрос.УстановитьПараметр("Задача", Задача);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДатаНачалаЗадачи 			= ?(ДатаНачала = Неопределено, 			Выборка.ДатаНачала, 			ДатаНачалаЗадачи);
			ПланРазработкиВДняхЗадачи 	= ?(ПланРазработкиВДнях = Неопределено, Выборка.ПланРазработкиВДнях, 	ПланРазработкиВДняхЗадачи);
		КонецЦикла;
		
	КонецЕсли;
	
	СдвигВремяЗадачи = Окр(ПланРазработкиВДняхЗадачи, 0);
	СдвигВремяЗадачи = ?(СдвигВремяЗадачи = 0, 1, СдвигВремяЗадачи);	
	
	МенеджерЗаписи = РегистрыСведений.ПлановоеЗначениеПроектирования.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача 					= Задача;
	МенеджерЗаписи.Период 					= Период;
	МенеджерЗаписи.Автор 					= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.ДатаНачала 				= ДатаНачалаЗадачи;
	МенеджерЗаписи.ПланРазработкиВДнях 		= ПланРазработкиВДняхЗадачи;                        
	МенеджерЗаписи.ОкончанияВРабочих 		= омДаты.ДобавитьДниСУчетомВыходных(ДатаНачалаЗадачи, СдвигВремяЗадачи);
	МенеджерЗаписи.ОкончанияВКалендарных 	= ДатаНачалаЗадачи + 86400 * СдвигВремяЗадачи;
	МенеджерЗаписи.Комментарий 				= Комментарий; 
	
	Если омЗадачиОбщие.ПолучитьрежимРаботыИсполнителяЗадачи(Задача) = Перечисления.РежимыРаботы.Пятидневка Тогда
		МенеджерЗаписи.ДатаОкончания = МенеджерЗаписи.ОкончанияВРабочих;	
	Иначе
		МенеджерЗаписи.ДатаОкончания = МенеджерЗаписи.ОкончанияВКалендарных;	
	КонецЕсли;
	
	МенеджерЗаписи.Записать();

КонецПроцедуры 

Процедура ПересчитатьДатуОкончания() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановоеЗначениеПроектированияСрезПоследних.Период КАК Период,
		|	ПлановоеЗначениеПроектированияСрезПоследних.Задача КАК Задача,
		|	ПлановоеЗначениеПроектированияСрезПоследних.ДатаНачала КАК ДатаНачала,
		|	ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях КАК ПланРазработкиВДнях,
		|	ПлановоеЗначениеПроектированияСрезПоследних.ДатаОкончания КАК ДатаОкончания,
		|	ПлановоеЗначениеПроектированияСрезПоследних.ОкончанияВКалендарных КАК ОкончанияВКалендарных,
		|	ПлановоеЗначениеПроектированияСрезПоследних.ОкончанияВРабочих КАК ОкончанияВРабочих,
		|	ЕСТЬNULL(ДанныеСотрудниковСрезПоследних.РежимРаботы, ЗНАЧЕНИЕ(Перечисление.РежимыРаботы.ПустаяСсылка)) КАК РежимРаботы
		|ИЗ
		|	РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних КАК ПлановоеЗначениеПроектированияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСотрудников.СрезПоследних КАК ДанныеСотрудниковСрезПоследних
		|		ПО ПлановоеЗначениеПроектированияСрезПоследних.Задача.Исполнитель.Сотрудник = ДанныеСотрудниковСрезПоследних.Сотрудник
		|ГДЕ
		|	ПлановоеЗначениеПроектированияСрезПоследних.ДатаНачала > ДАТАВРЕМЯ(1, 1, 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НужнаЗапись = Ложь;
		
		Если Выборка.ПланРазработкиВДнях = 0 Тогда
		
			ПланРазработкиВДнях = 1;
			НужнаЗапись 		= Истина;
			
		Иначе
			ПланРазработкиВДнях = Выборка.ПланРазработкиВДнях;
		КонецЕсли;
		
		ОкончанияВРабочих 		= КонецДня(омДаты.ДобавитьДниСУчетомВыходных(Выборка.ДатаНачала, ПланРазработкиВДнях));
		ОкончанияВКалендарных 	= КонецДня(Выборка.ДатаНачала + 86400 * ПланРазработкиВДнях);
		
		Если Выборка.РежимРаботы = Перечисления.РежимыРаботы.Пятидневка Тогда
			ДатаОкончания = ОкончанияВРабочих;	
		Иначе
			ДатаОкончания = ОкончанияВКалендарных;	
		КонецЕсли;
		
		Если НужнаЗапись ИЛИ НЕ (ПланРазработкиВДнях = Выборка.ПланРазработкиВДнях 
			И ОкончанияВРабочих = Выборка.ОкончанияВРабочих
			И ОкончанияВКалендарных = Выборка.ОкончанияВКалендарных
			И ДатаОкончания = Выборка.ДатаОкончания) Тогда
		
			МенеджерЗаписи = РегистрыСведений.ПлановоеЗначениеПроектирования.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Задача 					= Выборка.Задача;
			МенеджерЗаписи.Период 					= Выборка.Период;
			
			МенеджерЗаписи.Прочитать();
			
			Если МенеджерЗаписи.Выбран() Тогда
			
				МенеджерЗаписи.ПланРазработкиВДнях 		= ПланРазработкиВДнях;	
				МенеджерЗаписи.ОкончанияВРабочих 		= ОкончанияВРабочих;	
				МенеджерЗаписи.ОкончанияВКалендарных 	= ОкончанияВКалендарных;	
				МенеджерЗаписи.ДатаОкончания  			= ДатаОкончания;
				
				МенеджерЗаписи.Записать();
			
			КонецЕсли;
			
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
