Процедура ЗаписатьПлановоеЗначениеЗадачи(Задача, ДатаНачала = Неопределено, ПланРазработкиВДнях = Неопределено, Комментарий = "", ДатаЗаписи = Неопределено) Экспорт

	ТД = ТекущаяДата();
	
	Если ДатаЗаписи = Неопределено Тогда
		Период = ТД;
	Иначе
		Период = ДатаЗаписи;
	КонецЕсли;
	
	Если ДатаНачала = Неопределено Тогда
		ДатаНачалаЗадачи = ТД;
	Иначе
		ДатаНачалаЗадачи = ДатаНачала;
	КонецЕсли;
	
	Если ПланРазработкиВДнях = Неопределено Тогда
		ПланРазработкиВДняхЗадачи = 1;
	Иначе
		ПланРазработкиВДняхЗадачи = ПланРазработкиВДнях;
	КонецЕсли;
	
	Если ДатаНачала = Неопределено ИЛИ ПланРазработкиВДнях = Неопределено Тогда
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПлановоеЗначениеПроектированияСрезПоследних.ДатаНачала КАК ДатаНачала,
			|	ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях КАК ПланРазработкиВДнях
			|ИЗ
			|	РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних(, Задача = &Задача) КАК ПлановоеЗначениеПроектированияСрезПоследних";
		
		Запрос.УстановитьПараметр("Задача", Задача);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДатаНачалаЗадачи 			= ?(ДатаНачала = Неопределено, 			Выборка.ДатаНачала, 			ДатаНачалаЗадачи);
			ПланРазработкиВДняхЗадачи 	= ?(ПланРазработкиВДнях = Неопределено, Выборка.ПланРазработкиВДнях, 	ПланРазработкиВДняхЗадачи);
		КонецЦикла;
		
	КонецЕсли;
	
	СдвигВремяЗадачи = Окр(ПланРазработкиВДняхЗадачи, 0);
	СдвигВремяЗадачи = ?(СдвигВремяЗадачи = 0, 1, СдвигВремяЗадачи);	
	
	МенеджерЗаписи = РегистрыСведений.ПлановоеЗначениеПроектирования.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача 					= Задача;
	МенеджерЗаписи.Период 					= Период;
	МенеджерЗаписи.Автор 					= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.ДатаНачала 				= ДатаНачалаЗадачи;
	МенеджерЗаписи.ПланРазработкиВДнях 		= ПланРазработкиВДняхЗадачи;                        
	МенеджерЗаписи.ОкончанияВРабочих 		= омДаты.ДобавитьДниСУчетомВыходных(ДатаНачалаЗадачи, СдвигВремяЗадачи);
	МенеджерЗаписи.ОкончанияВКалендарных 	= ДатаНачалаЗадачи + 86400 * СдвигВремяЗадачи;
	МенеджерЗаписи.Комментарий 				= Комментарий; 
	
	Если омЗадачиОбщие.ПолучитьрежимРаботыИсполнителяЗадачи(Задача) = Перечисления.РежимыРаботы.Пятидневка Тогда
		МенеджерЗаписи.ДатаОкончания = МенеджерЗаписи.ОкончанияВРабочих;	
	Иначе
		МенеджерЗаписи.ДатаОкончания = МенеджерЗаписи.ОкончанияВКалендарных;	
	КонецЕсли;
	
	МенеджерЗаписи.Записать();

КонецПроцедуры 

Функция ПолучитьПлановыеПараметрыПроектирования(ОбъектТЗ) Экспорт


	

КонецФункции // ПолучитьПлановыеПараметрыПроектирования()

