
Функция ПередачаВПроизводствоКомплекта(Комплект) Экспорт
	
	УИДДоскиПроизводство = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("НаименованиеДоскиПроизводство");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКарточки.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|ГДЕ
		|	КанбанКарточки.Ресурс = &Ресурс
		|	И КанбанКарточки.Доска = &Доска";
	
	Запрос.УстановитьПараметр("Доска", УИДДоскиПроизводство);
	Запрос.УстановитьПараметр("Ресурс", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	УИД_существующей_карточки = "";
	Пока Выборка.Следующий() Цикл
		УИД_существующей_карточки = Выборка.УИД;	
	КонецЦикла;
	
	ИмяДоски = омКанбанДоскиНаСервереПовтор.ПолучитьИмяДоски("НаименованиеДоскиПроизводство");
	стРазделители = Новый Структура("Проект, Сотрудник", Комплект.Проект, Неопределено); 
	
	МассивКомплектов = Новый Массив(1);
	МассивКомплектов[0] = Комплект;
	
	Возврат омКанбанНачальноеЗаполнение.ЗаполнитьНачальноеЗаполнениеКанбана(ИмяДоски, стРазделители, МассивКомплектов, "Начальное заполнение", УИД_существующей_карточки); 
	
КонецФункции // ПередачаВПроизводство()

Функция ПолучитьИмяСтадииВМонтаж() Экспорт

	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	НастройкаИмяДоски = ОбъектОтчета.НаименованиеКолонкиДляПроизводствоВМонтаж();
		

КонецФункции // ПолучитьИмяСтадии()
