
Функция ПередачаВПроизводствоКомплекта(Комплект) Экспорт

	Если НЕ ЗначениеЗаполнено(Комплект) Тогда
	
		Возврат Неопределено;	
	
	КонецЕсли;
	
	ГЧ = омГабаритныйЧертежНаСервере.ПолучитьГЧКомплекта(Комплект);
	
	Если НЕ ЗначениеЗаполнено(ГЧ) Тогда
	
		Возврат Неопределено;	
	
	КонецЕсли;
	
	СтатусЗамера = омГабаритныйЧертежНаСервере.ПолучитьСтатусГЧ(ГЧ);
	
	Если НЕ СтатусЗамера = Перечисления.СтатусыЗамера.Рабочий Тогда
	
		Возврат Неопределено;	
	
	КонецЕсли;
	
	СсыкаЗадачаРКД = омЗадачи.ЕстьЗакрытаяЗадачаРКД(Комплект);
	
	Если НЕ ЗначениеЗаполнено(СсыкаЗадачаРКД) Тогда
	
		Возврат Неопределено;	
	
	КонецЕсли; 
	
	УИДДоскиПроизводство 	= омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("НаименованиеДоскиПроизводство");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКарточки.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|ГДЕ
		|	КанбанКарточки.Ресурс = &Ресурс
		|	И КанбанКарточки.Доска = &Доска";
	
	Запрос.УстановитьПараметр("Доска", УИДДоскиПроизводство);
	Запрос.УстановитьПараметр("Ресурс", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Неопределено;	
	КонецЦикла;
	
	ИмяДоски = омКанбанДоскиНаСервереПовтор.ПолучитьИмяДоски("НаименованиеДоскиПроизводство");
	стРазделители = Новый Структура("Проект, Сотрудник", Комплект.Проект, Неопределено); 
	
	МассивКомплектов = Новый Массив(1);
	МассивКомплектов[0] = Комплект;
	
	омКанбанНачальноеЗаполнение.ЗаполнитьНачальноеЗаполнениеКанбана(ИмяДоски, стРазделители, МассивКомплектов, "Начальное заполнение"); 
	
	
	
КонецФункции // ПередачаВПроизводство()
