
&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = "Файл изображения|*.jpg;*.png;*.jpeg"; 
	ПомещенныйФайл = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога);
	
	Если ПомещенныйФайл <> Неопределено И Не ПомещенныйФайл.ПомещениеФайлаОтменено Тогда
		ЗаписатьФайлКартинкиНаСервере(ПараметрКоманды, ПомещенныйФайл.Адрес, ПомещенныйФайл.СсылкаНаФайл.Имя);
		Оповестить("Добавлена картинка", ПараметрКоманды);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьФайлКартинкиНаСервере(ИзделиеЗаказчика, АдресВХ, ИмяФайла)

	
	МЗ = РегистрыСведений.КартинкиНоменклатуры.СоздатьМенеджерЗаписи();
	
	МЗ.ИзделиеЭлемент = ИзделиеЗаказчика;
	МЗ.ИмяФайла 		= ИмяФайла;
	МЗ.Картинка 		= Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХ));
	
	МЗ.Записать();
	
	
КонецФункции