
&НаКлиенте
Процедура ИзменитьАдресПортала(Команда)
	
	ОткрытьФорму("РегистрСведений.Б24_К_ИдентификаторыОбъектов.Форма.ФормаИзмененияАдресаПортала");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)  
	
	ТекущаяСтрокаТЧ = Элементы.Список.ТекущаяСтрока;
	ТекущиеДанныеТЧ = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанныеТЧ <> Неопределено И ТипЗнч(ТекущаяСтрокаТЧ) = Тип("РегистрСведенийКлючЗаписи.Б24_К_ИдентификаторыДел") Тогда
		Сущность1С = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоИмениИИдентификатору(ТекущиеДанныеТЧ.ТипОбъекта, ТекущиеДанныеТЧ.ИдентификаторОбъекта);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)   
	
	Если ЗначениеЗаполнено(Сущность1С) Тогда	
		
		СтандартнаяОбработка = Ложь;
		
		ПоказатьЗначение(, Сущность1С);
	КонецЕсли;
	
КонецПроцедуры

