Процедура РасчетТабеляЗаПериод(ДатаНачала = Неопределено, ДатаОкончания = Неопределено) Экспорт

	Если ДатаНачала = Неопределено Тогда
		ДатаН = НачалоДня(ТекущаяДата());
	Иначе
		ДатаН = НачалоДня(ДатаНачала);
	КонецЕсли;
	
	Если ДатаОкончания = Неопределено Тогда
		ДатаК = КонецДня(ДатаН);
	Иначе
		ДатаК = КонецДня(ДатаОкончания);
	КонецЕсли;
	
	СекундВСутках = 25 * 3600;
	
    Пока ДатаН < ДатаК Цикл
	
		РасчитатьТабельЗаДень(ДатаН);
		ДатаН = ДатаН + СекундВСутках;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура РасчитатьТабельЗаДень(Дата)

	РаботающиеСотрудники = РаботающиеСотрудники(Дата);
	

КонецПроцедуры


Функция РаботающиеСотрудники(Дата)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриемНаРаботуСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ПриемНаРаботу.СрезПоследних(&Дата, ) КАК ПриемНаРаботуСрезПоследних
		|ГДЕ
		|	ПриемНаРаботуСрезПоследних.Работает";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции // РаботающиеСотрудники()

  