Процедура РасчетТабеляЗаПериод(ДатаНачала = Неопределено, ДатаОкончания = Неопределено) Экспорт

	Если ДатаНачала = Неопределено Тогда
		ДатаН = НачалоДня(ТекущаяДата());
	Иначе
		ДатаН = НачалоДня(ДатаНачала);
	КонецЕсли;
	
	Если ДатаОкончания = Неопределено Тогда
		ДатаК = КонецДня(ДатаН);
	Иначе
		ДатаК = КонецДня(ДатаОкончания);
	КонецЕсли; 
	
	ТД = ТекущаяДата();
	
	тзРабочиеЧасы = омДаты.ПолучитьРабочиеДни(ДатаН, ДатаК);
	
	ТипыДней = Новый Структура("КоличествоЧасов, ТипДня", 0);
	ДанныеВыходногоДня 	= ПолучитьТипВыходногооДняПоУмолчанию();							
	ДанныеРабочегоДня 	= ПолучитьТипРабочегоДняПоУмолчанию();							
								
	Для каждого СтрокаДат Из тзРабочиеЧасы Цикл
		
		Если СтрокаДат.Дата > ТД Тогда
			
			ОчиститьДату(СтрокаДат.Дата);
			
		Иначе
			
			ТипыДней.ТипДня 			= ?(СтрокаДат.РабочиеЧасы = 0, ДанныеВыходногоДня.ТипДня, ДанныеРабочегоДня.ТипДня);
			ТипыДней.КоличествоЧасов 	= СтрокаДат.РабочиеЧасы;
			
			РасчитатьТабельЗаДень(СтрокаДат, ТипыДней);
			
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ОчиститьДату(Дата)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Табель.Сотрудник КАК Сотрудник,
		|	Табель.ТипДня КАК ТипДня
		|ИЗ
		|	РегистрСведений.Табель КАК Табель
		|ГДЕ
		|	Табель.Дата = &Дата
		|	И Табель.ДокументОтклонения = ЗНАЧЕНИЕ(Документ.ОтклоненияРабочихДней.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи 				= РегистрыСведений.Табель.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Сотрудник 	= Выборка.Сотрудник;
		МенеджерЗаписи.ТипДня 		= Выборка.ТипДня;
		МенеджерЗаписи.Дата 		= Дата;
		
		МенеджерЗаписи.Удалить();
		
	КонецЦикла;

КонецПроцедуры

Процедура РасчитатьТабельЗаДень(СтрокаДат, ТипыДней)
	
	Попытка
		НачатьТранзакцию();
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.Табель");
		ЭлементБлокировки.УстановитьЗначение("Дата", СтрокаДат.Дата);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		РаботающиеСотрудники = РаботающиеСотрудники(СтрокаДат.Дата);
		
		ТекущийТабель = ПолучитьТекущийТабель(СтрокаДат.Дата);
		ТекущийТабель.Индексы.Добавить("Сотрудник");
		
		УдалитьЗаписиНеРаботающихСотрудников(РаботающиеСотрудники, ТекущийТабель, СтрокаДат.Дата);
		
		СотрудникиСОтклонением = ПолучитьСотрудниковСОтклонением(РаботающиеСотрудники, СтрокаДат.Дата);
		
		ЗаполнитьЗначениеПоУмолчанию(СотрудникиСОтклонением, РаботающиеСотрудники, СтрокаДат, ТекущийТабель, ТипыДней);
		
		ЗафиксироватьТранзакцию();

		
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;

КонецПроцедуры

Функция ПолучитьТипРабочегоДняПоУмолчанию() Экспорт

	ДанныеРабочегоДня = Новый Структура("Наименование, КоличествоЧасов, ПредставлениеВОтчетах, ТипДня", "", 0, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипыРабочихДней.Наименование КАК Наименование,
		|	ТипыРабочихДней.Ссылка КАК ТипДня,
		|	ТипыРабочихДней.КоличествоЧасов КАК КоличествоЧасов,
		|	ТипыРабочихДней.ПредставлениеВОтчетах КАК ПредставлениеВОтчетах
		|ИЗ
		|	Справочник.ТипыРабочихДней КАК ТипыРабочихДней
		|ГДЕ
		|	ТипыРабочихДней.РабочийПоУмолчанию";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеРабочегоДня, Выборка);
	КонецЦикла;
	
	Возврат ДанныеРабочегоДня;
	

КонецФункции // ПолучитьТипРабочегоДняПоУмолчанию

Функция ПолучитьТипВыходногооДняПоУмолчанию() Экспорт

	ДанныеРабочегоДня = Новый Структура("Наименование, КоличествоЧасов, ПредставлениеВОтчетах, ТипДня", "", 0, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипыРабочихДней.Наименование КАК Наименование,
		|	ТипыРабочихДней.Ссылка КАК ТипДня,
		|	ТипыРабочихДней.КоличествоЧасов КАК КоличествоЧасов,
		|	ТипыРабочихДней.ПредставлениеВОтчетах КАК ПредставлениеВОтчетах
		|ИЗ
		|	Справочник.ТипыРабочихДней КАК ТипыРабочихДней
		|ГДЕ
		|	ТипыРабочихДней.ВыходнойПоУмолчанию";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеРабочегоДня, Выборка);
	КонецЦикла;
	
	Возврат ДанныеРабочегоДня;
	

КонецФункции // ПолучитьТипВыходногооДняПоУмолчанию

Процедура ЗаполнитьЗначениеПоУмолчанию(СотрудникиСОтклонением, РаботающиеСотрудники, СтрокаДат, ТекущийТабель, ТипыДней)

	ПустоеОтклонение 	= Документы.ОтклоненияРабочихДней.ПустаяСсылка();
	Отбор = Новый Структура("Сотрудник", );
	
	Для каждого Сотрудник Из РаботающиеСотрудники Цикл
	
		Если НЕ СотрудникиСОтклонением.Найти(Сотрудник) = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		Отбор.Сотрудник = Сотрудник;
		СуществующиеДвижения = ТекущийТабель.НайтиСтроки(Отбор);
		
		Если СуществующиеДвижения.Количество() = 0  Тогда
		
			СоздатьЗаписьВРегистр(Сотрудник, СтрокаДат.Дата, ТипыДней.ТипДня, ПустоеОтклонение, ТипыДней.КоличествоЧасов);
			
		Иначе
			
			Для каждого ТекущиеДвижение Из СуществующиеДвижения Цикл
				
				Если ТекущиеДвижение.ТипДня = ТипыДней.ТипДня Тогда
				
					Если ТекущиеДвижение.КоличествоЧасов = ТипыДней.КоличествоЧасов Тогда
					
						Продолжить;	
					
					КонецЕсли;
					
					СоздатьЗаписьВРегистр(Сотрудник, СтрокаДат.Дата, ТипыДней.ТипДня, ПустоеОтклонение, ТипыДней.КоличествоЧасов);
					
				Иначе
					
					МенеджерЗаписи 				= РегистрыСведений.Табель.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Сотрудник 	= Сотрудник;
					МенеджерЗаписи.ТипДня 		= ТекущиеДвижение.ТипДня;
					МенеджерЗаписи.Дата 		= СтрокаДат.Дата;
					
					МенеджерЗаписи.Удалить();
					
				КонецЕсли;
				
			
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры 

Процедура СоздатьЗаписьВРегистр(Сотрудник, Дата, ТипДня, ДокументОтклонения, КоличествоЧасов)

	МенеджерЗаписи = РегистрыСведений.Табель.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Сотрудник 			= Сотрудник;
	МенеджерЗаписи.Дата 				= Дата;
	МенеджерЗаписи.ТипДня 				= ТипДня; 
	МенеджерЗаписи.ДокументОтклонения 	= ДокументОтклонения;
	МенеджерЗаписи.КоличествоЧасов 		= КоличествоЧасов;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ПолучитьСотрудниковСОтклонением(РаботающиеСотрудники, Дата)

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Табель.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.Табель КАК Табель
		|ГДЕ
		|	НЕ Табель.ДокументОтклонения = ЗНАЧЕНИЕ(Документ.ОтклоненияРабочихДней.ПустаяСсылка)
		|	И Табель.Сотрудник В(&РаботающиеСотрудники)
		|	И Табель.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("РаботающиеСотрудники", РаботающиеСотрудники);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
	

КонецФункции // ПолучитьСотрудниковСОтклонением(РаботающиеСотрудники)

Процедура УдалитьЗаписиНеРаботающихСотрудников(РаботающиеСотрудники, ТекущийТабель, Дата)

    Для каждого ЗаписьТабеля Из ТекущийТабель Цикл
	
		Если РаботающиеСотрудники.Найти(ЗаписьТабеля.Сотрудник) = Неопределено Тогда
		
			МенеджерЗаписи 				= РегистрыСведений.Табель.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Сотрудник 	= ЗаписьТабеля.Сотрудник;
			МенеджерЗаписи.Дата 		= Дата;
			
			МенеджерЗаписи.Удалить();
		
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьТекущийТабель(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Табель.Сотрудник КАК Сотрудник,
		|	Табель.ТипДня КАК ТипДня,
		|	Табель.КоличествоЧасов КАК КоличествоЧасов,
		|	Табель.ДокументОтклонения КАК ДокументОтклонения
		|ИЗ
		|	РегистрСведений.Табель КАК Табель
		|ГДЕ
		|	Табель.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТекущийТабель()

Функция РаботающиеСотрудники(Дата, Подразделение = Неопределено, ПолучитьТаблицей = Ложь, БезСдельщиков = Истина) Экспорт

	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПриемНаРаботуСрезПоследних.Сотрудник КАК Сотрудник,
			|	ПриемНаРаботуСрезПоследних.Сотрудник.Наименование КАК СотрудникНаименование
			|ИЗ
			|	РегистрСведений.ПриемНаРаботу.СрезПоследних(&Дата, ) КАК ПриемНаРаботуСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Подразделения КАК Подразделения
			|		ПО ПриемНаРаботуСрезПоследних.Сотрудник = Подразделения.Сотрудник
			|ГДЕ
			|	ПриемНаРаботуСрезПоследних.Работает
			|	И Подразделения.Подразделение = &Подразделение
			|	И ВЫБОР
			|			КОГДА &БезСдельщиков
			|				ТОГДА НЕ ПриемНаРаботуСрезПоследних.Сотрудник.СдельнаяОплата
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|
			|УПОРЯДОЧИТЬ ПО
			|	СотрудникНаименование";
	
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		
	Иначе
	
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПриемНаРаботуСрезПоследних.Сотрудник КАК Сотрудник,
			|	ПриемНаРаботуСрезПоследних.Сотрудник.Наименование КАК СотрудникНаименование,
			|	ПодразделенияСрезПоследних.Подразделение КАК Подразделение,
			|	ПодразделенияСрезПоследних.Подразделение.Наименование КАК ПодразделениеНаименование,
			|	ПриемНаРаботуСрезПоследних.Сотрудник.СдельнаяОплата КАК СдельнаяОплата
			|ИЗ
			|	РегистрСведений.ПриемНаРаботу.СрезПоследних(&Дата, ) КАК ПриемНаРаботуСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Подразделения.СрезПоследних(&Дата, ) КАК ПодразделенияСрезПоследних
			|		ПО ПриемНаРаботуСрезПоследних.Сотрудник = ПодразделенияСрезПоследних.Сотрудник
			|ГДЕ
			|	ПриемНаРаботуСрезПоследних.Работает
			|	И ВЫБОР
			|			КОГДА &БезСдельщиков
			|				ТОГДА НЕ ПриемНаРаботуСрезПоследних.Сотрудник.СдельнаяОплата
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПодразделениеНаименование,
			|	СотрудникНаименование";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("БезСдельщиков", БезСдельщиков);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Если ПолучитьТаблицей Тогда
	
		Возврат Запрос.Выполнить().Выгрузить();
	
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник"); 
	
КонецФункции // РаботающиеСотрудники()

//Если Сотрудники СправочникСсылка.Сотрудники возврат структура иначе возврат таблица значений 
//Если ДатаОкончания = Неопределено, тогда КонецМесяца(ДатаНачала)
Функция ПолучитьКоличествоРабочхДнейПоТабелю(Сотрудники, ДатаНачала, ДатаОкончания = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(Табель.КоличествоЧасов) КАК КоличествоЧасов,
		|	СУММА(ВЫБОР
		|			КОГДА Табель.КоличествоЧасов = 0
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК КоличествоДней,
		|	Табель.Сотрудник КАК Сотрудник,
		|	Табель.Сотрудник.Наименование КАК СотрудникНаименование
		|ИЗ
		|	РегистрСведений.Табель КАК Табель
		|ГДЕ
		|	Табель.Сотрудник В(&Сотрудник)
		|	И Табель.Дата >= &ДатаНачала
		|	И Табель.Дата <= &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	Табель.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Табель.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ?(ДатаОкончания = Неопределено, КонецМесяца(ДатаНачала), ДатаОкончания));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудники);
	
	Если ТипЗнч(Сотрудники) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		СтруктураДанных = Новый Структура("КоличествоЧасов, КоличествоДней", 0, 0);
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
		КонецЦикла;
		
		Возврат СтруктураДанных;	
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьКоличествоРабочхДнейПоТабелю()

Функция ПолучитьПоДолжности(Должность, ВозвращатьПользователей = Истина) Экспорт

	Запрос = Новый Запрос;
	
	Если ВозвращатьПользователей Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Пользователи.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
			|		ПО Пользователи.Сотрудник = Сотрудники.Ссылка
			|ГДЕ
			|	НЕ Сотрудники.ПометкаУдаления
			|	И Сотрудники.Должность = &Должность";
		
		
	Иначе
	
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Сотрудники.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|ГДЕ
			|	НЕ Сотрудники.ПометкаУдаления
			|	И Сотрудники.Должность = &Должность";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Должность", Должность);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции // ПолучитьПоДолжности()
