Процедура РасчетТабеляЗаПериод(ДатаНачала = Неопределено, ДатаОкончания = Неопределено) Экспорт

	Если ДатаНачала = Неопределено Тогда
		ДатаН = НачалоДня(ТекущаяДата());
	Иначе
		ДатаН = НачалоДня(ДатаНачала);
	КонецЕсли;
	
	Если ДатаОкончания = Неопределено Тогда
		ДатаК = КонецДня(ДатаН);
	Иначе
		ДатаК = КонецДня(ДатаОкончания);
	КонецЕсли;
	
	СекундВСутках = 25 * 3600;
	
    Пока ДатаН < ДатаК Цикл
	
		РасчитатьТабельЗаДень(ДатаН);
		ДатаН = ДатаН + СекундВСутках;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура РасчитатьТабельЗаДень(Дата)

	РаботающиеСотрудники = РаботающиеСотрудники(Дата);
	
	ТекущийТабель = ПолучитьТекущийТабель(Дата);
	
	УдалитьЗаписиНеРаботающихСотрудников(РаботающиеСотрудники, ТекущийТабель, Дата);
	
	ДоументыОтклонения = ПолучитьДокументыОтклонения(Дата, РаботающиеСотрудники);
	

КонецПроцедуры 

Функция ПолучитьДокументыОтклонения(Дата, РаботающиеСотрудники)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтклоненияРабочихДней.Сотрудник КАК Сотрудник,
		|	ОтклоненияРабочихДней.ТипДня КАК ТипДня,
		|	ОтклоненияРабочихДней.КоличествоЧасов КАК КоличествоЧасов,
		|	ОтклоненияРабочихДней.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОтклоненияРабочихДней КАК ОтклоненияРабочихДней
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Табель КАК Табель
		|		ПО Табель.ДокументОтклонения = ОтклоненияРабочихДней.Ссылка
		|			И ОтклоненияРабочихДней.Сотрудник = Табель.Сотрудник
		|			И ОтклоненияРабочихДней.ТипДня = Табель.ТипДня
		|			И ОтклоненияРабочихДней.КоличествоЧасов = Табель.КоличествоЧасов
		|ГДЕ
		|	ОтклоненияРабочихДней.ДатаНачала >= &Дата
		|	И ОтклоненияРабочихДней.ДатаОкончания <= &Дата
		|	И ОтклоненияРабочихДней.Сотрудник В(&Сотрудник)
		|	И ОтклоненияРабочихДней.Проведен
		|	И Табель.Дата = &Дата";
	
	Запрос.УстановитьПараметр("ДатаНачала", Дата);
	Запрос.УстановитьПараметр("ДатаОкончания", Дата);
	Запрос.УстановитьПараметр("Сотрудник", РаботающиеСотрудники);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
КонецФункции // ПолучитьДокументыОтклонения()


Процедура УдалитьЗаписиНеРаботающихСотрудников(РаботающиеСотрудники, ТекущийТабель, Дата)

    Для каждого ЗаписьТабеля Из ТекущийТабель Цикл
	
		Если РаботающиеСотрудники.Найти(ЗаписьТабеля.Сотрудник) = Неопределено Тогда
		
			МенеджерЗаписи 				= РегистрыСведений.Табель.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Сотрудник 	= ЗаписьТабеля.Сотрудник;
			МенеджерЗаписи.Дата 		= Дата;
			
			МенеджерЗаписи.Удалить();
		
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры


Функция ПолучитьТекущийТабель(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Табель.Сотрудник КАК Сотрудник,
		|	Табель.ТипДня КАК ТипДня,
		|	Табель.КоличествоЧасов КАК КоличествоЧасов,
		|	Табель.ДокументОтклонения КАК ДокументОтклонения
		|ИЗ
		|	РегистрСведений.Табель КАК Табель
		|ГДЕ
		|	Табель.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТекущийТабель()


Функция РаботающиеСотрудники(Дата)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриемНаРаботуСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ПриемНаРаботу.СрезПоследних(&Дата, ) КАК ПриемНаРаботуСрезПоследних
		|ГДЕ
		|	ПриемНаРаботуСрезПоследних.Работает";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции // РаботающиеСотрудники()

  