
Процедура ПриЗаписи(Отказ)
	
	Если РабочийПоУмолчанию Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТипыРабочихДней.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ТипыРабочихДней КАК ТипыРабочихДней
			|ГДЕ
			|	ТипыРабочихДней.Ссылка <> &Ссылка
			|	И ТипыРабочихДней.РабочийПоУмолчанию";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			об = Выборка.Ссылка.ПолучитьОбъект();
			об.РабочийПоУмолчанию = Ложь;
			об.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	Если ВыходнойПоУмолчанию Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТипыРабочихДней.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ТипыРабочихДней КАК ТипыРабочихДней
			|ГДЕ
			|	ТипыРабочихДней.Ссылка <> &Ссылка
			|	И ТипыРабочихДней.ВыходнойПоУмолчанию";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			об = Выборка.Ссылка.ПолучитьОбъект();
			об.ВыходнойПоУмолчанию = Ложь;
			об.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
