&НаКлиенте
Процедура ЦветФонаПриИзменении(Элемент)
	Элементы.Декорация1.ЦветФона 	= ЦветФона;
	Модифицированность 				= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЦветШрифтаПриИзменении(Элемент)
	Элементы.Декорация1.ЦветТекста 	= ЦветТекста;
	Модифицированность 				= Истина;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ЦветФона 		= омЦветНаСервереПовтор.ПолучитьСтроковоеПредставлениеЦвета(ЦветФона);
	ТекущийОбъект.ЦветТекста 	= омЦветНаСервереПовтор.ПолучитьСтроковоеПредставлениеЦвета(ЦветТекста);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		ЦветФона 	= Новый Цвет(255, 255, 255);
		ЦветТекста 	= Новый Цвет(0, 0, 0);
	Иначе	
		ЦветФона 	= омЦветНаСервереПовтор.ПолучитьЦветИзСтрокиСПрефиксом(Объект.ЦветФона);
		ЦветТекста 	= омЦветНаСервереПовтор.ПолучитьЦветИзСтрокиСПрефиксом(Объект.ЦветТекста);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Декорация1.ЦветТекста 	= ЦветТекста;
	Элементы.Декорация1.ЦветФона 	= ЦветФона;
	Элементы.Декорация1.Заголовок 	= ?(ПустаяСтрока(Объект.Текст), "Пример цвета.", Объект.Текст);
КонецПроцедуры


&НаКлиенте
Процедура ТекстПриИзменении(Элемент)
	Элементы.Декорация1.Заголовок 	= ?(ПустаяСтрока(Объект.Текст), "Пример цвета.", Объект.Текст);
КонецПроцедуры

