
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПроекты();
	
	
КонецПроцедуры


Процедура ЗаполнитьПроекты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Ссылка,
		|	Проекты.Наименование КАК Наименование,
		|	Проекты.Номер КАК Номер,
		|	Проекты.Префикс КАК Префикс
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	НЕ Проекты.НеВыводитьНаДиаграмму
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Элементы.Проект.СписокВыбора.Добавить(Выборка.Ссылка, 
			Формат(Выборка.Номер, "ЧГ=0") + "-" + Выборка.Наименование + " (" + Выборка.Префикс + ")");
	КонецЦикла;


КонецПроцедуры

&НаСервере
Процедура ПроектПриИзмененииНаСервере()

	ПолеВывода.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Проект) Тогда
	
		Возврат;
	
	КонецЕсли;
	
	тзДанные = ПолучитьТаблицуДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ПроектПриИзмененииНаСервере();
	
КонецПроцедуры 

Функция ПолучитьТаблицуДанных()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.Комплект КАК Комплект,
		|	ДатыКомплекта.ДнейПКД КАК ДнейПКД,
		|	ДатыКомплекта.ДнейРКД КАК ДнейРКД,
		|	ДатыКомплекта.Код_в_PDM КАК Код_в_PDM,
		|	ДатыКомплекта.КрайПКД КАК КрайПКД,
		|	ДатыКомплекта.КрайРКД КАК КрайРКД,
		|	ДатыКомплекта.КрайТЗ КАК КрайТЗ,
		|	ДатыКомплекта.НачалоПКД КАК НачалоПКД,
		|	ДатыКомплекта.НачалоРКД КАК НачалоРКД,
		|	ДатыКомплекта.НачалоТЗ КАК НачалоТЗ,
		|	ДатыКомплекта.Комплект.Наименование КАК КомплектНаименование,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект.Проект = &Проект) КАК ДанныеКомплектаСрезПоследних
		|		ПО ДатыКомплекта.Комплект = ДанныеКомплектаСрезПоследних.Комплект
		|
		|УПОРЯДОЧИТЬ ПО
		|	КомплектНаименование";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Возврат  Запрос.Выполнить().Выгрузить();

КонецФункции // ПолучитьТаблицуДанных()

