Процедура СоздатьЭлементыИРеквизитыНаФорме(ТекущаяФорма, РодительскийЭлемент, ТаблицаДопПараметров, КоличествоКолонок = 2) Экспорт
	
	МассивГрупп 		= СоздатьГруппуКолонкиДополнительныхРеквизитов(ТекущаяФорма, РодительскийЭлемент, КоличествоКолонок);
	
	ДобавляемыеРеквизиты = Новый Массив; 
	Для каждого х Из ТаблицаДопПараметров Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(х.НаименованиеРеквизита, Новый ОписаниеТипов("Строка"))); 
	КонецЦикла;

	ТекущаяФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	
	НомерГруппыВывода	= 0;
	
	НомерГруппыВывода = НомерГруппыВывода + 1;
	
	НомерГруппыВывода = ?(НомерГруппыВывода < КоличествоКолонок, НомерГруппыВывода, 0);
	
  		ЭлементГруппа = МассивГрупп[НомерГруппыВывода] ;


КонецПроцедуры


Функция СоздатьГруппуКолонкиДополнительныхРеквизитов(ТекущаяФорма, РодительскийЭлемент, КоличествоКолонок)
	
	МассивГрупп = Новый Массив;
	
	Для х = 0 По КоличествоКолонок - 1 Цикл
		
		ГруппаДопПараметры 						= ТекущаяФорма.Элементы.Добавить("ГруппаДополнительныеПараметры_авто_" + х, Тип("ГруппаФормы"), РодительскийЭлемент);
		ГруппаДопПараметры.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаДопПараметры.Отображение 			= ОтображениеОбычнойГруппы.Нет;
		ГруппаДопПараметры.ОтображатьЗаголовок 	= Ложь; 
		ГруппаДопПараметры.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
	КонецЦикла;
	
	Возврат МассивГрупп;
	
КонецФункции

