&НаСервере
Функция ПолучитьИмяПапки(СсылкаНаГруппу) Экспорт
	Возврат СсылкаНаГруппу.Наименование;
КонецФункции // ПолучитьИмяПапки()

&НаСервере
Функция ПроверитьКаталогЭлемента(СсылкаНаИзделиеЗаказчика,Знач ОбъектИзделия = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ИзделияЗаказчика.Родитель.Проект, ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)) КАК РодительОбъект,
		|	ИзделияЗаказчика.Проект КАК Проект
		|ИЗ
		|	Справочник.ИзделияЗаказчика КАК ИзделияЗаказчика
		|ГДЕ
		|	ИзделияЗаказчика.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаИзделиеЗаказчика);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Если Выборка.РодительОбъект = Выборка.Проект Тогда
			Возврат Истина;	
		КонецЕсли; 
		Проект = Выборка.Проект;
	КонецЦикла; 
	
	Если Проект = Неопределено Тогда
		Проект = СсылкаНаИзделиеЗаказчика.Проект;
	КонецЕсли;
	
	ПеренестиЭлементаВГруппуОбъекта(Проект,СсылкаНаИзделиеЗаказчика);	
	
КонецФункции // ПроверитьКаталогИзделия()

&НаСервере
Процедура ПеренестиЭлементаВГруппуОбъекта(Проект,СсылкаНаИзделиеЗаказчика)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияЗаказчика.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИзделияЗаказчика КАК ИзделияЗаказчика
		|ГДЕ
		|	ИзделияЗаказчика.Проект = &Проект
		|	И ИзделияЗаказчика.ЭтоГруппа = ИСТИНА";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ГруппаИзделияЗаказачика = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		ГруппаИзделияЗаказачика = Выборка.Ссылка;
	КонецЦикла;
	
	Если ГруппаИзделияЗаказачика = Неопределено Тогда
		ГруппаИзделияЗаказачика = СоздатьКаталогЭлемента(Проект);
	КонецЕсли;
	
	обЭлементСделки 			= СсылкаНаИзделиеЗаказчика.ПолучитьОбъект();
	обЭлементСделки.Родитель 	= ГруппаИзделияЗаказачика;
	обЭлементСделки.Записать();
	
КонецПроцедуры // ПеренестиИзделиеВГруппуОбъекта() 

&НаСервере
Функция СоздатьКаталогЭлемента(Проект)
	обГруппаЭлементСделки = Справочники.ИзделияЗаказчика.СоздатьГруппу();
	обГруппаЭлементСделки.Проект = Проект;
	обГруппаЭлементСделки.Наименование = Проект;
	обГруппаЭлементСделки.Записать();
	
	Возврат обГруппаЭлементСделки.Ссылка;

КонецФункции // СоздатьКаталог()

&НаСервере
Функция ПолучитьАртикулОбъекта(СсылкаНаИзделиеЗаказчика, Проект = Неопределено, пНомерДоговора = Неопределено, пНомерВДоговоре = Неопределено, ПриложениеКДоговору = Неопределено) Экспорт

	Если Проект = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ИзделияЗаказчика.Проект.Префикс, """") КАК ПрефиксСделки
		|ИЗ
		|	Справочник.ИзделияЗаказчика КАК ИзделияЗаказчика
		|ГДЕ
		|	ИзделияЗаказчика.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаИзделиеЗаказчика);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ПрефиксСделки = Выборка.ПрефиксСделки;
		КонецЦикла;
		
	ИначеЕсли ЗначениеЗаполнено(Проект) Тогда
	
		ПрефиксСделки = Проект.Префикс;
		
	Иначе
		
		ПрефиксСделки = "";	
	
	КонецЕсли;
	
	Если пНомерДоговора = Неопределено ИЛИ пНомерВДоговоре = Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЕСТЬNULL(ПриложенияКДоговорамИзделияЗаказчика.Ссылка.НомерПоПорядку, """") КАК НомерДоговора,
		|	ЕСТЬNULL(ДанныеИзделияЗаказчика.НомерПоПорядку, """") КАК НомерВДоговоре,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК ПриложенияКДоговорамИзделияЗаказчика,
		|	РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
		|ГДЕ
		|	ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика = &ИзделиеЗаказчика
		|	И ДанныеИзделияЗаказчика.ИзделиеЗаказчика = &ИзделиеЗаказчика";
		
		Запрос.УстановитьПараметр("ИзделиеЗаказчика", СсылкаНаИзделиеЗаказчика);
		Выборка = Запрос.Выполнить().Выбрать();
		
		НомерВДоговоре = 0;
		Пока Выборка.Следующий() Цикл
			НомерДоговора 		= ?(ЗначениеЗаполнено(Выборка.НомерДоговора),Выборка.НомерДоговора, ""); 
			НомерВДоговоре 		= Выборка.НомерВДоговоре;
			ПриложениеКДоговору = Выборка.Ссылка;
			
			пНомерДоговора 		= НомерДоговора;
			пНомерВДоговоре		= НомерВДоговоре;
		КонецЦикла;
	Иначе
			НомерДоговора 	= пНомерДоговора; 
			НомерВДоговоре 	= пНомерВДоговоре;
	КонецЕсли;
	
	
	Возврат ПрефиксСделки + "." + НомерДоговора + "." + Формат(НомерВДоговоре,"ЧЦ=3; ЧН=; ЧВН="); 
КонецФункции // ПолучитьАртикулбъекта()
