&НаСервере
Функция ПолучитьДанныеЭлемента(СсылкаНаОбъект) Экспорт

	ИдентификаторОбъекта = СсылкаНаОбъект.УникальныйИдентификатор();
	
	//ДанныеЭлемента = Новый Структура;
	//ДанныеЭлемента.Вставить("ИдСмартПроцесса"			, СмартПроцесс.Ид);
	//ДанныеЭлемента.Вставить("ТипВладельцаСмартПроцесса"	, СмартПроцесс.ТипВладельца);
	//ДанныеЭлемента.Вставить("Наименование"				, СмартПроцесс.Наименование);
	//ДанныеЭлемента.Вставить("Данные"					, СмартПроцесс.Данные);
	

КонецФункции // ПолучитьДанныеЭлемента()
