Функция ПолучитьМассивЗадачЗакрытыеВПериод(ДатаНачала, ДатаОкончания, Исполнитель = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадач.Задача КАК Задача
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|ГДЕ
		|	ТаймингЗадач.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ВЫБОР
		|			КОГДА &Исполнитель = НЕОПРЕДЕЛЕНО
		|					ИЛИ &Исполнитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТаймингЗадач.Исполнитель = &Исполнитель
		|		КОНЕЦ
		|	И ТаймингЗадач.ТипЗадачи = значение(Перечисление.ТипыЗадачКонструирования.Завершение)";
	
	Запрос.УстановитьПараметр("ДатаНачала", 	ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	ДатаОкончания);
	Запрос.УстановитьПараметр("Исполнитель", 	Исполнитель);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьМассивЗадачЗакрытыеВПериод()
