
#Область Загрузка

Функция ПолучитьСтруктуруСПолямиКИ(Страна, Регион, Район, Индекс, ГородНП, Адрес1, Адрес2) Экспорт     
	
	СтруктураДанных =  Новый Структура;
	СтруктураДанных.Вставить("Страна"		,Страна);
	СтруктураДанных.Вставить("Регион"		, Регион);
	СтруктураДанных.Вставить("Район"		, Район);
	СтруктураДанных.Вставить("ПИндекс"		, Индекс);
	
	Если ВРег(СокрЛП(Страна)) <> Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьНазваниеСтраны() ИЛИ (ГородНП = "" И Адрес2 = "" И Регион = "" И Район = "") Тогда
		
		СтруктураДанных.Вставить("Город"			, "");
		СтруктураДанных.Вставить("Представление"	, Адрес1);
		СтруктураДанных.Вставить("ПроизвольныйАдрес", Истина);
		Возврат СтруктураДанных;
		
	КонецЕсли;
	
	Город 		= "";
	НасПункт 	= "";
	Улица 		= "";
	Дом 		= "";
	Корпус 		= "";
	Участок 	= "";
	Сооружение 	= "";
	Строение 	= "";
	Литера		= "";
	
	Квартира	= "";
	Офис		= "";
	Бокс		= "";
	Помещение	= "";
	Этаж		= "";
	АЯ			= "";
	ПОП			= "";
	ВЧ			= "";
	Другое		= "";
	Комната		= "";
	
	ГородНПМассив = СтрРазделить(ГородНП, ",");
	
	Если ГородНПМассив.Количество()>0 Тогда
		Город = СокрЛП(ГородНПМассив[0]);
	КонецЕсли;
	
	Если ГородНПМассив.Количество()>1 Тогда
		НасПункт = СокрЛП(СтрЗаменить(ГородНПМассив[1], "нас. пункт", ""));
	ИначеЕсли ГородНПМассив.Количество()=1 Тогда
		Если СтрНайти(ГородНПМассив[0], "нас. пункт") Тогда
			Город = "";	
			НасПункт = СокрЛП(СтрЗаменить(ГородНПМассив[0], "нас. пункт", ""));
		КонецЕсли;
	КонецЕсли;
	
	Адрес1Массив = СтрРазделить(Адрес1, ","); 
	Адрес2Массив = СтрРазделить(Адрес2, ","); 
	Адрес1Массив = ?(ЗначениеЗаполнено(Адрес1), Адрес1Массив, Адрес2Массив);   
	
	Для каждого Элемент Из Адрес1Массив Цикл
		
		Если СтрНайти(Элемент, "улица ")> 0 Тогда
			Улица = СокрЛП(СтрЗаменить(Элемент, "улица ", ""));	
		ИначеЕсли СтрНайти(Элемент, "Улица ")> 0 Тогда
			Улица = СокрЛП(СтрЗаменить(Элемент, "Улица ", ""));	
		ИначеЕсли СтрНайти(Элемент, "УЛИЦА ")> 0 Тогда
			Улица = СокрЛП(СтрЗаменить(Элемент, "УЛИЦА ", ""));	
		ИначеЕсли СтрНайти(Элемент, " УЛИЦА")> 0 Тогда
			Улица = СокрЛП(СтрЗаменить(Элемент, " УЛИЦА", ""));	
		ИначеЕсли СтрНайти(Элемент, "УЛ.")> 0 Тогда
			Улица = СокрЛП(СтрЗаменить(Элемент, "УЛ.", ""));
		ИначеЕсли СтрНайти(Элемент, " УЛ ")> 0 Тогда
			Улица = СокрЛП(СтрЗаменить(Элемент, " УЛ ", " "));	
		ИначеЕсли СтрНайти(Элемент, "ул ")> 0 Тогда
			Улица = СокрЛП(СтрЗаменить(Элемент, "ул ", " "));	
		ИначеЕсли стрНайти(Элемент, " ул") > 0 Тогда
			Улица = СокрЛП(Элемент);      
		ИначеЕсли стрНайти(Элемент, " ш.") > 0 Тогда
			Улица = СокрЛП(Элемент);     
		ИначеЕсли стрНайти(Элемент, " Ш.") > 0 Тогда
			Улица = СокрЛП(Элемент);      
		ИначеЕсли СтрНайти(Элемент, "просп ")> 0 Тогда
			Улица = СокрЛП(СтрЗаменить(Элемент, "просп ", ""));	
			Улица = Улица + " пр-кт";
		ИначеЕсли СтрНайти(Элемент, "ПРОСПЕКТ")> 0 Тогда
			Улица = СокрЛП(СтрЗаменить(Элемент, "ПРОСПЕКТ", ""));	
			Улица = Улица + " пр-кт";
		ИначеЕсли СтрНайти(Элемент, "БУЛЬВАР")> 0 Тогда
			Улица = СокрЛП(Элемент);	
		ИначеЕсли СтрНайти(Элемент, "Б-Р")> 0 Тогда
			Улица = СокрЛП(Элемент);				
		ИначеЕсли СтрНайти(Элемент, "ПЛОЩАДЬ")> 0 Тогда
			Улица = СокрЛП(Элемент);
		ИначеЕсли стрНайти(Элемент, " пер") > 0 Тогда
			Улица = СокрЛП(Элемент);	              
		ИначеЕсли стрНайти(Элемент, " наб.") > 0 Тогда
			Улица = СокрЛП(Элемент);	              
		ИначеЕсли стрНайти(Элемент, "пер ") > 0 Тогда
			Улица = СокрЛП(Элемент);	
		ИначеЕсли СтрНайти(Элемент, "ПЕР ")> 0 Тогда
			Улица = СокрЛП(Элемент);	
		ИначеЕсли СтрНайти(Элемент, " ПЕР")> 0 Тогда
			Улица = СокрЛП(Элемент);	
		ИначеЕсли СтрНайти(Элемент, "ПЕРЕУЛОК")> 0 Тогда
			Улица = СокрЛП(Элемент);	
		ИначеЕсли стрНайти(Элемент, " проезд") > 0 Тогда
			Улица = СокрЛП(Элемент);	
		ИначеЕсли стрНайти(Элемент, " линия") > 0 Тогда
			Улица = СокрЛП(Элемент);	
		ИначеЕсли стрНайти(Элемент, " ал.") > 0 Тогда
			Улица = СокрЛП(Элемент);	
		ИначеЕсли стрНайти(Элемент, " пр-кт") > 0 Тогда
			Улица = СокрЛП(Элемент);	
		ИначеЕсли стрНайти(Элемент, " пл") > 0 Тогда
			Улица = СокрЛП(Элемент);	
		ИначеЕсли стрНайти(Элемент, " дор") > 0 Тогда
			Улица = СокрЛП(Элемент);	
		ИначеЕсли стрНайти(Элемент, " тер") > 0 Тогда
			Улица = СокрЛП(Элемент);	
/////////////////////////////////////////////////////////////////////////////////////////		
		ИначеЕсли СтрНайти(Элемент, "дом ")> 0 Тогда
			Дом = СокрЛП(СтрЗаменить(Элемент, "дом ", ""));	
		ИначеЕсли СтрНайти(Элемент, "Дом ")> 0 Тогда
			Дом = СокрЛП(СтрЗаменить(Элемент, "Дом ", ""));	
		ИначеЕсли СтрНайти(Элемент, "ДОМ ")> 0 Тогда
			Дом = СокрЛП(СтрЗаменить(Элемент, "ДОМ ", ""));	
		ИначеЕсли СтрНайти(Элемент, " Д.")> 0 Тогда
			Дом = СокрЛП(СтрЗаменить(Элемент, " Д.", "")); 
		ИначеЕсли СтрНайти(Элемент, " Д")> 0 Тогда
			Дом = СокрЛП(СтрЗаменить(Элемент, " Д", " "));	
		ИначеЕсли СтрНайти(Элемент, "Д. ")> 0 Тогда
			Дом = СокрЛП(СтрЗаменить(Элемент, "Д. ", " "));
		ИначеЕсли СтрНайти(Элемент, "Д ")> 0 Тогда
			Дом = СокрЛП(СтрЗаменить(Элемент, "Д ", " "));
		ИначеЕсли СтрНайти(СокрЛП(Элемент), " д.")> 0 Тогда
			Дом = СокрЛП(СтрЗаменить(Элемент, " д.", " "));	
/////////////////////////////////////////////////////////////////////////////////////////		
		ИначеЕсли СтрНайти(Элемент, "этаж ")> 0 Тогда
			Этаж = СокрЛП(СтрЗаменить(Элемент, "этаж ", ""));	
		ИначеЕсли СтрНайти(Элемент, "Этаж ")> 0 Тогда
			Этаж = СокрЛП(СтрЗаменить(Элемент, "Этаж ", ""));	
		ИначеЕсли СтрНайти(Элемент, "ЭТАЖ ")> 0 Тогда
			Этаж = СокрЛП(СтрЗаменить(Элемент, "ЭТАЖ ", ""));	
/////////////////////////////////////////////////////////////////////////////////////////		
		ИначеЕсли СтрНайти(Элемент, "корпус ")> 0 Тогда
			Корпус = СокрЛП(СтрЗаменить(Элемент, "корпус", ""));	
		ИначеЕсли СтрНайти(Элемент, "Корпус ")> 0 Тогда
			Корпус = СокрЛП(СтрЗаменить(Элемент, "Корпус", ""));	
		ИначеЕсли СтрНайти(Элемент, "КОРПУС ")> 0 Тогда
			Корпус = СокрЛП(СтрЗаменить(Элемент, "КОРПУС ", ""));	
		ИначеЕсли СтрНайти(Элемент, "КОРП ")> 0 Тогда
			Корпус = СокрЛП(СтрЗаменить(Элемент, "КОРП ", ""));	
		ИначеЕсли СтрНайти(Элемент, "корп ")> 0 Тогда
			Корпус = СокрЛП(СтрЗаменить(Элемент, "корп ", ""));	
/////////////////////////////////////////////////////////////////////////////////////////		
		ИначеЕсли СтрНайти(Элемент, "сооружение ")> 0 Тогда
			Сооружение = СокрЛП(СтрЗаменить(Элемент, "сооружение ", ""));	
		ИначеЕсли СтрНайти(Элемент, "Сооружение ")> 0 Тогда
			Сооружение = СокрЛП(СтрЗаменить(Элемент, "Сооружение ", ""));	
		ИначеЕсли СтрНайти(Элемент, "СООРУЖЕНИЕ ")> 0 Тогда
			Сооружение = СокрЛП(СтрЗаменить(Элемент, "СООРУЖЕНИЕ ", ""));	
/////////////////////////////////////////////////////////////////////////////////////////		
		ИначеЕсли СтрНайти(Элемент, "литера ")> 0 Тогда
			Литера = СокрЛП(СтрЗаменить(Элемент, "литера ", ""));
		ИначеЕсли СтрНайти(Элемент, "Литера ")> 0 Тогда
			Литера = СокрЛП(СтрЗаменить(Элемент, "Литера ", ""));
		ИначеЕсли СтрНайти(Элемент, "ЛИТЕРА ")> 0 Тогда
			Литера = СокрЛП(СтрЗаменить(Элемент, "ЛИТЕРА ", ""));
/////////////////////////////////////////////////////////////////////////////////////////		
		ИначеЕсли СтрНайти(Элемент, "строение ")> 0 Тогда
			Строение = СокрЛП(СтрЗаменить(Элемент, "строение", ""));	
		ИначеЕсли СтрНайти(Элемент, "Строение ")> 0 Тогда
			Строение = СокрЛП(СтрЗаменить(Элемент, "Строение", ""));	
		ИначеЕсли СтрНайти(Элемент, "СТРОЕНИЕ ")> 0 Тогда
			Строение = СокрЛП(СтрЗаменить(Элемент, "СТРОЕНИЕ ", ""));	 
		ИначеЕсли СтрНайти(Элемент, "СТР.")> 0 Тогда
			Строение = СокрЛП(СтрЗаменить(Элемент, "СТР.", ""));	 
/////////////////////////////////////////////////////////////////////////////////////////		
		ИначеЕсли СтрНайти(Элемент, "участок ")> 0 Тогда
			Участок = СокрЛП(СтрЗаменить(Элемент, "участок", ""));	
		ИначеЕсли СтрНайти(Элемент, "Участок ")> 0 Тогда
			Участок = СокрЛП(СтрЗаменить(Элемент, "Участок", ""));	
		ИначеЕсли СтрНайти(Элемент, "УЧАСТОК ")> 0 Тогда
			Участок = СокрЛП(СтрЗаменить(Элемент, "УЧАСТОК", ""));	
/////////////////////////////////////////////////////////////////////////////////////////		
		ИначеЕсли СтрНайти(Элемент, "а/я")> 0 Тогда
			АЯ = СокрЛП(СтрЗаменить(Элемент, "а/я", ""));	
		ИначеЕсли СтрНайти(Элемент, "А/Я")> 0 Тогда
			АЯ = СокрЛП(СтрЗаменить(Элемент, "А/Я", ""));	
		ИначеЕсли СтрНайти(Элемент, "п/о")> 0 Тогда
			ПОП = СокрЛП(СтрЗаменить(Элемент, "п/о", ""));	
		ИначеЕсли СтрНайти(Элемент, "П/П")> 0 Тогда
			ПОП = СокрЛП(СтрЗаменить(Элемент, "П/О", ""));	
		ИначеЕсли СтрНайти(Элемент, "в/ч")> 0 Тогда
			ВЧ = СокрЛП(СтрЗаменить(Элемент, "в/ч", ""));	
		ИначеЕсли СтрНайти(Элемент, "В/Ч")> 0 Тогда
			ВЧ = СокрЛП(СтрЗаменить(Элемент, "В/Ч", ""));	
		КонецЕсли;
	КонецЦикла;
	
	Адрес2Массив = СтрРазделить(Адрес2, ",");
	
	Для Каждого Элемент Из Адрес2Массив Цикл
		
		Если СтрНайти(Элемент, "квартира ")> 0 Тогда
			Квартира = СокрЛП(СтрЗаменить(Элемент, "квартира ", ""));	
			Продолжить;
		КонецЕсли;
		Если СтрНайти((Элемент), "Квартира ")> 0 Тогда
			Квартира = СокрЛП(СтрЗаменить(Элемент, "Квартира ", ""));	
			Продолжить;
		КонецЕсли;
		Если СтрНайти((Элемент), "КВАРТИРА ")> 0 Тогда
			Квартира = СокрЛП(СтрЗаменить(Элемент, "КВАРТИРА ", ""));	
			Продолжить;
		КонецЕсли;
/////////////////////////////////////////////////////////////////////////////////////////		
		Если СтрНайти(Элемент, "офис ")> 0 Тогда
			Офис = СокрЛП(СтрЗаменить(Элемент, "офис ", ""));	
			Продолжить;
		КонецЕсли;
		Если СтрНайти(Элемент, "Офис ")> 0 Тогда
			Офис = СокрЛП(СтрЗаменить(Элемент, "Офис ", ""));	
			Продолжить;
		КонецЕсли;
		Если СтрНайти(Элемент, "ОФИС ")> 0 Тогда
			Офис = СокрЛП(СтрЗаменить(Элемент, "ОФИС ", ""));	
			Продолжить;
		КонецЕсли;
/////////////////////////////////////////////////////////////////////////////////////////		
		Если СтрНайти(Элемент, "бокс ")> 0 Тогда
			бокс = СокрЛП(СтрЗаменить(Элемент, "бокс ", ""));	
			Продолжить;
		КонецЕсли;
		Если СтрНайти(Элемент, "Бокс ")> 0 Тогда
			бокс = СокрЛП(СтрЗаменить(Элемент, "Бокс ", ""));	
			Продолжить;
		КонецЕсли;
		Если СтрНайти(Элемент, "БОКС ")> 0 Тогда
			бокс = СокрЛП(СтрЗаменить(Элемент, "БОКС ", ""));	
			Продолжить;
		КонецЕсли;
/////////////////////////////////////////////////////////////////////////////////////////		
		Если СтрНайти(Элемент, "помещение ")> 0 Тогда
			Помещение = СокрЛП(СтрЗаменить(Элемент, "помещение ", ""));	
			Продолжить;
		КонецЕсли;
		Если СтрНайти(Элемент, "Помещение ")> 0 Тогда
			Помещение = СокрЛП(СтрЗаменить(Элемент, "Помещение ", ""));	
			Продолжить;
		КонецЕсли;
		Если СтрНайти(Элемент, "ПОМЕЩЕНИЕ ")> 0 Тогда
			Помещение = СокрЛП(СтрЗаменить(Элемент, "ПОМЕЩЕНИЕ ", ""));	
			Продолжить;
		КонецЕсли;     
		Если СтрНайти(Элемент, "ПОМЕЩ.")> 0 Тогда
			Помещение = СокрЛП(СтрЗаменить(Элемент, "ПОМЕЩ.", ""));	
			Продолжить;
		КонецЕсли;  
/////////////////////////////////////////////////////////////////////////////////////////		
		Если СтрНайти(Элемент, "этаж ")> 0 Тогда
			Этаж = СокрЛП(СтрЗаменить(Элемент, "этаж ", ""));	
			Продолжить;
		КонецЕсли;
		Если СтрНайти(Элемент, "Этаж ")> 0 Тогда
			Этаж = СокрЛП(СтрЗаменить(Элемент, "Этаж ", ""));	
			Продолжить;
		КонецЕсли;
		Если СтрНайти(Элемент, "ЭТАЖ ")> 0 Тогда
			Этаж = СокрЛП(СтрЗаменить(Элемент, "ЭТАЖ ", ""));	
			Продолжить;
		КонецЕсли;
/////////////////////////////////////////////////////////////////////////////////////////		
		Если СтрНайти(Элемент, "комната ")> 0 Тогда
			Комната = СокрЛП(СтрЗаменить(Элемент, "комната ", ""));	
			Продолжить;
		КонецЕсли;
		Если СтрНайти(Элемент, "комн ")> 0 Тогда
			Комната = СокрЛП(СтрЗаменить(Элемент, "комн ", ""));	
			Продолжить;
		КонецЕсли;
		Если СтрНайти(Элемент, "Комната ")> 0 Тогда
			Комната = СокрЛП(СтрЗаменить(Элемент, "Комната ", ""));	
			Продолжить;
		КонецЕсли;
		Если СтрНайти(Элемент, "КОМНАТА ")> 0 Тогда
			Комната = СокрЛП(СтрЗаменить(Элемент, "КОМНАТА ", ""));	
			Продолжить;
		КонецЕсли;
		Если СтрНайти(Элемент, "КОМН ")> 0 Тогда
			Комната = СокрЛП(СтрЗаменить(Элемент, "КОМН ", ""));	
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Представление = Строка(Индекс);
	
	Представление = Представление + ?(ЗначениеЗаполнено(Регион)		, ", " + Регион					, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(Район)		, ", " + Район					, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(Город)		, ", " + Город					, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(НасПункт)	, ", " + НасПункт				, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(Улица)		, ", " + Улица					, "");	
	
	Представление = Представление + ?(ЗначениеЗаполнено(Дом)		, ", дом № " + Дом				, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(Участок)	, ", участок " + Участок		, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(Сооружение)	, ", сооружение " + Сооружение	, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(Литера)		, ", литера " + Литера			, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(Строение)	, ", строение " + Строение		, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(Корпус)		, ", корпус " + Корпус			, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(Квартира)	, ", квартира " + Квартира		, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(Офис)		, ", офис " + Офис				, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(Бокс)		, ", бокс " + Бокс				, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(Помещение)	, ", помещение " + Помещение	, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(Этаж)		, ", этаж " + Этаж				, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(АЯ)			, ", а/я " + АЯ					, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(ПОП)		, ", п/о " + ПОП				, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(ВЧ)			, ", в/ч " + ВЧ					, "");	
	Представление = Представление + ?(ЗначениеЗаполнено(Комната)	, ", комната " + Комната		, "");	
	
	СтруктураДанных.Вставить("Представление",Представление);
	СтруктураДанных.Вставить("Город"	, Город);
	СтруктураДанных.Вставить("НаселПункт",НасПункт);
	СтруктураДанных.Вставить("Улица"	, Улица);
	
	
	СтруктураДанных.Вставить("Дом"		, Дом);
	СтруктураДанных.Вставить("Участок"	, Участок);
	СтруктураДанных.Вставить("Сооружение",Сооружение);
	СтруктураДанных.Вставить("Литера"	, Литера);
	СтруктураДанных.Вставить("Строение"	, Строение);
	СтруктураДанных.Вставить("Корпус"	, Корпус);
	
	СтруктураДанных.Вставить("Квартира"	, Квартира);
	СтруктураДанных.Вставить("Офис"		, Офис);
	СтруктураДанных.Вставить("Бокс"		, Бокс);
	СтруктураДанных.Вставить("Помещение", Помещение);
	СтруктураДанных.Вставить("Этаж"		, Этаж);
	СтруктураДанных.Вставить("АЯ"		, АЯ);
	СтруктураДанных.Вставить("ПО"		, ПОП);
	СтруктураДанных.Вставить("ВЧ"		, ВЧ);
	СтруктураДанных.Вставить("Другое"	, Другое);
	СтруктураДанных.Вставить("Комната"	, Комната);
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПолучитьЗначениеПолейАдреса(СтруктураДанных) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("КонтактнаяИнформация");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xs"		, XMLСтрока("http://www.w3.org/2001/XMLSchema"));
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xsi"		, XMLСтрока("http://www.w3.org/2001/XMLSchema-instance"));
	ЗаписьXML.ЗаписатьАтрибут("xmlns"			, XMLСтрока("http://www.v8.1c.ru/ssl/contactinfo"));
	ЗаписьXML.ЗаписатьАтрибут("Представление"	, XMLСтрока(СтруктураДанных.Представление));
	
	// ЗаписьXML.ЗаписатьНачалоЭлемента("Комментарий");
	// ЗаписьXML.ЗаписатьКонецЭлемента();
	
	лСтрана = ВРег(СокрЛП(СтруктураДанных.Страна));
	Если лСтрана = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьНазваниеСтраны() И НЕ СтруктураДанных.Свойство("ПроизвольныйАдрес") Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("Состав");
		ЗаписьXML.ЗаписатьАтрибут("xsi:type", "Адрес");
		ЗаписьXML.ЗаписатьАтрибут("Страна", Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьНазваниеСтраны());
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Состав");
		ЗаписьXML.ЗаписатьАтрибут("xsi:type", "АдресРФ");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СубъектРФ");
		ЗаписьXML.ЗаписатьТекст(СтруктураДанных.Регион);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвРайМО");
		ЗаписьXML.ЗаписатьНачалоЭлемента("Район");
		ЗаписьXML.ЗаписатьТекст(СтруктураДанных.район);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Город");
		ЗаписьXML.ЗаписатьТекст(СтруктураДанных.Город);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("НаселПункт");
		ЗаписьXML.ЗаписатьТекст(СтруктураДанных.НаселПункт);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("Улица");
		ЗаписьXML.ЗаписатьТекст(СтруктураДанных.Улица);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ОКТМО");
		ЗаписьXML.ЗаписатьТекст("27701000001");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		// Используется в некоторых конфигурациях
		// ЗаписьXML.ЗаписатьНачалоЭлемента("ОКТМО");
		//	ЗаписьXML.ЗаписатьТекст("");
		// ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, "1010", СтруктураДанных.Дом);
		ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, "1040", СтруктураДанных.Участок);
		ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, "1070", СтруктураДанных.Сооружение);
		ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, "1080", СтруктураДанных.Литера);
		ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, "1060", СтруктураДанных.Строение);
		ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, "1050", СтруктураДанных.Корпус);
		ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, "2010", СтруктураДанных.Квартира);
		ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, "2030", СтруктураДанных.Офис);
		ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, "2040", СтруктураДанных.Бокс);
		ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, "2020", СтруктураДанных.Помещение);
		ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, "2060", СтруктураДанных.Этаж);
		ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, "2070", СтруктураДанных.АЯ);
		ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, "2090", СтруктураДанных.ПО);
		ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, "2080", СтруктураДанных.ВЧ);
		ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, "Другое", СтруктураДанных.Другое);
		ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, "2050", СтруктураДанных.Комната);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопАдрЭл");
		ЗаписьXML.ЗаписатьАтрибут("ТипАдрЭл", "10100000");
		ЗаписьXML.ЗаписатьАтрибут("Значение", СтруктураДанных.ПИндекс);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	Иначе
		ЗаписьXML.ЗаписатьНачалоЭлемента("Состав");
		ЗаписьXML.ЗаписатьАтрибут("xsi:type", "Адрес");
		ЗаписьXML.ЗаписатьАтрибут("Страна", XMLСтрока(лСтрана));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Состав");
		ЗаписьXML.ЗаписатьАтрибут("xsi:type", "xs:string");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(СтруктураДанных.Представление));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьXML.Закрыть();	
	
КонецФункции

Процедура ДобавитьТегВАдресноеПолеРФ(ЗаписьXML, ТипЗначения, Значение)
	
	Если ЗначениеЗаполнено(Значение) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопАдрЭл");
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номер");
		ЗаписьXML.ЗаписатьАтрибут("Тип", ТипЗначения);
		ЗаписьXML.ЗаписатьАтрибут("Значение", Значение);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область Выгрузка

Процедура ДобавитьПоляАдресаВСтруктуруВыгрузки(СтруктураВыгрузки, ИнформацияОАдресе) Экспорт
	
	СтруктураПолей = ПолучитьСтруктуруАдреса(ИнформацияОАдресе.ЗначенияПолей);
	
	Если СтруктураПолей <> Неопределено Тогда
		
		СтруктураВыгрузки.Вставить("COUNTRY", СтруктураПолей.Страна);  	
		
		Если ВРег(СокрЛП(СтруктураПолей.Страна)) = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьНазваниеСтраны()
			И (СтруктураПолей.Город <> "" ИЛИ СтруктураПолей.Улица <> "" ИЛИ СтруктураПолей.Дом <> "") Тогда
			
			СтруктураВыгрузки.Вставить("PROVINCE"	, СтруктураПолей.СубъектРФ);  	
			СтруктураВыгрузки.Вставить("REGION"		, СтруктураПолей.Район);
			СтруктураВыгрузки.Вставить("POSTAL_CODE"	, СтруктураПолей.ПИндекс);  
			
			лГород = "";
			Если ЗначениеЗаполнено(СтруктураПолей.Город) Тогда
				лГород = СтруктураПолей.Город; 
			КонецЕсли;
			Если ЗначениеЗаполнено(СтруктураПолей.НаселПункт) Тогда
				Если ЗначениеЗаполнено(лГород) Тогда
					лГород = лГород + ", ";	
				КонецЕсли;
				лГород = лГород + "нас. пункт " + СтруктураПолей.НаселПункт; 
			КонецЕсли;
			СтруктураВыгрузки.Вставить("CITY", лГород);  	
			
			Адрес1 = "";
			
			Если стрНайти(СтруктураПолей.Улица, " ул") > 0 Тогда
				НужноКлючевоеСловоУлицы = Ложь;
			ИначеЕсли стрНайти(СтруктураПолей.Улица, " пер") > 0 Тогда
				НужноКлючевоеСловоУлицы = Ложь;
			ИначеЕсли стрНайти(СтруктураПолей.Улица, " проезд") > 0 Тогда
				НужноКлючевоеСловоУлицы = Ложь;
			ИначеЕсли стрНайти(СтруктураПолей.Улица, " линия") > 0 Тогда
				НужноКлючевоеСловоУлицы = Ложь;
			ИначеЕсли стрНайти(СтруктураПолей.Улица, " линия") > 0 Тогда
				НужноКлючевоеСловоУлицы = Ложь;
			ИначеЕсли стрНайти(СтруктураПолей.Улица, " ал.") > 0 Тогда
				НужноКлючевоеСловоУлицы = Ложь;
			ИначеЕсли стрНайти(СтруктураПолей.Улица, " пр-кт") > 0 Тогда
				НужноКлючевоеСловоУлицы = Ложь;
			ИначеЕсли стрНайти(СтруктураПолей.Улица, " пл") > 0 Тогда
				НужноКлючевоеСловоУлицы = Ложь;
			ИначеЕсли стрНайти(СтруктураПолей.Улица, " дор") > 0 Тогда
				НужноКлючевоеСловоУлицы = Ложь;
			ИначеЕсли стрНайти(СтруктураПолей.Улица, " тер") > 0 Тогда
				НужноКлючевоеСловоУлицы = Ложь;
			Иначе
				НужноКлючевоеСловоУлицы = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктураПолей.Улица) Тогда
				Адрес1 = ?(НужноКлючевоеСловоУлицы, "улица ", "") + СтруктураПолей.Улица;  	
			КонецЕсли;
			
			сЗначенийАдреса = Новый Структура;
			сЗначенийАдреса.Вставить("Дом"			, "дом");
			сЗначенийАдреса.Вставить("Корпус"		, "корпус");
			сЗначенийАдреса.Вставить("Сооружение"	, "сооружение");
			сЗначенийАдреса.Вставить("Литера"		, "литера");
			сЗначенийАдреса.Вставить("Строение"		, "строение");
			сЗначенийАдреса.Вставить("Участок"		, "участок");
			сЗначенийАдреса.Вставить("АЯ"			, "а/я");
			сЗначенийАдреса.Вставить("ВЧ"			, "в/ч");
			сЗначенийАдреса.Вставить("ПОП"			, "п/о");
			
			Для каждого ТекЗначениеАдреса Из сЗначенийАдреса Цикл
				Если ЗначениеЗаполнено(СтруктураПолей[ТекЗначениеАдреса.Ключ]) Тогда
					Адрес1 = Адрес1 + ?(ЗначениеЗаполнено(Адрес1), ", ", "");
					Адрес1 = Адрес1 + ТекЗначениеАдреса.Значение + " " + СтруктураПолей[ТекЗначениеАдреса.Ключ];	
				КонецЕсли;
			КонецЦикла;
			
			СтруктураВыгрузки.Вставить("ADDRESS_1", Адрес1);  	
			
			сЗначенийАдреса = Новый Структура;
			сЗначенийАдреса.Вставить("квартира"		, "квартира");
			сЗначенийАдреса.Вставить("офис"			, "офис");
			сЗначенийАдреса.Вставить("бокс"			, "бокс");
			сЗначенийАдреса.Вставить("этаж"			, "этаж");
			сЗначенийАдреса.Вставить("комната"		, "комната");
			сЗначенийАдреса.Вставить("помещение"	, "помещение");
			
			Адрес2 = "";
			Для каждого ТекЗначениеАдреса Из сЗначенийАдреса Цикл
				Если ЗначениеЗаполнено(СтруктураПолей[ТекЗначениеАдреса.Ключ]) Тогда
					Адрес2 = Адрес2 + ?(ЗначениеЗаполнено(Адрес2), ", ", "");
					Адрес2 = Адрес2 + ТекЗначениеАдреса.Значение + " " + СтруктураПолей[ТекЗначениеАдреса.Ключ];	
				КонецЕсли;
			КонецЦикла;
			
			СтруктураВыгрузки.Вставить("ADDRESS_2", Адрес2);  	
			
		Иначе
			СтруктураВыгрузки.Вставить("ADDRESS_1", СтруктураПолей.Представление);  	
		КонецЕсли;
	Иначе
		СтруктураВыгрузки.Вставить("COUNTRY"		, ИнформацияОАдресе.Страна);  
		СтруктураВыгрузки.Вставить("ADDRESS_1"	, ИнформацияОАдресе.Представление); 
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруАдреса(ЗначенияПолей)
	
	Если Метаданные.ОбщиеМодули.Найти("РаботаСАдресами") <> Неопределено Тогда
		
		Если ТипЗнч(ЗначенияПолей) = Тип("Строка") И СтрНачинаетсяС(СокрЛ(ЗначенияПолей), "<") Тогда
			
			ПространствоИмен = "http://www.v8.1c.ru/ssl/contactinfo";;
			ЧтениеXML = Новый ЧтениеXML;
			
			ЧтениеXML.УстановитьСтроку(ЗначенияПолей);
			
			Попытка
				XDTOАдрес = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ФабрикаXDTO.Тип(ПространствоИмен, "КонтактнаяИнформация"));
			Исключение
				Возврат Неопределено;
			КонецПопытки;
			
			СтруктураДанных = РазобратьАдресXDTO(XDTOАдрес);
			
			Возврат СтруктураДанных;
			
		КонецЕсли;
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция РазобратьАдресXDTO(XDTOАдрес)
	
	СтруктураДанных =  Новый Структура;
	СтруктураДанных.Вставить("Представление", "");
	СтруктураДанных.Вставить("Страна"		, "");
	СтруктураДанных.Вставить("СубъектРФ"	, "");
	СтруктураДанных.Вставить("Округ"		, "");
	СтруктураДанных.Вставить("Район"		, "");
	СтруктураДанных.Вставить("Город"		, "");
	СтруктураДанных.Вставить("ВнутригРайон"	, "");
	СтруктураДанных.Вставить("НаселПункт"	, "");
	СтруктураДанных.Вставить("Улица"		, "");
	СтруктураДанных.Вставить("ОКТМО"		, "");
	
	СтруктураДанных.Вставить("ПИндекс"		, "");
	СтруктураДанных.Вставить("Дом"			, "");
	СтруктураДанных.Вставить("Корпус"		, "");
	СтруктураДанных.Вставить("Участок"		, "");
	СтруктураДанных.Вставить("Сооружение"	, "");
	СтруктураДанных.Вставить("Строение"		, "");
	СтруктураДанных.Вставить("Литера"		, "");
	СтруктураДанных.Вставить("Квартира"		, "");
	СтруктураДанных.Вставить("Офис"			, "");
	СтруктураДанных.Вставить("Бокс"			, "");
	СтруктураДанных.Вставить("Помещение"	, "");
	СтруктураДанных.Вставить("Этаж"			, "");
	СтруктураДанных.Вставить("АЯ"			, "");
	СтруктураДанных.Вставить("ПОП"			, "");
	СтруктураДанных.Вставить("ВЧ"			, "");
	СтруктураДанных.Вставить("Другое"		, "");
	СтруктураДанных.Вставить("Комната"		, "");
	
	
	Если XDTOАдрес.Свойства().Получить("Представление") <> Неопределено Тогда
		СтруктураДанных.Представление = XDTOАдрес.Представление;
	Иначе
		Возврат Неопределено; 
	КонецЕсли;
	
	Если XDTOАдрес.Свойства().Получить("Состав") = Неопределено Тогда
		Возврат СтруктураДанных; 
	Иначе
		
		Состав = XDTOАдрес.Состав;	
		
		Если Состав.Свойства().Получить("Страна") <> Неопределено Тогда
			СтруктураДанных.Страна = Состав.Страна;
		Иначе
			Возврат Неопределено; 
		КонецЕсли;
		
		
		Если Состав.Свойства().Получить("Состав") <> Неопределено Тогда
			
			ПоляАдреса = Состав.Состав;	
			
			Если ТипЗнч(ПоляАдреса) = Тип("Строка") ИЛИ ПоляАдреса = Неопределено Тогда
				Возврат СтруктураДанных;
			КонецЕсли;
			
			Если ПоляАдреса.Свойства().Получить("СубъектРФ") <> Неопределено Тогда
				Если СвойствоXDTOЗаполнено(ПоляАдреса.СубъектРФ) Тогда
					СтруктураДанных.СубъектРФ = ПоляАдреса.СубъектРФ;
				КонецЕсли
			КонецЕсли;
			Если ПоляАдреса.Свойства().Получить("Округ") <> Неопределено Тогда
				Если СвойствоXDTOЗаполнено(ПоляАдреса.Округ) Тогда
					СтруктураДанных.Округ = ПоляАдреса.Округ;
				КонецЕсли
			КонецЕсли;
			Если ПоляАдреса.Свойства().Получить("СвРайМО") <> Неопределено Тогда
				Если ПоляАдреса.СвРайМО <> Неопределено Тогда
					Если ПоляАдреса.СвРайМО.Свойства().Получить("Район") <> Неопределено Тогда
						Если СвойствоXDTOЗаполнено(ПоляАдреса.СвРайМО.Район) Тогда
							СтруктураДанных.Район = ПоляАдреса.СвРайМО.Район;
						КонецЕсли
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если ПоляАдреса.Свойства().Получить("Город") <> Неопределено Тогда
				Если СвойствоXDTOЗаполнено(ПоляАдреса.Город) Тогда
					СтруктураДанных.Город = ПоляАдреса.Город;
				КонецЕсли
			КонецЕсли;
			Если ПоляАдреса.Свойства().Получить("ВнутригРайон") <> Неопределено Тогда
				Если СвойствоXDTOЗаполнено(ПоляАдреса.ВнутригРайон) Тогда
					СтруктураДанных.ВнутригРайон = ПоляАдреса.ВнутригРайон;
				КонецЕсли
			КонецЕсли;
			Если ПоляАдреса.Свойства().Получить("НаселПункт") <> Неопределено Тогда
				Если СвойствоXDTOЗаполнено(ПоляАдреса.НаселПункт) Тогда
					СтруктураДанных.НаселПункт = ПоляАдреса.НаселПункт;
				КонецЕсли
			КонецЕсли;
			Если ПоляАдреса.Свойства().Получить("Улица") <> Неопределено Тогда
				Если СвойствоXDTOЗаполнено(ПоляАдреса.Улица) Тогда
					СтруктураДанных.Улица = ПоляАдреса.Улица;
				КонецЕсли
			КонецЕсли;
			Если ПоляАдреса.Свойства().Получить("ОКТМО") <> Неопределено Тогда
				Если СвойствоXDTOЗаполнено(ПоляАдреса.ОКТМО) Тогда
					СтруктураДанных.ОКТМО = ПоляАдреса.ОКТМО;
				КонецЕсли
			КонецЕсли;
			
			Если ПоляАдреса.Свойства().Получить("ДопАдрЭл") <> Неопределено Тогда
				
				Если ТипЗнч(ПоляАдреса.ДопАдрЭл) = Тип("СписокXDTO") Тогда
					
					Для Каждого ДопАдрЭл Из ПоляАдреса.ДопАдрЭл Цикл
						
						Если ДопАдрЭл.Свойства().Получить("Номер") <> Неопределено Тогда
							
							Если ДопАдрЭл.Номер <> Неопределено Тогда
								РазобратьДопАдрЭл(СтруктураДанных, ДопАдрЭл.Номер);
							Иначе
								Если ДопАдрЭл.Свойства().Получить("ТипАдрЭл") <> Неопределено Тогда
									Если ДопАдрЭл.ТипАдрЭл = "10100000" Тогда
										СтруктураДанных.ПИндекс = ДопАдрЭл.Значение; 	
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							
						Иначе
							
							Если ДопАдрЭл.Свойства().Получить("ТипАдрЭл") <> Неопределено Тогда
								СтруктураДанных.ПИндекс = ДопАдрЭл.Значение; 	
							КонецЕсли;
							
						КонецЕсли;
					КонецЦикла;
					
				Иначе
					Если ПоляАдреса.ДопАдрЭл.Свойства().Получить("Номер") <> Неопределено Тогда
						РазобратьДопАдрЭл(СтруктураДанных, ПоляАдреса.ДопАдрЭл.Номер);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЕсли;	
	
	Возврат СтруктураДанных;	
	
КонецФункции 

Функция СвойствоXDTOЗаполнено(СвойствоXDTO)
	
	СвойствоЗаполнено = Истина;
	
	Если ТипЗнч(СвойствоXDTO) = Тип("ОбъектXDTO")
		ИЛИ ТипЗнч(СвойствоXDTO) = Тип("СписокXDTO")
		ИЛИ НЕ ЗначениеЗаполнено(СвойствоXDTO) Тогда
		
		СвойствоЗаполнено = Ложь;
		
	КонецЕсли;
	
	Возврат СвойствоЗаполнено;
	
КонецФункции

Процедура РазобратьДопАдрЭл(СтруктураДанных, ДопАдрЭлXDTO)
	
	Попытка
		Значение = ДопАдрЭлXDTO.Значение;
	Исключение
		Значение = "";
	КонецПопытки;
	
	Если ТипЗнч(ДопАдрЭлXDTO) <> Тип("ОбъектXDTO") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопАдрЭлXDTO.Свойства().Получить("Тип")= Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопАдрЭлXDTO.Тип = "1010" Тогда
		СтруктураДанных.Дом = Значение;
	ИначеЕсли ДопАдрЭлXDTO.Тип = "1040" Тогда
		СтруктураДанных.Участок = Значение;
	ИначеЕсли ДопАдрЭлXDTO.Тип = "1070" Тогда
		СтруктураДанных.Сооружение = Значение;
	ИначеЕсли ДопАдрЭлXDTO.Тип = "1080" Тогда
		СтруктураДанных.Литера = Значение;
	ИначеЕсли ДопАдрЭлXDTO.Тип = "1060" Тогда
		СтруктураДанных.Строение = Значение;
	ИначеЕсли ДопАдрЭлXDTO.Тип = "1050" Тогда
		СтруктураДанных.Корпус = Значение;
	ИначеЕсли ДопАдрЭлXDTO.Тип = "2010" Тогда
		СтруктураДанных.Квартира = Значение;
	ИначеЕсли ДопАдрЭлXDTO.Тип = "2030" Тогда
		СтруктураДанных.Офис = Значение;
	ИначеЕсли ДопАдрЭлXDTO.Тип = "2040" Тогда
		СтруктураДанных.Бокс = Значение;
	ИначеЕсли ДопАдрЭлXDTO.Тип = "2020" Тогда
		СтруктураДанных.Помещение = Значение;
	ИначеЕсли ДопАдрЭлXDTO.Тип = "2060" Тогда
		СтруктураДанных.Этаж = Значение;
	ИначеЕсли ДопАдрЭлXDTO.Тип = "2070" Тогда
		СтруктураДанных.АЯ = Значение;
	ИначеЕсли ДопАдрЭлXDTO.Тип = "2090" Тогда
		СтруктураДанных.ПОП = Значение;
	ИначеЕсли ДопАдрЭлXDTO.Тип = "2080" Тогда
		СтруктураДанных.ВЧ = Значение;
	ИначеЕсли ДопАдрЭлXDTO.Тип = "2050" Тогда
		СтруктураДанных.Комната = Значение;
	Иначе
		СтруктураДанных.Другое = Значение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
