
&НаСервере
Функция ПолучитьЦенуВидаРабот(ВидРабот, ВозвращатьВТаблицеЗначений = Истина, Процент = 0) Экспорт

	Если ТипЗнч(ВидРабот) = Тип("СправочникСсылка.ВидыРабот") Тогда
		мРасценки = ПолучитьРасценки(ВидРабот);
	Иначе	
	    мРасценки = ВидРабот; //Уже передается массив с расценками
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементныеРасценки.ЕдиницыВидРаботы КАК ЕдиницыВидРаботы,
		|	СУММА(ЭлементныеРасценки.ЦенаРаботы * (1 + &Процент / 100)) КАК ЦенаРаботы
		|ИЗ
		|	Справочник.ЭлементныеРасценки КАК ЭлементныеРасценки
		|ГДЕ
		|	ЭлементныеРасценки.Ссылка В(&мРасценки)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЭлементныеРасценки.ЕдиницыВидРаботы";
	
	Запрос.УстановитьПараметр("мРасценки", мРасценки);
	Запрос.УстановитьПараметр("Процент", Процент);
	
	тзРезультат = Запрос.Выполнить().Выгрузить();
	
	Если ВозвращатьВТаблицеЗначений Тогда
	
		Возврат тзРезультат;	
	
	КонецЕсли;
	
    Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(тзРезультат);

КонецФункции // ПолучитьЦенуВидаРабот()


&НаСервере
Функция ПолучитьТекстовоеПредставлениеЦены(ТаблицаЦен) Экспорт
	строкаЦены = "";
	
	Для каждого х Из ТаблицаЦен Цикл
		
		омРаботаССтроками.ДобавитьРазделительНеПустойСтроке(строкаЦены);
		
		строкаЦены = строкаЦены + ПолучитьПредставлениеВидаЕдиницы(х.ЕдиницыВидРаботы) + х.ЦенаРаботы + " руб.";	
	КонецЦикла;
	
	Возврат строкаЦены;

КонецФункции // ПолучитьТекстовоеПредставлениеЦены()

&НаСервере
Функция ПолучитьПредставлениеВидаЕдиницы(ЕдиницыВидРаботы) Экспорт
	
	строкаПредставления = "";
	
	Если Перечисления.ВидыЕдиницДляРаботы.ПоДлине 			= ЕдиницыВидРаботы Тогда
		строкаПредставления = "за метр по длинне ";	
	ИначеЕсли Перечисления.ВидыЕдиницДляРаботы.ПоОбъему 	= ЕдиницыВидРаботы Тогда
		строкаПредставления = "за метр кубический ";
	ИначеЕсли Перечисления.ВидыЕдиницДляРаботы.ПоПериметру 	= ЕдиницыВидРаботы Тогда
		строкаПредставления = "за метр по периметру ";
	ИначеЕсли Перечисления.ВидыЕдиницДляРаботы.ПоПлощади 	= ЕдиницыВидРаботы Тогда
		строкаПредставления = "за метр квадратный ";
	ИначеЕсли Перечисления.ВидыЕдиницДляРаботы.ПоШтучно 	= ЕдиницыВидРаботы Тогда
		строкаПредставления = "за штуку ";
	КонецЕсли; 
	
	Возврат строкаПредставления
КонецФункции // ПолучитьПредставлениеВидаЕдиницы()


&НаСервере
Функция РасчитаьЦенуВидовРабот(мВидыРабот) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыРаботРасценки.Расценка КАК Расценка,
		|	ВЫБОР
		|		КОГДА ВидыРаботРасценки.Ссылка.ПоказательРассчетаЦены = 2
		|			ТОГДА ВидыРаботРасценки.Ссылка.ПоказательРассчетаЦены
		|		ИНАЧЕ ВидыРаботРасценки.Расценка.ЕдиницыВидРаботы
		|	КОНЕЦ КАК ЕдиницыВидРаботы,
		|	ВидыРаботРасценки.Ссылка.ПоказательРассчетаЦены КАК ПоказательРассчетаЦены,
		|	ВидыРаботРасценки.Расценка.ЦенаРаботы КАК РасценкаЦенаРаботы,
		|	ВидыРаботРасценки.Ссылка.ПоказательЦены КАК ПоказательЦены,
		|	ВидыРаботРасценки.Ссылка КАК ВидРаботы
		|ИЗ
		|	Справочник.ВидыРабот.Расценки КАК ВидыРаботРасценки
		|ГДЕ
		|	ВидыРаботРасценки.Ссылка В(&мВидыРабот)";
	
	Запрос.УстановитьПараметр("мВидыРабот", мВидыРабот);
	
	тзРезультат = Запрос.Выполнить().Выгрузить();
	тзРезультат.Индексы.Добавить("ВидРаботы");

	тзЦены = Новый ТаблицаЗначений;
	тзЦены.Колонки.Добавить("ВидРаботы", 		Новый ОписаниеТипов("СправочникСсылка.ВидыРабот"));
	тзЦены.Колонки.Добавить("ЕдиницыВидРаботы",	Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЕдиницДляРаботы"));
	тзЦены.Колонки.Добавить("Цена", 			Новый ОписаниеТипов("Число"));

	стОтбора = Новый Структура("ВидРаботы", );
	
	тзГруппировкиЦены = Новый ТаблицаЗначений;
	тзГруппировкиЦены.Колонки.Добавить("ЕдиницыВидРаботы",	Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЕдиницДляРаботы"));
	тзГруппировкиЦены.Колонки.Добавить("Цена", 			Новый ОписаниеТипов("Число"));
	
	Для каждого текВидРаботы Из мВидыРабот Цикл
		
		стОтбора.ВидРаботы = текВидРаботы;
		
		НайденыеСтроки = тзРезультат.НайтиСтроки(стОтбора);
		
		Если НайденыеСтроки.Количество() = 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НайденыеСтроки[0].ПоказательРассчетаЦены = 2 Тогда //Фиксироанная цена
			НС = тзЦены.Добавить();
			НС.ВидРаботы = текВидРаботы;
			НС.Цена = НайденыеСтроки[0].ПоказательЦены;	
			НС.ЕдиницыВидРаботы = НайденыеСтроки[0].ЕдиницыВидРаботы;	
			
		Иначе
			тзГруппировкиЦены.Очистить();
			
			Для каждого текРасценка Из НайденыеСтроки Цикл
				НС = тзГруппировкиЦены.Добавить();
				НС.ЕдиницыВидРаботы = текРасценка.ЕдиницыВидРаботы;
				НС.Цена = текРасценка.РасценкаЦенаРаботы;
				
			КонецЦикла; 
			
			тзГруппировкиЦены.Свернуть("ЕдиницыВидРаботы","Цена");
			
			Коэффициент = 1;
			
			Если НайденыеСтроки[0].ПоказательРассчетаЦены = 1 Тогда //Процент
				Коэффициент = Коэффициент + НайденыеСтроки[0].ПоказательЦены / 100;
			КонецЕсли;
			
			Для каждого х Из тзГруппировкиЦены Цикл
				НС = тзЦены.Добавить();
				НС.ВидРаботы = текВидРаботы;
				НС.Цена = х.ПоказательЦены * Коэффициент;	
				НС.ЕдиницыВидРаботы = х.ЕдиницыВидРаботы;	
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат тзЦены;
КонецФункции // РасчитаьЦенуВидовРабот()


&НаСервере
Функция ПолучитьРасценки(ВидРабот)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыРаботРасценки.Расценка КАК Расценка
		|ИЗ
		|	Справочник.ВидыРабот.Расценки КАК ВидыРаботРасценки
		|ГДЕ
		|	ВидыРаботРасценки.Ссылка = &ВидРабот";
	
	Запрос.УстановитьПараметр("ВидРабот", ВидРабот);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Расценка");
	

КонецФункции // ПолучитьРасценки()
