
Процедура ПриЗаписи(Отказ, Замещение)
	
	ЗаписатьМаксимальныНомерСообщения();
	
КонецПроцедуры


Процедура ЗаписатьМаксимальныНомерСообщения()
	
	Если ЭтотОбъект.Количество() = 0 Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Бот 			= ЭтотОбъект[0].Бот;
	ID_Сообщения 	= ЭтотОбъект[0].ID_Сообщения;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ТелеграммСлужебныеДанные");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	НачатьТранзакцию();
	БлокировкаДанных.Заблокировать(); 
	
	ИмяПараметра = "ID_СообщенияМаксимум";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТелеграммСлужебныеДанные.Значение КАК ID_СообщенияМаксимум
		|ИЗ
		|	РегистрСведений.ТелеграммСлужебныеДанные КАК ТелеграммСлужебныеДанные
		|ГДЕ
		|	ТелеграммСлужебныеДанные.ИмяПараметра = &ИмяПараметра
		|	И ТелеграммСлужебныеДанные.Бот = &Бот";
	
	Запрос.УстановитьПараметр("Бот", 			Бот);
	Запрос.УстановитьПараметр("ИмяПараметра", 	ИмяПараметра);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ID_СообщенияМаксимум = 0;
	
	Пока Выборка.Следующий() Цикл
		ID_СообщенияМаксимум = Выборка.ID_СообщенияМаксимум;
	КонецЦикла; 
	
	Если ID_СообщенияМаксимум < ID_Сообщения Тогда
		
		МенеджерЗаписей = РегистрыСведений.ТелеграммСлужебныеДанные.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписей.ИмяПараметра 	= ИмяПараметра;
		МенеджерЗаписей.Бот 			= Бот;
		МенеджерЗаписей.Значение 		= ID_Сообщения;
		
		МенеджерЗаписей.Записать();
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
