&НаКлиенте
Функция КомплектыДляАналогичногоДействия(Объект, ПодчиненыеКомплекты) Экспорт
	
	мКомплектыДляАналогичногоДействия = Новый Массив;
	
	Если ТипЗнч(Объект.ОбъектТЗ) = Тип("СправочникСсылка.Композиции") Тогда
		КонструкторКомпозиции = омКомпозицииСервер.ПолучитьДанныеКомпозиции(Объект.ОбъектТЗ);	
	Иначе
		Возврат мКомплектыДляАналогичногоДействия;
	КонецЕсли; 
	
	НЕЗадачаКонструктора = НЕ Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыЗадачКонструирования.Конструктор");
	
	Для каждого СтрокаТаблицы Из ПодчиненыеКомплекты Цикл
		
		Если СтрокаТаблицы.Конструктор = КонструкторКомпозиции ИЛИ НЕЗадачаКонструктора Тогда
			мКомплектыДляАналогичногоДействия.Добавить(СтрокаТаблицы.Комплект);	
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат мКомплектыДляАналогичногоДействия

КонецФункции // КомплектыДляАналогичногоДайствия()

