
&НаКлиенте
Процедура Обновить(Команда)
	СформироватьОтчет();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
	тзДанныеДляВывода = ПолучитьДанныеДляВывода();
	ВывестиДанные(тзДанныеДляВывода);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформироватьОтчет();
КонецПроцедуры

&НаСервере
Процедура ВывестиДанные(тзДанныеДляВывода)
 	Макет = Отчеты.ЗаказанныйМатериал.ПолучитьМакет("Макет");
	
	ПолеВывода.Очистить();
	
	ПолеВывода.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	обСтрока = Макет.ПолучитьОбласть("Строка");
	
	Для каждого х Из тзДанныеДляВывода Цикл
		обСтрока.Параметры.Заполнить(х);
		ПолеВывода.Вывести(обСтрока);
	КонецЦикла;
	

КонецПроцедуры // ВывестиДанные(тзДанныеДляВывода)


&НаСервере
Функция ПолучитьДанныеДляВывода()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщикуОстатки.Поставщик КАК Поставщик,
		|	ЗаказПоставщикуОстатки.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ЗаказПоставщику.Остатки(&Дата, ) КАК ЗаказПоставщикуОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказПоставщикуОстатки.Поставщик.Наименование,
		|	ЗаказПоставщикуОстатки.Номенклатура.Наименование";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьДанныеДляВывода()
