
Функция ПолучитьНастройкиПользователя(Пользователь = Неопределено) Экспорт
	
	СписокЗначений = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.Пользователь = &Пользователь
		|	И НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ПолучитьСписокНастроек());
	Запрос.УстановитьПараметр("Пользователь", ?(Пользователь = Неопределено, ПараметрыСеанса.ТекущийПользователь, Пользователь));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокЗначений.Добавить(Выборка.Значение, Выборка.ИмяНастройки); 
	КонецЦикла;

	Возврат СписокЗначений 
	
КонецФункции // ПолучитьНастройкиПользователя()


Функция ПолучитьСписокНастроек() Экспорт

	МассивНастроек = Новый Массив(3);
	
	МассивНастроек[0] = НаименованиеНастройкиДляОтправкиСообщений();
	МассивНастроек[1] = "ВзаимодействиеСвернуто";
	МассивНастроек[2] = "СвернутыйГантПриОткрытии";
	
    Возврат МассивНастроек;
	
КонецФункции // ПолучитьСписокНастроек()

Функция НаименованиеНастройкиДляОтправкиСообщений()

	Возврат "АдресаДляОтправкиОповещений";

КонецФункции // НаименованиеНастройкиДляОтправкиСообщений()

Функция СписокАдресовДляОтправкиВзаимодействия(Пользователь = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.Пользователь = &Пользователь
		|	И НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", НаименованиеНастройкиДляОтправкиСообщений());
	Запрос.УстановитьПараметр("Пользователь", ?(Пользователь = Неопределено, ПараметрыСеанса.ТекущийПользователь, Пользователь));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Значение; 
	КонецЦикла;

	Возврат ""; 

КонецФункции // СписокАдресовДляОтправкиВзаимодействия()

