
Процедура ОбработкаПроведения(Отказ, Режим)
	
	МассивКомплектов 	= ИзделияКомплект.ВыгрузитьКолонку("ИзделиеКомплект");
	
	МенеджерРегистр 	= РегистрыСведений.ГлабольныеСостояниеКомплекта;
	
	ТаблицаСтадия 				= МенеджерРегистр.ПолучитьСтадииКомплектов(МассивКомплектов);
	СтркутураМассивовКомплеты 	= МенеджерРегистр.СоздатьМассивыКомплектов(ТаблицаСтадия);
    ТаблицаСтатусов 			= МенеджерРегистр.ПолучитьТекущиеСтатусы(СтркутураМассивовКомплеты.МассивовКомплетыКонструирование);
    ТаблицаЗадач	 			= МенеджерРегистр.ПолучитьЗадачи(МассивКомплектов);
    ТаблицаТЗ		 			= МенеджерРегистр.ПолучитьКорточкиТЗ(СтркутураМассивовКомплеты.МассивовКомплетыПрочие);
    ТаблицаПроизводства			= МенеджерРегистр.ПолучитьКарточкиПроизводства(СтркутураМассивовКомплеты.МассивовКомплетыПрочие);
	ТаблицаПроводок 			= МенеджерРегистр.ПолучитьТаблицуПроведения();
	
	СтруктураТаблиц = Новый Структура("ТаблицаСтатусов, ТаблицаПроводок, ТаблицаЗадач, ТаблицаТЗ, ТаблицаПроизводства, ТаблицаСтадия" 
	                                    ,ТаблицаСтатусов
	                                    ,ТаблицаПроводок
	                                    ,ТаблицаЗадач
	                                    ,ТаблицаТЗ
	                                    ,ТаблицаПроизводства
	                                    ,ТаблицаСтадия
										);
	
	Для каждого ТекущийКомплект Из ИзделияКомплект Цикл
		МенеджерРегистр.РасчитатьКомплект(СтруктураТаблиц, ТекущийКомплект.ИзделиеКомплект);
	КонецЦикла;
	
	Движения.ГлабольныеСостояниеКомплекта.Записывать = Истина;
	Для Каждого ТекСтрокаПроводки Из ТаблицаПроводок Цикл
		
		Движение = Движения.ГлабольныеСостояниеКомплекта.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаПроводки);
		Движение.Период 			= ДатаПриостановки;
		Движение.ГлобальныйСтатус 	= Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы;
		
		омСтадииКомплекта.УстановитьГлобальныйСтатусСУчетомРаботыКонструктора(ТекСтрокаПроводки.Комплект
													, Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы
													, ДатаПриостановки
													, Автор
													, Комментарий);
		
	КонецЦикла; 
												
	СтрокаДокумент = Строка(Ссылка);											
												
	Для каждого х Из ТаблицаПроизводства Цикл
		омКанбанПроизводство.ПеревестиРеквизитВСтоп(х.Ресурс, СтрокаДокумент, х.УИДКарточка);
	КонецЦикла;
	
	Для каждого х Из ТаблицаТЗ Цикл
		омКанбанТЗ.ПеревестиРеквизитВСтоп(х.Ресурс, СтрокаДокумент, х.УИДКарточка);
	КонецЦикла;
	

КонецПроцедуры 

