
Процедура ОбработкаПроведения(Отказ, Режим)
	
	МассивКомплектов 	= ИзделияКомплект.ВыгрузитьКолонку("ИзделиеКомплект");
	
	МенеджерРегистр 	= РегистрыСведений.ГлабольныеСостояниеКомплекта;
	
    ТаблицаСтатусов 	= МенеджерРегистр.ПолучитьТекущиеСтатусы(МассивКомплектов);
    ТаблицаЗадач	 	= МенеджерРегистр.ПолучитьЗадачи(МассивКомплектов);
    ТаблицаТЗ		 	= МенеджерРегистр.ПолучитьКорточкиТЗ(МассивКомплектов);
    ТаблицаПроизводства	= МенеджерРегистр.ПолучитьКарточкиПроизводства(МассивКомплектов);
	ТаблицаПроводок 	= МенеджерРегистр.ПолучитьТаблицуПроведения();
	
	СтруктураТаблиц = Новый Структура("ТаблицаСтатусов, ТаблицаПроводок, ТаблицаЗадач, ТаблицаТЗ, ТаблицаПроизводства" 
	                                    ,ТаблицаСтатусов
	                                    ,ТаблицаПроводок
	                                    ,ТаблицаЗадач
	                                    ,ТаблицаТЗ
	                                    ,ТаблицаПроизводства
										);
	
	
	Для каждого ТекущийКомплект Из ИзделияКомплект Цикл
		
		МенеджерРегистр.РасчитатьКомплект(СтруктураТаблиц, ТекущийКомплект.ИзделиеКомплект);
	
	КонецЦикла;
	
	Движения.ГлабольныеСостояниеКомплекта.Записывать = Истина;
	Для Каждого ТекСтрокаПроводки Из ТаблицаПроводок Цикл
		Движение = Движения.ГлабольныеСостояниеКомплекта.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаПроводки);
		Движение.Период 			= ДатаПриостановки;
		Движение.ГлобальныйСтатус 	= Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы;
		
		омСтадииКомплекта.УстановитьГлобальныйСтатусСУчетомРаботыКонструктора(ТекСтрокаПроводки.Комплект
													, Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы
													, ДатаПриостановки
													, Автор
													, Комментарий);
		
	КонецЦикла;

КонецПроцедуры 

