
Процедура ОбработкаПроведения(Отказ, Режим)
	
	МассивКомплектов 	= ИзделияКомплект.ВыгрузитьКолонку("ИзделиеКомплект");
	
	МенеджерРегистр 	= РегистрыСведений.ГлабольныеСостояниеКомплекта;
	
	ТаблицаСтадия 				= МенеджерРегистр.ПолучитьСтадииКомплектов(МассивКомплектов);
	СтркутураМассивовКомплеты 	= МенеджерРегистр.СоздатьМассивыКомплектов(ТаблицаСтадия);
    ТаблицаСтатусов 			= МенеджерРегистр.ПолучитьТекущиеСтатусы(СтркутураМассивовКомплеты.МассивовКомплетыКонструирование);
    ТаблицаЗадач	 			= МенеджерРегистр.ПолучитьЗадачи(МассивКомплектов);
    ТаблицаТЗ		 			= МенеджерРегистр.ПолучитьКорточкиТЗ(СтркутураМассивовКомплеты.МассивовКомплетыПрочие);
    ТаблицаПроизводства			= МенеджерРегистр.ПолучитьКарточкиПроизводства(СтркутураМассивовКомплеты.МассивовКомплетыПрочие);
	ТаблицаПроводок 			= МенеджерРегистр.ПолучитьТаблицуПроведения();
	
	СтруктураТаблиц = Новый Структура("ТаблицаСтатусов, ТаблицаПроводок, ТаблицаЗадач, ТаблицаТЗ, ТаблицаПроизводства, ТаблицаСтадия" 
	                                    ,ТаблицаСтатусов
	                                    ,ТаблицаПроводок
	                                    ,ТаблицаЗадач
	                                    ,ТаблицаТЗ
	                                    ,ТаблицаПроизводства
	                                    ,ТаблицаСтадия
										);
	
	Для каждого ТекущийКомплект Из ИзделияКомплект Цикл
		МенеджерРегистр.РасчитатьКомплект(СтруктураТаблиц, ТекущийКомплект.ИзделиеКомплект);
	КонецЦикла; 
	
	ПустаяСсылкаИзделиеЗаказчика = Справочники.ИзделияЗаказчика.ПустаяСсылка();
	
	МассивКомплектов = Новый Массив;
	
	Движения.ГлабольныеСостояниеКомплекта.Записывать = Истина;
	Для Каждого ТекСтрокаПроводки Из ТаблицаПроводок Цикл
		
		Движение = Движения.ГлабольныеСостояниеКомплекта.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаПроводки);
		Движение.Период 			= Дата;
		Движение.ГлобальныйСтатус 	= Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы;
		
		омСтадииКомплекта.УстановитьГлобальныйСтатусСУчетомРаботыКонструктора(ТекСтрокаПроводки.Комплект
													, Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы
													, ДатаПриостановки
													, Автор
													, Комментарий);
													
		МассивКомплектов.Добавить(ТекСтрокаПроводки.Комплект);
		
	КонецЦикла; 
												
	СтрокаДокумент = Строка(Ссылка);											
	
	Для каждого х Из ТаблицаПроизводства Цикл
		
		омКанбанПроизводство.ПеревестиРеквизитВСтоп(х.Ресурс, СтрокаДокумент, х.УИДКарточка);

	КонецЦикла;
	
	Для каждого х Из ТаблицаТЗ Цикл
		
		омКанбанТЗ.ПеревестиРеквизитВСтоп(х.Ресурс, СтрокаДокумент, х.УИДКарточка);
		
	КонецЦикла; 
	
	Если МассивКомплектов.Количество() > 0 Тогда
		СоздатьИнформациюКонструкторуОПереводеНаСтоп(МассивКомплектов);
	КонецЕсли;
	

КонецПроцедуры 

Процедура СоздатьИнформациюКонструкторуОПереводеНаСтоп(МассивКомплектов)

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Задача,
		|	Задачи_ПКД.Наименование КАК Наименование,
		|	Задачи_ПКД.Проект КАК Проект,
		|	Задачи_ПКД.Исполнитель КАК Исполнитель
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.ОбъектТЗ В(&ОбъектТЗ)
		|	И Задачи_ПКД.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.Конструктор)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Задачи_РКД.Ссылка,
		|	Задачи_РКД.Наименование,
		|	Задачи_РКД.Проект,
		|	Задачи_РКД.Исполнитель
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ В(&ОбъектТЗ)
		|	И Задачи_РКД.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.Конструктор)";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", МассивКомплектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ШаблонСообщения = "Задача %1 перевыедена на СТОП. Нужно либо завешить задачу либо сбросить";
	
	Пока Выборка.Следующий() Цикл
		омЗадачаОбщаяНаСервере.СоздатьЗадачуИнформация(СтрШаблон(ШаблонСообщения, Выборка.Наименование), Выборка.Проект, Выборка.Задача, Выборка.Исполнитель);
	КонецЦикла;
	
КонецПроцедуры


