
Процедура ОбработкаПроведения(Отказ, Режим)
	
	
    ТаблицаСтатусов 			= ПолучитьТекущиеСтатусы(ИзделияКомплект);
	ТаблицаПроводок 			= ПолучитьТаблицуПроведения();
	
	СтруктураТаблиц = Новый Структура("ТаблицаСтатусов, ТаблицаПроводок" 
	                                    ,ТаблицаСтатусов
	                                    ,ТаблицаПроводок
										);
	
	
	Для каждого ТекущийКомплект Из ИзделияКомплект Цикл
		
		РасчитатьКомплект(СтруктураТаблиц, ТекущийКомплект.ИзделиеКомплект);
	
	КонецЦикла;
	
	Движения.ГлабольныеСостояниеКомплекта.Записывать = Истина;
	Для Каждого ТекСтрокаПроводки Из ТаблицаПроводок Цикл
		Движение = Движения.ГлабольныеСостояниеКомплекта.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаПроводки);
		Движение.Период 			= ДатаПриостановки;
		Движение.ГлобальныйСтатус 	= Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы;
		
		омСтадииКомплекта.УстановитьГлобальныйСтатусСУчетомРаботыКонструктора(ТекСтрокаПроводки.Комплект
													, Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы
													, ДатаПриостановки
													, Автор
													, Комментарий);
		
	КонецЦикла;

КонецПроцедуры 

Функция ПолучитьТаблицуПроведения()

	МасиивТипов = Новый Массив;
	МасиивТипов.Добавить(Тип("СправочникСсылка.ИзделияКомплект"));
	МасиивТипов.Добавить(Тип("СправочникСсылка.Композиции"));
	
	ТаблицаПроводок = Новый ТаблицаЗначений;
	ТаблицаПроводок.Колонки.Добавить("Комплект", 			Новый ОписаниеТипов(МасиивТипов));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийСостояние", Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЗадач"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийСтатус", 	Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийТипЗадачи", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадачКонструирования"));
	
	Возврат ТаблицаПроводок;

КонецФункции // ПолучитьТаблицуПроведения()

Процедура РасчитатьКомплект(СтруктураТаблиц, Комплект)

	ТаблицаСтатусов = СтруктураТаблиц.ТаблицаСтатусов;
	ТаблицаПроводок = СтруктураТаблиц.ТаблицаПроводок;
	
	НС = ТаблицаПроводок.Добавить();
	НС.Комплект				= Комплект; 
	
	СтрокаСостояния = ТаблицаСтатусов.Найти(Комплект, "Комплект");
	Если НЕ СтрокаСостояния = Неопределено Тогда
		
		НС.ПредыдущийСостояние 	= СтрокаСостояния.Состояние;
		НС.ПредыдущийСтатус 	= СтрокаСостояния.Статус;
		НС.ПредыдущийТипЗадачи 	= СтрокаСостояния.ТипЗадачи;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТекущиеСтатусы(ТаблицаКомплектыИзделия)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадачСрезПоследних.Задача КАК Задача,
		|	ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ КАК Комплект,
		|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние,
		|	ТаймингЗадачСрезПоследних.Статус КАК Статус,
		|	ТаймингЗадачСрезПоследних.ТипЗадачи КАК ТипЗадачи
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних(&ДатаПриостановки, Задача.ОбъектТЗ В (&ОбъектТЗ)) КАК ТаймингЗадачСрезПоследних
		|ГДЕ
		|	НЕ ТаймингЗадачСрезПоследних.Задача.Выполнена";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", 			ТаблицаКомплектыИзделия.ВыгрузитьКолонку("ИзделиеКомплект"));
	Запрос.УстановитьПараметр("ДатаПриостановки", 	ДатаПриостановки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции


