Функция ПолучитьИнтервалОпросаСообщений() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСеанса.ЕстьВизуализацияСообщений = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК ИнтервалОпросаСообщений
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Пользователи.НеИспользоватьСообщения КАК НеИспользоватьСообщения
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ИмяНастройки", "ИнтервалОпросаСообщений");
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[1].Выбрать();
	
	НеИспользоватьСообщения = Истина;
	
	Пока Выборка.Следующий() Цикл
		НеИспользоватьСообщения = Выборка.НеИспользоватьСообщения;	
	КонецЦикла;
	
	Если НеИспользоватьСообщения Тогда
		Возврат 0;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ИнтервалОпросаСообщений;	
	КонецЦикла;
	
	Возврат 0;
	

КонецФункции // ПолучитьИнтервалОпросаСообщений()

Функция ЕстьНовыеСообщения(стДляКогоСообщения) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщенияПрочитал.Ссылка КАК Ссылка,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СообщенияПрочитал.Получатель) КАК КоличествоПолучателей
		|ПОМЕСТИТЬ втДляВсех
		|ИЗ
		|	Справочник.Сообщения.Прочитал КАК СообщенияПрочитал
		|ГДЕ
		|	НЕ СообщенияПрочитал.Ссылка.Прочитано
		|	И СообщенияПрочитал.Ссылка.ДляВсех
		|
		|СГРУППИРОВАТЬ ПО
		|	СообщенияПрочитал.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СообщенияПрочитал.Ссылка КАК Ссылка,
		|	СообщенияПрочитал.Ссылка.ГруппаСообщения КАК ГруппаСообщения
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.Сообщения.Прочитал КАК СообщенияПрочитал
		|ГДЕ
		|	НЕ СообщенияПрочитал.Ссылка.Прочитано
		|	И СообщенияПрочитал.Получатель = &Получатель
		|	И СообщенияПрочитал.Ссылка.ГруппаСообщения = &ГруппаСообщения
		|	И НЕ СообщенияПрочитал.Ссылка.ДляВсех
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сообщения.Ссылка) КАК Ссылка
		|ИЗ
		|	Справочник.Сообщения КАК Сообщения
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО (вт.Ссылка = Сообщения.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ втДляВсех КАК втДляВсех
		|		ПО (втДляВсех.Ссылка = Сообщения.Ссылка)
		|			И (втДляВсех.КоличествоПолучателей > 0)
		|ГДЕ
		|	НЕ Сообщения.Прочитано
		|	И Сообщения.Получатель = &Получатель
		|	И вт.Ссылка ЕСТЬ NULL
		|	И втДляВсех.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Пользователь", стДляКогоСообщения.Пользователь);
	Запрос.УстановитьПараметр("ГруппаСообщения", стДляКогоСообщения.ГруппаСообщения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
    Возврат 0;
	
КонецФункции // ЕстьНовыеСообщения()
 
Функция ПолучитьПревьюКартинки(ДанныеКартинки) Экспорт

    Картинка = Новый Картинка(ДанныеКартинки, Истина);
    Размер = ДанныеКартинки.Размер();
    МаксимальныйРазмер = 10240;  //Превью делаем, только если размер исходной картинки больше 300Кб
	
	Если Размер > МаксимальныйРазмер Тогда
		
        ОбрабатываемаяКартинка = Новый ОбрабатываемаяКартинка(Картинка);
		
		Попытка
            Если Картинка.ПлотностьПоВертикали() > 72 Тогда
                ОбрабатываемаяКартинка.УстановитьПлотность(72, 72);
            КонецЕсли;
        Исключение
            
		КонецПопытки;
		
        Ширина = Картинка.Ширина();
        МаксимальнаяШирина = 150;
		
        Если Ширина > МаксимальнаяШирина Тогда
            ОбрабатываемаяКартинка.УстановитьРазмер(МаксимальнаяШирина, Окр(Картинка.Высота() / Ширина * МаксимальнаяШирина));
		КонецЕсли;
		
        Картинка = ОбрабатываемаяКартинка.ПолучитьКартинку(); 
		
    КонецЕсли;
    
    Возврат Картинка.ПолучитьДвоичныеДанные(); 
	
КонецФункции
