
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ЗаполнитьПараметрыПользователя();
	Элементы.Пользователь.ТолькоПросмотр = НЕ РольДоступна("Программист");
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыПользователя()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.Пользователь = &Пользователь
		|	И НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ПолучитьСписокНастроек());
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтаФорма[Выборка.ИмяНастройки] = Выборка.Значение;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьСписокНастроек()

	МассивНастроек = Новый Массив(2);
	
	МассивНастроек[0] = "АдресаДляОтправкиОповещений";
	МассивНастроек[1] = "СвернутыйГантПриОткрытии";
	
    Возврат МассивНастроек;
	
КонецФункции // ПолучитьСписокНастроек()

Процедура СохранитьНаСервере()
	
	Для каждого ИмяНастройки Из ПолучитьСписокНастроек() Цикл
	
		МенеджерРегистра 				= РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи();
		МенеджерРегистра.ИмяНастройки 	= ИмяНастройки;
		МенеджерРегистра.НомерНастройки = 0;
		МенеджерРегистра.Пользователь  	= Пользователь;
		МенеджерРегистра.Значение 		= ЭтаФорма[ИмяНастройки];
		
		МенеджерРегистра.Записать();
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура АдресаДляОтправкиОповещенийПриИзменении(Элемент)
	Элементы.ФормаСохранить.Доступность = Истина;
КонецПроцедуры 

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ЗаполнитьПараметрыПользователя()
КонецПроцедуры

&НаКлиенте
Процедура СвернутыйГантПриОткрытииПриИзменении(Элемент)
	Элементы.ФормаСохранить.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура АдресаДляОтправкиОповещенийИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элементы.ФормаСохранить.Доступность = Истина;
КонецПроцедуры
