&НаКлиенте
Перем ДолжностьПользователя;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ЗаполнитьПараметрыПользователя();
	Элементы.Пользователь.ТолькоПросмотр = НЕ РольДоступна("Программист");
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыПользователя()

	
	Для каждого ЗначениеНастройки Из омРабочийСтол.ПолучитьНастройкиПользователя(Пользователь) Цикл
	
		ЭтаФорма[ЗначениеНастройки.Представление] = ЗначениеНастройки.Значение;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура СохранитьНаСервере()
	
	Для каждого ИмяНастройки Из омРабочийСтол.ПолучитьСписокНастроек() Цикл
	
		МенеджерРегистра 				= РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи();
		МенеджерРегистра.ИмяНастройки 	= ИмяНастройки;
		МенеджерРегистра.НомерНастройки = 0;
		МенеджерРегистра.Пользователь  	= Пользователь;
		МенеджерРегистра.Значение 		= ЭтаФорма[ИмяНастройки];
		
		МенеджерРегистра.Записать();
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура АдресаДляОтправкиОповещенийПриИзменении(Элемент)
	Элементы.ФормаСохранить.Доступность = Истина;
КонецПроцедуры 

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	ДолжностьПользователя = омСотрудники.ДолжностьПользователя(Пользователь);
	ЗаполнитьПараметрыПользователя();
	ВидимостьЭлемнтовПоДолжности();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутыйГантПриОткрытииПриИзменении(Элемент)
	Элементы.ФормаСохранить.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДолжностьПользователя = омСотрудники.ДолжностьПользователя(Пользователь); 
	ВидимостьЭлемнтовПоДолжности();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлемнтовПоДолжности()

	МассивГруппЭлементов = Новый Массив(1);
	МассивГруппЭлементов[0] = "ГруппаКонструкторы";
	
	ДолжностьКонструктор = ПредопределенноеЗначение("Перечисление.Должности.Конструктор");
	
	Для каждого ТекущаяГруппа Из МассивГруппЭлементов Цикл
	
		Если ДолжностьПользователя = ДолжностьКонструктор И ТекущаяГруппа = "ГруппаКонструкторы" Тогда
		
			Элементы[ТекущаяГруппа].Видимость = Истина;	
		
		Иначе
		
			Элементы[ТекущаяГруппа].Видимость = Ложь;	
		
		КонецЕсли;	
	
	КонецЦикла;

КонецПроцедуры // ВидимостьЭментовПоДолжности()


&НаКлиенте
Процедура ВзаимодействиеСвернутоПриИзменении(Элемент)
	Элементы.ФормаСохранить.Доступность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура АдресаДляОтправкиОповещенийИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элементы.ФормаСохранить.Доступность = Истина;
КонецПроцедуры
