&НаКлиенте
Перем НеПроверятьПолноеИмя;

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если НЕ НеПроверятьПолноеИмя Тогда
		
		ПолноеНаименование = омОбщиеФункции.ПолучитьПолныйПутьЭлементаСправочника(Объект.Ссылка);
		Если НЕ Объект.ПолноеНаименование = ПолноеНаименование Тогда
			
			Объект.ПолноеНаименование = ПолноеНаименование;
			НеПроверятьПолноеИмя = Истина;
			Записать();
			НеПроверятьПолноеИмя = Ложь;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НеПроверятьПолноеИмя = Ложь;
КонецПроцедуры




