&НаКлиенте
Перем НеПроверятьПолноеИмя;

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если НЕ НеПроверятьПолноеИмя Тогда
		
		
		НужнаЗапись = Ложь;
		
		ПолноеНаименование = омОбщиеФункции.ПолучитьПолныйПутьЭлементаСправочника(Объект.Ссылка);
		Если НЕ Объект.ПолноеНаименование = ПолноеНаименование Тогда
			
			Объект.ПолноеНаименование = ПолноеНаименование;
			НужнаЗапись = Истина;
		КонецЕсли;
		
		Если ПустаяСтрока(Объект.ШаблонНаименования) Тогда
			
			мДанных = СтрРазделить(Объект.ПолноеНаименование, ".", Ложь);
			
			КоличествоЭлементов = мДанных.Количество();
			Если КоличествоЭлементов = 0 Тогда
				Объект.ШаблонНаименования = "";
			Иначе
				Объект.ШаблонНаименования =  мДанных[0] + "%%%";
				
				Для х = 1 По КоличествоЭлементов - 1 Цикл
					Объект.ШаблонНаименования = Объект.ШаблонНаименования + "." + мДанных[х];	
				КонецЦикла;
				
			КонецЕсли; 
			
			НужнаЗапись = Истина;
		КонецЕсли;  
		
		Если НужнаЗапись Тогда
			НеПроверятьПолноеИмя = Истина;
			Записать();
			НеПроверятьПолноеИмя = Ложь;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НеПроверятьПолноеИмя = Ложь;
КонецПроцедуры




