
#Область СозданиеИПолучениеПредопределенныхСвойств

Функция СформироватьСтруктуруСвойств(НастройкаПодключения, ДляДругихПодсистем = Ложь) Экспорт
	
	НастройкиСинхронизации = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);
	Если ДляДругихПодсистем Тогда       
		НастройкиСинхронизации.СинхронизацияТоваров = Истина;
		НастройкиСинхронизации.СинхронизацияКлиентов = Истина;
	КонецЕсли;
	
	СтруктураСвойств = Новый Структура;
	
	СтруктураСвойств.Вставить("НеЗагружаемыеЗначенияСвойств"	, ПолучитьНеЗагружаемыеСвойства(НастройкаПодключения, НастройкиСинхронизации)); // указываются свойства, которые не должно добавляться загружаемым объектам
	СтруктураСвойств.Вставить("НеВыгружаемыеСвойства"			, ПолучитьНеВыгружаемыеСвойства(НастройкаПодключения, НастройкиСинхронизации)); 
	
	
	Если НастройкиСинхронизации.СинхронизацияТоваров ИЛИ НастройкиСинхронизации.СинхронизацияСделок ИЛИ НастройкиСинхронизации.СинхронизацияСчетов ИЛИ НастройкиСинхронизации.СинхронизацияЗаказов Тогда
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоВидаНоменклатуры"	  	, СоздатьПолучитьСвойствоВидаНоменклатурыБитрикс24(НастройкаПодключения));
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоАртикулНоменклатуры" 	, СоздатьПолучитьСвойствоАртикулНоменклатурыБитрикс24(НастройкаПодключения)); 
		Если НастройкиСинхронизации.ВерсияТоваров <> "v.2" Тогда
			СтруктураСвойств.Вставить("ПредопределенноеСвойствоОстатокНоменклатуры" , СоздатьПолучитьСвойствоОстатокНоменклатурыБитрикс24(НастройкаПодключения)); 
		КонецЕсли;
	КонецЕсли;
	
	Если НастройкиСинхронизации.СинхронизацияКлиентов ИЛИ НастройкиСинхронизации.СинхронизацияСделок ИЛИ НастройкиСинхронизации.СинхронизацияСчетов ИЛИ НастройкиСинхронизации.СинхронизацияЗаказов Тогда
		
		СохраненныеНастройкиСинхронизации = НастройкиСинхронизации.Настройки.Получить();
		НастройкиСинхронизацииКлиентов = СохраненныеНастройкиСинхронизации.НастройкиСинхронизацииКлиентов;
		Если НастройкиСинхронизацииКлиентов.Свойство("ВыгружатьВзаиморасчетыКлиентов") И НастройкиСинхронизацииКлиентов.ВыгружатьВзаиморасчетыКлиентов Тогда 
			СтруктураСвойств.Вставить("ПредопределенноеСвойствоВзаиморасчетКомпанийКонтактов", СоздатьПолучитьСвойствоВзаиморасчетКомпанийКонтактовБитрикс24(НастройкаПодключения));
		КонецЕсли;		
		
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоПолКонтактов", СоздатьПолучитьСвойствоПолКонтактаБитрикс24(НастройкаПодключения));
		Если НастройкиСинхронизации.ОбрабатыватьУдалениеОбъектовВ1С Тогда
			СтруктураСвойств.Вставить("ПредопределенноеСвойствоПометкаУдаленияКомпанийИКонтактов", СоздатьПолучитьСвойствоПометкаУдаленияКомпанииКонтактаБитрикс24(НастройкаПодключения));
		КонецЕсли;

	КонецЕсли;
	
	Если НастройкиСинхронизации.СинхронизацияСчетов Тогда
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоНазваниеКомментарияСчета"	, СоздатьПолучитьСвойствоПользовательскогоКомментарияСчетаБитрикс24(НастройкаПодключения));
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоНазваниеТемыСчета"			, СоздатьПолучитьСвойствоНазваниеТемыСчетаБитрикс24(НастройкаПодключения));
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоНомерСчетаБитрикс24"			, СоздатьПолучитьСвойствоНомерСчетаБитрикс24(НастройкаПодключения));
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоДатаСчетаБитрикс24"			, СоздатьПолучитьСвойствоДатаСчетаБитрикс24(НастройкаПодключения));
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоНомер1ССчетаБитрикс24"		, СоздатьПолучитьСвойствоНомерСчета1С(НастройкаПодключения));
		
		Если НастройкиСинхронизации.ОбрабатыватьУдалениеОбъектовВ1С Тогда
			СтруктураСвойств.Вставить("ПредопределенноеСвойствоПометкаУдаленияСчетов"		, СоздатьПолучитьСвойствоПометкаУдаленияСчетаБитрикс24(НастройкаПодключения));
		КонецЕсли;

	КонецЕсли;
	
	Если НастройкиСинхронизации.СинхронизацияСделок Тогда
		
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоНазваниеТемыСделки"			, СоздатьПолучитьСвойствоНазваниеТемыСделкиБитрикс24(НастройкаПодключения));
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоНомерСделкиБитрикс24"		, СоздатьПолучитьСвойствоНомерСделкиБитрикс24(НастройкаПодключения));
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоДатаСделкиБитрикс24"			, СоздатьПолучитьСвойствоДатаСделкиБитрикс24(НастройкаПодключения));
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоОрганизацияСделки"			, СоздатьПолучитьСвойствоОрганизацияБитрикс24(НастройкаПодключения));
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоНомер1ССделки"				, СоздатьПолучитьСвойствоНомерСделки1С(НастройкаПодключения));
		
		Если НастройкиСинхронизации.ОбрабатыватьУдалениеОбъектовВ1С Тогда
			СтруктураСвойств.Вставить("ПредопределенноеСвойствоПометкаУдаленияСделок"		, СоздатьПолучитьСвойствоПометкаУдаленияСделкиБитрикс24(НастройкаПодключения));
		КонецЕсли;
		
		 СтруктураСвойств.Вставить("ПредопределенноеСвойствоНаправлениеСделки"		, СоздатьПолучитьСвойствоНаправлениеСделкиБитрикс24(НастройкаПодключения));
	КонецЕсли;
	
	Если НастройкиСинхронизации.СинхронизацияЗаказов Тогда
		
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоНомераЗаказаБитрикс24"		, СоздатьПолучитьСвойствоНомерЗаказаБитрикс24(НастройкаПодключения));
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоДатыЗаказаБитрикс24"			, СоздатьПолучитьСвойствоДатаЗаказаБитрикс24(НастройкаПодключения));
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоТрекНомераЗаказаБитрикс24"	, СоздатьПолучитьСвойствоТрекНомерЗаказаБитрикс24(НастройкаПодключения));
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоКомментарияЗаказаБитрикс24"	, СоздатьПолучитьСвойствоПользовательскогоКомментарияЗаказаБитрикс24(НастройкаПодключения));
		
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоНомераОтгрузкиБитрикс24"		, СоздатьПолучитьСвойствоНомерОтгрузкиБитрикс24(НастройкаПодключения));
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоДатыОтгрузкиБитрикс24"		, СоздатьПолучитьСвойствоДатаОтгрузкиБитрикс24(НастройкаПодключения));
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоТрекНомераОтгрузкиБитрикс24"	, СоздатьПолучитьСвойствоТрекНомерОтгрузкиБитрикс24(НастройкаПодключения));
		СтруктураСвойств.Вставить("ПредопределенноеСвойствоДоставкаРазрешенаОтгрузкиБитрикс24", СоздатьПолучитьСвойствоДоставкаРазрешенаОтгрузкиБитрикс24(НастройкаПодключения));
		
	КонецЕсли;
	
	Возврат СтруктураСвойств; 
	
КонецФункции

Функция ПолучитьНеЗагружаемыеСвойства(НастройкаПодключения, НастройкиСинхронизации = Неопределено) Экспорт
	
	Если НастройкиСинхронизации = Неопределено Тогда
		НастройкиСинхронизации = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);
	КонецЕсли;
	
	СвойстваИсключения = Новый Массив;
	
	Если НастройкиСинхронизации.СинхронизацияКлиентов ИЛИ НастройкиСинхронизации.СинхронизацияСчетов 
		ИЛИ НастройкиСинхронизации.СинхронизацияСделок ИЛИ НастройкиСинхронизации.СинхронизацияЗаказов Тогда
		
		Если НастройкиСинхронизации.СинхронизацияКлиентов Тогда
			
			СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоПолКонтактаБитрикс24(НастройкаПодключения));
			СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоВзаиморасчетКомпанийКонтактовБитрикс24(НастройкаПодключения));
			
			Если НастройкиСинхронизации.ОбрабатыватьУдалениеОбъектовВ1С Тогда
				СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоПометкаУдаленияКомпанииКонтактаБитрикс24(НастройкаПодключения));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НастройкиСинхронизации.СинхронизацияТоваров ИЛИ НастройкиСинхронизации.СинхронизацияСчетов 
		ИЛИ НастройкиСинхронизации.СинхронизацияСделок ИЛИ НастройкиСинхронизации.СинхронизацияЗаказов Тогда
		
		Если НастройкиСинхронизации.СинхронизацияТоваров Тогда
			СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоВидаНоменклатурыБитрикс24(НастройкаПодключения));
			СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоАртикулНоменклатурыБитрикс24(НастройкаПодключения));
			СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоОстатокНоменклатурыБитрикс24(НастройкаПодключения));
		КонецЕсли;
		
	КонецЕсли;
	
	Если НастройкиСинхронизации.СинхронизацияСчетов Тогда
		СвойствоСтатуса = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСвойстваДокументовДляСопоставлений(НастройкаПодключения, "Счет");
		Если ЗначениеЗаполнено(СвойствоСтатуса) Тогда СвойстваИсключения.Добавить(СвойствоСтатуса) КонецЕсли;
		
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоПометкаУдаленияСчетаБитрикс24(НастройкаПодключения));
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоНомерСчета1С(НастройкаПодключения));
		
	КонецЕсли;
	
	Если НастройкиСинхронизации.СинхронизацияСделок Тогда
		
		СвойствоСтатуса = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСвойстваДокументовДляСопоставлений(НастройкаПодключения, "Проект");
		Если ЗначениеЗаполнено(СвойствоСтатуса) Тогда СвойстваИсключения.Добавить(СвойствоСтатуса) КонецЕсли;
		
		Если НастройкиСинхронизации.ОбрабатыватьУдалениеОбъектовВ1С Тогда
			СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоПометкаУдаленияСделкиБитрикс24(НастройкаПодключения));
		КонецЕсли;
		
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоНомерСделки1С(НастройкаПодключения));
		
	КонецЕсли;
	
	Если НастройкиСинхронизации.СинхронизацияЗаказов Тогда
		
		СвойствоСтатуса = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСвойстваДокументовДляСопоставлений(НастройкаПодключения, "Заказ");
		Если ЗначениеЗаполнено(СвойствоСтатуса) Тогда СвойстваИсключения.Добавить(СвойствоСтатуса) КонецЕсли;
		
		СвойствоСтатуса = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСвойстваДокументовДляСопоставлений(НастройкаПодключения, "Отгрузка");
		Если ЗначениеЗаполнено(СвойствоСтатуса) Тогда СвойстваИсключения.Добавить(СвойствоСтатуса) КонецЕсли;
		
		СвойствоСтатуса = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСвойстваДокументовДляСопоставлений(НастройкаПодключения, "ДоставкаЗаказ");
		Если ЗначениеЗаполнено(СвойствоСтатуса) Тогда СвойстваИсключения.Добавить(СвойствоСтатуса) КонецЕсли;
		
		СвойствоСтатуса = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСвойстваДокументовДляСопоставлений(НастройкаПодключения, "ДоставкаОтгрузка");
		Если ЗначениеЗаполнено(СвойствоСтатуса) Тогда СвойстваИсключения.Добавить(СвойствоСтатуса) КонецЕсли;
		
	КонецЕсли;
	
	Если НастройкиСинхронизации.СинхронизацияСделок ИЛИ НастройкиСинхронизации.СинхронизацияЗаказов Тогда
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоОрганизацияБитрикс24(НастройкаПодключения));
	КонецЕсли;
		
	Возврат СвойстваИсключения;
	
КонецФункции

Функция ПолучитьНеВыгружаемыеСвойства(НастройкаПодключения, НастройкиСинхронизации = Неопределено) Экспорт
	
	Если НастройкиСинхронизации = Неопределено Тогда
		НастройкиСинхронизации = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);
	КонецЕсли;
	
	СвойстваИсключения = Новый Массив;

	Если НастройкиСинхронизации.СинхронизацияСчетов Тогда
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоПользовательскогоКомментарияСчетаБитрикс24(НастройкаПодключения));
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоНазваниеТемыСчетаБитрикс24(НастройкаПодключения));
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоНомерСчетаБитрикс24(НастройкаПодключения));
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоДатаСчетаБитрикс24(НастройкаПодключения));
		
		СвойствоСтатуса = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСвойстваДокументовДляСопоставлений(НастройкаПодключения, "Счет");
		Если ЗначениеЗаполнено(СвойствоСтатуса) Тогда СвойстваИсключения.Добавить(СвойствоСтатуса) КонецЕсли;
		
	КонецЕсли;
	
	Если НастройкиСинхронизации.СинхронизацияСделок Тогда
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоНазваниеТемыСделкиБитрикс24(НастройкаПодключения));
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоНаправлениеСделкиБитрикс24(НастройкаПодключения));
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоНомерСделкиБитрикс24(НастройкаПодключения));
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоДатаСделкиБитрикс24(НастройкаПодключения));
		
		СвойствоСтатуса = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСвойстваДокументовДляСопоставлений(НастройкаПодключения, "Проект");
		Если ЗначениеЗаполнено(СвойствоСтатуса) Тогда СвойстваИсключения.Добавить(СвойствоСтатуса) КонецЕсли;
		
	КонецЕсли;
	
	Если НастройкиСинхронизации.СинхронизацияЗаказов Тогда
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоНомерЗаказаБитрикс24(НастройкаПодключения));
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоДатаЗаказаБитрикс24(НастройкаПодключения));
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоТрекНомерЗаказаБитрикс24(НастройкаПодключения));
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоПользовательскогоКомментарияЗаказаБитрикс24(НастройкаПодключения));
		
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоНомерОтгрузкиБитрикс24(НастройкаПодключения));
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоДатаОтгрузкиБитрикс24(НастройкаПодключения));
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоТрекНомерОтгрузкиБитрикс24(НастройкаПодключения));
		СвойстваИсключения.Добавить(СоздатьПолучитьСвойствоДоставкаРазрешенаОтгрузкиБитрикс24(НастройкаПодключения));
		
		СвойствоСтатуса = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСвойстваДокументовДляСопоставлений(НастройкаПодключения, "Заказ");
		Если ЗначениеЗаполнено(СвойствоСтатуса) Тогда СвойстваИсключения.Добавить(СвойствоСтатуса) КонецЕсли;
		
		СвойствоСтатуса = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСвойстваДокументовДляСопоставлений(НастройкаПодключения, "Отгрузка");
		Если ЗначениеЗаполнено(СвойствоСтатуса) Тогда СвойстваИсключения.Добавить(СвойствоСтатуса) КонецЕсли;
		
		СвойствоСтатуса = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСвойстваДокументовДляСопоставлений(НастройкаПодключения, "ДоставкаЗаказ");
		Если ЗначениеЗаполнено(СвойствоСтатуса) Тогда СвойстваИсключения.Добавить(СвойствоСтатуса) КонецЕсли;
		
		СвойствоСтатуса = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСвойстваДокументовДляСопоставлений(НастройкаПодключения, "ДоставкаОтгрузка");
		Если ЗначениеЗаполнено(СвойствоСтатуса) Тогда СвойстваИсключения.Добавить(СвойствоСтатуса) КонецЕсли;
		
	КонецЕсли;
	
	Возврат СвойстваИсключения;
	
КонецФункции

Функция ПолучитьНаименованияСлужебныхСвойствБ24() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Удален в 1С");
	Результат.Добавить("Удален в 1С для Битрикс24");
	Результат.Добавить("Организация");
	Результат.Добавить("Организация для Битрикс24");
	Результат.Добавить("Долг (+нам,-мы)");
	Результат.Добавить("Долг (+нам,-мы) по данным 1С для Битрикс24");
	Результат.Добавить("Пол");
	Результат.Добавить("Пол для Битрикс24");
	Результат.Добавить("Артикул номенклатуры");
	Результат.Добавить("Артикул номенклатуры для Битрикс24");
	Результат.Добавить("Вид номенклатуры");
	Результат.Добавить("Вид номенклатуры для Битрикс24");
	Результат.Добавить("Остаток номенклатуры для Битрикс24");
	Результат.Добавить("Пользовательский комментарий счета Битрикс24");
	Результат.Добавить("Название счета Битрикс24");
	Результат.Добавить("Номер счета Битрикс24");
	Результат.Добавить("Дата счета Битрикс24");
	Результат.Добавить("Номер 1С");
	Результат.Добавить("Номер 1С для Битрикс24");
	Результат.Добавить("Название Проекты Битрикс24");
	Результат.Добавить("Номер Проекты Битрикс24");
	Результат.Добавить("Дата Проекты Битрикс24");
	Результат.Добавить("Направление Проекты Битрикс24");
	Результат.Добавить("Номер заказа Битрикс24");
	Результат.Добавить("Дата заказа Битрикс24");
	Результат.Добавить("Трек номер заказа Битрикс24");
	Результат.Добавить("Пользовательский комментарий заказа Битрикс24");
	Результат.Добавить("Номер отгрузки Битрикс24");
	Результат.Добавить("Дата отгрузки Битрикс24");
	Результат.Добавить("Трек номер отгрузки Битрикс24");
	Результат.Добавить("Доставка разрешена отгрузки Битрикс24");
	
	Возврат Результат;
		
КонецФункции


Функция СоздатьПолучитьСвойствоВидаНоменклатурыБитрикс24(НастройкаПодключения, СоздаватьНовыеЗначения = Ложь) Экспорт

	УстановитьПривилегированныйРежим(Истина);            
	
	ТипыДанныхДляОбменаСПорталом = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
		
	НастройкиСинхронизации 			= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);	
	Если НастройкиСинхронизации.ВерсияТоваров = "v.2" Тогда  
		ТипыДанныхС = ТипыДанныхДляОбменаСПорталом.СвойствоТовара2; 
		ТипыДанныхЗС = ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваТовара2; 
	Иначе
		ТипыДанныхС = ТипыДанныхДляОбменаСПорталом.СвойствоТовара; 
		ТипыДанныхЗС = ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваТовара; 
	КонецЕсли;
	
	НаименованиеСвойства 			= "Вид номенклатуры для Битрикс24";
	Справочник_Номенклатура_Общие 	= ПолучитьНаборСвойств("Справочник_Номенклатура_Общие");	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ИСТИНА";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при синхронизации с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Номенклатура)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Справочник_Номенклатура_Общие;
		
		лТип = Тип("СправочникСсылка.ЗначенияСвойствОбъектов");
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(лТип);
		
		СвойствоОбъект.ЭтоДополнительноеСведение = Истина;
		СвойствоОбъект.ТипЗначения 	= Новый ОписаниеТипов(МассивТипов);
		СвойствоОбъект.Доступен 	= Ложь;
		СвойствоОбъект.Виден 		= Ложь;
		СвойствоОбъект.ДополнительныеЗначенияИспользуются 	= Истина;
		
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		СоздаватьНовыеЗначения = Истина;
		
		//лНабор = Справочник_Номенклатура_Общие.ПолучитьОбъект();
		//лНабор.ДополнительныеСведения.Добавить().Свойство = СвойствоСсылка;
		//лНабор.Записать();
		
		ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхС, Истина, ТипыДанныхЗС);
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвойствоСсылка = Выборка.Ссылка; 
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(НастройкаПодключения.Портал, ТипыДанныхС, СвойствоСсылка)) Тогда
			ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхС, Истина, ТипыДанныхЗС);
		КонецЕсли;		
		
	КонецЕсли;
	
	Если СоздаватьНовыеЗначения И ЗначениеЗаполнено(СвойствоСсылка) Тогда
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Владелец", СвойствоСсылка);
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Наименование КАК Наименование,
		|	ЗначенияСвойствОбъектов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ЗначенияСвойств
		|ИЗ
		|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Владелец = &Владелец
		|	И ЗначенияСвойствОбъектов.ЭтоГруппа = ЛОЖЬ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыНоменклатуры.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|ГДЕ
		|	НЕ ВидыНоменклатуры.Наименование В
		|				(ВЫБРАТЬ
		|					ВТ_ЗначенияСвойств.Наименование
		|				ИЗ
		|					ВТ_ЗначенияСвойств)";     
		ВыполненныйЗапрос = Запрос.Выполнить();
		Если НЕ ВыполненныйЗапрос.Пустой() Тогда 
			
			ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхС, Истина, ТипыДанныхЗС);

			Выборка = ВыполненныйЗапрос.Выбрать();
			Пока Выборка.Следующий() Цикл
				НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
				НовоеЗначение.Владелец = СвойствоСсылка;
				НовоеЗначение.Наименование = Выборка.Наименование;
				НовоеЗначение.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
				НовоеЗначение.Записать();       
			КонецЦикла;  
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_ЗначенияСвойств.Наименование КАК Наименование,
		|	ВТ_ЗначенияСвойств.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_ЗначенияСвойств КАК ВТ_ЗначенияСвойств
		|ГДЕ
		|	НЕ ВТ_ЗначенияСвойств.Наименование В
		|				(ВЫБРАТЬ
		|					ВидыНоменклатуры.Наименование
		|				ИЗ
		|					Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры)";   
		ВыполненныйЗапрос = Запрос.Выполнить();
		Если НЕ ВыполненныйЗапрос.Пустой() Тогда 
			
			ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхС, Истина, ТипыДанныхЗС);

			Выборка = ВыполненныйЗапрос.Выбрать();
			Пока Выборка.Следующий() Цикл
				ТекЗначение = Выборка.Ссылка.ПолучитьОбъект();
				ТекЗначение.ПометкаУдаления = Истина;
				ТекЗначение.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
				ТекЗначение.Записать();
			КонецЦикла;
		
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции

Функция СоздатьПолучитьСвойствоАртикулНоменклатурыБитрикс24(НастройкаПодключения) 
	
	ТипыДанныхДляОбменаСПорталом = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	
	НастройкиСинхронизации 			= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);	
	Если НастройкиСинхронизации.ВерсияТоваров = "v.2" Тогда  
		ТипыДанныхС = ТипыДанныхДляОбменаСПорталом.СвойствоТовара2; 
	Иначе
		ТипыДанныхС = ТипыДанныхДляОбменаСПорталом.СвойствоТовара; 
	КонецЕсли;
	
	НаименованиеСвойства 			= "Артикул номенклатуры для Битрикс24";
	Справочник_Номенклатура_Общие 	= ПолучитьНаборСвойств("Справочник_Номенклатура_Общие");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ИСТИНА";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при синхронизации с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Номенклатура)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Справочник_Номенклатура_Общие;
		
		КС = Новый КвалификаторыСтроки(250);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
		
		СвойствоОбъект.ЭтоДополнительноеСведение = Истина;
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		СвойствоОбъект.Доступен 	= Ложь;
		СвойствоОбъект.Виден 		= Ложь;
		СвойствоОбъект.ДополнительныеЗначенияИспользуются 	= Ложь;
		
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);		
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Справочник_Номенклатура_Общие.ПолучитьОбъект();
		//лНабор.ДополнительныеСведения.Добавить().Свойство = СвойствоОбъект.Ссылка;
		//лНабор.Записать();
		
		ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхС);
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвойствоСсылка = Выборка.Ссылка; 
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(НастройкаПодключения.Портал, ТипыДанныхС, СвойствоСсылка)) Тогда
			ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхС);
		КонецЕсли;		
		
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции

Функция СоздатьПолучитьСвойствоОстатокНоменклатурыБитрикс24(НастройкаПодключения) 
	
	ТипыДанныхДляОбменаСПорталом = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	НастройкиСинхронизации 			= Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);	
	
	Если НастройкиСинхронизации.ВерсияТоваров = "v.2" Тогда  
    	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка();
	КонецЕсли;
	
	НаименованиеСвойства 			= "Остаток номенклатуры для Битрикс24";
	Справочник_Номенклатура_Общие 	= ПолучитьНаборСвойств("Справочник_Номенклатура_Общие"); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ИСТИНА";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при синхронизации с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Номенклатура)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Справочник_Номенклатура_Общие;
		
		КЧ = Новый КвалификаторыЧисла(12,3);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		СвойствоОбъект.ЭтоДополнительноеСведение = Истина;
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		СвойствоОбъект.Доступен 	= Ложь;
		СвойствоОбъект.Виден 		= Ложь;
		СвойствоОбъект.ДополнительныеЗначенияИспользуются 	= Ложь;
		
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);		
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Справочник_Номенклатура_Общие.ПолучитьОбъект();
		//лНабор.ДополнительныеСведения.Добавить().Свойство = СвойствоОбъект.Ссылка;
		//лНабор.Записать();
		
		ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоТовара);
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвойствоСсылка = Выборка.Ссылка; 
		КонецЦикла;
			
		Если НЕ ЗначениеЗаполнено(РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(НастройкаПодключения.Портал, ТипыДанныхДляОбменаСПорталом.СвойствоТовара, СвойствоСсылка)) Тогда
			ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоТовара);
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции


Функция СоздатьПолучитьСвойствоПолКонтактаБитрикс24(НастройкаПодключения, СоздаватьНовыеЗначения = Ложь) 
	
	ТипыДанныхДляОбменаСПорталом = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	
	НаименованиеСвойства 				= "Пол для Битрикс24";
	Справочник_КонтактныеЛицаПартнеров 	= ПолучитьНаборСвойств("Справочник_КонтактныеЛицаПартнеров");
	Справочник_Партнеры 				= ПолучитьНаборСвойств("Справочник_Партнеры");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ИСТИНА";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства;
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.Комментарий	= "Свойство контакта (Битрикс24)";
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		
		лТип = Тип("СправочникСсылка.ЗначенияСвойствОбъектов");
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(лТип);
		
		СвойствоОбъект.ЭтоДополнительноеСведение = Истина;
		СвойствоОбъект.ТипЗначения 	= Новый ОписаниеТипов(МассивТипов);
		СвойствоОбъект.Доступен 	= Ложь;
		СвойствоОбъект.Виден 		= Ложь;
		СвойствоОбъект.ДополнительныеЗначенияИспользуются 	= Истина;
		
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);		
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		СоздаватьНовыеЗначения = Истина;
		
		//лНабор = Справочник_Партнеры.ПолучитьОбъект();
		//лНабор.ДополнительныеСведения.Добавить().Свойство = СвойствоОбъект.Ссылка;
		//лНабор.Записать();
		//
		//лНабор = Справочник_Партнеры.ПолучитьОбъект();
		//лНабор.ДополнительныеСведения.Добавить().Свойство = СвойствоОбъект.Ссылка;
		//лНабор.Записать();
		
		ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоКонтакта, Истина, ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваКонтакта);
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвойствоСсылка = Выборка.Ссылка; 
		КонецЦикла;
			
		Если НЕ ЗначениеЗаполнено(РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(НастройкаПодключения.Портал, ТипыДанныхДляОбменаСПорталом.СвойствоКонтакта, СвойствоСсылка)) Тогда
			ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоКонтакта, Истина, ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваКонтакта);
		КонецЕсли;	
		
	КонецЕсли;
	
	Если СоздаватьНовыеЗначения И ЗначениеЗаполнено(СвойствоСсылка) Тогда
		
		мТипыПолов = Новый Массив;
		мТипыПолов.Добавить("Мужской");
		мТипыПолов.Добавить("Женский");
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Владелец", СвойствоСсылка);
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Наименование КАК Наименование,
		|	ЗначенияСвойствОбъектов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ЗначенияСвойств
		|ИЗ
		|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Владелец = &Владелец
		|	И ЗначенияСвойствОбъектов.ЭтоГруппа = ЛОЖЬ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Наименование";
		
		Запрос.Выполнить();
		
		Для каждого ТекПол Из мТипыПолов Цикл
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.УстановитьПараметр("Наименование", ТекПол);
			Запрос.Текст = "ВЫБРАТЬ
			|	ВТ_ЗначенияСвойств.Ссылка КАК Ссылка
			|ИЗ
			|	ВТ_ЗначенияСвойств КАК ВТ_ЗначенияСвойств
			|ГДЕ
			|	ВТ_ЗначенияСвойств.Наименование = &Наименование";
			Если Запрос.Выполнить().Пустой() Тогда
				НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
				НовоеЗначение.Владелец 				= СвойствоСсылка;
				НовоеЗначение.Наименование 			= ТекПол;
				НовоеЗначение.ПолноеНаименование 	= ТекПол;
				НовоеЗначение.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
				НовоеЗначение.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции

Функция СоздатьПолучитьСвойствоВзаиморасчетКомпанийКонтактовБитрикс24(НастройкаПодключения) 
	
	ТипыДанныхДляОбменаСПорталом = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	
	НаименованиеСвойства				= "Долг (+нам,-мы) по данным 1С для Битрикс24";
	Справочник_КонтактныеЛицаПартнеров 	= ПолучитьНаборСвойств("Справочник_КонтактныеЛицаПартнеров");
	Справочник_Партнеры 				= ПолучитьНаборСвойств("Справочник_Партнеры");  
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ИСТИНА";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства;
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.Комментарий	= "";
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		
		КЧ = Новый КвалификаторыЧисла(12,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		СвойствоОбъект.ЭтоДополнительноеСведение = Истина;
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		СвойствоОбъект.Доступен 	= Ложь;
		СвойствоОбъект.Виден 		= Ложь;
		СвойствоОбъект.ДополнительныеЗначенияИспользуются 	= Ложь;
		
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);		
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Справочник_КонтактныеЛицаПартнеров.ПолучитьОбъект();
		//лНабор.ДополнительныеСведения.Добавить().Свойство = СвойствоОбъект.Ссылка;
		//лНабор.Записать();
		//
		//лНабор = Справочник_Партнеры.ПолучитьОбъект();
		//лНабор.ДополнительныеСведения.Добавить().Свойство = СвойствоОбъект.Ссылка;
		//лНабор.Записать();
		
		ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоКомпании);
		ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоКонтакта);
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвойствоСсылка = Выборка.Ссылка; 
		КонецЦикла;
			
		Если НЕ ЗначениеЗаполнено(РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(НастройкаПодключения.Портал, ТипыДанныхДляОбменаСПорталом.СвойствоКонтакта, СвойствоСсылка)) Тогда
			ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоКонтакта);
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(НастройкаПодключения.Портал, ТипыДанныхДляОбменаСПорталом.СвойствоКомпании, СвойствоСсылка)) Тогда
			ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоКомпании);
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции


Функция СоздатьПолучитьСвойствоПользовательскогоКомментарияСчетаБитрикс24(НастройкаПодключения) 
	
	НаименованиеСвойства 			= "Пользовательский комментарий счета Битрикс24";
	Документ_СчетНаОплатуКлиенту 	= ПолучитьНаборСвойств("Документ_СчетНаОплатуКлиенту"); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Счет на оплату)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_СчетНаОплатуКлиенту;
		
		КС = Новый КвалификаторыСтроки(250);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
		
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		СвойствоОбъект.ЭтоДополнительноеСведение = ЛОЖЬ;
		СвойствоОбъект.Доступен = Истина;
		СвойствоОбъект.Виден 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		лНабор = Документ_СчетНаОплатуКлиенту.ПолучитьОбъект();
		лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		лНабор.Записать();
		
		Возврат СвойствоСсылка; 
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция СоздатьПолучитьСвойствоНазваниеТемыСчетаБитрикс24(НастройкаПодключения) 
	
	ТипыДанныхДляОбменаСПорталом 	= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	Документ_СчетНаОплатуКлиенту 	= ПолучитьНаборСвойств("Документ_СчетНаОплатуКлиенту");      
	
	НаименованиеСвойства = "Название счета Битрикс24";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Счет на оплату)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_СчетНаОплатуКлиенту;
		
		КС = Новый КвалификаторыСтроки(250);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
		
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		СвойствоОбъект.ЭтоДополнительноеСведение = ЛОЖЬ;
		СвойствоОбъект.Доступен = Истина;
		СвойствоОбъект.Виден 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Документ_СчетНаОплатуКлиенту.ПолучитьОбъект();
		//лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		//лНабор.Записать();
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвойствоСсылка = Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СвойствоСсылка; 
	
КонецФункции

Функция СоздатьПолучитьСвойствоНомерСчетаБитрикс24(НастройкаПодключения) 
	
	ТипыДанныхДляОбменаСПорталом 	= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	Документ_СчетНаОплатуКлиенту 	= ПолучитьНаборСвойств("Документ_СчетНаОплатуКлиенту");      
	
	НаименованиеСвойства = "Номер счета Битрикс24";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Счет на оплату)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_СчетНаОплатуКлиенту;
		
		КС = Новый КвалификаторыСтроки(250);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
		
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		СвойствоОбъект.ЭтоДополнительноеСведение = ЛОЖЬ;
		СвойствоОбъект.Доступен = Истина;
		СвойствоОбъект.Виден 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Документ_СчетНаОплатуКлиенту.ПолучитьОбъект();
		//лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		//лНабор.Записать();
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвойствоСсылка = Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СвойствоСсылка; 
	
КонецФункции

Функция СоздатьПолучитьСвойствоДатаСчетаБитрикс24(НастройкаПодключения) 
	
	ТипыДанныхДляОбменаСПорталом 	= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	Документ_СчетНаОплатуКлиенту	= ПолучитьНаборСвойств("Документ_СчетНаОплатуКлиенту");      
	
	НаименованиеСвойства = "Дата счета Битрикс24";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Счет на оплату)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_СчетНаОплатуКлиенту;
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("Дата"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		СвойствоОбъект.ЭтоДополнительноеСведение = ЛОЖЬ;
		СвойствоОбъект.Доступен = Истина;
		СвойствоОбъект.Виден 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Документ_СчетНаОплатуКлиенту.ПолучитьОбъект();
		//лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		//лНабор.Записать();
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвойствоСсылка = Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
		
	Возврат СвойствоСсылка; 
	
КонецФункции

Функция СоздатьПолучитьСвойствоНомерСчета1С(НастройкаПодключения) 
	
	ТипыДанныхДляОбменаСПорталом 	= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	Документ_СчетНаОплатуКлиенту 	= ПолучитьНаборСвойств("Документ_СчетНаОплатуКлиенту");      
	
	НаименованиеСвойства = "Номер 1С для Битрикс24";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ИСТИНА";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Счет на оплату)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_СчетНаОплатуКлиенту;
		
		КС = Новый КвалификаторыСтроки(250);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
		
		СвойствоОбъект.ЭтоДополнительноеСведение = Истина;
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		СвойствоОбъект.Доступен 	= Ложь;
		СвойствоОбъект.Виден 		= Ложь;
		СвойствоОбъект.ДополнительныеЗначенияИспользуются 	= Ложь;
		
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);		
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Документ_СчетНаОплатуКлиенту.ПолучитьОбъект();
		//лНабор.ДополнительныеСведения.Добавить().Свойство = СвойствоСсылка;
		//лНабор.Записать();
		
		ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоСчета);
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвойствоСсылка = Выборка.Ссылка; 
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(НастройкаПодключения.Портал, ТипыДанныхДляОбменаСПорталом.СвойствоСчета2, СвойствоСсылка)) Тогда
			ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоСчета2);
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат СвойствоСсылка; 
	
КонецФункции


Функция СоздатьПолучитьСвойствоНазваниеТемыСделкиБитрикс24(НастройкаПодключения) 
	
	НаименованиеСвойства 	= "Название Проекты Битрикс24";
	Документ_ЗаказКлиента 	= ПолучитьНаборСвойств("Документ_ЗаказКлиента");   
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Заказ клиента)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_ЗаказКлиента;
		
		КС = Новый КвалификаторыСтроки(250);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
		
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		
		СвойствоОбъект.Доступен = Истина;
		СвойствоОбъект.Виден 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Документ_ЗаказКлиента.ПолучитьОбъект();
		//лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		//лНабор.Записать();
		
		Возврат СвойствоСсылка; 
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция СоздатьПолучитьСвойствоНомерСделкиБитрикс24(НастройкаПодключения) 
	
	НаименованиеСвойства 	= "Номер Проекты Битрикс24";
	Документ_ЗаказКлиента 	= ПолучитьНаборСвойств("Документ_ЗаказКлиента");  
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Заказ клиента)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_ЗаказКлиента;
		
		КС = Новый КвалификаторыСтроки(250);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
		
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		
		СвойствоОбъект.Доступен = Истина;
		СвойствоОбъект.Виден 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Документ_ЗаказКлиента.ПолучитьОбъект();
		//лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		//лНабор.Записать();
		
		Возврат СвойствоСсылка; 
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция СоздатьПолучитьСвойствоДатаСделкиБитрикс24(НастройкаПодключения) 
	
	НаименованиеСвойства 	= "Дата Проекты Битрикс24";
	Документ_ЗаказКлиента 	= ПолучитьНаборСвойств("Документ_ЗаказКлиента"); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Заказ клиента)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_ЗаказКлиента;
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("Дата"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		
		СвойствоОбъект.Доступен = Истина;
		СвойствоОбъект.Виден 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Документ_ЗаказКлиента.ПолучитьОбъект();
		//лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		//лНабор.Записать();
		
		Возврат СвойствоСсылка; 
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция СоздатьПолучитьСвойствоНаправлениеСделкиБитрикс24(НастройкаПодключения) Экспорт 
	
	НаименованиеСвойства 	= "Направление Проекты Битрикс24";
	Документ_ЗаказКлиента 	= ПолучитьНаборСвойств("Документ_ЗаказКлиента");    
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства";
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при синхронизации с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Заказ клиента)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_ЗаказКлиента;
		
		
		лТип = Тип("СправочникСсылка.ЗначенияСвойствОбъектов");
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(лТип);
		
		СвойствоОбъект.ЭтоДополнительноеСведение = ЛОЖЬ;
		СвойствоОбъект.ТипЗначения 	= Новый ОписаниеТипов(МассивТипов);
		СвойствоОбъект.Доступен 	= Ложь;
		СвойствоОбъект.Виден 		= Ложь;
		СвойствоОбъект.ДополнительныеЗначенияИспользуются 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Документ_ЗаказКлиента.ПолучитьОбъект();
		//лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		//лНабор.Записать();
		//
		СвойствоСсылка =  СвойствоСсылка; 
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвойствоСсылка = Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции

Функция СоздатьПолучитьСвойствоНомерСделки1С(НастройкаПодключения) 
	
	ТипыДанныхДляОбменаСПорталом 	= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	Документ_ЗаказКлиента 			= ПолучитьНаборСвойств("Документ_ЗаказКлиента");    
	
	НаименованиеСвойства = "Номер 1С для Битрикс24";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ИСТИНА";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Заказ клиента)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_ЗаказКлиента;
		
		КС = Новый КвалификаторыСтроки(250);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
		
		СвойствоОбъект.ЭтоДополнительноеСведение = Истина;
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		СвойствоОбъект.Доступен 	= Ложь;
		СвойствоОбъект.Виден 		= Ложь;
		СвойствоОбъект.ДополнительныеЗначенияИспользуются 	= Ложь;
		
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);		
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Документ_ЗаказКлиента.ПолучитьОбъект();
		//лНабор.ДополнительныеСведения.Добавить().Свойство = СвойствоСсылка;
		//лНабор.Записать();
		
		ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоСделки);
		
		Возврат СвойствоСсылка; 
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвойствоСсылка = Выборка.Ссылка; 
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(НастройкаПодключения.Портал, ТипыДанныхДляОбменаСПорталом.СвойствоСделки, СвойствоСсылка)) Тогда
			ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоСделки);
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат СвойствоСсылка; 
	
КонецФункции


Функция СоздатьПолучитьСвойствоНомерЗаказаБитрикс24(НастройкаПодключения) 
	
	НаименованиеСвойства 	= "Номер заказа Битрикс24";
	Документ_ЗаказКлиента 	= ПолучитьНаборСвойств("Документ_ЗаказКлиента");    
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Заказ клиента)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_ЗаказКлиента;
		
		КС = Новый КвалификаторыСтроки(250);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
		
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		
		СвойствоОбъект.Доступен = Истина;
		СвойствоОбъект.Виден 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Документ_ЗаказКлиента.ПолучитьОбъект();
		//лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		//лНабор.Записать();
		
		Возврат СвойствоСсылка; 
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция СоздатьПолучитьСвойствоДатаЗаказаБитрикс24(НастройкаПодключения) 
	
	НаименованиеСвойства 	= "Дата заказа Битрикс24";
	Документ_ЗаказКлиента 	= ПолучитьНаборСвойств("Документ_ЗаказКлиента");    
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Заказ клиента)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_ЗаказКлиента;
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("Дата"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		
		СвойствоОбъект.Доступен = Истина;
		СвойствоОбъект.Виден 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Документ_ЗаказКлиента.ПолучитьОбъект();
		//лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		//лНабор.Записать();
		
		Возврат СвойствоСсылка; 
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция СоздатьПолучитьСвойствоТрекНомерЗаказаБитрикс24(НастройкаПодключения) 
	
	НаименованиеСвойства = "Трек номер заказа Битрикс24";
	Документ_ЗаказКлиента 	= ПолучитьНаборСвойств("Документ_ЗаказКлиента");    
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Заказ клиента)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_ЗаказКлиента;
		
		КС = Новый КвалификаторыСтроки(250);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
		
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		
		СвойствоОбъект.Доступен = Истина;
		СвойствоОбъект.Виден 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Документ_ЗаказКлиента.ПолучитьОбъект();
		//лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		//лНабор.Записать();
		
		Возврат СвойствоСсылка; 
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция СоздатьПолучитьСвойствоПользовательскогоКомментарияЗаказаБитрикс24(НастройкаПодключения) 
	
	НаименованиеСвойства = "Пользовательский комментарий заказа Битрикс24";
	Документ_ЗаказКлиента 	= ПолучитьНаборСвойств("Документ_ЗаказКлиента");    
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Заказ клиента)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_ЗаказКлиента;
		
		КС = Новый КвалификаторыСтроки(250);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
		
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		
		СвойствоОбъект.Доступен = Истина;
		СвойствоОбъект.Виден 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Документ_ЗаказКлиента.ПолучитьОбъект();
		//лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		//лНабор.Записать();
		
		Возврат СвойствоСсылка; 
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции


Функция СоздатьПолучитьСвойствоНомерОтгрузкиБитрикс24(НастройкаПодключения) 
	
	НаименованиеСвойства 			= "Номер отгрузки Битрикс24";
	Документ_РеализацияТоваровУслуг = ПолучитьНаборСвойств("Документ_РеализацияТоваровУслуг");   
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Расходная накладная)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_РеализацияТоваровУслуг;
		
		КС = Новый КвалификаторыСтроки(250);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
		
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		
		СвойствоОбъект.Доступен = Истина;
		СвойствоОбъект.Виден 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		лНабор = Документ_РеализацияТоваровУслуг.ПолучитьОбъект();
		лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		лНабор.Записать();
		
		Возврат СвойствоСсылка; 
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция СоздатьПолучитьСвойствоДатаОтгрузкиБитрикс24(НастройкаПодключения) 
	
	НаименованиеСвойства 			= "Дата отгрузки Битрикс24";
	Документ_РеализацияТоваровУслуг = ПолучитьНаборСвойств("Документ_РеализацияТоваровУслуг");   
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Расходная накладная)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_РеализацияТоваровУслуг;
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("Дата"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		
		СвойствоОбъект.Доступен = Истина;
		СвойствоОбъект.Виден 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		лНабор = Документ_РеализацияТоваровУслуг.ПолучитьОбъект();
		лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		лНабор.Записать();
		
		Возврат СвойствоСсылка; 
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция СоздатьПолучитьСвойствоТрекНомерОтгрузкиБитрикс24(НастройкаПодключения) 
	
	НаименованиеСвойства 			= "Трек номер отгрузки Битрикс24";
	Документ_РеализацияТоваровУслуг = ПолучитьНаборСвойств("Документ_РеализацияТоваровУслуг");   
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Расходная накладная)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_РеализацияТоваровУслуг;
		
		КС = Новый КвалификаторыСтроки(250);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
		
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		
		СвойствоОбъект.Доступен = Истина;
		СвойствоОбъект.Виден 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		лНабор = Документ_РеализацияТоваровУслуг.ПолучитьОбъект();
		лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		лНабор.Записать();
		
		Возврат СвойствоСсылка; 
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция СоздатьПолучитьСвойствоДоставкаРазрешенаОтгрузкиБитрикс24(НастройкаПодключения) 
	
	НаименованиеСвойства 			= "Доставка разрешена отгрузки Битрикс24";
	Документ_РеализацияТоваровУслуг = ПолучитьНаборСвойств("Документ_РеализацияТоваровУслуг");   
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ЛОЖЬ";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Расходная накладная)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_РеализацияТоваровУслуг;
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("Булево"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
		СвойствоОбъект.ТипЗначения 	= ОписаниеТипов;
		
		СвойствоОбъект.Доступен = Истина;
		СвойствоОбъект.Виден 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		лНабор = Документ_РеализацияТоваровУслуг.ПолучитьОбъект();
		лНабор.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		лНабор.Записать();
		
		Возврат СвойствоСсылка; 
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции


Функция СоздатьПолучитьСвойствоОрганизацияБитрикс24(НастройкаПодключения) 

	УстановитьПривилегированныйРежим(Истина);
	
	ТипыДанныхДляОбменаСПорталом = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	
	НаименованиеСвойства 	= "Организация для Битрикс24";
	Документ_ЗаказКлиента 	= ПолучитьНаборСвойств("Документ_ЗаказКлиента"); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства";
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при синхронизации с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства + " (Заказ клиента)";
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_ЗаказКлиента;
		
		
		лТип = Тип("СправочникСсылка.ЗначенияСвойствОбъектов");
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(лТип);
		
		СвойствоОбъект.ТипЗначения 	= Новый ОписаниеТипов(МассивТипов);
		СвойствоОбъект.ЭтоДополнительноеСведение = Истина;
		СвойствоОбъект.Доступен 	= Ложь;
		СвойствоОбъект.Виден 		= Ложь;
		СвойствоОбъект.ДополнительныеЗначенияИспользуются 	= Истина;
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Документ_ЗаказКлиента.ПолучитьОбъект();
		//лНабор.ДополнительныеСведения.Добавить().Свойство = СвойствоСсылка;
		//лНабор.Записать();
		
		ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоСделки, Истина, ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваСделки);
		//ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоЗаказа, Истина, ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваЗаказа);
		
		СоздаватьНовыеЗначения = Истина;
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвойствоСсылка = Выборка.Ссылка; 
		КонецЦикла;
			
		Если НЕ ЗначениеЗаполнено(РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(НастройкаПодключения.Портал, ТипыДанныхДляОбменаСПорталом.СвойствоСделки, СвойствоСсылка)) Тогда
			ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоСделки, Истина, ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваСделки);
		КонецЕсли;	
		//Если НЕ ЗначениеЗаполнено(РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(НастройкаПодключения.Портал, ТипыДанныхДляОбменаСПорталом.СвойствоЗаказа, СвойствоСсылка)) Тогда
		//	ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоЗаказа, Истина, ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваЗаказа);
		//КонецЕсли;	
			
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(СвойствоСсылка) Тогда
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Владелец", СвойствоСсылка);
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Наименование КАК Наименование,
		|	ЗначенияСвойствОбъектов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ЗначенияСвойств
		|ИЗ
		|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Владелец = &Владелец
		|	И ЗначенияСвойствОбъектов.ЭтоГруппа = ЛОЖЬ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Организации.Наименование КАК Наименование,
		|	Организации.НаименованиеПолное КАК НаименованиеПолное
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.Наименование В
		|				(ВЫБРАТЬ
		|					ВТ_ЗначенияСвойств.Наименование
		|				ИЗ
		|					ВТ_ЗначенияСвойств)";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
			НовоеЗначение.Владелец 				= СвойствоСсылка;
			НовоеЗначение.Наименование 			= Выборка.Наименование;
			НовоеЗначение.ПолноеНаименование 	= Выборка.НаименованиеПолное;
			НовоеЗначение.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
			НовоеЗначение.Записать();
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_ЗначенияСвойств.Наименование КАК Наименование,
		|	ВТ_ЗначенияСвойств.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_ЗначенияСвойств КАК ВТ_ЗначенияСвойств
		|ГДЕ
		|	НЕ ВТ_ЗначенияСвойств.Наименование В
		|				(ВЫБРАТЬ
		|					Организации.Наименование
		|				ИЗ
		|					Справочник.Организации КАК Организации)";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТекЗначение = Выборка.Ссылка.ПолучитьОбъект();
			ТекЗначение.ПометкаУдаления = Истина;
			ТекЗначение.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
			ТекЗначение.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции


Функция СоздатьПолучитьСвойствоПометкаУдаленияКомпанииКонтактаБитрикс24(НастройкаПодключения) 
	
	ТипыДанныхДляОбменаСПорталом = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	
	НаименованиеСвойства = "Удален в 1С для Битрикс24";
	Справочник_Партнеры  = ПолучитьНаборСвойств("Справочник_Партнеры");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.УстановитьПараметр("НаборСсылка"			, Справочник_Партнеры);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСсылка
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ИСТИНА";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства;
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Справочник_Партнеры;
		
		лТип = Тип("Булево");
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(лТип);
		
		СвойствоОбъект.ЭтоДополнительноеСведение = Истина;
		СвойствоОбъект.ТипЗначения 	= Новый ОписаниеТипов(МассивТипов);
		СвойствоОбъект.Доступен 	= Ложь;
		СвойствоОбъект.Виден 		= Ложь;
		
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		лНабор = Справочник_Партнеры.ПолучитьОбъект();
		лНабор.ДополнительныеСведения.Добавить().Свойство = СвойствоСсылка;
		лНабор.Записать();
		
		ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоКомпании);
		ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоКонтакта);
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвойствоСсылка = Выборка.Ссылка; 
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(НастройкаПодключения.Портал, ТипыДанныхДляОбменаСПорталом.СвойствоКомпании, СвойствоСсылка)) Тогда
			ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоКомпании);
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(НастройкаПодключения.Портал, ТипыДанныхДляОбменаСПорталом.СвойствоКонтакта, СвойствоСсылка)) Тогда
			ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоКонтакта);
		КонецЕсли;	
			
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции

Функция СоздатьПолучитьСвойствоПометкаУдаленияСчетаБитрикс24(НастройкаПодключения) 
	
	ТипыДанныхДляОбменаСПорталом = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	
	НаименованиеСвойства 			= "Удален в 1С для Битрикс24";
	Документ_СчетНаОплатуКлиенту 	 = ПолучитьНаборСвойств("Документ_СчетНаОплатуКлиенту");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.УстановитьПараметр("НаборСсылка"			, Документ_СчетНаОплатуКлиенту);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСсылка
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ИСТИНА";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда

		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства;
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_СчетНаОплатуКлиенту;
		
		лТип = Тип("Булево");
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(лТип);
		
		СвойствоОбъект.ЭтоДополнительноеСведение = Истина;
		СвойствоОбъект.ТипЗначения 	= Новый ОписаниеТипов(МассивТипов);
		СвойствоОбъект.Доступен 	= Ложь;
		СвойствоОбъект.Виден 		= Ложь;
		
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		лНабор = Документ_СчетНаОплатуКлиенту.ПолучитьОбъект();
		лНабор.ДополнительныеСведения.Добавить().Свойство = СвойствоСсылка;
		лНабор.Записать();
		
		ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоСчета);
		ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоСчета2);
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвойствоСсылка = Выборка.Ссылка; 
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(НастройкаПодключения.Портал, ТипыДанныхДляОбменаСПорталом.СвойствоСчета2, СвойствоСсылка)) Тогда
			ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоСчета2);
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции

Функция СоздатьПолучитьСвойствоПометкаУдаленияСделкиБитрикс24(НастройкаПодключения) 
	
	ТипыДанныхДляОбменаСПорталом = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	
	НаименованиеСвойства 	= "Удален в 1С для Битрикс24";
	Документ_ЗаказКлиента	= ПолучитьНаборСвойств("Документ_ЗаказКлиента");
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСвойства", НаименованиеСвойства);
	Запрос.УстановитьПараметр("НаборСсылка"			, Документ_ЗаказКлиента);
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &НаименованиеСвойства
	|	И ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСсылка
	|	И ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение = ИСТИНА";
	
	ВыполненныйЗапрос = Запрос.Выполнить();	
	
	Если ВыполненныйЗапрос.Пустой() Тогда
		
		СвойствоОбъект 	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		СвойствоОбъект.Комментарий 	= НСтр("ru = 'Создано автоматически при загрузке с Битрикс24'");
		СвойствоОбъект.Наименование = НаименованиеСвойства;
		СвойствоОбъект.Заголовок 	= НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыВыбораЗначения = НаименованиеСвойства;
		СвойствоОбъект.ЗаголовокФормыЗначения 		= НаименованиеСвойства;
		СвойствоОбъект.НаборСвойств = Документ_ЗаказКлиента;
		
		лТип = Тип("Булево");
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(лТип);
		
		СвойствоОбъект.ЭтоДополнительноеСведение = Истина;
		СвойствоОбъект.ТипЗначения 	= Новый ОписаниеТипов(МассивТипов);
		СвойствоОбъект.Доступен 	= Ложь;
		СвойствоОбъект.Виден 		= Ложь;
		
		СвойствоОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСБитрикс24", Истина);
		СвойствоОбъект.Записать();
		СвойствоСсылка = СвойствоОбъект.Ссылка; 
		
		//лНабор = Документ_ЗаказКлиента.ПолучитьОбъект();
		//лНабор.ДополнительныеСведения.Добавить().Свойство = СвойствоСсылка;
		//лНабор.Записать();
		
		ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоСделки);
		
	Иначе
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвойствоСсылка = Выборка.Ссылка; 
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(НастройкаПодключения.Портал, ТипыДанныхДляОбменаСПорталом.СвойствоСделки, СвойствоСсылка)) Тогда
			ДобавитьСвойствоВТаблицуИзменений(СвойствоСсылка, ТипыДанныхДляОбменаСПорталом.СвойствоСделки);
		КонецЕсли;	
			
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции

Процедура ДобавитьСвойствоВТаблицуИзменений(Свойство, ТипСвойства, НадоВыгружатьЗначения = Ложь, ТипЗначенийСвойства = Неопределено)
	
	СтруктураОтборка = Новый Структура;
	СтруктураОтборка.Вставить("НастройкаПодключения"	, Неопределено);
	СтруктураОтборка.Вставить("ТипДанных"				, Неопределено);
	СтруктураОтборка.Вставить("Объект"					, Свойство);
	СтруктураОтборка.Вставить("ПодчиненныйОбъект"		, Неопределено);
	
	
	мНастройкиСинхронизации = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьМассивНастроекСинхронизации();
	Для Каждого НастройкаПодключения Из мНастройкиСинхронизации Цикл
		
		СтруктураОтборка.НастройкаПодключения 	= НастройкаПодключения;
		СтруктураОтборка.ТипДанных 				= ТипСвойства;
		
		Если РегистрыСведений.Б24_КС_ТаблицаИзменений.Получить(СтруктураОтборка).ВремяЗаписиВМиллисекундах = 0 Тогда 
				НоваяЗапись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
				НоваяЗапись.НастройкаПодключения		= СтруктураОтборка.НастройкаПодключения;
				НоваяЗапись.ТипДанных 					= СтруктураОтборка.ТипДанных;
				НоваяЗапись.Объект 						= Свойство; 
				НоваяЗапись.ВремяЗаписиВМиллисекундах	= 100;
				НоваяЗапись.Записать();
		КонецЕсли;
		
		Если НадоВыгружатьЗначения Тогда
			
			СтруктураОтборка.ТипДанных 	= ТипЗначенийСвойства;
			
			Если РегистрыСведений.Б24_КС_ТаблицаИзменений.Получить(СтруктураОтборка).ВремяЗаписиВМиллисекундах = 0 Тогда 
					НоваяЗапись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
					НоваяЗапись.НастройкаПодключения		= СтруктураОтборка.НастройкаПодключения;
					НоваяЗапись.ТипДанных 					= СтруктураОтборка.ТипДанных;
					НоваяЗапись.Объект 						= Свойство; 
					НоваяЗапись.ВремяЗаписиВМиллисекундах	= 100;
					НоваяЗапись.Записать();
				КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


Функция ПолучитьНаборСвойств(КлючНабора) Экспорт
	
	ПредопределенныеНаборыСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.ПредопределенныеНаборыСвойств();
	
	ДанныеПоКлючуНабора = ПредопределенныеНаборыСвойств.Получить(КлючНабора);
	
	Если ДанныеПоКлючуНабора = Неопределено Тогда
		Возврат Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка();	
	Иначе
		Возврат ДанныеПоКлючуНабора.Ссылка;	
	КонецЕсли;
	
КонецФункции

#КонецОбласти


#Область ПолучениеНастроек

Функция ПолучитьМассивНастроекОВыгружаемыхДанных(ТолькоДляРегистрацииИзменений = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	мНастройкиПодключения = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьМассивНастроекСинхронизации();
	Для Каждого НастройкаПодключения Из мНастройкиПодключения Цикл
		
		НастройкиСинхронизации = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);
		Если НастройкиСинхронизации.НеРегистрироватьИзмененияАвтоматически И ТолькоДляРегистрацииИзменений Тогда
			Продолжить;
		КонецЕсли;
		
		СохраненныеНастройки = НастройкиСинхронизации.Настройки.Получить();
		Если СохраненныеНастройки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("НастройкаПодключения"		, НастройкаПодключения);
		СтруктураДанных.Вставить("Портал"				 	, НастройкаПодключения.Портал);
		СтруктураДанных.Вставить("СпособСинхронизацииДанных", НастройкиСинхронизации.СпособСинхронизацииДанных);
		СтруктураДанных.Вставить("ВерсияСчетов"				, НастройкиСинхронизации.ВерсияСчетов);
		СтруктураДанных.Вставить("ВерсияТоваров"			, НастройкиСинхронизации.ВерсияТоваров); 
		
		ПакетнаяРегистрацияИзменений = Неопределено;
		СохраненныеНастройки.НастройкиСинхронизацииТоваров.Свойство("ПакетнаяРегистрацияИзменений", ПакетнаяРегистрацияИзменений);
		СтруктураДанных.Вставить("ПакетнаяРегистрацияИзменений"	, ПакетнаяРегистрацияИзменений = Истина); 
		
		ИсточникИерархии = "Иерархия номенклатуры"; 
		Если НастройкиСинхронизации.ВерсияТоваров = "v.2" Тогда
			Если СохраненныеНастройки.НастройкиСинхронизацииТоваров.Свойство("ИсточникИерархии") Тогда ИсточникИерархии = СохраненныеНастройки.НастройкиСинхронизацииТоваров.ИсточникИерархии КонецЕсли;
		Иначе
			Если СохраненныеНастройки.НастройкиСинхронизацииТоваров.Свойство("ДеревоГрупп") И ЗначениеЗаполнено(СохраненныеНастройки.НастройкиСинхронизацииТоваров.ДеревоГрупп) Тогда
				ИсточникИерархии = "Произвольная иерархия"; 
			КонецЕсли;
		КонецЕсли;
		СтруктураДанных.Вставить("ИсточникИерархии", ИсточникИерархии);	
		
		ВыгружатьПартнеров 		= Ложь;
		ВыгружатьКонтрагентов 	= Ложь;
		ВыгружатьОрганизации 	= Ложь;
		ВыгружатьКонтактныеЛица	= Ложь;
		ВыгружатьБанкСчета		= Ложь;
		ВыгружатьТовары 		= Ложь;            
		ВыгружатьПредложения	= Ложь;
		ВыгружатьСчета 			= Ложь;
		ВыгружатьСделки 		= Ложь;
		ВыгружатьЗаказы 		= Ложь;
		ВыгружатьОплатыН 		= Ложь;
		ВыгружатьОплатыЭ 		= Ложь;
		ВыгружатьОплатыБ 		= Ложь;
		ВыгружатьОтгрузки 		= Ложь;
		ВыгружатьЦены 			= Ложь;
		ВыгружатьОстатки 		= Ложь;
		
		Если СохраненныеНастройки.Свойство("Сущности") Тогда
			Для каждого ТекЭлемент Из СохраненныеНастройки.Сущности Цикл
				
				Если ТекЭлемент.ВидОбъекта = "Справочник" И ТекЭлемент.ИмяОбъекта = "Партнеры" Тогда 
					Если НЕ ВыгружатьПартнеров Тогда
						ВыгружатьПартнеров = ТекЭлемент.ВыгружатьНаПортал;
					КонецЕсли;
				
				ИначеЕсли ТекЭлемент.ВидОбъекта = "Справочник" И ТекЭлемент.ИмяОбъекта = "Контрагенты" Тогда 
					Если НЕ ВыгружатьКонтрагентов Тогда
						ВыгружатьКонтрагентов = ТекЭлемент.ВыгружатьНаПортал;
					КонецЕсли;
				ИначеЕсли ТекЭлемент.ВидОбъекта = "Справочник" И ТекЭлемент.ИмяОбъекта = "Организации" Тогда 
					Если НЕ ВыгружатьОрганизации Тогда
						ВыгружатьОрганизации = ТекЭлемент.ВыгружатьНаПортал;
					КонецЕсли;
				ИначеЕсли ТекЭлемент.ВидОбъекта = "Справочник" И ТекЭлемент.ИмяОбъекта = "КонтактныеЛицаПартнеров" Тогда 
					Если НЕ ВыгружатьКонтактныеЛица Тогда
						ВыгружатьКонтактныеЛица = ТекЭлемент.ВыгружатьНаПортал;
					КонецЕсли;
				ИначеЕсли ТекЭлемент.ВидОбъекта = "Справочник" И ТекЭлемент.ИмяОбъекта = "БанковскиеСчетаКонтрагентов" Тогда 
					Если НЕ ВыгружатьБанкСчета Тогда
						ВыгружатьБанкСчета = ТекЭлемент.ВыгружатьНаПортал;
					КонецЕсли;
				ИначеЕсли ТекЭлемент.ВидОбъекта = "Справочник" И ТекЭлемент.ИмяОбъекта = "БанковскиеСчетаОрганизаций" Тогда 
					Если НЕ ВыгружатьБанкСчета Тогда
						ВыгружатьБанкСчета = ТекЭлемент.ВыгружатьНаПортал;
					КонецЕсли;  					
				ИначеЕсли ТекЭлемент.ВидОбъекта = "Справочник" И ТекЭлемент.ИмяОбъекта = "Номенклатура" Тогда 
					Если НЕ ВыгружатьТовары 
						И (ТекЭлемент.ВидСущности = "Товар" ИЛИ ТекЭлемент.ВидСущности = "Товар2") Тогда
						ВыгружатьТовары = ТекЭлемент.ВыгружатьНаПортал;
					КонецЕсли;          
				ИначеЕсли ТекЭлемент.ВидОбъекта = "Справочник" И ТекЭлемент.ИмяОбъекта = "ХарактеристикиНоменклатуры" Тогда 
					Если НЕ ВыгружатьПредложения Тогда
						ВыгружатьПредложения = ТекЭлемент.ВыгружатьНаПортал;
					КонецЕсли;
				ИначеЕсли ТекЭлемент.ВидОбъекта = "Документ" И ТекЭлемент.ИмяОбъекта = "СчетНаОплатуКлиенту" Тогда 
					Если НЕ ВыгружатьСчета Тогда
						ВыгружатьСчета = ТекЭлемент.ВыгружатьНаПортал;
					КонецЕсли;
				ИначеЕсли ТекЭлемент.ВидОбъекта = "Документ" И ТекЭлемент.ИмяОбъекта = "ЗаказКлиента" Тогда 
					Если НЕ ВыгружатьЗаказы Тогда
						ВыгружатьЗаказы = ТекЭлемент.ВыгружатьНаПортал;
					КонецЕсли;
					Если НЕ ВыгружатьСделки Тогда
						ВыгружатьСделки = ТекЭлемент.ВыгружатьНаПортал;
					КонецЕсли;
				ИначеЕсли ТекЭлемент.ВидОбъекта = "Документ" И ТекЭлемент.ИмяОбъекта = "ПоступлениеБезналичныхДенежныхСредств" Тогда 
					Если НЕ ВыгружатьОплатыБ Тогда
						ВыгружатьОплатыБ = ТекЭлемент.ВыгружатьНаПортал;
					КонецЕсли;
				ИначеЕсли ТекЭлемент.ВидОбъекта = "Документ" И ТекЭлемент.ИмяОбъекта = "ПриходныйКассовыйОрдер" Тогда 
					Если НЕ ВыгружатьОплатыН Тогда
						ВыгружатьОплатыН = ТекЭлемент.ВыгружатьНаПортал;
					КонецЕсли;
				ИначеЕсли ТекЭлемент.ВидОбъекта = "Документ" И ТекЭлемент.ИмяОбъекта = "ОперацияПоПлатежнойКарте" Тогда 
					Если НЕ ВыгружатьОплатыЭ Тогда
						ВыгружатьОплатыЭ = ТекЭлемент.ВыгружатьНаПортал;
					КонецЕсли;
				ИначеЕсли ТекЭлемент.ВидОбъекта = "Документ" И ТекЭлемент.ИмяОбъекта = "РеализацияТоваровУслуг" Тогда 
					Если НЕ ВыгружатьОтгрузки Тогда
						ВыгружатьОтгрузки = ТекЭлемент.ВыгружатьНаПортал;
					КонецЕсли;
				КонецЕсли
			
			КонецЦикла;
		КонецЕсли;
		
		СтруктураДанных.Вставить("ВыгружатьПартнеров"		, ?(ВыгружатьПартнеров 			= Истина И НастройкиСинхронизации.СинхронизацияКлиентов, Истина, Ложь));
		СтруктураДанных.Вставить("ВыгружатьКонтрагентов"	, ?(ВыгружатьКонтрагентов 		= Истина И НастройкиСинхронизации.СинхронизацияКлиентов, Истина, Ложь));
		СтруктураДанных.Вставить("ВыгружатьОрганизации"		, ?(ВыгружатьОрганизации 		= Истина И НастройкиСинхронизации.СинхронизацияКлиентов, Истина, Ложь));
		СтруктураДанных.Вставить("ВыгружатьКонтактныеЛица"	, ?(ВыгружатьКонтактныеЛица 	= Истина И НастройкиСинхронизации.СинхронизацияКлиентов, Истина, Ложь));
		СтруктураДанных.Вставить("ВыгружатьБанкСчета"		, ?(ВыгружатьБанкСчета 			= Истина И НастройкиСинхронизации.СинхронизацияКлиентов, Истина, Ложь));
		
		СтруктураДанных.Вставить("ВыгружатьТовары"			, ?(ВыгружатьТовары 			= Истина И НастройкиСинхронизации.СинхронизацияТоваров, Истина, Ложь));
		СтруктураДанных.Вставить("ВыгружатьПредложения"		, ?(ВыгружатьПредложения 		= Истина И ВыгружатьТовары = Истина И НастройкиСинхронизации.СинхронизацияТоваров, Истина, Ложь));
		
		СтруктураДанных.Вставить("ВыгружатьСчета"			, ?(ВыгружатьСчета 				= Истина И НастройкиСинхронизации.СинхронизацияСчетов, Истина, Ложь));
		СтруктураДанных.Вставить("ВыгружатьСделки"			, ?(ВыгружатьСделки 			= Истина И НастройкиСинхронизации.СинхронизацияСделок, Истина, Ложь));
		СтруктураДанных.Вставить("ВыгружатьЗаказы"			, ?(ВыгружатьЗаказы 			= Истина И НастройкиСинхронизации.СинхронизацияЗаказов, Истина, Ложь));
		
		СтруктураДанных.Вставить("ВыгружатьОплатыН"			, ?(ВыгружатьОплатыН 		= Истина И НастройкиСинхронизации.СинхронизацияЗаказов И ВыгружатьЗаказы = Истина , Истина, Ложь));
		СтруктураДанных.Вставить("ВыгружатьОплатыЭ"			, ?(ВыгружатьОплатыЭ 		= Истина И НастройкиСинхронизации.СинхронизацияЗаказов И ВыгружатьЗаказы = Истина , Истина, Ложь));
		СтруктураДанных.Вставить("ВыгружатьОплатыБ"			, ?(ВыгружатьОплатыБ 		= Истина И НастройкиСинхронизации.СинхронизацияЗаказов И ВыгружатьЗаказы = Истина , Истина, Ложь));
		СтруктураДанных.Вставить("ВыгружатьОтгрузки"		, ?(ВыгружатьОтгрузки 		= Истина И НастройкиСинхронизации.СинхронизацияЗаказов И ВыгружатьЗаказы = Истина, Истина, Ложь));
		
		ВыгружатьФайлыКомпаний	= Ложь;
		ВыгружатьФайлыКонтактов	= Ложь;
		Если СтруктураДанных.ВыгружатьКонтрагентов И СохраненныеНастройки.НастройкиСинхронизацииКлиентов.Свойство("ВыгружатьФайлыКлиентов") И СохраненныеНастройки.НастройкиСинхронизацииКлиентов.ВыгружатьФайлыКлиентов Тогда
			ВыгружатьФайлыКомпаний = СохраненныеНастройки.НастройкиСинхронизацииКлиентов.Свойство("СвойствоФайловБ24Компаний") 
				И ЗначениеЗаполнено(СохраненныеНастройки.НастройкиСинхронизацииКлиентов.СвойствоФайловБ24Компаний);
			ВыгружатьФайлыКонтактов = СохраненныеНастройки.НастройкиСинхронизацииКлиентов.Свойство("СвойствоФайловБ24Контактов") 
				И ЗначениеЗаполнено(СохраненныеНастройки.НастройкиСинхронизацииКлиентов.СвойствоФайловБ24Контактов);   
		КонецЕсли;
		
		СтруктураДанных.Вставить("ВыгружатьФайлыКомпаний"	, ВыгружатьФайлыКомпаний);
		СтруктураДанных.Вставить("ВыгружатьФайлыКонтактов"	, ВыгружатьФайлыКонтактов);
		
		ВыгружатьВзаиморасчетыКлиентов	= Ложь;
		Если СтруктураДанных.ВыгружатьКонтрагентов И СохраненныеНастройки.НастройкиСинхронизацииКлиентов.Свойство("ВыгружатьВзаиморасчетыКлиентов") Тогда
			ВыгружатьВзаиморасчетыКлиентов = СохраненныеНастройки.НастройкиСинхронизацииКлиентов.ВыгружатьВзаиморасчетыКлиентов;
		КонецЕсли;
		СтруктураДанных.Вставить("ВыгружатьВзаиморасчетыКлиентов", ВыгружатьВзаиморасчетыКлиентов);
		
		ВыгружатьФайлыСчетов	= Ложь;
		Если СтруктураДанных.ВыгружатьСчета И СохраненныеНастройки.НастройкиСинхронизацииСчетов.Свойство("ВыгружатьФайлыСчетов") И СохраненныеНастройки.НастройкиСинхронизацииСчетов.ВыгружатьФайлыСчетов Тогда
			ВыгружатьФайлыСчетов = СохраненныеНастройки.НастройкиСинхронизацииСчетов.Свойство("СвойствоФайловБ24Счетов") 
				И ЗначениеЗаполнено(СохраненныеНастройки.НастройкиСинхронизацииСчетов.СвойствоФайловБ24Счетов);
		КонецЕсли;
		СтруктураДанных.Вставить("ВыгружатьФайлыСчетов"	, ВыгружатьФайлыСчетов);
		
		ВыгружатьФайлыСделок	= Ложь;
		Если СтруктураДанных.ВыгружатьСделки И СохраненныеНастройки.НастройкиСинхронизацииСделок.Свойство("ВыгружатьФайлыСделок") И СохраненныеНастройки.НастройкиСинхронизацииСделок.ВыгружатьФайлыСделок Тогда
			ВыгружатьФайлыСделок = СохраненныеНастройки.НастройкиСинхронизацииСделок.Свойство("СвойствоФайловБ24Сделок") 
				И ЗначениеЗаполнено(СохраненныеНастройки.НастройкиСинхронизацииСделок.СвойствоФайловБ24Сделок);
		КонецЕсли;
		СтруктураДанных.Вставить("ВыгружатьФайлыСделок"	, ВыгружатьФайлыСделок);
		
		Если СтруктураДанных.ВерсияТоваров = "v.2" Тогда
			Если СохраненныеНастройки.НастройкиСинхронизацииТоваров.Свойство("Склады") Тогда
				ВыгружатьОстатки = СохраненныеНастройки.НастройкиСинхронизацииТоваров.Склады.Количество() > 0;
			КонецЕсли;
			Если СохраненныеНастройки.НастройкиСинхронизацииТоваров.Свойство("Прайсы") Тогда
				ВыгружатьЦены = СохраненныеНастройки.НастройкиСинхронизацииТоваров.Прайсы.Количество() > 0;
			КонецЕсли;
		Иначе  
			Если СохраненныеНастройки.НастройкиСинхронизацииТоваров.Свойство("Склад") Тогда
				ВыгружатьОстатки = ЗначениеЗаполнено(СохраненныеНастройки.НастройкиСинхронизацииТоваров.Склад);
			КонецЕсли;
			Если СохраненныеНастройки.НастройкиСинхронизацииТоваров.Свойство("ТипЦены") Тогда
				ВыгружатьЦены = ЗначениеЗаполнено(СохраненныеНастройки.НастройкиСинхронизацииТоваров.ТипЦены);
			КонецЕсли;
		КонецЕсли;
		СтруктураДанных.Вставить("ВыгружатьЦены"	, ВыгружатьЦены);
		СтруктураДанных.Вставить("ВыгружатьОстатки"	, ВыгружатьОстатки);
		
		Результат.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНастройкиСинхронизации(НастройкаПодключения) Экспорт
	
	СохраненныеНастройки = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);
	
	Возврат СохраненныеНастройки.Настройки.Получить();
	
КонецФункции


Функция НастройкиСущностей(НастройкаПодключения, ВидСущности, ИмяОбъекта, НазваниеНастройки) Экспорт
	
	Результат = Неопределено;
	
	Настройки = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкиСинхронизации(НастройкаПодключения);
	
	Если Настройки <> Неопределено Тогда
		
		Для каждого ТекЭлемент Из Настройки.Сущности Цикл
			
			Если ТекЭлемент.ВидСущности = ВидСущности И ТекЭлемент.ИмяОбъекта = ИмяОбъекта Тогда
				 Результат = ТекЭлемент[НазваниеНастройки];
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьВыгружаемыеПоляСущностей(НастройкаПодключения, ВидСущности, ИмяОбъекта) Экспорт
	
	Результат = Новый Массив;
	
	Настройки = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкиСинхронизации(НастройкаПодключения);
	
	Если Настройки <> Неопределено Тогда
		
		Для каждого ТекЭлемент Из Настройки.СоответствияПолейСущностейДляВыгрузкиНаПортал Цикл
			
			Если ТекЭлемент.ВидСущности = ВидСущности И ТекЭлемент.ИмяОбъекта = ИмяОбъекта Тогда
   				Результат.Добавить(ТекЭлемент);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВыгружаемыеПоляСущностейТЧ(НастройкаПодключения, ВидСущности, ИмяОбъекта) Экспорт
	
	Результат = Новый Массив;
	
	Настройки = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкиСинхронизации(НастройкаПодключения);
	
	Если Настройки <> Неопределено Тогда
		
		Для каждого ТекЭлемент Из Настройки.СоответствияПолейСущностейТабЧастейДляВыгрузкиНаПортал Цикл
			
			Если ТекЭлемент.ВидСущности = ВидСущности И ТекЭлемент.ИмяОбъекта = ИмяОбъекта Тогда
   				Результат.Добавить(ТекЭлемент);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьЗагружаемыеПоляСущностей(НастройкаПодключения, ВидСущности, ИмяОбъекта) Экспорт
	
	Результат = Новый Массив;
	
	Настройки = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкиСинхронизации(НастройкаПодключения);
	
	Если Настройки <> Неопределено Тогда
		
		Для каждого ТекЭлемент Из Настройки.СоответствияПолейСущностейДляЗагрузкиВ1С Цикл
			
			Если ТекЭлемент.ВидСущности = ВидСущности И ТекЭлемент.ИмяОбъекта = ИмяОбъекта Тогда
   				Результат.Добавить(ТекЭлемент);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗагружаемыеПоляСущностейТЧ(НастройкаПодключения, ВидСущности, ИмяОбъекта) Экспорт
	
	Результат = Новый Массив;
	
	Настройки = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкиСинхронизации(НастройкаПодключения);
	
	Если Настройки <> Неопределено Тогда
		                                     
		Для каждого ТекЭлемент Из Настройки.СоответствияПолейСущностейТабЧастейДляЗагрузкиВ1С Цикл
			
			Если ТекЭлемент.ВидСущности = ВидСущности И ТекЭлемент.ИмяОбъекта = ИмяОбъекта Тогда
   				Результат.Добавить(ТекЭлемент);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОтборыДляЗагрузкиДанныхВ1С(НастройкаПодключения, ВидСущности, ИмяОбъекта) Экспорт
	
	Результат = Новый Массив;
	
	Настройки = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкиСинхронизации(НастройкаПодключения);
	
	Если Настройки <> Неопределено Тогда
		                                     
		Для каждого ТекЭлемент Из Настройки.ОтборыДляЗагрузкиДанныхВ1С Цикл
			
			Если ТекЭлемент.ВидСущности = ВидСущности И ТекЭлемент.ИмяОбъекта = ИмяОбъекта Тогда
   				Результат.Добавить(ТекЭлемент);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции



Функция НастройкиСинхронизацииКлиентов(НастройкаПодключения, НазваниеНастройки) Экспорт
	
	Результат = Неопределено;
	
	Настройки = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкиСинхронизации(НастройкаПодключения);
	
	Если Настройки <> Неопределено Тогда
		НастройкиСинхронизацииКлиентов = Настройки.НастройкиСинхронизацииКлиентов;
		НастройкиСинхронизацииКлиентов.Свойство(НазваниеНастройки, Результат); 	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НастройкиСинхронизацииТоваров(НастройкаПодключения, НазваниеНастройки) Экспорт
	
	Результат = Неопределено;
	
	Настройки = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкиСинхронизации(НастройкаПодключения);
	
	Если Настройки <> Неопределено Тогда
		НастройкиСинхронизацииТоваров = Настройки.НастройкиСинхронизацииТоваров;
		НастройкиСинхронизацииТоваров.Свойство(НазваниеНастройки, Результат); 	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НастройкиСинхронизацииСчетов(НастройкаПодключения, НазваниеНастройки) Экспорт
	
	Результат = Неопределено;
	
	Настройки = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкиСинхронизации(НастройкаПодключения);
	
	Если Настройки <> Неопределено Тогда
		НастройкиСинхронизацииСчетов = Настройки.НастройкиСинхронизацииСчетов;
		НастройкиСинхронизацииСчетов.Свойство(НазваниеНастройки, Результат); 	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НастройкиСинхронизацииСделок(НастройкаПодключения, НазваниеНастройки) Экспорт
	
	Результат = Неопределено;
	
	Настройки = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкиСинхронизации(НастройкаПодключения);
	
	Если Настройки <> Неопределено Тогда
		НастройкиСинхронизацииСделок = Настройки.НастройкиСинхронизацииСделок;
		НастройкиСинхронизацииСделок.Свойство(НазваниеНастройки, Результат); 	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НастройкиСинхронизацииЗаказов(НастройкаПодключения, НазваниеНастройки) Экспорт
	
	Результат = Неопределено;
	
	Настройки = Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьНастройкиСинхронизации(НастройкаПодключения);
	
	Если Настройки <> Неопределено Тогда
		НастройкиСинхронизацииЗаказов = Настройки.НастройкиСинхронизацииЗаказов;
		НастройкиСинхронизацииЗаказов.Свойство(НазваниеНастройки, Результат); 	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСвойстваДокументовДляСопоставлений(НастройкаПодключения, НазваниеДокумента) Экспорт
	
	Результат = Неопределено;
	
	Если НазваниеДокумента = "Счет" Тогда
		ИнформацияОСтатусах = НастройкиСинхронизацииСчетов(НастройкаПодключения, "ИнформацияОСтатусах");
		
		Если ЗначениеЗаполнено(ИнформацияОСтатусах) Тогда
			Если ИнформацияОСтатусах.ИсточникСтатусов1С = "СвойствоСчета" Тогда 			
				Результат = ИнформацияОСтатусах.СвойствоСчета; 	
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли НазваниеДокумента = "Проект" Тогда
		ИнформацияОСтатусах = НастройкиСинхронизацииСделок(НастройкаПодключения, "ИнформацияОСтатусах");
		
		Если ЗначениеЗаполнено(ИнформацияОСтатусах) Тогда
			Если ИнформацияОСтатусах.ИсточникСтатусов1С = "СвойствоЗаказов" Тогда 			
				Результат = ИнформацияОСтатусах.СвойствоЗаказов; 
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли НазваниеДокумента = "Заказ" Тогда
		ИнформацияОСтатусах = НастройкиСинхронизацииЗаказов(НастройкаПодключения, "ИнформацияОСтатусах");
		
		Если ЗначениеЗаполнено(ИнформацияОСтатусах) Тогда
			Если ИнформацияОСтатусах.ИсточникСтатусовЗаказов = "СвойствоЗаказов" Тогда 			
				Результат = ИнформацияОСтатусах.СвойствоЗаказа; 
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли НазваниеДокумента = "Отгрузка" Тогда
		ИнформацияОСтатусах = НастройкиСинхронизацииЗаказов(НастройкаПодключения, "ИнформацияОСтатусах");
		
		Если ЗначениеЗаполнено(ИнформацияОСтатусах) Тогда
			Если ИнформацияОСтатусах.ИсточникСтатусовОтгрузок = "СвойствоОтгрузок" Тогда 			
				Результат = ИнформацияОСтатусах.СвойствоОтгрузки; 	
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли НазваниеДокумента = "ДоставкаЗаказ" Тогда
		ИнформацияОСтатусах = НастройкиСинхронизацииЗаказов(НастройкаПодключения, "ИнформацияОДоставках");
		
		Если ЗначениеЗаполнено(ИнформацияОСтатусах) Тогда
			Если ИнформацияОСтатусах.ИсточникСлужбДоставкиЗаказов = "СвойствоЗаказов" Тогда 			
				Результат = ИнформацияОСтатусах.СвойствоЗаказа;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли НазваниеДокумента = "ДоставкаОтгрузка" Тогда
		ИнформацияОСтатусах = НастройкиСинхронизацииЗаказов(НастройкаПодключения, "ИнформацияОДоставках");
		
		Если ЗначениеЗаполнено(ИнформацияОСтатусах) Тогда  			
			Если ИнформацияОСтатусах.ИсточникСлужбДоставкиОтгрузок = "СвойствоОтгрузок" Тогда 			
				Результат = ИнформацияОСтатусах.СвойствоОтгрузки; 
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьПрайсы(НастройкаПодключения, ВерсияТоваров) Экспорт
	
	ИспользуемыеПрайсы = Новый Массив;
	Если ВерсияТоваров = "v.2" Тогда    
		Прайсы = НастройкиСинхронизацииТоваров(НастройкаПодключения, "Прайсы");
		Если Прайсы <> Неопределено Тогда
			ИспользуемыеПрайсы = Прайсы.ВыгрузитьЗначения(); 
		КонецЕсли;
	Иначе         
		Прайс = НастройкиСинхронизацииТоваров(НастройкаПодключения, "ТипЦены");
		Если Прайс <> Неопределено Тогда
			ИспользуемыеПрайсы.Добавить(Прайс); 
		КонецЕсли;          
	КонецЕсли;
	
	Возврат ИспользуемыеПрайсы;
	
КонецФункции

Функция ПолучитьСклады(НастройкаПодключения, ВерсияТоваров) Экспорт 
	
	ИспользуемыеСклады = Новый Массив;
	Если ВерсияТоваров = "v.2" Тогда    
		Склады = НастройкиСинхронизацииТоваров(НастройкаПодключения, "Склады");
		Если Склады <> Неопределено Тогда
			ИспользуемыеСклады = Склады.ВыгрузитьЗначения(); 
		КонецЕсли;
	Иначе         
		Склад = НастройкиСинхронизацииТоваров(НастройкаПодключения, "Склад");
		Если Склад <> Неопределено Тогда
			ИспользуемыеСклады.Добавить(Склад); 
		КонецЕсли;          
	КонецЕсли;
	
	Возврат ИспользуемыеСклады;
	
КонецФункции

Функция ПолучитьМассивНастроекСинхронизации(КлючНастройки = "", ЗначениеНастройки = "") Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_КС_НастройкиСинхронизации.НастройкаПодключения КАК НастройкаПодключения
	|ИЗ
	|	РегистрСведений.Б24_КС_НастройкиСинхронизации КАК Б24_КС_НастройкиСинхронизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Б24_К_НастройкиПодключения КАК Б24_К_НастройкиПодключения
	|		ПО Б24_КС_НастройкиСинхронизации.НастройкаПодключения = Б24_К_НастройкиПодключения.Ссылка
	|ГДЕ
	|	Б24_К_НастройкиПодключения.ПометкаУдаления = ЛОЖЬ";
	
	//Если НЕ КлючНастройки = "" Тогда
	//	Запрос.Текст = Запрос.Текст + "
	//	|" + " И Б24_КС_НастройкиСинхронизации." + КлючНастройки + " = &ПараметрПоиска";
	//	
	//	Запрос.УстановитьПараметр("ПараметрПоиска", ЗначениеНастройки);
	//КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НастройкаПодключения");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("НастройкаПодключения"					, Справочники.Б24_К_НастройкиПодключения.ПустаяСсылка());
	Результат.Вставить("СинхронизацияКлиентов"					, Ложь);
	Результат.Вставить("СинхронизацияТоваров"					, Ложь);
	Результат.Вставить("СинхронизацияСделок"					, Ложь);
	Результат.Вставить("СинхронизацияСчетов"					, Ложь);
	Результат.Вставить("ВерсияСчетов"							, "v.2");
	Результат.Вставить("ВерсияТоваров"							, "v.2");
	Результат.Вставить("СинхронизацияЗаказов"					, Ложь);
	Результат.Вставить("СпособСинхронизацииДанных"				, "Только ручной режим");
	Результат.Вставить("КоличествоПовторенийПриОшибках"			, 1);
	Результат.Вставить("НеРегистрироватьИзмененияАвтоматически"	, Ложь);
	Результат.Вставить("ПорядокВыполненияСинхронизации"			, "Сперва Битрикс24, затем 1С");
	Результат.Вставить("ОбрабатыватьУдалениеОбъектовВБ24"		, Ложь);
	Результат.Вставить("ОбрабатыватьУдалениеОбъектовВ1С"		, Ложь);
	Результат.Вставить("ИдентификаторРегламентногоЗадания"		, Неопределено);
	Результат.Вставить("ИгнорироватьОшибкиВоВремяСинхронизации"	, Ложь);
	Результат.Вставить("Настройки"								, Новый ХранилищеЗначения(Неопределено));
	
	Запрос = Новый Запрос;
	
	Если Тип("Структура") = ТипЗнч(НастройкаПодключения) Тогда
		Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения.НастройкаПодключения);
	Иначе
		Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_КС_НастройкиСинхронизации.НастройкаПодключения КАК НастройкаПодключения,
	|	Б24_КС_НастройкиСинхронизации.СинхронизацияКлиентов КАК СинхронизацияКлиентов,
	|	Б24_КС_НастройкиСинхронизации.СинхронизацияТоваров КАК СинхронизацияТоваров,
	|	Б24_КС_НастройкиСинхронизации.СинхронизацияСделок КАК СинхронизацияСделок,
	|	Б24_КС_НастройкиСинхронизации.СинхронизацияСчетов КАК СинхронизацияСчетов,
	|	Б24_КС_НастройкиСинхронизации.СинхронизацияЗаказов КАК СинхронизацияЗаказов,
	|	Б24_КС_НастройкиСинхронизации.Настройки КАК Настройки,
	|	Б24_КС_НастройкиСинхронизации.СпособСинхронизацииДанных КАК СпособСинхронизацииДанных,
	|	Б24_КС_НастройкиСинхронизации.КоличествоПовторенийПриОшибках КАК КоличествоПовторенийПриОшибках,
	|	Б24_КС_НастройкиСинхронизации.НеРегистрироватьИзмененияАвтоматически КАК НеРегистрироватьИзмененияАвтоматически,
	|	Б24_КС_НастройкиСинхронизации.ПорядокВыполненияСинхронизации КАК ПорядокВыполненияСинхронизации,
	|	Б24_КС_НастройкиСинхронизации.ОбрабатыватьУдалениеОбъектовВБ24 КАК ОбрабатыватьУдалениеОбъектовВБ24,
	|	Б24_КС_НастройкиСинхронизации.ОбрабатыватьУдалениеОбъектовВ1С КАК ОбрабатыватьУдалениеОбъектовВ1С,
	|	Б24_КС_НастройкиСинхронизации.ИдентификаторРегламентногоЗадания КАК ИдентификаторРегламентногоЗадания,
	|	Б24_КС_НастройкиСинхронизации.ИгнорироватьОшибкиВоВремяСинхронизации КАК ИгнорироватьОшибкиВоВремяСинхронизации,
	|	Б24_КС_НастройкиСинхронизации.ВерсияСчетов КАК ВерсияСчетов,
	|	Б24_КС_НастройкиСинхронизации.ВерсияТоваров КАК ВерсияТоваров
	|ИЗ
	|	РегистрСведений.Б24_КС_НастройкиСинхронизации КАК Б24_КС_НастройкиСинхронизации
	|ГДЕ
	|	Б24_КС_НастройкиСинхронизации.НастройкаПодключения = &НастройкаПодключения";
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат.Настройки.Получить() = Неопределено Тогда
		Результат.Настройки = Новый ХранилищеЗначения(РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьНастройкиСинхронизацииПоУмолчанию());	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти
