
&НаКлиенте
Перем ВыбранФайлПДФ;



&НаКлиенте
Процедура ДобавитьФайл(Команда)

	ЗагрузитьФайл();
	
КонецПроцедуры

 &НаКлиенте
Асинх Процедура ЗагрузитьФайл()
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = "Файл изображения|*.jpg;*.png;*.jpeg|Файл pdf|*.pdf"; 
	ПомещенныйФайл = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога);
	
	Если ПомещенныйФайл <> Неопределено И Не ПомещенныйФайл.ПомещениеФайлаОтменено Тогда 
		ИмяФайла = ПомещенныйФайл.СсылкаНаФайл.Имя;
		ЗаписатьФайлЧерновикНаСервере(ПомещенныйФайл.Адрес, ИмяФайла, ТекстСообщения);
		Если ПомещенныйФайл.СсылкаНаФайл.Расширение = ".pdf" Тогда
			ВыбранФайлПДФ = Истина;	
		КонецЕсли;
		
		Оповестить("Добавлен файл сообщения");
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ЗаписатьФайлЧерновикНаСервере(АдресВХ, ИмяФайла, ТекстСообщения)
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	МЗ = РегистрыСведений.СообщенияЧерновик.СоздатьМенеджерЗаписи();
	
	МЗ.Пользователь 	= Пользователь;
	МЗ.ДатаЧерновика	= ТекущаяДата();
	МЗ.ТекстСообщения 	= ТекстСообщения;
	МЗ.ИмяФайла 		= ИмяФайла;
	МЗ.Картинка 		= Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХ));
	
	МЗ.Записать();
	
	
КонецФункции 


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Добавлен файл сообщения" Тогда
		//Если Параметр = Объект.Ссылка Тогда
			ПодключитьОбработчикОжидания("ПослеЗагрузкиКартинки",0.5,Истина);
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗагрузкиКартинки() Экспорт

	ОбновитьКартинки();	
	Элементы.АдресФайла.Обновить();

КонецПроцедуры // ПослеЗагрузкиКартинки()

 
&НаСервере
Процедура ОбновитьКартинки()	
	КлючКартинки = РегистрыСведений.СообщенияЧерновик.СоздатьКлючЗаписи(Новый Структура("Пользователь", ПараметрыСеанса.ТекущийПользователь));
	АдресКартинки = ПолучитьНавигационнуюСсылку(КлючКартинки, "Картинка");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НаборЗаписей = РегистрыСведений.СообщенияЧерновик.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыбранФайлПДФ = Ложь;
КонецПроцедуры



