
&НаКлиенте
Процедура ДобавитьКартинку(Команда)

	ЗегрузитьКартинку();
	
КонецПроцедуры

 &НаКлиенте
Асинх Процедура ЗегрузитьКартинку()
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = "Файл изображения|*.jpg;*.png;*.jpeg"; 
	ПомещенныйФайл = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога);
	
	Если ПомещенныйФайл <> Неопределено И Не ПомещенныйФайл.ПомещениеФайлаОтменено Тогда 
		ИмяФайла = ПомещенныйФайл.СсылкаНаФайл.Имя;
		ЗаписатьФайлКартинкиЧерновикНаСервере(ПомещенныйФайл.Адрес, ИмяФайла, ТекстСообщения);
		Оповестить("Добавлена картинка сообщения");
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ЗаписатьФайлКартинкиЧерновикНаСервере(АдресВХ, ИмяФайла, ТекстСообщения)
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	МЗ = РегистрыСведений.СообщенияЧерновик.СоздатьМенеджерЗаписи();
	
	МЗ.Пользователь 	= Пользователь;
	МЗ.ДатаЧерновика	= ТекущаяДата();
	МЗ.ТекстСообщения 	= ТекстСообщения;
	МЗ.ИмяФайла 		= ИмяФайла;
	МЗ.Картинка 		= Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХ));
	
	МЗ.Записать();
	
	
КонецФункции 


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Добавлена картинка сообщения" Тогда
		//Если Параметр = Объект.Ссылка Тогда
			ПодключитьОбработчикОжидания("ПослеЗагрузкиКартинки",0.5,Истина);
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПослеЗагрузкиКартинки() Экспорт

	ОбновитьКартинки();	
	Элементы.АдресКартинки.Обновить();

КонецПроцедуры // ПослеЗагрузкиКартинки()

 
&НаСервере
Процедура ОбновитьКартинки()	
	КлючКартинки = РегистрыСведений.СообщенияЧерновик.СоздатьКлючЗаписи(Новый Структура("Пользователь", ПараметрыСеанса.ТекущийПользователь));
	АдресКартинки = ПолучитьНавигационнуюСсылку(КлючКартинки, "Картинка");
КонецПроцедуры



