//ОписаниеПрефикса
//Если первая цифра 0, то следующая код объекта, следующие код элемента
//Если первая цифра 1, то следующие две цифрв код объекта, следующие код элемента


Функция ПолучитьПрефиксШтрихкодаПоТипу(ОбъектОпределения) Экспорт

	ТипОбъекта = ТипЗнч(ОбъектОпределения);
	
	Если ТипОбъекта = Тип("СправочникСсылка.Образцы") Тогда
		Возврат "01";
	КонецЕсли;

КонецФункции // ПолучитьПрефиксШтрихкодаПоТипу()

Функция ПолучитьШтрихкод(ШиринаШтрихкода, ВысотаШтрихкода, ЗначШтрихкод, ЗначТипШтрихкода)
	
	//https://its.1c.ru/db/metod8dev/content/5963/hdoc

	ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	ПараметрыШтрихкода.Ширина = ШиринаШтрихкода;
	ПараметрыШтрихкода.Высота = ВысотаШтрихкода;
	ПараметрыШтрихкода.ТипКода = ЗначТипШтрихкода;
	ПараметрыШтрихкода.Штрихкод = ЗначШтрихкод;
	ПараметрыШтрихкода.ПрозрачныйФон = Истина;
	ПараметрыШтрихкода.УровеньКоррекцииQR = 2;
	ПараметрыШтрихкода.ОтображатьТекст = Ложь;
	ПараметрыШтрихкода.Масштабировать = Истина;
	ПараметрыШтрихкода.СохранятьПропорции = Истина;
	ПараметрыШтрихкода.ВертикальноеВыравнивание  = 0; 
	ПараметрыШтрихкода.GS1DatabarКоличествоСтрок = 1;
	ПараметрыШтрихкода.ТипВходныхДанных = 0;
	
	РезультатШтрихкод = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);

	Возврат РезультатШтрихкод.Картинка;
	
КонецФункции
 

	
