Функция ПолучитьДанныеПроекта(Проект) Экспорт
	
	СтруктураВозврата = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.ДанныеПроекта КАК ДанныеПроекта
		|ГДЕ
		|	ДанныеПроекта.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	Колонки = СхемаЗапроса.ПакетЗапросов[0].Колонки;
	
	Для каждого ТекущаяКолонка Из Колонки Цикл
		
		ИмяКолонки = ТекущаяКолонка.Псевдоним;
		
		СтруктураВозврата.Вставить(ИмяКолонки, Неопределено);
		
	КонецЦикла;

	Выборка = Запрос.Выполнить().Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		
		Для каждого ТекущаяКолонка Из Колонки Цикл
		
			ИмяКолонки = ТекущаяКолонка.Псевдоним;
			
			СтруктураВозврата[ИмяКолонки] = Выборка[ИмяКолонки];
		
		КонецЦикла;
		
	КонецЦикла; 
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьДанныеПроекта()

Процедура УстановитьПараметры(СтруктураДанных) Экспорт

	МенеджерЗаписи 			= РегистрыСведений.ДанныеПроекта.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Проект 	= СтруктураДанных.Проект;
	
	МенеджерЗаписи.Прочитать();
	
	НужнаЗапись = Ложь;
	
	Для каждого х Из СтруктураДанных Цикл
	
		Если НЕ МенеджерЗаписи[х.Ключ] = х.Значение Тогда
		
			НужнаЗапись = Истина;
			МенеджерЗаписи[х.Ключ] = х.Значение;
		
		КонецЕсли;	
	
	КонецЦикла; 
	
	Если НужнаЗапись Тогда
	
		МенеджерЗаписи.Записать();	
	
	КонецЕсли;
	

КонецПроцедуры
