&НаКлиенте
Перем мИзменения, мСписокВыбораЦвета, ТаблицаВыгрузкиИзменена;

Процедура СохранитьНаСервере(мИзменения, ТаблицаВыгрузкиИзменена)
	
	ПустойПользователь 	= Справочники.Пользователи.ПустаяСсылка();
	НомерНастройки 		= 0;
	
	Для каждого текИмя Из ПолучитьСписокИменРеквизитов() Цикл
		МенеджерЗаписи = РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Значение 		= ЭтаФорма[текИмя];
		МенеджерЗаписи.ИмяНастройки 	= текИмя;
		МенеджерЗаписи.НомерНастройки 	= НомерНастройки;
		МенеджерЗаписи.Пользователь 	= ПустойПользователь;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
	Если НЕ мИзменения.Найти("ИспользоватьМножитель") = Неопределено Тогда
		Константы.ИспользоватьМножитель.Установить(ЭтаФорма.ИспользоватьМножитель);	
	КонецЕсли;

	Если НЕ мИзменения.Найти("УчитыватьПроектПриХранении") = Неопределено Тогда
		Константы.УчитыватьПроектПриХранении.Установить(ЭтаФорма.УчитыватьПроектПриХранении);	
	КонецЕсли;
	
	СохранитьЦвета();
	
	Если ТаблицаВыгрузкиИзменена Тогда
		СохранитьТаблицуВыгрузки();
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Ложь;
КонецПроцедуры

Процедура СохранитьТаблицуВыгрузки()
	
	мНастроек = омВыгрузкаCRMНаСевере.ПолучитьНаименованиеНастроек();

	Для каждого ИмяНастройки Из мНастроек Цикл
		НаборЗаписей = РегистрыСведений.НастройкиПроекта.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИмяНастройки.Установить(ИмяНастройки);
		
		Для каждого ДанныеТаблицы Из тзВыгрузка_в_PDM Цикл
			Если ДанныеТаблицы.ИмяНастройки = ИмяНастройки И ЗначениеЗаполнено(ДанныеТаблицы.Пользователь) Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ИмяНастройки 	= ИмяНастройки;
				НоваяЗапись.НомерНастройки 	= 0;
				НоваяЗапись.Пользователь 	= ДанныеТаблицы.Пользователь;
				НоваяЗапись.Значение 		= ДанныеТаблицы.В_PDM;
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура СохранитьЦвета()
	
	мПрефиксыГанта = омГантНастройкаСервер.ПолучитьПрефиксыГанта();
	
	Для каждого х Из СписокУдаленныхЦветов Цикл 
		
		ИмяОбъекта = "%" + х;
		
		Для каждого префикс Из мПрефиксыГанта Цикл
			НаборЗаписей = РегистрыСведений.НастройкиПроекта.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИмяНастройки.Установить(префикс +  ИмяОбъекта);
			
			НаборЗаписей.Записать();
		КонецЦикла;
		
	КонецЦикла;

	СписокУдаленныхЦветов.Очистить();
	
	тзСоответствиеПрефиксКолонка = омГантНастройкаСервер.ПолучитьТаблицуСоответсвияГантаКолонки();

	НайденыйСтроки = ТаблицаЦветов.НайтиСтроки(Новый Структура("Изменен", Истина));
	
	Для каждого ИзмененаяСтрока Из НайденыйСтроки Цикл
		Если НЕ ЗначениеЗаполнено(ИзмененаяСтрока.Объект) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяКолонки = "Цвет";
		Если ИзмененаяСтрока.Цвет.Вид = ВидЦвета.Абсолютный Тогда
			Значение = "a" + Формат(ИзмененаяСтрока[ИмяКолонки].Красный,"ЧЦ=3; ЧН=000; ЧВН=") 
							+ Формат(ИзмененаяСтрока[ИмяКолонки].Зеленый,"ЧЦ=3; ЧН=000; ЧВН=") 
							+ Формат(ИзмененаяСтрока[ИмяКолонки].Синий,"ЧЦ=3; ЧН=000; ЧВН=");
		Иначе
			Значение = "w" + ЗначениевСтрокуВнутр(ИзмененаяСтрока[ИмяКолонки]);
		КонецЕсли;
		
		ОбъектИзменения = СтрЗаменить(ИзмененаяСтрока.Объект, " ", "_"); 
		
		ЗаписатьПараметрНастройкиЦвет(тзСоответствиеПрефиксКолонка, ИмяКолонки, 				Значение, 								ОбъектИзменения);
		
		ЗаписатьПараметрНастройкиЦвет(тзСоответствиеПрефиксКолонка, "РазмерШрифта", 			ИзмененаяСтрока.РазмерШрифта, 			ОбъектИзменения);
		
		ЗаписатьПараметрНастройкиЦвет(тзСоответствиеПрефиксКолонка, "ПредставлениеЗначения", 	ИзмененаяСтрока.ПредставлениеЗначения, 	ОбъектИзменения);
		
		ЗаписатьПараметрНастройкиЦвет(тзСоответствиеПрефиксКолонка, "СокращатьНаименование", 	ИзмененаяСтрока.СокращатьНаименование, 	ОбъектИзменения);
		
	КонецЦикла;

КонецПроцедуры // СохранитьЦвета()

Процедура ЗаписатьПараметрНастройкиЦвет(тзСоответствиеПрефиксКолонка, ИмяКолонки, Значение, Объект)
	НайденаяСтрока = тзСоответствиеПрефиксКолонка.Найти(ИмяКолонки, "ИмяКолонки");
	ИмяНастройки =  НайденаяСтрока.Префикс + "%" + Объект;
	
	
	НаборЗаписей = РегистрыСведений.НастройкиПроекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИмяНастройки.Установить(ИмяНастройки);
	
	НоваяЗапись 				= НаборЗаписей.Добавить();
	НоваяЗапись.ИмяНастройки 	= ИмяНастройки;
	НоваяЗапись.Значение 		= Значение;
	
	НаборЗаписей.Записать();
КонецПроцедуры // ЗаписатьПараметрНастройкиЦвет()

Функция ПолучитьСписокИменРеквизитов()

	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	Возврат ОбъектОтчета.ПолучитьСписокИменРеквизитов();

КонецФункции // ПолучитьСписокИменРеквизитов()

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)
		|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ПолучитьСписокИменРеквизитов());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтаФорма[Выборка.ИмяНастройки] = Выборка.Значение;
	КонецЦикла;
	
	
	ИспользоватьМножитель 		= Константы.ИспользоватьМножитель.Получить();
	УчитыватьПроектПриХранении = Константы.УчитыватьПроектПриХранении.Получить();
	
	ЗаполнитьТаблицуЦветов();
	ЗаполнитьВыгрузку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТаблицаВыгрузкиИзменена = Ложь;
	мИзменения 			= Новый Массив;
	мСписокВыбораЦвета 	= Новый Массив;
	
	Для каждого х Из омЦвет.ПолучитьОбъектыДляЦвета() Цикл
		мСписокВыбораЦвета.Добавить(СтрЗаменить(х.Ключ, "_", " "));	
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьТаблицуЦветов()
	ТаблицаЦветов.Загрузить(омГантНастройкаСервер.ПолучитьТаблицуНастроекГанта());	
КонецПроцедуры // ЗаполнитьТаблицуЦветов() 

&НаКлиенте
Процедура ИспользоватьМножительПриИзменении(Элемент)
	Если мИзменения.Найти("ИспользоватьМножитель") = Неопределено Тогда
		мИзменения.Добавить("ИспользоватьМножитель");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьСделкуПриХраненииПриИзменении(Элемент)
	Если мИзменения.Найти("УчитыватьПроектПриХранении") = Неопределено Тогда
		мИзменения.Добавить("УчитыватьПроектПриХранении");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПароль(Команда)
	Элементы.ПарольPDM.РежимПароля = Ложь;
КонецПроцедуры

Функция  ТестПодключенияSQLНаСервере()
	стПодключения = омMsSQL.ПолучитьСтруктуруПодключения();
	ЗаполнитьЗначенияСвойств(стПодключения, Этаформа);
	
	стОтвет = омMsSQL.СоздатьПодключениеКБД(стПодключения);
	Если ПустаяСтрока(стОтвет.Ошибка) Тогда
		Сообщить("Тест пройден");
	Иначе
		Сообщить(стОтвет.Ошибка);
	КонецЕсли;
	
КонецФункции // ТестПодключенияMySQL()

&НаКлиенте
Процедура ТестПодключенияSQL(Команда)
	 ТестПодключенияSQLНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦветовПередУдалением(Элемент, Отказ)
	ТД = Элементы.ТаблицаЦветов.ТекущиеДанные;
	СписокУдаленныхЦветов.Добавить(ТД.Объект);
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаЦветовОбъектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	мВыбора = Новый Массив;
	
	стОтбор = Новый Структура("Объект", );
	
	Для каждого х Из мСписокВыбораЦвета Цикл
		стОтбор.Объект = х;
		Если ТаблицаЦветов.НайтиСтроки(стОтбор).Количество() = 0 Тогда
			мВыбора.Добавить(х);
		КонецЕсли;
	КонецЦикла;
	
	
	Элементы.ТаблицаЦветовОбъект.СписокВыбора.ЗагрузитьЗначения(мВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦветовПриИзменении(Элемент)
	ТД = Элементы.ТаблицаЦветов.ТекущиеДанные;
	Если НЕ ТД = Неопределено Тогда
		ТД.Изменен = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦветовПриАктивизацииСтроки(Элемент)
	ТД = Элементы.ТаблицаЦветов.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ЦветФорна.ЦветФона = ТД.Цвет;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦветовЦветПриИзменении(Элемент)
	ТаблицаЦветовПриАктивизацииСтроки(Элемент);
КонецПроцедуры

#Область Выгрузка 

Процедура ЗаполнитьВыгрузку()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК В_PDM,
		|	НастройкиПроекта.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НастройкиПроекта.Пользователь.Наименование,
		|	ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", омВыгрузкаCRMНаСевере.ПолучитьНаименованиеНастроек());
	
	тзВыгрузка_в_PDM.Загрузить(Запрос.Выполнить().Выгрузить());
	

КонецПроцедуры

&НаКлиенте
Процедура тзВыгрузка_в_PDMПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура тзВыгрузка_в_PDMПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

 &НаКлиенте
Процедура ПослеВыбораЭлемента(ВыбранныйЭлемент, СписокПараметров) Экспорт
    Если ВыбранныйЭлемент = Неопределено Тогда
    	Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение = ВыбранныйЭлемент.Значение;

	СтрокиДляУдаления = Новый Массив;
	
	Для каждого х Из тзВыгрузка_в_PDM Цикл
		Если х.Пользователь = ВыбранноеЗначение Тогда
			СтрокиДляУдаления.Добавить(х);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого х Из СтрокиДляУдаления Цикл
		тзВыгрузка_в_PDM.Удалить(х);
	КонецЦикла;

	ТаблицаВыгрузкиИзменена = Истина;
	Модифицированность 		= Истина;
КонецПроцедуры
 
&НаКлиенте
Процедура СоздатьНаОснованииВыгрузка(Команда)
	стДанные = ПолучитьСтруктуруДанныхПользователя(Ложь);
	
	Если стДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеРЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияОкнаРедактированияВыгрузка", ЭтаФорма);
	ОткрытьФорму("Отчет.ОбщиеНастройки.Форма.ФормаНастройкаВыгрузкиВPDM", стДанные, ЭтаФорма, , , , ОповещениеРЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияОкнаРедактированияВыгрузка(ПараметрыДанных, ДопПараметры) Экспорт

	Если НЕ ТипЗнч(ПараметрыДанных) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	стПраметры = 
	Новый Структура("ПутьКФайлуEXE, ПутьКФайлуЗагрузки, ПутьКФайлуEXEПроекта, ПутьКФайлуEXEКонструктор, ПутьКФайлуEXEКомпозиция, ПутьКФайлуEXEГабаритныйЧерчеж, ПутьКФайлуEXEИзменениеСтатусаГЧ, ПутьКФайлуEXEЗагрузкаТЗ"
			, Ложь, Ложь, Ложь, Ложь, Ложь, Ложь, Ложь, Ложь, Ложь);

    стПраметры.Вставить("РаздатьПрава", Ложь);
    стПраметры.Вставить("ЗабратьПрава", Ложь);
	
	Для каждого х Из тзВыгрузка_в_PDM Цикл 
				
		Если НЕ х.Пользователь = ПараметрыДанных.Пользователь Тогда
			Продолжить;
		КонецЕсли;	
		
	    Если х.ИмяНастройки = "ПутьКФайлуEXE" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXE; 
			стПраметры.ПутьКФайлуEXE = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуЗагрузки" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуЗагрузки; 
			стПраметры.ПутьКФайлуЗагрузки = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEСделки" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEСделки; 
			стПраметры.ПутьКФайлуEXEСделки = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEКонструктор" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEКонструктор; 
			стПраметры.ПутьКФайлуEXEКонструктор = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEКомпозиция" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEКомпозиция; 
			стПраметры.ПутьКФайлуEXEКомпозиция = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEГабаритныйЧерчеж" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEГабаритныйЧерчеж; 
			стПраметры.ПутьКФайлуEXEГабаритныйЧерчеж = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEИзменениеСтатусаГЧ" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEИзменениеСтатусаГЧ; 
			стПраметры.ПутьКФайлуEXEИзменениеСтатусаГЧ = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEПроекта" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEПроекта; 
			стПраметры.ПутьКФайлуEXEПроекта = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEЗагрузкаТЗ" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEЗагрузкаТЗ; 
			стПраметры.ПутьКФайлуEXEЗагрузкаТЗ = Истина;
		ИначеЕсли х.ИмяНастройки = "РаздатьПрава" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEРаздатьПрава; 
			стПраметры.ПутьКФайлуEXEРаздатьПрава = Истина;
		ИначеЕсли х.ИмяНастройки = "ЗабратьПрава" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEЗабратьПрава; 
			стПраметры.ПутьКФайлуEXEЗабратьПрава = Истина;
		КонецЕсли;
		
	КонецЦикла;      
	
	Если НЕ стПраметры.ПутьКФайлуEXE Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXE";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXE;
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуЗагрузки Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуЗагрузки";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуЗагрузки;
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуEXEПроекта Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEПроекта";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEПроекта;
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуEXEКонструктор Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEКонструктор";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEКонструктор;
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуEXEКомпозиция Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEКомпозиция";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEКомпозиция;
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуEXEГабаритныйЧерчеж Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEГабаритныйЧерчеж";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEГабаритныйЧерчеж;
	КонецЕсли;
	
	Если НЕ стПраметры.ПутьКФайлуEXEИзменениеСтатусаГЧ Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEИзменениеСтатусаГЧ";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEИзменениеСтатусаГЧ;                
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуEXEЗагрузкаТЗ Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEЗагрузкаТЗ";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEЗагрузкаТЗ;                
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуEXEРаздатьПрава Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEРаздатьПрава";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEРаздатьПрава;                
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуEXEЗабратьПрава Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEЗабратьПрава";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEЗабратьПрава;                
	КонецЕсли;


	ТаблицаВыгрузкиИзменена = Истина;
	Модифицированность 		= Истина;
КонецПроцедуры // ПослеЗакрытияОкнаРедактированияВыгрузка()

&НаКлиенте
Функция ПолучитьСтруктуруДанныхПользователя(Изменить)
	ТД = Элементы.тзВыгрузка_в_PDM.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	текПользователь = ТД.Пользователь;
	
	Если Изменить Тогда
		стДанные = Новый Структура("Пользователь, ПутьКФайлуEXE, ПутьКФайлуЗагрузки, ПутьКФайлуEXEПроекта, ПутьКФайлуEXEКонструктор, ПутьКФайлуEXEКомпозиция, ПутьКФайлуEXEГабаритныйЧерчеж, ПутьКФайлуEXEИзменениеСтатусаГЧ, ПутьКФайлуEXEЗагрузкаТЗ"
		, текПользователь);
	Иначе	
		стДанные = Новый Структура("ПутьКФайлуEXE, ПутьКФайлуЗагрузки, ПутьКФайлуEXEПроекта, ПутьКФайлуEXEКонструктор, ПутьКФайлуEXEКомпозиция, ПутьКФайлуEXEГабаритныйЧерчеж, ПутьКФайлуEXEИзменениеСтатусаГЧ, ПутьКФайлуEXEЗагрузкаТЗ");
	КонецЕсли;
	
	Для каждого х Из тзВыгрузка_в_PDM Цикл
		Если НЕ х.Пользователь = текПользователь Тогда
			Продолжить;
		КонецЕсли;
		
	    стДанные[х.ИмяНастройки] = х.В_PDM;
	КонецЦикла;
	
	Возврат стДанные;
КонецФункции // ПолучитьСтруктуруДанныхПользователя()

&НаСервереБезКонтекста
Процедура ВыгрузитьВБитриксНаСервере()
	омВыгрузкаCRMНаСевере.ВыгрузитьВБитриксРегламентноеЗадание();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВБитрикс(Команда)
	ВыгрузитьВБитриксНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере(мИзменения, ТаблицаВыгрузкиИзменена);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПользователяВыгрузка(Команда)
	стДанные = ПолучитьСтруктуруДанныхПользователя(Истина);
	
	Если стДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеРЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияОкнаРедактированияВыгрузка", ЭтаФорма);
	ОткрытьФорму("Отчет.ОбщиеНастройки.Форма.ФормаНастройкаВыгрузкиВPDM", стДанные, ЭтаФорма, , , , ОповещениеРЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователяВыгрузка(Команда) 
	
	ОповещениеРЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияОкнаРедактированияВыгрузка", ЭтаФорма);
	ОткрытьФорму("Отчет.ОбщиеНастройки.Форма.ФормаНастройкаВыгрузкиВPDM", , ЭтаФорма, , , , ОповещениеРЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПользователяВыгрузка(Команда)
	СписокВыбора = Новый СписокЗначений;
	
	Для каждого х Из тзВыгрузка_в_PDM Цикл
		Если СписокВыбора.НайтиПоЗначению(х.Пользователь) = Неопределено Тогда
		     СписокВыбора.Добавить(х.Пользователь);
		 КонецЕсли;
	 КонецЦикла;
	 
	 Оповещение = Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтотОбъект);
	 СписокВыбора.ПоказатьВыборЭлемента(Оповещение, "Укажите пользователя для удаления");

 КонецПроцедуры
 
#КонецОбласти