
&НаКлиенте
Асинх Процедура ВыборФайлаДляПеремещенияВPDM(Задача, ДействиеПриОкончании, НаименованиеДействия) Экспорт
	
	ДиалогВыбора 					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.Фильтр 			= "Текстовый документ (*.pdf)|*.pdf";
	
	Обещание = ДиалогВыбора.ВыбратьАсинх();
	
	ВыбранныеВДиалогеФайлы = Ждать Обещание;
	
	Если ВыбранныеВДиалогеФайлы = Неопределено Тогда
		Возврат;
	Конецесли;
	
	СруктураПараметров = Новый Структура("ЗадачаСсылка, НаименованиеДействия", Задача, НаименованиеДействия);
	
	УИДДействия = омФайлыPDM.СоздатьДействие(ДействиеПриОкончании, СруктураПараметров);
	Миллисекунды = омФайлыPDM.СоздатьЭтап(УИДДействия, "Перемещение файла " + ВыбранныеВДиалогеФайлы[0] + " на сервер");
	
	Параметры = Новый Структура("ПослеПеремещенияФайла", "омФайлыPDMНаКлиенте.ПослеПеремещенияФайла(""" + УИДДействия + """, " + Формат(Миллисекунды, "ЧГ=0") + ", ""%1"", ""%2"")");
	
	омФайлыНаКлиенте.ПереместитьФайлНаСервер(ВыбранныеВДиалогеФайлы[0], УИДДействия , , , Параметры);
	
КонецПроцедуры // ВыборФайлаДляПеремещенияВPDM()

&НаКлиенте
Процедура ПослеПеремещенияФайла(УИДДействия, Миллисекунды, АдресВХранилище, ОписаниеОшибки) Экспорт
	
	Если ПустаяСтрока(ОписаниеОшибки) Тогда
		
		ИмяФайла = омФайлыPDM.СохранитьФайлНаСервере(УИДДействия, АдресВХранилище);
		
		Если ПустаяСтрока(ИмяФайла) Тогда
			омФайлыPDM.ЗавершитьЭтапсОшибкой(УИДДействия, Миллисекунды, "Не удалось переместить файл на сервер");
		КонецЕсли;
		
		омФайлыPDM.ЗавершитьЭтап(УИДДействия, Миллисекунды);
		ПараметрыФункции 	= Новый Массив(2);
		ПараметрыФункции[0] = УИДДействия;	
		ПараметрыФункции[1] = ИмяФайла;
		омФайлыPDM.ЗапуститьФоновыеЗадания("омФайлыPDM.Запустить_обмен_файлов_с_PDM_на_Сервере", ПараметрыФункции, "Запустить_обмен_файлов_с_PDM_на_Сервере");
		
	Иначе
		омФайлыPDM.ЗавершитьЭтапсОшибкой(УИДДействия, Миллисекунды, ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры 

