
&НаКлиенте
Асинх Процедура ВыборФайлаДляПеремещенияВPDM(Задача, ДействиеПриОкончании, НаименованиеДействия) Экспорт
	
	ДиалогВыбора 					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.Фильтр 			= "Текстовый документ (*.pdf)|*.pdf";
	
	Обещание = ДиалогВыбора.ВыбратьАсинх();
	
	ВыбранныеВДиалогеФайлы = Ждать Обещание;
	
	Если ВыбранныеВДиалогеФайлы = Неопределено Тогда
		Возврат;
	Конецесли;
	
	СруктураПараметров = Новый Структура("ЗадачаСсылка, НаименованиеДействия", Задача, НаименованиеДействия);
	
	УИДДействия = омФайлыPDM.СоздатьДействие(ДействиеПриОкончании, СруктураПараметров);
	Миллисекунды = омФайлыPDM.СоздатьЭтап(УИДДействия, "Перемещение файла " + ВыбранныеВДиалогеФайлы[0] + " на сервер");
	
	Параметры = Новый Структура("ПослеПеремещенияФайла", "омФайлыPDMНаКлиенте.ПослеПеремещенияФайла(""" + УИДДействия + """, " + Формат(Миллисекунды, "ЧГ=0") + ")");
	
	омФайлыНаКлиенте.ПереместитьФайлНаСервер(ВыбранныеВДиалогеФайлы[0], УИДДействия , , , Параметры);
	
КонецПроцедуры // ВыборФайлаДляПеремещенияВPDM()

&НаКлиенте
Процедура ПослеПеремещенияФайла(УИДДействия, Миллисекунды) Экспорт
	
	омФайлыPDM.ЗавершитьЭтап(УИДДействия, Миллисекунды);
	
	
КонецПроцедуры
 