&НаКлиенте
Процедура ОткрытьПодборИзделияЗаказчика(Объект, ЭтаФорма, СтандартнаяОбработка = Ложь, ДополнительныеПараметры = Неопределено, НеПоказыватьИзделияЗаказчика = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;
	
	СделкаЗаказчика = Объект.Проект;
	
	Если Не ЗначениеЗаполнено(СделкаЗаказчика) Тогда
		ПоказатьПредупреждение(,"Не заполнена Проект.");	
		Возврат;	
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзделиеЗаказчика", ЭтаФорма, ДополнительныеПараметры);
	
	стПараметры = Новый Структура("Проект",СделкаЗаказчика); 
	Если НЕ НеПоказыватьИзделияЗаказчика = Неопределено Тогда
		стПараметры.Вставить("НеПоказыватьИзделияЗаказчика", НеПоказыватьИзделияЗаказчика);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ИзделияЗаказчика.ФормаВыбора",стПараметры,ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

КонецПроцедуры // ОткрытьПодборИзделий()

