&НаКлиенте
Процедура ОткрытьПодборИзделияЗаказчика(Объект, ЭтаФорма, СсылкаДоговор, СтандартнаяОбработка = Ложь, ДополнительныеПараметры = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;
	
	Проект = Объект.Проект;
	
	Если Не ЗначениеЗаполнено(Проект) Тогда
		ПоказатьПредупреждение(,"Не заполнен Проект.");	
		Возврат;	
	КонецЕсли;
	
	ЕстьТЧ = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ИзделияЗаказчика"); 
	
	ТолькоНеИспользованые = Истина;
	ДополнительныеПараметры.Свойство("ТолькоНеИспользованые" ,ТолькоНеИспользованые);
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзделияЗаказчика", ЭтаФорма, ДополнительныеПараметры);
	
	стПараметры = Новый Структура("Проект, ТолькоНеИспользованые, ТекущиеИзделияЗаказчика, СсылкаДоговор, Отказ, НомерПоПорядку"
					,Проект
					,ТолькоНеИспользованые
					,?(ЕстьТЧ, омТЧ_НаКлиентеСервере.КолонкуВМассив(Объект.ИзделияЗаказчика, "ИзделиеЗаказчика"), Новый Массив)
					,СсылкаДоговор
					,ДополнительныеПараметры.Отказ
					,ДополнительныеПараметры.НомерПоПорядку);
	
	ОткрытьФорму("Справочник.ИзделияЗаказчика.ФормаВыбора", стПараметры, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

КонецПроцедуры // ОткрытьПодборИзделий()

