
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектТайминга = Параметры.ОбъектТайминга;
	
	ЗаполнитьДанные(СформироватьЗаголовокОбъекта());
	
	Элементы.ФормаЗаписать.Видимость = РольДоступна("ПолныеПрава");
	Элементы.ТаблицаТаймингаНорматив.ТолькоПросмотр = НЕ Элементы.ФормаЗаписать.Видимость;
	
КонецПроцедуры


Процедура ЗаполнитьДанные(СтруктураДанных)

    Если СтруктураДанных.ПКД Тогда
		ЗаполнитьДанныеПКД();	
	КонецЕсли;
	
    Если СтруктураДанных.РКД Тогда
		ЗаполнитьДанныеРКД();	
	КонецЕсли;
	
	ТаблицаТайминга.Сортировать("ДатаНачала");

КонецПроцедуры


Функция СформироватьЗаголовокОбъекта()
	
	СтруктураДанных = Новый Структура("ПКД, ТЗ, РКД", Ложь, Ложь, Ложь);
	
	ТипОбъекта = ТипЗнч(ОбъектТайминга);
	
	Если ТипОбъекта = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
	
		Элементы.ОбъектТайминга.Заголовок = "Задача ПКД";
		СтруктураДанных.ПКД = Истина;
	
	ИначеЕсли ТипОбъекта = Тип("ЗадачаСсылка.Задачи_РКД") Тогда
	
		Элементы.ОбъектТайминга.Заголовок = "Задача РКД";
		СтруктураДанных.РКД = Истина;
	
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ИзделияКомплект") Тогда
	
		Элементы.ОбъектТайминга.Заголовок = "Изделие комплект";	
		СтруктураДанных.ПКД = Истина;
		СтруктураДанных.РКД = Истина;
		СтруктураДанных.ТЗ = Истина;
	
	КонецЕсли;
	
	Возврат СтруктураДанных;

КонецФункции

&НаКлиенте
Процедура ТаблицаТаймингаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТаймингаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТаймингаНормативПриИзменении(Элемент)
	ТД = Элементы.ТаблицаТайминга.ТекущиеДанные;
	
	Если НЕ ТД = Неопределено Тогда
	
		ТД.Изменен = Истина;
		
		Элементы.ФормаЗаписать.Доступность = Истина;
	
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьДанныеПКД()
	
	Если ТипЗнч(ОбъектТайминга) = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
		ЗадачаТайминга = ОбъектТайминга;	
	Иначе
		ЗадачаТайминга = ПолучитьЗадачуПКД();	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗадачаТайминга) Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьДанныеПоЗадачи(ЗадачаТайминга);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеРКД()
	
	Если ТипЗнч(ОбъектТайминга) = Тип("ЗадачаСсылка.Задачи_РКД") Тогда
		ЗадачаТайминга = ОбъектТайминга;	
	Иначе
		ЗадачаТайминга = ПолучитьЗадачуРКД();	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗадачаТайминга) Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьДанныеПоЗадачи(ЗадачаТайминга);
	
КонецПроцедуры 

Процедура ЗаполнитьДанныеПоЗадачи(ЗадачаТайминга)

	СтруктураТаблиц = РегистрыСведений.ТаймингЗадач.ПолучитьТаймингиЗадач(ЗадачаТайминга);
	
	Для каждого Тайминг Из СтруктураТаблиц.ТайминЗадач Цикл
	
		НС = ТаблицаТайминга.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Тайминг);
		
		Если Тайминг.НормаВремени = 0 И Тайминг.НормаВремениПоУмолчанию > 0 Тогда
		
			НС.НормаВремени = Тайминг.НормаВремениПоУмолчанию;	
			НС.НормативПоУмолчаению = Истина	
		
		КонецЕсли;
	
	КонецЦикла;
	

КонецПроцедуры

Функция ПолучитьЗадачуПКД()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.ОбъектТЗ = &ОбъектТЗ";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТайминга);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	

КонецФункции // ПолучитьЗадачуПКД()

Функция ПолучитьЗадачуРКД()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ = &ОбъектТЗ";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТайминга);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	

КонецФункции // ПолучитьЗадачуПКД()

&НаСервереБезКонтекста
Процедура ЗаписатьНаСервере(мДанных)

	МенеджерЗаписи = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	
	Для каждого х Из мДанных Цикл
	
		МенеджерЗаписи.Период = х.Период;
		МенеджерЗаписи.Задача = х.Задача;
		
		МенеджерЗаписи.Прочитать();
		
		Если НЕ МенеджерЗаписи.НормаВремени = х.НормаВремени Тогда
		
			МенеджерЗаписи.НормаВремени = х.НормаВремени;
			МенеджерЗаписи.Записать();
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	мДанных = Новый Массив;
	
	Для каждого х Из ТаблицаТайминга Цикл
	
		Если х.Изменен Тогда
		
			Данные = Новый Структура("Задача, Период, НормаВремени", х.Задача, х.ДатаНачала, х.НормаВремени);
			х.Изменен = Ложь;
		
			мДанных.Добавить(Данные);
			
		КонецЕсли;
	
	КонецЦикла;
	
	ЗаписатьНаСервере(мДанных); 
	
КонецПроцедуры
