
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектТайминга = Параметры.ОбъектТайминга;
	
	СформироватьЗаголовогОбъекта();
	
	ЗаполнитьДанные();
	
КонецПроцедуры


Процедура ЗаполнитьДанные()

	

КонецПроцедуры


Процедура СформироватьЗаголовогОбъекта()

	ТипОбъекта = ТипЗнч(ОбъектТайминга);
	
	Если ТипОбъекта = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
	
		Элементы.ОбъектТайминга.Заголовок = "Задача ПКД";	
	
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ИзделияКомплект") Тогда
	
		Элементы.ОбъектТайминга.Заголовок = "Изделие комплект";	
	
	
	КонецЕсли;

КонецПроцедуры
