&НаКлиенте
Перем СтруктураПараметров; 
 
Функция СформироватьЗаголовокОбъекта()
	
	СтруктураПараметров = Новый Структура("ТипОбъекта, ЗадачаПКД, ЗадачаРКД, ОбъектТЗ", );
	
	СтруктураПараметров.ТипОбъекта = ТипЗнч(ОбъектТайминга);
	
	Если СтруктураПараметров.ТипОбъекта = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
	
		Элементы.ОбъектТайминга.Заголовок 	= "Задача ПКД";
		ЗадачиПКД 							= Истина;
		СтруктураПараметров.ОбъектТЗ 		= ОбъектТайминга.ОбъектТЗ;
	
	ИначеЕсли СтруктураПараметров.ТипОбъекта = Тип("ЗадачаСсылка.Задачи_РКД") Тогда
	
		Элементы.ОбъектТайминга.Заголовок = "Задача РКД";
		ЗадачиРКД = Истина;
		СтруктураПараметров.ОбъектТЗ 		= ОбъектТайминга.ОбъектТЗ;
	
	ИначеЕсли СтруктураПараметров.ТипОбъекта = Тип("СправочникСсылка.ИзделияКомплект")  Тогда
	
		Элементы.ОбъектТайминга.Заголовок = "Изделие комплект";	
		ЗадачиПКД					= Истина;
		ЗадачиРКД 					= Истина;
		ЗадачиТЗ 					= Истина;
		Комплект 					= Истина;
		Производство 				= Истина;
		СтруктураПараметров.ОбъектТЗ = ОбъектТайминга;
	
	ИначеЕсли СтруктураПараметров.ТипОбъекта = Тип("СправочникСсылка.Композиции")  Тогда
	
		Элементы.ОбъектТайминга.Заголовок = "Коомпозиция";	
		ЗадачиПКД						= Истина;
		ЗадачиТЗ 						= Истина;
		Комплект 						= Истина;
		СтруктураПараметров.ОбъектТЗ 	= ОбъектТайминга;
	
	КонецЕсли;
	
	МассивДанных = омЗадачиОбщие.ПолучитьЗадачуПоОбъекту(СтруктураПараметров.ОбъектТЗ, Ложь);
	
	Элементы.ЗадачиПКД.Доступность = Ложь;	
	Элементы.ЗадачиРКД.Доступность = Ложь;
	
	ТипПКД = Тип("ЗадачаСсылка.Задачи_ПКД");
	
	Для каждого х Из МассивДанных Цикл
		
		Если ТипЗнч(х.Задача) = ТипПКД Тогда
			
			Элементы.ЗадачиПКД.Доступность 	= Истина;	
			СтруктураПараметров.ЗадачаПКД 	= х.Задача;
			
		Иначе
			
			Элементы.ЗадачиРКД.Доступность 	= Истина;	
			СтруктураПараметров.ЗадачаРКД 	= х.Задача;
		 
		 КонецЕсли;
	
	 КонецЦикла;
	 
	 Возврат СтруктураПараметров;
	 
КонецФункции

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектТайминга = Параметры.ОбъектТайминга;
	
	Элементы.ФормаЗаписать.Видимость = РольДоступна("ПолныеПрава");
	Элементы.ТаблицаТаймингаНорматив.ТолькоПросмотр = НЕ Элементы.ФормаЗаписать.Видимость;
	
КонецПроцедуры

Процедура ЗаполнитьДанные(СтруктураПараметров)

	ТаблицаТайминга.Очистить();
	
	Если ЗадачиПКД Тогда
		ЗаполнитьДанныеПКД(СтруктураПараметров);	
	КонецЕсли;
	
    Если ЗадачиРКД Тогда
		ЗаполнитьДанныеРКД(СтруктураПараметров);	
	КонецЕсли;
	
    Если ЗадачиТЗ Тогда
		ЗаполнитьДанныеТЗ(СтруктураПараметров);	
	КонецЕсли;
	
    Если Производство Тогда
		ЗаполнитьДанныеПроизводство(СтруктураПараметров);	
	КонецЕсли;
	
    Если Комплект Тогда
		ЗаполнитьДанныеКомплект(СтруктураПараметров);	
	КонецЕсли;
	
	//Если СтруктураДанных.ПроверитьГЧ ИЛИ СтруктураДанных.СоздатьГЧ Тогда
	//	ЗаполнитьДанныеПоЗадачи(ОбъектТайминга);
	//КонецЕсли;
	
	ТаблицаТайминга.Сортировать("ДатаНачала");

КонецПроцедуры

Процедура ЗаполнитьДанныеТЗ(СтруктураПараметров)

	УИДДоски = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиДляТЗ");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанПереходКарточки.Период КАК ДатаНачала,
		|	КанбанПереходКарточки.Пользователь КАК Автор,
		|	СтадииКомплектаРеквизитыСтадии.Ссылка.Ссылка КАК Стадия,
		|	СтадииКомплектаРеквизитыСтадии.Ссылка.ПолноеНаименование КАК СтадияНаименование
		|ИЗ
		|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанПереходКарточки КАК КанбанПереходКарточки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|				ПО КанбанКолонки.Статус = СтадииКомплектаРеквизитыСтадии.Статус
		|			ПО КанбанПереходКарточки.УИДКудаКолонка = КанбанКолонки.УИД
		|		ПО КанбанКарточки.УИД = КанбанПереходКарточки.УИДКарточка
		|ГДЕ
		|	КанбанКарточки.Доска = &Доска
		|	И КанбанКарточки.Ресурс = &Ресурс";
	
	Запрос.УстановитьПараметр("Доска", УИДДоски);
	Запрос.УстановитьПараметр("Ресурс", СтруктураПараметров.ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НС = ТаблицаТайминга.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
	КонецЦикла;
	

	
КонецПроцедуры

Процедура ЗаполнитьДанныеПроизводство(СтруктураПараметров)
	
	
КонецПроцедуры

Процедура ЗаполнитьДанныеКомплект(СтруктураПараметров)
	
	ТайминЗадач = РегистрыСведений.ТаймингКомплекта.ПолучитьТаймингКомплектов(СтруктураПараметров.ОбъектТЗ);
	
	Для каждого Тайминг Из ТайминЗадач Цикл
	
		НС = ТаблицаТайминга.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Тайминг);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПКД(СтруктураПараметров)
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ЗадачаПКД) Тогда
	
		ЗаполнитьДанныеПоЗадачи(СтруктураПараметров.ЗадачаПКД);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеРКД(СтруктураПараметров)
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ЗадачаРКД) Тогда
	
		ЗаполнитьДанныеПоЗадачи(СтруктураПараметров.ЗадачаРКД);
	
	КонецЕсли;
	
КонецПроцедуры 

Процедура ЗаполнитьДанныеПоЗадачи(ЗадачаТайминга)

	СтруктураТаблиц = РегистрыСведений.ТаймингЗадач.ПолучитьТаймингиЗадач(ЗадачаТайминга);
	
	Для каждого Тайминг Из СтруктураТаблиц.ТайминЗадач Цикл
	
		НС = ТаблицаТайминга.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Тайминг);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЗадачуПКД()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.ОбъектТЗ = &ОбъектТЗ";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТайминга);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	

КонецФункции // ПолучитьЗадачуПКД()

Функция ПолучитьЗадачуРКД()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ = &ОбъектТЗ";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТайминга);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	

КонецФункции // ПолучитьЗадачуПКД()

&НаСервереБезКонтекста
Процедура ЗаписатьНаСервере(мДанных)

	МенеджерЗаписи = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	
	Для каждого х Из мДанных Цикл
	
		МенеджерЗаписи.Период = х.Период;
		МенеджерЗаписи.Задача = х.Задача;
		
		МенеджерЗаписи.Прочитать();
		
		Если НЕ МенеджерЗаписи.НормаВремени = х.НормаВремени Тогда
		
			МенеджерЗаписи.НормаВремени = х.НормаВремени;
			МенеджерЗаписи.Записать();
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеТайминга()

	

КонецПроцедуры // ЗаполнитьДанныеТайминга()
 

&НаКлиенте
Процедура Записать(Команда)
	
	мДанных = Новый Массив;
	
	Для каждого х Из ТаблицаТайминга Цикл
	
		Если х.Изменен И ЗначениеЗаполнено(х.Задача) Тогда
		
			Данные = Новый Структура("Задача, Период, НормаВремени", х.Задача, х.ДатаНачала, х.НормаВремени);
			х.Изменен = Ложь;
		
			мДанных.Добавить(Данные);
			
		КонецЕсли;
	
	КонецЦикла;
	
	ЗаписатьНаСервере(мДанных); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТаймингаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТаймингаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТаймингаНормативПриИзменении(Элемент)
	
	ТД = Элементы.ТаблицаТайминга.ТекущиеДанные;
	
	Если НЕ ТД = Неопределено Тогда
	
		ТД.Изменен = Истина;
		
		Элементы.ФормаЗаписать.Доступность = Истина;
	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура КомплектПриИзменении(Элемент)
	ЗаполнитьДанные(СтруктураПараметров);
КонецПроцедуры


&НаКлиенте
Процедура ЗадачиПКДПриИзменении(Элемент)
	ЗаполнитьДанные(СтруктураПараметров);
КонецПроцедуры


&НаКлиенте
Процедура ЗадачиРКДПриИзменении(Элемент)
	ЗаполнитьДанные(СтруктураПараметров);
КонецПроцедуры


&НаКлиенте
Процедура ПроизводствоПриИзменении(Элемент)
	ЗаполнитьДанные(СтруктураПараметров);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СтруктураПараметров = СформироватьЗаголовокОбъекта();
	
	ЗаполнитьДанные(СтруктураПараметров);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗадачиТЗПриИзменении(Элемент)
	ЗаполнитьДанные(СтруктураПараметров);
КонецПроцедуры

