Перем ТипОбъекта; 
 
Процедура СформироватьЗаголовокОбъекта()
	
	ТипОбъекта = ТипЗнч(ОбъектТайминга);
	
	Если ТипОбъекта = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
	
		Элементы.ОбъектТайминга.Заголовок = "Задача ПКД";
		ЗадачиПКД = Истина;
	
	ИначеЕсли ТипОбъекта = Тип("ЗадачаСсылка.Задачи_РКД") Тогда
	
		Элементы.ОбъектТайминга.Заголовок = "Задача РКД";
		ЗадачиРКД = Истина;
	
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ИзделияКомплект")  Тогда
	
		Элементы.ОбъектТайминга.Заголовок = "Изделие комплект";	
		ЗадачиПКД		= Истина;
		ЗадачиРКД 		= Истина;
		ЗадачиТЗ 		= Истина;
		Комплект 		= Истина;
		Производство 	= Истина;
	
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Композиции")  Тогда
	
		Элементы.ОбъектТайминга.Заголовок = "Коомпозиция";	
		ЗадачиПКД		= Истина;
		ЗадачиТЗ 		= Истина;
		Комплект 		= Истина;
	
	//ИначеЕсли ТипОбъекта = Тип("ЗадачаСсылка.ПроверитьГабаритныеЧертежи") Тогда
	//
	//	Элементы.ОбъектТайминга.Заголовок = "Проверить габаритные чертежи";
	//	ПроверитьГЧ = Истина;
	//
	//ИначеЕсли ТипОбъекта = Тип("ЗадачаСсылка.СоздатьМодельГабаритногоЧертежа") Тогда
	//
	//	Элементы.ОбъектТайминга.Заголовок = "Создать модель габаритного чертежа";
	//	СоздатьГЧ = Истина;
	//
	КонецЕсли;
	

КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектТайминга = Параметры.ОбъектТайминга;
	СформироватьЗаголовокОбъекта();
	
	ЗаполнитьДанные();
	
	Элементы.ФормаЗаписать.Видимость = РольДоступна("ПолныеПрава");
	Элементы.ТаблицаТаймингаНорматив.ТолькоПросмотр = НЕ Элементы.ФормаЗаписать.Видимость;
	
КонецПроцедуры

Процедура ЗаполнитьДанные()

    Если ЗадачиПКД Тогда
		ЗаполнитьДанныеПКД();	
	КонецЕсли;
	
    Если ЗадачиРКД Тогда
		ЗаполнитьДанныеРКД();	
	КонецЕсли;
	
    Если ЗадачиТЗ Тогда
		ЗаполнитьДанныеТЗ();	
	КонецЕсли;
	
    Если Производство Тогда
		ЗаполнитьДанныеПроизводство();	
	КонецЕсли;
	
    Если Комплект Тогда
		ЗаполнитьДанныеКомплект();	
	КонецЕсли;
	
	//Если СтруктураДанных.ПроверитьГЧ ИЛИ СтруктураДанных.СоздатьГЧ Тогда
	//	ЗаполнитьДанныеПоЗадачи(ОбъектТайминга);
	//КонецЕсли;
	
	ТаблицаТайминга.Сортировать("ДатаНачала");

КонецПроцедуры

Процедура ЗаполнитьДанныеТЗ()
	
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПроизводство()
	
	
КонецПроцедуры

Процедура ЗаполнитьДанныеКомплект()
	
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПКД()
	
	Если ТипОбъекта = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
		ЗадачаТайминга = ОбъектТайминга;	
	Иначе
		ЗадачаТайминга = ПолучитьЗадачуПКД();	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗадачаТайминга) Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьДанныеПоЗадачи(ЗадачаТайминга);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеРКД()
	
	Если ТипЗнч(ОбъектТайминга) = Тип("ЗадачаСсылка.Задачи_РКД") Тогда
		ЗадачаТайминга = ОбъектТайминга;	
	Иначе
		ЗадачаТайминга = ПолучитьЗадачуРКД();	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗадачаТайминга) Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьДанныеПоЗадачи(ЗадачаТайминга);
	
КонецПроцедуры 

Процедура ЗаполнитьДанныеПоЗадачи(ЗадачаТайминга)

	СтруктураТаблиц = РегистрыСведений.ТаймингЗадач.ПолучитьТаймингиЗадач(ЗадачаТайминга);
	
	Для каждого Тайминг Из СтруктураТаблиц.ТайминЗадач Цикл
	
		НС = ТаблицаТайминга.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Тайминг);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЗадачуПКД()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.ОбъектТЗ = &ОбъектТЗ";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТайминга);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	

КонецФункции // ПолучитьЗадачуПКД()

Функция ПолучитьЗадачуРКД()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ = &ОбъектТЗ";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТайминга);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	

КонецФункции // ПолучитьЗадачуПКД()

&НаСервереБезКонтекста
Процедура ЗаписатьНаСервере(мДанных)

	МенеджерЗаписи = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	
	Для каждого х Из мДанных Цикл
	
		МенеджерЗаписи.Период = х.Период;
		МенеджерЗаписи.Задача = х.Задача;
		
		МенеджерЗаписи.Прочитать();
		
		Если НЕ МенеджерЗаписи.НормаВремени = х.НормаВремени Тогда
		
			МенеджерЗаписи.НормаВремени = х.НормаВремени;
			МенеджерЗаписи.Записать();
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	мДанных = Новый Массив;
	
	Для каждого х Из ТаблицаТайминга Цикл
	
		Если х.Изменен Тогда
		
			Данные = Новый Структура("Задача, Период, НормаВремени", х.Задача, х.ДатаНачала, х.НормаВремени);
			х.Изменен = Ложь;
		
			мДанных.Добавить(Данные);
			
		КонецЕсли;
	
	КонецЦикла;
	
	ЗаписатьНаСервере(мДанных); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТаймингаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТаймингаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТаймингаНормативПриИзменении(Элемент)
	ТД = Элементы.ТаблицаТайминга.ТекущиеДанные;
	
	Если НЕ ТД = Неопределено Тогда
	
		ТД.Изменен = Истина;
		
		Элементы.ФормаЗаписать.Доступность = Истина;
	
	КонецЕсли;
КонецПроцедуры

