
&НаКлиенте
Процедура Скопировать(Команда)
	СкопироватьЭлемент(Элементы.Список)
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьЭлемент(СписокДокументов) Экспорт
	
	ТекущиеДанные = СписокДокументов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Элемент = ТекущиеДанные.Ссылка;
				
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначениеКопирования", Элемент);
	
		ИмяФормыОбъекта = ПолноеИмяФормыОбъекта(Элемент);	
		ОткрытьФорму(ИмяФормыОбъекта, ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры  

// Возвращает полное имя основной формы объекта.
//
// Параметры:
//  Ссылка	 - 	ЛюбаяСсылка - ссылка на объект. Например, ДокументСсылка или СправочникСсылка.
// 
// Возвращаемое значение:
//  Строка - полное имя основной формы объекта.
//
Функция ПолноеИмяФормыОбъекта(Ссылка) Экспорт
	
	ИмяФормыДокумента = "";
	ОбъектМетаданных = Ссылка.Метаданные();
	ИмяФормыДокумента = ОбъектМетаданных.ПолноеИмя() + ".ФормаОбъекта";
	Возврат ИмяФормыДокумента;
	
КонецФункции

&НаКлиенте
Процедура Провести(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Элемент = ТекущиеДанные.Ссылка;
		ПровестиДокумент(Элемент);
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры   

Процедура ПровестиДокумент(Ссылка)
	ДокОбъект = Ссылка.ПолучитьОбъект();
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаКлиенте
Процедура ОтменаПроведения(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Элемент = ТекущиеДанные.Ссылка;
		РаспровестиДокумент(Элемент);
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры

Процедура РаспровестиДокумент(Ссылка)
	ДокОбъект = Ссылка.ПолучитьОбъект();
	ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если (ИмяСобытия = "Запись_ПоступлениеМатериалов"
		ИЛИ ИмяСобытия = "Запись_СписаниеМатериалов") Тогда
		
			Элементы.Список.Обновить();
		
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ИзменитьЭлемент(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЭлемент(Список) Экспорт
	
	ТекущиеДанные = Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступление(Команда)
	ОткрытьФорму("Документ.ПоступлениеМатериалов.ФормаОбъекта",);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСписаниеМатериалов(Команда)
	ОткрытьФорму("Документ.СписаниеМатериалов.ФормаОбъекта",);
КонецПроцедуры  


&НаКлиенте
Процедура ПометкаУдаления(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Элемент = ТекущиеДанные.Ссылка;
		ПометкаУдаленияСервер(Элемент);
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры 

Процедура ПометкаУдаленияСервер(Ссылка)
	ДокОбъект = Ссылка.ПолучитьОбъект();
	
	ДокОбъект.ПометкаУдаления = НЕ ДокОбъект.ПометкаУдаления;
		
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

