#Область Для_печати_Ганта
	
&НаСервере
Функция ЗаполнитьДиаграммуГанта(тзДанные, стПараметры, ДиаграммаГанта) Экспорт

	

КонецФункции // ЗаполнитьДиаграммуКанта(тзДанные, стПараметры, ДиаграммаГанта)

&НаСервере
Функция ПолучитьСтруктуруПараметров() Экспорт
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ТипИнтервалов", 		"День"); 		//Возможные варианты День, Неделя
	СтруктураПараметров.Вставить("ДатаНачалаИнтервала", Дата(1, 1, 1)); 		
	СтруктураПараметров.Вставить("ВыводитьМесяц", 		Истина); 		
	СтруктураПараметров.Вставить("ОписаниеТиповДанных", Новый Массив); 	//Массив с описанием типов данных
	
	
	Возврат СтруктураПараметров; 
	
КонецФункции // ПолучитьСтруктуруПараметров()

&НаСервере
Функция ПолучитьПустыеТаблицыДанных(стСтруктураПараметров) Экспорт

	ОписаниеТиповДанных = Новый ОписаниеТипов(стСтруктураПараметров.ОписаниеТиповДанных);
	
	ОписаниеЦелоеЧисло 	= Новый ОписаниеТипов("Число", , ,Новый КвалификаторыЧисла(6, 0, ДопустимыйЗнак.Неотрицательный));
	ОписаниеСтрока30 	= Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
	ОписаниеСтрока5 	= Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(5));
	
	ПараметрыДаты = ТипДатыИнтервала(стСтруктураПараметров);
	
	ОписаниеДата = Новый ОписаниеТипов("Дата", , , , , ПараметрыДаты);

	тзДанные = Новый ТаблицаЗначений;
	тзДанные.Колонки.Добавить("НомерПоПорядку", 		ОписаниеЦелоеЧисло);
	тзДанные.Колонки.Добавить("Родитель", 				ОписаниеЦелоеЧисло);  //Ссылка на НомерПоПорядку
	тзДанные.Колонки.Добавить("ДанныеДиаграммы", 		ОписаниеТиповДанных);
	тзДанные.Колонки.Добавить("ПредставлениеДанных", 	ОписаниеСтрока30);
	тзДанные.Колонки.Добавить("Серия");
	тзДанные.Индексы.Добавить("Родитель"); 
	тзДанные.Индексы.Добавить("НомерПоПорядку"); 
	
	
	тзДаты = Новый ТаблицаЗначений;
	тзДаты.Колонки.Добавить("НомерИнтервала", 			ОписаниеЦелоеЧисло);
	тзДаты.Колонки.Добавить("ДатаНачалаИнтервала", 		ОписаниеДата);
	тзДаты.Колонки.Добавить("ПредставлениеИнтервала", 	ОписаниеСтрока5);
	тзДаты.Индексы.Добавить("НомерИнтервала");
	
	
	тзЗначениеИнтервала = Новый ТаблицаЗначений;
	тзЗначениеИнтервала.Колонки.Добавить("НомерПоПорядку", 				ОписаниеЦелоеЧисло);
	тзЗначениеИнтервала.Колонки.Добавить("НомерИнтервалаНачало", 		ОписаниеЦелоеЧисло);
	тзЗначениеИнтервала.Колонки.Добавить("НомерИнтервалаОкончание",		ОписаниеЦелоеЧисло);
	тзЗначениеИнтервала.Колонки.Добавить("Описание",					ОписаниеСтрока30);
	тзЗначениеИнтервала.Колонки.Добавить("Значение");
	тзЗначениеИнтервала.Индексы.Добавить("НомерПоПорядку");
	
	тзЦвет = Новый ТаблицаЗначений;
	тзЦвет.Колонки.Добавить("Значение",);
	тзЦвет.Колонки.Добавить("ЦветФона", Новый ОписаниеТипов("Цвет")); 
	
	Возврат Новый Структура("тзДанные, тзДаты, тзЗначениеИнтервала, тзЦвет"
							, тзДанные, тзДаты, тзЗначениеИнтервала, тзЦвет);                              

КонецФункции // ПолучитьПустуюТаблицеДанных(стСтруктураПараметров)

&НаСервере
Функция ДобавитьДанныеВТаблицу(стСтруктураПараметров, стТзДанные, стДанные) Экспорт
	

КонецФункции // ДобавитьДанныеВТаблицу()

&НаСервере
Функция ДобавитьЗначениеИнтервала(Дата, стСтруктураПараметров, тзДаты) Экспорт

	Если стСтруктураПараметров.ТипИнтервалов = "День" Тогда
		текДата = НачалоДня(Дата);
		Представление = День(текДата);
	ИначеЕсли стСтруктураПараметров.ТипИнтервалов = "Неделя" Тогда
		текДата = НачалоДня(Дата);
		НомерНедели = ДеньНедели(текДата);
		
	    текДата = текДата - 3600 * 24 * (НомерНедели - 1);
		Представление = День(текДата);
	КонецЕсли;
	
	НайденаяСтрока = тзДаты.Найти(текДата, "ДатаНачалаИнтервала");
	
	
	Если НайденаяСтрока = Неопределено Тогда
		НайденаяСтрока 							= тзДаты.Добавить(); 	
		НайденаяСтрока.НомерИнтервала 			= ПолучитьНомерИнтервала(стСтруктураПараметров, текДата);	
		НайденаяСтрока.ДатаНачалаИнтервала 		= текДата;	
		НайденаяСтрока.ПредставлениеИнтервала 	= Представление;	
	КонецЕсли;
	
    Возврат Новый Структура("НомерИнтервала, ПредставлениеИнтервала", НайденаяСтрока.НомерИнтервала, НайденаяСтрока.ПредставлениеИнтервала);
КонецФункции // ДобавитьЗначениеИнтервала()

&НаСервере
Функция ПолучитьНомерИнтервала(стСтруктураПараметров, текДата)
	
	Если НЕ ЗначениеЗаполнено(текДата) Тогда
		Возврат 0;
	КонецЕсли;
	
	ДатаНачала = стСтруктураПараметров.ДатаНачалаИнтервала;
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если стСтруктураПараметров.ТипИнтервалов = "День" Тогда
		НомерИнтервала = (текДата - ДатаНачала) / (3600 * 24) + 1;
	ИначеЕсли стСтруктураПараметров.ТипИнтервалов = "Неделя" Тогда
		НомерИнтервала = (текДата - ДатаНачала) / (3600 * 24 * 7);
		ЦелыйИнтервал = Цел(НомерИнтервала);
		Если НЕ НомерИнтервала = ЦелыйИнтервал Тогда
			НомерИнтервала = ЦелыйИнтервал + 1;
		КонецЕсли;
	КонецЕсли;

   Возврат НомерИнтервала;
КонецФункции // ПолучитьНомерИнтервала(стСтруктураПараметров, текДата)

&НаСервере
Функция ПолучитьСтруктуруДляДанных() Экспорт

	стДанные = Новый Структура();
	стДанные.Вставить("НомерПоПорядку", 	0); //либо НомерПоПорядку либо ДанныеДиаграммы
	стДанные.Вставить("ДанныеДиаграммы", 	Неопределено); //возможно испльзовать если ДанныеДиаграммы уникальны в тзДанные
	стДанные.Вставить("ДатаНачала", 		Дата(1, 1, 1));
	стДанные.Вставить("ДатаОкончанияа", 	Дата(1, 1, 1));  //Не обязательно
	стДанные.Вставить("РодительОбъект", 	Неопределено);  //либо РодительОбъект либо РодительНомер. Достаточно уазать впервый раз.
	стДанные.Вставить("РодительНомер", 		0);  	
	
	Возврат стДанные;
	
КонецФункции // ПолучитьСтруктуруДляДанных()

&НаСервере
Функция ТипДатыИнтервала(стСтруктураПараметров)

	Возврат Новый КвалификаторыДаты(ЧастиДаты.Дата);	

КонецФункции // ТребуетсяВремяИнтервала()  

#КонецОбласти

#Область Для_вывода_Ганта
	
&НаСервере
Функция ШаблоныТЗДляВыводаГанта(стСтруктураПараметров) Экспорт
	
	ОписаниеЦелоеЧисло 	= Новый ОписаниеТипов("Число", , ,Новый КвалификаторыЧисла(6, 0, ДопустимыйЗнак.Неотрицательный));
	
	ТЗДляВыводаГанта = Новый ТаблицаЗначений;
	ТЗДляВыводаГанта.Колонки.Добавить("НомерПоПорядку", 	ОписаниеЦелоеЧисло);
	ТЗДляВыводаГанта.Колонки.Добавить("ИнтервалНачало", 	ОписаниеЦелоеЧисло);
	ТЗДляВыводаГанта.Колонки.Добавить("ИнтервалОкончания", 	ОписаниеЦелоеЧисло);
	ТЗДляВыводаГанта.Колонки.Добавить("НомерЗначения",		ОписаниеЦелоеЧисло);
	
	ОписаниеСтрока30 	= Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
	
	ТЗВариантыЗначение = Новый ТаблицаЗначений;
	ТЗВариантыЗначение.Колонки.Добавить("НомерПоПорядку", 				ОписаниеЦелоеЧисло);
	ТЗВариантыЗначение.Колонки.Добавить("Значение");
	ТЗВариантыЗначение.Колонки.Добавить("ПредставлениеГанта", 			ОписаниеСтрока30);
	//При выводе значения сокращать наименование на форме до указанного количество знаков
    //Если 0, то наименование не выводиться, если -1 выводить полностью
	ТЗВариантыЗначение.Колонки.Добавить("СокращатьНаименованиеГанта", 	ОписаниеЦелоеЧисло); 
	ТЗВариантыЗначение.Колонки.Добавить("ЦветГанта", 					Новый ОписаниеТипов("Цвет")); 
	ТЗВариантыЗначение.Колонки.Добавить("РазмерШрифтаГанта",			ОписаниеЦелоеЧисло);  
	
	тзКеш = Новый ТаблицаЗначений;
	тзКеш.Колонки.Добавить("Значение");
	тзКеш.Колонки.Добавить("НомерПоПорядку", 	ОписаниеЦелоеЧисло);
	тзКеш.Колонки.Добавить("ТипПараметра", 		ОписаниеСтрока30);
	тзКеш.Колонки.Добавить("Цвет", 				Новый ОписаниеТипов("Цвет"));
	
	стПустыеТаблицыДанных = ПолучитьПустыеТаблицыДанных(стСтруктураПараметров);
	стПустыеТаблицыДанных.Вставить("ТЗДляВыводаГанта", 		ТЗДляВыводаГанта);
	стПустыеТаблицыДанных.Вставить("ТЗВариантыЗначение", 	ТЗВариантыЗначение);
	стПустыеТаблицыДанных.Вставить("тзКеш", 				тзКеш);
	
	Возврат стПустыеТаблицыДанных;
	
КонецФункции // ШаблоныТЗДляВыводаГанта() 

&НаСервере
Процедура ВывестиДиаграммуГанта(ПолеДиаграмма, стТаблицыДанных, стСтруктураПараметров) Экспорт
	
	ПолеДиаграмма.Очистить();

	тзДанные = стТаблицыДанных.тзДанные;
	тзДанные.Сортировать("Родитель, ПредставлениеДанных");
	
	мСерии = омТЧ_НаКлиентеСервере.КолонкуВМассив(тзДанные, "Серия");
	
	Для каждого ТекущаяСерия Из мСерии Цикл
		Если стСтруктураПараметров.Свойство("Серия") Тогда
			стСтруктураПараметров.Серия = ПолеДиаграмма.УстановитьСерию(ТекущаяСерия);
		Иначе
			стСтруктураПараметров.Вставить("Серия", ПолеДиаграмма.УстановитьСерию(ТекущаяСерия));
		КонецЕсли;
		
		стОтборРодитель = Новый Структура("Родитель", 0);
		
		НайденыеКорневыеЗначения = тзДанные.НайтиСтроки(стОтборРодитель);
		
		Для каждого текСтрокаЗначение Из НайденыеКорневыеЗначения Цикл
			ТочкаДиограммы = ВывестиДанные(ПолеДиаграмма, текСтрокаЗначение, стТаблицыДанных, стСтруктураПараметров);
			
			
		КонецЦикла;
		
	КонецЦикла;
	

КонецПроцедуры // ВывестиДиаграммуГанта()

&НаСервере
Функция ВывестиДанные(ПолеДиаграмма, текСтрокаЗначение, стТаблицыДанных, стСтруктураПараметров)
	
	СтрокаДанныхРодитель = ПолучитьЗначениеРодитель(текСтрокаЗначение.Родитель, стТаблицыДанных);
	
	Если СтрокаДанныхРодитель = Неопределено Тогда
		Родитель = Неопределено;
	Иначе	
		Родитель = СтрокаДанныхРодитель.ДанныеДиаграммы;
	КонецЕсли;
	
	СделкаТочка 			= ПолеДиаграмма.Точки.Добавить();
	СделкаТочка.Текст 		= текСтрокаЗначение.ПредставлениеДанных;
	СделкаТочка.Значение 	= текСтрокаЗначение.ДанныеДиаграммы;
	СделкаТочка.Картинка 	= БиблиотекаКартинок.СводнаяДиаграмма;
	
	Значение = ПолеДиаграмма.ПолучитьЗначение(СделкаТочка, стСтруктураПараметров.Серия);
	//Значение.Редактирование = Истина;//Редактирование;
	
	Интервал 				= Значение.Добавить();
	//Интервал.Начало 		= ДанныеДатыЭтап.ДатаНачалаПлан;
	//Интервал.Конец 			= ?(ДанныеДатыЭтап.ДатаОкончанияПлан - ДанныеДатыЭтап.ДатаНачалаПлан < 24 * 3600, ДанныеДатыЭтап.ДатаНачалаПлан + 24 * 3600, ДанныеДатыЭтап.ДатаОкончанияПлан);
	//Интервал.Текст 			= ?(ДанныеДатыЭтап.Этап = "Производство", "Пр", ДанныеДатыЭтап.Этап);
	//Если НЕ ТекущийЦвет = Неопределено Тогда
	//	Интервал.Цвет			= ТекущийЦвет;
	//ИначеЕсли НЕ тзЦвета = Неопределено Тогда
	//	Интервал.Цвет			= омДиаграммаГанта.ПолучитьЦвет(ДанныеДатыЭтап.Этап, тзЦвета, ЭтоГруппа, СократитьНаименование);
	//КонецЕсли;
	//Если ЕстьРасшифровка Тогда
	//	//Интервал.Расшифровка 	= Новый Структура("Сделка,Этап,СсылкаКомплект", ДанныеДатыЭтап.Сделка, ДанныеДатыЭтап.Этап, СсылкаЗначение);
	//Иначе
	//	Интервал.Расшифровка 	= Неопределено;
	//КонецЕсли;
	//
	//Если СократитьНаименование Тогда
	//	Интервал.Текст = Лев(Интервал.Текст, 1);
	//КонецЕсли;
	//
	//УстановитьТекстЗначения(Значение.Текст, ДанныеДатыЭтап.ДатаНачалаПлан, ДанныеДатыЭтап.ДатаОкончанияПлан, ДанныеДатыЭтап.Этап); 
	
	Возврат СделкаТочка;
КонецФункции // ВывестиРодителя(ПолеДиаграмма, текСтрокаЗначение, стТаблицыДанных, стСтруктураПараметров)

&НаСервере
Функция ПолучитьЗначениеРодитель(Родитель, стТаблицыДанных)
	
	Если Родитель = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат стТаблицыДанных.тзДанные.Найти(Родитель, "НомерПоПорядку");
	
	
КонецФункции // ПолучитьЗначениеРодитель(текСтрокаЗначение.НомерПоПорядку, текСтрокаЗначение.Родитель, стТаблицыДанных)()

&НаСервере
Функция ПолучитьСтруктуруДобавленияДанных(стСтруктураПараметров) Экспорт
	
	СтруктураДобавленияДанных = Новый Структура(); 
	
	СтруктураДобавленияДанных.Вставить("НомерПоПорядку", 			0); 						//Если заполнен НомерПоПорядку, то поля Родитель и ДанныеДиаграммы можно не заполнять 
	СтруктураДобавленияДанных.Вставить("НомерЗначения", 			0); 						//Если заполнен НомерЗначения, то поле Значение можно не заполнять 
	СтруктураДобавленияДанных.Вставить("ДатаНачала", 				Дата(1, 1, 1)); 			//
	СтруктураДобавленияДанных.Вставить("ДатаОкончания", 			Дата(1, 1, 1)); 			//
	СтруктураДобавленияДанных.Вставить("РодительНомер",				0); 						//Не обязательно
	СтруктураДобавленияДанных.Вставить("Родитель", 					Неопределено); 				//
	СтруктураДобавленияДанных.Вставить("ДанныеДиаграммы", 			Неопределено); 				//
	СтруктураДобавленияДанных.Вставить("ПредставлениеДанных",		""); 						//
	СтруктураДобавленияДанных.Вставить("ПредставлениеРодителя",		""); 						//
	СтруктураДобавленияДанных.Вставить("ПредставлениеЗначения",		""); 						//
	СтруктураДобавленияДанных.Вставить("Значение", 					Неопределено); 				//
	СтруктураДобавленияДанных.Вставить("СокращатьНаименованиеДо", 	-1); 						//
	СтруктураДобавленияДанных.Вставить("ЦветФона", 					Новый Цвет(255, 255, 255)); //
	СтруктураДобавленияДанных.Вставить("РазмерШрифта", 				8); 						//
	СтруктураДобавленияДанных.Вставить("стСтруктураПараметров", 	стСтруктураПараметров); 	//
	СтруктураДобавленияДанных.Вставить("Серия", 					"Данные"); 					//
	
	Возврат СтруктураДобавленияДанных;
	
КонецФункции // ПолучитьСтруктуруДобавленияДанных()

//Параметр стТаблицыДанных создан фунцией ПолучитьСтруктуруДобавленияДанных
&НаСервере
Функция ДобавитьДанныеВТаблицуВыводаГанта(стТаблицыДанных, СтруктураДобавленияДанных) Экспорт

	стИнтервалы = ПолучитьИнтервалыДанных(СтруктураДобавленияДанных);
	
	Если СтруктураДобавленияДанных.НомерПоПорядку = 0 Тогда
		стНомера = ПолучитьНомерПоПорядку(стТаблицыДанных, СтруктураДобавленияДанных);
	Иначе	
		стНомера = Новый Структура("НомерРодителя, НомерПоПорядку", СтруктураДобавленияДанных.РодительНомер, СтруктураДобавленияДанных.НомерПоПорядку)
	КонецЕсли;
	
	СтруктураДобавленияДанных.НомерПоПорядку 	= стНомера.НомерПоПорядку;
	НомерПоПорядку 								= СтруктураДобавленияДанных.НомерПоПорядку;	
	
	Если НомерПоПорядку = 0 Тогда
		Возврат 0;	
	КонецЕсли;
	
	Если СтруктураДобавленияДанных.НомерЗначения = 0 Тогда
		НомерЗначения = ПолучитьНомерЗначения(стТаблицыДанных, СтруктураДобавленияДанных);
	Иначе	
		НомерЗначения = СтруктураДобавленияДанных.НомерЗначения;
	КонецЕсли;
	стНомера.Вставить("НомерЗначения", НомерЗначения); 
	
	НС = стТаблицыДанных.ТЗДляВыводаГанта.Добавить();
	
	НС.НомерПоПорядку 		= НомерПоПорядку;
	НС.НомерЗначения 		= НомерЗначения;
	НС.ИнтервалНачало 		= стИнтервалы.ИнтервалНачало;
	НС.ИнтервалОкончания 	= стИнтервалы.ИнтервалОкончания;
	
	Возврат стНомера;
	
КонецФункции // ДобавитьДанныеВТаблицуВыводаГанта(стТаблицыДанных, СтруктураДобавленияДанных)

&НаСервере
Функция ПолучитьНомерЗначения(стТаблицыДанных, СтруктураДобавленияДанных)

	ТЗВариантыЗначение = стТаблицыДанных.ТЗВариантыЗначение;
	
	НайденаяСтрока = ТЗВариантыЗначение.Найти(СтруктураДобавленияДанных.Значение, "Значение");
	
	Если НЕ НайденаяСтрока = Неопределено Тогда
	    Возврат НайденаяСтрока.НомерЗначения;
	КонецЕсли;
	
	НомерПоПорядку = МаксимальныйНомерПоПорядку(ТЗВариантыЗначение);
	
	НС 								= ТЗВариантыЗначение.Добавить();
	НС.НомерПоПорядку 				= НомерПоПорядку;
	НС.Значение 					= СтруктураДобавленияДанных.Значение;
	НС.ПредставлениеГанта 			= СтруктураДобавленияДанных.ПредставлениеДанных;
	НС.СокращатьНаименованиеГанта 	= СтруктураДобавленияДанных.СокращатьНаименованиеДо;
	НС.ЦветФона 					= СтруктураДобавленияДанных.ЦветФона;
	НС.РазмерШрифта 				= СтруктураДобавленияДанных.РазмерШрифта;
	
	Возврат НомерПоПорядку;
	
КонецФункции // ПолучитьНомерЗначения()

&НаСервере
Функция ПолучитьНомерПоПорядку(стТаблицыДанных, СтруктураДобавленияДанных)
	
	Если НЕ ЗначениеЗаполнено(СтруктураДобавленияДанных.ДанныеДиаграммы) Тогда
		Возврат Новый Структура("НомерРодителя, НомерПоПорядку", 0, 0);	
	КонецЕсли;
	
	тзДанные = стТаблицыДанных.тзДанные;
	
	НайденаяСтрока = тзДанные.Найти(СтруктураДобавленияДанных.ДанныеДиаграммы, "ДанныеДиаграммы");
	
	Если НЕ НайденаяСтрока = Неопределено Тогда
		Возврат НайденаяСтрока.НомерПоПорядку;	
	КонецЕсли;
	
	КэшНомераСтроки = 0;
	
	НомерРодителя = ПолучитьРодителя(тзДанные, СтруктураДобавленияДанных, КэшНомераСтроки);
	
	Если КэшНомераСтроки = 0 Тогда
		НомерПоПорядку = МаксимальныйНомерПоПорядку(тзДанные);
	Иначе
		НомерПоПорядку = КэшНомераСтроки;
	КонецЕсли;
	НомерПоПорядку = НомерПоПорядку + 1;
	
	НС = тзДанные.Добавить();
	НС.НомерПоПорядку 		= НомерПоПорядку; 
	НС.Родитель 			= НомерРодителя; 
	НС.ДанныеДиаграммы 		= СтруктураДобавленияДанных.ДанныеДиаграммы; 
	НС.ПредставлениеДанных 	= СтруктураДобавленияДанных.ПредставлениеДанных;
	НС.Серия 				= СтруктураДобавленияДанных.Серия;
	
	Возврат Новый Структура("НомерРодителя, НомерПоПорядку", НомерРодителя, НомерПоПорядку);

КонецФункции // ПолучитьНомерПоПорядку(СтруктураДобавленияДанных) 

&НаСервере
Функция ПолучитьРодителя(тзДанные, СтруктураДобавленияДанных, КэшНомераСтроки)
	
	Если СтруктураДобавленияДанных.РодительНомер = 0 Тогда
		Если СтруктураДобавленияДанных.Родитель = Неопределено Тогда
			Родитель = 0;
		Иначе	
			НайденаяСтрока = тзДанные.Найти(СтруктураДобавленияДанных.Родитель, "ДанныеДиаграммы");
			
			Если НайденаяСтрока = Неопределено Тогда
				КэшНомераСтроки = МаксимальныйНомерПоПорядку(тзДанные) + 1;
				
				НС = тзДанные.Добавить();
				НС.НомерПоПорядку 		= КэшНомераСтроки; 
				НС.Родитель 			= 0; 
				НС.ДанныеДиаграммы 		= СтруктураДобавленияДанных.Родитель; 
				НС.ПредставлениеДанных 	= СтруктураДобавленияДанных.ПредставлениеРодителя;
				
				Родитель = НС.НомерПоПорядку;	
			Иначе
				Родитель = НайденаяСтрока.НомерПоПорядку;	
			КонецЕсли;
		КонецЕсли;
	Иначе	
		Родитель = СтруктураДобавленияДанных.РодительНомер;
	КонецЕсли;
	
    Возврат Родитель;
КонецФункции // ПолучитьРодителя()

&НаСервере
Функция МаксимальныйНомерПоПорядку(тзДляПоиска, КолонкаДляПоиска = "НомерПоПорядку")

	максНомер = 0;
	
	Для каждого х Из тзДляПоиска Цикл
		максНомер = Макс(максНомер, х[КолонкаДляПоиска]);	
	КонецЦикла;
	
    Возврат максНомер;
КонецФункции // МаксимальныйномерПоПорядку()

&НаСервере
Функция ПолучитьИнтервалыДанных(СтруктураДобавленияДанных)
	
	ДатаНачала 				= СтруктураДобавленияДанных.ДатаНачала;
 	ДатаОкончания 			= СтруктураДобавленияДанных.ДатаОкончания;
	стСтруктураПараметров 	= СтруктураДобавленияДанных.стСтруктураПараметров;
	
	стИнтервалы = Новый Структура;
	стИнтервалы.Вставить("ИнтервалНачало", 		ПолучитьНомерИнтервала(стСтруктураПараметров, ДатаНачала));
	стИнтервалы.Вставить("ИнтервалОкончания", 	ПолучитьНомерИнтервала(стСтруктураПараметров, ДатаОкончания));
	
	Возврат стИнтервалы; 

КонецФункции // ПолучитьИнтервалыДанных(СтруктураДобавленияДанных)

#КонецОбласти
