Процедура РасчитатьПлановыеДатыГабаритныхЧерчежей(Сделка, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановаяГотовностьПомещений.Помещение КАК Помещение,
		|	ПлановаяГотовностьПомещений.ДатаГотовности КАК ДатаГотовности
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.ПлановаяГотовностьПомещений.СрезПоследних(&Дата, ) КАК ПлановаяГотовностьПомещений
		|ГДЕ
		|	ПлановаяГотовностьПомещений.Проект = &Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(вт.ДатаГотовности, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаГотовности,
		|	ГабаритныеЧертежиПомещения.Ссылка КАК ГабаритныйЧертеж
		|ПОМЕСТИТЬ втДата
		|ИЗ
		|	Справочник.ГабаритныеЧертежи.Помещения КАК ГабаритныеЧертежиПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО ГабаритныеЧертежиПомещения.Помещение = вт.Помещение
		|ГДЕ
		|	ГабаритныеЧертежиПомещения.Ссылка.Проект = &Проект
		|
		|СГРУППИРОВАТЬ ПО
		|	ГабаритныеЧертежиПомещения.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДата.ДатаГотовности КАК ДатаГотовности,
		|	втДата.ГабаритныйЧертеж КАК ГабаритныйЧертеж
		|ИЗ
		|	втДата КАК втДата
		|ГДЕ
		|	втДата.ДатаГотовности > ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	Запрос.УстановитьПараметр("Дата", ?(Дата = Неопределено, КонецДня(ТекущаяДата()), Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	НаборЗаписей = РегистрыСведений.ПлановаяГотовностьГабаритныхЧертежей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сделка.Установить(Сделка);
	
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Проект = Сделка;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
	КонецЦикла;  
		
	НаборЗаписей.Записать();
	
КонецПроцедуры
