
&НаКлиенте
Процедура ОткрытьПодборГЧ(Объект, ЭтаФорма, СтандартнаяОбработка = Ложь, ДополнительныеПараметры = Неопределено, НеПоказыватьГЧ = Неопределено, МножественныйВыбор = Ложь) Экспорт

	СтандартнаяОбработка = Ложь;
	
	СделкаЗаказчика = Объект.Проект;
	
	Если Не ЗначениеЗаполнено(СделкаЗаказчика) Тогда
		ПоказатьПредупреждение(,"Не заполнена Проект.");	
		Возврат;	
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораГЧ", ЭтаФорма, ДополнительныеПараметры);
	
	стПараметры = Новый Структура("Проект, МножественныйВыбор",СделкаЗаказчика, МножественныйВыбор); 
	Если НЕ НеПоказыватьГЧ = Неопределено Тогда
		стПараметры.Вставить("НеПоказыватьГЧ", НеПоказыватьГЧ);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ГабаритныеЧертежи.ФормаВыбора", стПараметры, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

КонецПроцедуры // ОткрытьПодборИзделий()

