
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	ДополнительноеПоле = ПолучитьДополнительнуюИнформацию(Объект.ОбъектАдресации);
	
КонецПроцедуры



&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		
		Если ПустаяСтрока(Объект.Сообщение) Тогда
		
			Отказ = Истина;
			ПоказатьПредупреждение(, "Не заполнено наименование и сообщение");
		
		Иначе
			Объект.Наименование = Объект.Сообщение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьТипАдресации();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДополнительнуюИнформацию(ОбъектАдресации)

	Если НЕ ЗначениеЗаполнено(ОбъектАдресации) Тогда
		Возврат "";
	КонецЕсли;
		
	
	ТипОбъектАдресации = ТипЗнч(ОбъектАдресации);
	
	Если ТипОбъектАдресации = Тип("СправочникСсылка.ИзделияЗаказчика") Тогда
		
		ТипАдресации = "Изделие заказчика";	
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеИзделияЗаказчика.Артикул КАК Артикул
			|ИЗ
			|	РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
			|ГДЕ
			|	ДанныеИзделияЗаказчика.ИзделиеЗаказчика = &ИзделиеЗаказчика";
			
		Запрос.УстановитьПараметр("ИзделиеЗаказчика", ОбъектАдресации);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Артикул;
		КонецЦикла;

	ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Проекты") Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Проекты.Префикс КАК Префикс,
			|	Проекты.Номер КАК Номер
			|ИЗ
			|	Справочник.Проекты КАК Проекты
			|ГДЕ
			|	Проекты.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ОбъектАдресации);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Префикс + " (" + Выборка.Номер + ")";
		КонецЦикла;

	КонецЕсли;
	
	Возврат "";
	
КонецФункции // ПолучитьДополнительнуюИнформацию()


&НаКлиенте
Процедура ЗаполнитьТипАдресации()
	
	Если ЗначениеЗаполнено(Объект.ОбъектАдресации) Тогда
	
		ТипОбъектАдресации = ТипЗнч(Объект.ОбъектАдресации);
		
		Если ТипОбъектАдресации = Тип("СправочникСсылка.ИзделияЗаказчика") Тогда
		
			ТипАдресации = "Изделие заказчика";	

		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.ИзделияКомплект") Тогда
		
			ТипАдресации = "Комплект";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Композиции") Тогда
		
			ТипАдресации = "Композиция";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Проекты") Тогда
		
			ТипАдресации = "Проект";		
		
		КонецЕсли;
		
	КонецЕсли;
	
	ТипАдресацииПриИзменении(Неопределено);
	

КонецПроцедуры // ЗаполнитьТипАдресацииэ()


&НаКлиенте
Процедура ТипАдресацииПриИзменении(Элемент)
	
	Объект.ОбъектАдресации 	= Неопределено; 
	ДополнительноеПоле 		=  "";
	
	
	Если Не ЗначениеЗаполнено(ТипАдресации) Тогда
		
		ТипАдресации = "Нет";
		Элементы.ОбъектАдресации.Доступность = Ложь;
		
	ИначеЕсли ТипАдресации = "Нет" Тогда
	
		Элементы.ОбъектАдресации.Доступность = Ложь;
		Объект.ОбъектАдресации = Неопределено;
	
	Иначе
	
		Элементы.ОбъектАдресации.Доступность = Истина;
		
		Если ТипАдресации = "Изделие заказчика" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ИзделияЗаказчика");	
		
		ИначеЕсли ТипАдресации = "Контрагент" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");	
		
		ИначеЕсли ТипАдресации = "Комплект" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ИзделияКомплекты");	
		
		ИначеЕсли ТипАдресации = "Композиция" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Композиции");	
		
		ИначеЕсли ТипАдресации = "Помещение" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Помещения");	
		
		ИначеЕсли ТипАдресации = "Проект" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Проекты");	
		
		КонецЕсли;
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектАдресацииПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ОбъектАдресации) Тогда
		
		Элементы.ТипАдресации.Доступность = Ложь;
		ДополнительноеПоле = ПолучитьДополнительнуюИнформацию(Объект.ОбъектАдресации);
		
	Иначе
		
		ДополнительноеПоле = "";
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
КонецПроцедуры



