
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	ДополнительноеПоле = ПолучитьДополнительнуюИнформацию(Объект.ОбъектАдресации);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.НуженОтчетОВыполнении = Истина;
		
	Иначе
		
		Если ПустаяСтрока(Объект.ДолжностьИсполнителя) Тогда
			ПолучитьИсполнителя();
		ИначеЕсли ЗначениеЗаполнено(Объект.ОбъектАдресации)  Тогда
			ТекущийИсполнитель = ЗаполнитьИсполнителя(Объект.ОбъектАдресации, Объект.ДолжностьИсполнителя);	
		КонецЕсли;
		
	КонецЕсли;

	Элементы.СвязаннаяЗадача.Видимость = ЗначениеЗаполнено(Объект.СвязаннаяЗадача);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьИсполнителя(ОбъектАдресации, ДолжностьИсполнителя)

	Возврат омСотрудники.ПолучитьИсполнителяОбъекта(ОбъектАдресации, ДолжностьИсполнителя);	

КонецФункции // ЗаполнитьИсолнителя()

Процедура ПолучитьИсполнителя()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеЗадачи.Исполнитель КАК Исполнитель
		|ИЗ
		|	РегистрСведений.ДанныеЗадачи КАК ДанныеЗадачи
		|ГДЕ
		|	ДанныеЗадачи.Задача = &Задача";
	
	Запрос.УстановитьПараметр("Задача", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Исполнитель = Выборка.Исполнитель;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		
		Если ПустаяСтрока(Объект.Сообщение) Тогда
		
			Отказ = Истина;
			ПоказатьПредупреждение(, "Не заполнено наименование и сообщение");
		
		Иначе
			Объект.Наименование = Объект.Сообщение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ДолжностьИсполнителя) Тогда
		ПоДолжности = Истина;	
	Иначе
		ПоДолжности = Ложь;	
	КонецЕсли;
	
	ПоДолжностиПриИзменении(Неопределено);
	
	Если Объект.Выполнена Тогда
		
		ТолькоПросмотр = Истина;
		Элементы.ДолжностьИсполнителя.ТолькоПросмотр 	= Истина;
		Элементы.ТипАдресации.ТолькоПросмотр 			= Истина; 
		Элементы.ФормаВыполнена.Доступность 			= Ложь;	
		Элементы.ФормаЗаписать.Доступность 				= Ложь;	
		
	ИначеЕсли Параметры.Ключ.Пустая() Тогда
	
		Элементы.Исполнение.ТолькоПросмотр 	= Истина;	
		Элементы.ФормаВыполнена.Доступность = Ложь;	
	
	Иначе
	
		Элементы.Сообщение.ТолькоПросмотр 				= Истина;	
		Элементы.Наименование.ТолькоПросмотр 			= Истина;	
		Элементы.Направление.ТолькоПросмотр 			= Истина;	
		Элементы.ТипЗадачи.ТолькоПросмотр 				= Истина;	
		Элементы.Исполнитель.ТолькоПросмотр 			= Истина;	
		Элементы.Сообщение.ТолькоПросмотр 				= Истина;	
		Элементы.ТипАдресации.ТолькоПросмотр			= Истина;	
		Элементы.ОбъектАдресации.ТолькоПросмотр			= Истина;	
		Элементы.ПоДолжности.ТолькоПросмотр				= Истина;	
		Элементы.ДолжностьИсполнителя.ТолькоПросмотр	= Истина;	
		Элементы.НуженОтчетОВыполнении.Доступность 		= Ложь;	
		
		Элементы.ФормаЗаписать.Доступность 	= Ложь;	
	
	КонецЕсли; 
	
	Если Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыОбщихЗадач.Информация") Тогда
	
		Элементы.Исполнение.Видимость = Ложь;	
	
	КонецЕсли; 
	
	Элементы.НуженОтчетОВыполнении.Видимость = НЕ Объект.ОтчетОВыполнении;
	
	ЗаполнитьТипАдресации();
	ОбъектАдресацииПриИзменении(Неопределено);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДополнительнуюИнформацию(ОбъектАдресации)

	Если НЕ ЗначениеЗаполнено(ОбъектАдресации) Тогда
		Возврат "";
	КонецЕсли;
		
	
	ТипОбъектАдресации = ТипЗнч(ОбъектАдресации);
	
	Если ТипОбъектАдресации = Тип("СправочникСсылка.ИзделияЗаказчика") Тогда
		
		ТипАдресации = "Изделие заказчика";	
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеИзделияЗаказчика.Артикул КАК Артикул
			|ИЗ
			|	РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
			|ГДЕ
			|	ДанныеИзделияЗаказчика.ИзделиеЗаказчика = &ИзделиеЗаказчика";
			
		Запрос.УстановитьПараметр("ИзделиеЗаказчика", ОбъектАдресации);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Артикул;
		КонецЦикла;

	ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Проекты") Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Проекты.Префикс КАК Префикс,
			|	Проекты.Номер КАК Номер
			|ИЗ
			|	Справочник.Проекты КАК Проекты
			|ГДЕ
			|	Проекты.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ОбъектАдресации);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Префикс + " (" + Выборка.Номер + ")";
		КонецЦикла;

	КонецЕсли;
	
	Возврат "";
	
КонецФункции // ПолучитьДополнительнуюИнформацию()

&НаКлиенте
Процедура ЗаполнитьТипАдресации()
	
	ТипАдресации = омЗадачаОбщаяНаКлиенте.ТипАдресацииПоОбъекту(Объект.ОбъектАдресации);
	
	ТипАдресацииПриИзменении(Неопределено);
	

КонецПроцедуры // ЗаполнитьТипАдресацииэ()

&НаКлиенте
Процедура ТипАдресацииПриИзменении(Элемент)
	
	Если НЕ Элемент = Неопределено Тогда
		
		Объект.ОбъектАдресации 	= Неопределено; 
		ДополнительноеПоле 		=  "";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипАдресации) Тогда
		
		ТипАдресации = "Нет";
		Элементы.ОбъектАдресации.Доступность = Ложь;
		
	ИначеЕсли ТипАдресации = "Нет" Тогда
	
		Элементы.ОбъектАдресации.Доступность = Ложь;
		Объект.ОбъектАдресации = Неопределено;
	
	Иначе
	
		Элементы.ОбъектАдресации.Доступность = Истина;
		
		Если ТипАдресации = "Изделие заказчика" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ИзделияЗаказчика");	
		
		ИначеЕсли ТипАдресации = "Контрагент" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");	
		
		ИначеЕсли ТипАдресации = "Комплект" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ИзделияКомплект");	
		
		ИначеЕсли ТипАдресации = "Композиция" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Композиции");	
		
		ИначеЕсли ТипАдресации = "Помещение" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Помещения");	
		
		ИначеЕсли ТипАдресации = "Проект" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Проекты");	
		
		КонецЕсли;
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектАдресацииПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОбъектАдресации) Тогда
		
		Элементы.ТипАдресации.Доступность 	= Ложь;
		Элементы.ПоДолжности.Доступность 	= Истина;
		ДополнительноеПоле = ПолучитьДополнительнуюИнформацию(Объект.ОбъектАдресации);
		
		Если ЗначениеЗаполнено(Объект.ДолжностьИсполнителя)  Тогда
			ТекущийИсполнитель = ЗаполнитьИсполнителя(Объект.ОбъектАдресации, Объект.ДолжностьИсполнителя);	
		Иначе
			ТекущийИсполнитель 				= Неопределено;
		КонецЕсли;
		
	Иначе
		
		Элементы.ПоДолжности.Доступность 	= Ложь;
		ДополнительноеПоле 					= "";
		ПоДолжност							= Ложь;         
		ПоДолжностиПриИзменении(Неопределено); 
		ТекущийИсполнитель 					= Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	
	Если НЕ ЗначениеЗаполнено(Исполнитель) И ПустаяСтрока(Объект.ДолжностьИсполнителя) Тогда
	
		ПоказатьПредупреждение(, "Не заполнен исполнитель");
		Возврат;	
	
	КонецЕсли;
	
	Записать();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Выполнена(Команда)
	
	Если Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыОбщихЗадач.Вопрос")
		ИЛИ Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыОбщихЗадач.Действие") Тогда
	
		Если ПустаяСтрока(Объект.Исполнение) Тогда
		
			ПоказатьПредупреждение(, "Не заполнено исполнение");
			Возврат;
		
		КонецЕсли; 
		
		Если Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыОбщихЗадач.Вопрос") Тогда
			НачалоОповещения = "Ответ: ";
		Иначе
			НачалоОповещения = "Выполнено: ";
		КонецЕсли;
		                   
		НачалоОповещения = НачалоОповещения + Лев(СокрЛ(Объект.Исполнение), 43);
		
	Иначе
		
		НачалоОповещения  = "Прочитано: " + СокрЛ(Объект.Наименование);

	КонецЕсли;
	
	Объект.Выполнена 		= Истина;
	Объект.АвторИсполнения 	= омСотрудники.ПолучитьТекущегоПользователя();
	Записать();
	
	Если Объект.НуженОтчетОВыполнении Тогда
	
		СсылкаЗадачиОповещения = СоздатьОтчетОВыполнении(Объект.Ссылка, Объект.Наименование, НачалоОповещения, Объект.Проект);	
		ЗаписатьИсполнителяНаСервере(СсылкаЗадачиОповещения, Объект.Автор);
	
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция СоздатьОтчетОВыполнении(Ссылка, Наименование, ТекстОповещения, Проект)

	ЗадачаОповещение = Задачи.ЗадачиОбщие.СоздатьЗадачу();
	ЗадачаОповещение.Автор = ПараметрыСеанса.ТекущийПользователь;
	ЗадачаОповещение.Дата = ТекущаяДата();
	ЗадачаОповещение.Наименование = ТекстОповещения;
	ЗадачаОповещение.ОтчетОВыполнении = Истина;
	ЗадачаОповещение.Проект = Проект; 
	ЗадачаОповещение.СвязаннаяЗадача = Ссылка;
	ЗадачаОповещение.ТипЗадачи = Перечисления.ТипыОбщихЗадач.Информация;
	
	ЗадачаОповещение.Записать();
	
	Возврат ЗадачаОповещение.Ссылка;

КонецФункции // СоздатьОтчетОВыполнении(Ссылка, Наименование,  ТекстОповещения, Проект)


&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДолжностьИсполнителя) И НЕ Объект.ДолжностьИсполнителя = "Нет" И ЗначениеЗаполнено(Объект.ОбъектАдресации) Тогда
		ТекущийИсполнитель = ЗаполнитьИсполнителя(Объект.ОбъектАдресации, Объект.ДолжностьИсполнителя);	
	Иначе
		ТекущийИсполнитель 				= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоДолжностиПриИзменении(Элемент)
	
	Если ПоДолжности Тогда
		Элементы.ДолжностьИсполнителя.Видимость = Истина;
		Элементы.Исполнитель.Видимость 			= Ложь;
		Исполнитель 							= Неопределено;
		
		Если Элементы.ДолжностьИсполнителя.СписокВыбора.Количество() = 0 Тогда
			омЗадачаОбщаяНаКлиенте.ЗаполнитьСписокДолжности(Элементы.ДолжностьИсполнителя.СписокВыбора);
		КонецЕсли;
		
	Иначе
		Элементы.Исполнитель.Видимость 			= Истина;
		Элементы.ДолжностьИсполнителя.Видимость = Ложь;
		Объект.ДолжностьИсполнителя 			= "";
	КонецЕсли;
	
	Элементы.ТекущийИсполнитель.Видимость		= Элементы.ДолжностьИсполнителя.Видимость;
	
КонецПроцедуры 

&НаКлиенте
Процедура ДолжностьИсполнителяНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Если Элементы.ДолжностьИсполнителя.СписокВыбора.Количество() = 0 Тогда
		омЗадачаОбщаяНаКлиенте.ЗаполнитьСписокДолжности(Элементы.ДолжностьИсполнителя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗадачиПриИзменении(Элемент)
	
	Элементы.Исполнение.Видимость = НЕ Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыОбщихЗадач.Информация");	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ОбъектАдресации) Тогда
		
		Если ТипЗнч(ТекущийОбъект.ОбъектАдресации) = Тип("СправочникСсылка.Проекты") Тогда
			ТекущийОбъект.Проект = ТекущийОбъект.ОбъектАдресации;
		ИначеЕсли ТипЗнч(ТекущийОбъект.ОбъектАдресации) = Тип("СправочникСсылка.Контрагенты") Тогда
			ТекущийОбъект.Проект = Справочники.Проекты.ПустаяСсылка();
		Иначе
			ТекущийОбъект.Проект = ТекущийОбъект.ОбъектАдресации.Проект;
		КонецЕсли;	
		
	Иначе
		
		ТекущийОбъект.Проект = Справочники.Проекты.ПустаяСсылка();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ТекущийИсполнитель = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		ТекущийИсполнитель = Исполнитель;	
	ИначеЕсли ЗначениеЗаполнено(Объект.ОбъектАдресации) И НЕ ПустаяСтрока(Объект.ДолжностьИсполнителя) Тогда
		ТекущийИсполнитель = омСотрудники.ПолучитьИсполнителяОбъекта(Объект.ОбъектАдресации, Объект.ДолжностьИсполнителя, Истина);	
	КонецЕсли;
	
	ЗаписатьИсполнителяНаСервере(Объект.Ссылка, ТекущийИсполнитель);

КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаписатьИсполнителяНаСервере(Задача, Исполнитель)

	МенеджерЗаписи = РегистрыСведений.ДанныеЗадачи.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Задача 		= Задача;
	МенеджерЗаписи.Исполнитель 	= Исполнитель;
	
	МенеджерЗаписи.Записать();
		
КонецПроцедуры // ЗаписатьИсполнителяНаСервере(Объект.Ссылка, Исполнитель)



