
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	ДополнительноеПоле = ПолучитьДополнительнуюИнформацию(Объект.ОбъектАдресации);
	
КонецПроцедуры



&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		
		Если ПустаяСтрока(Объект.Сообщение) Тогда
		
			Отказ = Истина;
			ПоказатьПредупреждение(, "Не заполнено наименование и сообщение");
		
		Иначе
			Объект.Наименование = Объект.Сообщение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ДолжностьИсполнителя) Тогда
		ПоДолжности = Истина;	
	Иначе
		ПоДолжности = Ложь;	
	КонецЕсли;
	
	ПоДолжностиПриИзменении(Неопределено);
	
	Если Объект.Выполнена Тогда
		
		ТолькоПросмотр = Истина;
		Элементы.ДолжностьИсполнителя.ТолькоПросмотр 	= Истина;
		Элементы.ТипАдресации.ТолькоПросмотр 			= Истина; 
		Элементы.ФормаВыполнена.Доступность 			= Ложь;	
		Элементы.ФормаЗаписать.Доступность 				= Ложь;	
		
	ИначеЕсли Параметры.Ключ.Пустая() Тогда
	
		Элементы.Исполнение.ТолькоПросмотр 	= Истина;	
		Элементы.ФормаВыполнена.Доступность = Ложь;	
	
	Иначе
	
		Элементы.Сообщение.ТолькоПросмотр 				= Истина;	
		Элементы.Наименование.ТолькоПросмотр 			= Истина;	
		Элементы.Направление.ТолькоПросмотр 			= Истина;	
		Элементы.ТипЗадачи.ТолькоПросмотр 				= Истина;	
		Элементы.Исполнитель.ТолькоПросмотр 			= Истина;	
		Элементы.Сообщение.ТолькоПросмотр 				= Истина;	
		Элементы.ТипАдресации.ТолькоПросмотр			= Истина;	
		Элементы.ОбъектАдресации.ТолькоПросмотр			= Истина;	
		Элементы.ПоДолжности.ТолькоПросмотр				= Истина;	
		Элементы.ДолжностьИсполнителя.ТолькоПросмотр	= Истина;	
		
		Элементы.ФормаЗаписать.Доступность 	= Ложь;	
	
	КонецЕсли; 
	
	Если Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыОбщихЗадач.Информация") Тогда
	
		Элементы.Исполнение.Видимость = Ложь;	
	
	КонецЕсли;
	
	ЗаполнитьТипАдресации(); 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДополнительнуюИнформацию(ОбъектАдресации)

	Если НЕ ЗначениеЗаполнено(ОбъектАдресации) Тогда
		Возврат "";
	КонецЕсли;
		
	
	ТипОбъектАдресации = ТипЗнч(ОбъектАдресации);
	
	Если ТипОбъектАдресации = Тип("СправочникСсылка.ИзделияЗаказчика") Тогда
		
		ТипАдресации = "Изделие заказчика";	
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеИзделияЗаказчика.Артикул КАК Артикул
			|ИЗ
			|	РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
			|ГДЕ
			|	ДанныеИзделияЗаказчика.ИзделиеЗаказчика = &ИзделиеЗаказчика";
			
		Запрос.УстановитьПараметр("ИзделиеЗаказчика", ОбъектАдресации);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Артикул;
		КонецЦикла;

	ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Проекты") Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Проекты.Префикс КАК Префикс,
			|	Проекты.Номер КАК Номер
			|ИЗ
			|	Справочник.Проекты КАК Проекты
			|ГДЕ
			|	Проекты.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ОбъектАдресации);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Префикс + " (" + Выборка.Номер + ")";
		КонецЦикла;

	КонецЕсли;
	
	Возврат "";
	
КонецФункции // ПолучитьДополнительнуюИнформацию()

&НаКлиенте
Процедура ЗаполнитьТипАдресации()
	
	Если ЗначениеЗаполнено(Объект.ОбъектАдресации) Тогда
	
		ТипОбъектАдресации = ТипЗнч(Объект.ОбъектАдресации);
		
		Если ТипОбъектАдресации = Тип("СправочникСсылка.ИзделияЗаказчика") Тогда
		
			ТипАдресации = "Изделие заказчика";	

		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.ИзделияКомплект") Тогда
		
			ТипАдресации = "Комплект";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Композиции") Тогда
		
			ТипАдресации = "Композиция";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Проекты") Тогда
		
			ТипАдресации = "Проект";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Помещения") Тогда
		
			ТипАдресации = "Помещение";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Контрагенты") Тогда
		
			ТипАдресации = "Контрагент";		
		
		КонецЕсли;
		
	КонецЕсли;
	
	ТипАдресацииПриИзменении(Неопределено);
	

КонецПроцедуры // ЗаполнитьТипАдресацииэ()

&НаКлиенте
Процедура ТипАдресацииПриИзменении(Элемент)
	
	Если НЕ Элемент = Неопределено Тогда
		
		Объект.ОбъектАдресации 	= Неопределено; 
		ДополнительноеПоле 		=  "";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипАдресации) Тогда
		
		ТипАдресации = "Нет";
		Элементы.ОбъектАдресации.Доступность = Ложь;
		
	ИначеЕсли ТипАдресации = "Нет" Тогда
	
		Элементы.ОбъектАдресации.Доступность = Ложь;
		Объект.ОбъектАдресации = Неопределено;
	
	Иначе
	
		Элементы.ОбъектАдресации.Доступность = Истина;
		
		Если ТипАдресации = "Изделие заказчика" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ИзделияЗаказчика");	
		
		ИначеЕсли ТипАдресации = "Контрагент" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");	
		
		ИначеЕсли ТипАдресации = "Комплект" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ИзделияКомплекты");	
		
		ИначеЕсли ТипАдресации = "Композиция" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Композиции");	
		
		ИначеЕсли ТипАдресации = "Помещение" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Помещения");	
		
		ИначеЕсли ТипАдресации = "Проект" Тогда
		
			Элементы.ОбъектАдресации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Проекты");	
		
		КонецЕсли;
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектАдресацииПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ОбъектАдресации) Тогда
		
		Элементы.ТипАдресации.Доступность = Ложь;
		ДополнительноеПоле = ПолучитьДополнительнуюИнформацию(Объект.ОбъектАдресации);
		
	Иначе
		
		ДополнительноеПоле = "";
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Направление) Тогда
	
		ПоказатьПредупреждение(, "Не заполнено направление");
		Возврат;	
	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Исполнитель) И ПустаяСтрока(Объект.ДолжностьИсполнителя) Тогда
	
		ПоказатьПредупреждение(, "Не заполнен исполнитель");
		Возврат;	
	
	КонецЕсли;
	
	Записать();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Выполнена(Команда)
	
	Если Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыОбщихЗадач.Вопрос")
		ИЛИ Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыОбщихЗадач.Действие") Тогда
	
		Если ПустаяСтрока(Объект.Исполнение) Тогда
		
			ПоказатьПредупреждение(, "Не заполнено исполнение");
			Возврат;
		
		КонецЕсли;	
	
	КонецЕсли;
	
	Объект.Выполнена 		= Истина;
	Объект.АвторИсполнения 	= омСотрудники.ПолучитьТекущегоПользователя();
	Записать();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ПоДолжностиПриИзменении(Элемент)
	
	Если ПоДолжности Тогда
		Элементы.ДолжностьИсполнителя.Видимость = Истина;
		Элементы.Исполнитель.Видимость 			= Ложь;
		Объект.Исполнитель 						= Неопределено;
		
		Если Элементы.ДолжностьИсполнителя.СписокВыбора.Количество() = 0 Тогда
			ЗаполнитьСписокДолжности();
		КонецЕсли;
		
	Иначе
		Элементы.Исполнитель.Видимость 			= Истина;
		Элементы.ДолжностьИсполнителя.Видимость = Ложь;
		Объект.ДолжностьИсполнителя 			= "";
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьСписокДолжности()
	
	Элементы.ДолжностьИсполнителя.СписокВыбора.Добавить("Дизайнер");
	Элементы.ДолжностьИсполнителя.СписокВыбора.Добавить("Менеджер");
	Элементы.ДолжностьИсполнителя.СписокВыбора.Добавить("Замерщик");
	Элементы.ДолжностьИсполнителя.СписокВыбора.Добавить("Ведущий конструктор");
	Элементы.ДолжностьИсполнителя.СписокВыбора.Добавить("Конструктор");
	
КонецПроцедуры // ЗаполнитьСписокДолжности()

&НаКлиенте
Процедура ДолжностьИсполнителяНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Если Элементы.ДолжностьИсполнителя.СписокВыбора.Количество() = 0 Тогда
		ЗаполнитьСписокДолжности();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗадачиПриИзменении(Элемент)
	
	Элементы.Исполнение.Видимость = НЕ Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыОбщихЗадач.Информация");	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ОбъектАдресации) Тогда
		
		Если ТипЗнч(ТекущийОбъект.ОбъектАдресации) = Тип("СправочникСсылка.Проекты") Тогда
			ТекущийОбъект.Проект = ТекущийОбъект.ОбъектАдресации;
		ИначеЕсли ТипЗнч(ТекущийОбъект.ОбъектАдресации) = Тип("СправочникСсылка.Контрагенты") Тогда
			ТекущийОбъект.Проект = Справочники.Проекты.ПустаяСсылка();
		Иначе
			ТекущийОбъект.Проект = ТекущийОбъект.ОбъектАдресации.Ппоект;
		КонецЕсли;	
		
	Иначе
		
		ТекущийОбъект.Проект = Справочники.Проекты.ПустаяСсылка();
		
	КонецЕсли;
	
КонецПроцедуры




