

Процедура ПриЗаписи(Отказ)
	
	УИДДоски = омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
	ИмяДоски = омКанбанДоскиНаСервереПовтор.ПолучитьИмяДоски("НаименованиеДоскиПроизводство");
	
	ТаблицаСуществующихКарточекПроизводства 
	= омКанбанДоскиНаСервере.ПолучитьКарточкиКанбанаСКолонкамиИТегами(УИДДоски, ИзделияКомплекты.ВыгрузитьКолонку("ИзделиеКомплект")); 
	
	МассивКолонокЗавершенных = Новый Массив(3);
	МассивКолонокЗавершенных[0] = "1";
	МассивКолонокЗавершенных[1] = "100";
	МассивКолонокЗавершенных[2] = "200";
	
	
	Для каждого х Из ТаблицаСуществующихКарточекПроизводства Цикл
		
		Если МассивКолонокЗавершенных.Найти(х.УИДКудаКолонка) = Неопределено Тогда
			
			омКанбанПроизводство.ПеревестиРеквизитВЗавершенный(х.Ресурс);	
		
		КонецЕсли;		
		
	КонецЦикла;
	
	МассивСтадий = омСтадииКомплекта.ПолучитьСтадииПоСтатусу(Перечисления.СтатусыЗадач.МонтажПередача);
	
	Если МассивСтадий.Количество() = 0 Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	СтадияМонтажПередача = МассивСтадий[0];
	
	Для каждого х Из ИзделияКомплекты Цикл
		
		стПараметры = Новый Структура("Комплект, ТекущаяСтадия", х.ИзделиеКомплект, СтадияМонтажПередача);
		РегистрыСведений.ДанныеКомплекта.ИзменитьДанныеКомплекта(стПараметры);
		
	КонецЦикла;
	
	
КонецПроцедуры

