
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СозданаИзмененаНастройка" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы      

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	лПараметры = Новый Структура;
	лПараметры.Вставить("НастройкаПодключения", ВыбраннаяСтрока); 
	ОткрытьФорму("РегистрСведений.Б24_СУ_Настройки.Форма.ФормаЗаписи", лПараметры);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настроить(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		лПараметры = Новый Структура;
		лПараметры.Вставить("НастройкаПодключения", ТекущаяСтрока); 
		ОткрытьФорму("РегистрСведений.Б24_СУ_Настройки.Форма.ФормаЗаписи", лПараметры);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо создать настройку подключения");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузку(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Если Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(ТекущаяСтрока, "ПометкаУдаления") = Ложь Тогда
			
			Если НЕ НастройкаВыгрузкиСуществует(ТекущаяСтрока) Тогда
				ПоказатьПредупреждение(, "Не заданы настройки выгрузки",10);
				Возврат;
			КонецЕсли;
			
			Если Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.РасширениеВБезопасномРежиме() Тогда
				ПоказатьПредупреждение(, "Расширение модуля в безопасном режиме. Продолжение невозможно",10);
				Возврат;
			КонецЕсли;
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("НастройкаПодключения"	, ТекущаяСтрока);
			ПараметрыФормы.Вставить("ПолнаяВыгрузка"	, Ложь);
			
			ОткрытьФорму("РегистрСведений.Б24_СУ_Настройки.Форма.ФормаВыполнениеВыгрузки", ПараметрыФормы, , ТекущаяСтрока);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПолнуюВыгрузку(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Если Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(ТекущаяСтрока, "ПометкаУдаления") = Ложь Тогда
			
			Если НЕ НастройкаВыгрузкиСуществует(ТекущаяСтрока) Тогда
				ПоказатьПредупреждение(, "Не заданы настройки выгрузки",10);
				Возврат;
			КонецЕсли;
			
			Если Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.РасширениеВБезопасномРежиме() Тогда
				ПоказатьПредупреждение(, "Расширение модуля в безопасном режиме. Продолжение невозможно",10);
				Возврат;
			КонецЕсли;
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("НастройкаПодключения"	, ТекущаяСтрока);
			ПараметрыФормы.Вставить("ПолнаяВыгрузка"		, Истина);
			
			ОткрытьФорму("РегистрСведений.Б24_СУ_Настройки.Форма.ФормаВыполнениеВыгрузки", ПараметрыФормы, , ТекущаяСтрока);
			
		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрированныеИзменения(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ПараметрыВыбора = Новый Структура("НастройкаПодключения", ТекущаяСтрока);
		ОткрытьФорму("РегистрСведений.Б24_СУ_ТаблицаИзменений.ФормаСписка", ПараметрыВыбора, ЭтаФорма);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#Область Прочие

&НаСервере
Функция НастройкаВыгрузкиСуществует(НастройкаПодключения)
	
	Возврат РегистрыСведений.Б24_СУ_Настройки.ПолучитьМассивНастроекВыгрузки("НастройкаПодключения", НастройкаПодключения).Количество() > 0;
	
КонецФункции

#КонецОбласти
