

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНаСервере();
	
	ДолжностьКонстуктор = Перечисления.Должности.Конструктор;
	
	Конструкторы = омСотрудники.ЗаполнитьСписокСотрудниковПоДолжностям(Истина, , ДолжностьКонстуктор);
	КоличествоКонструкторов = Конструкторы.Получить(ДолжностьКонстуктор).Количество();
	
		
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИтогоКонструкторов();
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

 &НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	Элементы.Сохранить.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПроектовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПроектовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПроектовПриИзменении(Элемент)
	
	ТД = Элементы.ДанныеПроектов.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ТД.Изменен = Истина;
	Элементы.Сохранить.Доступность = Истина;
	
	ИтогоКонструкторов();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНаСервере()
	
	Отбор = Новый Структура("Изменен", Истина);
	
	Для каждого х Из ДанныеПроектов.НайтиСтроки(Отбор) Цикл
	
		МенеджерЗаписи = РегистрыСведений.ДанныеПроекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Проект = х.Проект;
		МенеджерЗаписи.Прочитать();

		МенеджерЗаписи.Проект 					= х.Проект;
		МенеджерЗаписи.КоличествоКонструкторов 	= х.КоличествоКонструкторов;
		МенеджерЗаписи.Приоритет 				= х.Приоритет;
		
		МенеджерЗаписи.Записать();
	
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Проект,
		|	ДанныеПроекта.КоличествоКонструкторов КАК КоличествоКонструкторов,
		|	ДанныеПроекта.Приоритет КАК Приоритет
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПроекта КАК ДанныеПроекта
		|		ПО (ДанныеПроекта.Проект = Проекты.Ссылка)
		|ГДЕ
		|	НЕ Проекты.НеВыводитьНаДиаграмму
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет,
		|	Проекты.Номер";
	
	ДанныеПроектов.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИтогоКонструкторов()

	текКонструктор 	= 0; 
	Приоритет 		= 0; 
	
	Для каждого х Из ДанныеПроектов Цикл
		текКонструктор = текКонструктор + х.КоличествоКонструкторов;
		Если НЕ Приоритет = х.Приоритет Тогда
			х.Приоритет = Приоритет;
			х.Изменен	= Истина;	
		КонецЕсли;
		Приоритет = Приоритет + 1;
	КонецЦикла;
	
	ИтогоКонструкторов = Окр(текКонструктор, 0);

КонецПроцедуры // ИтогоКонструкторов()

#КонецОбласти
