 &НаКлиенте
Перем НачальноеЗначениеАктуальнаяСмета,НачальноеЗначениеИзделияЗаказчика,мНоменклатура; 

#Область СобытияФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	мНоменклатура = Новый Массив;
	
	мКонтроль = Новый Массив;
	Для каждого текНоменклатура Из Объект.Номенклатура Цикл
		Если НЕ мКонтроль.Найти(текНоменклатура.Номенклатура) = Неопределено Тогда
			Продолжить;
		КонецЕсли;             
		стДанные = Новый Структура("Номенклатура,Цена", );
		ЗаполнитьЗначенияСвойств(стДанные,текНоменклатура);
		мНоменклатура.Добавить(стДанные); 
		мКонтроль.Добавить(текНоменклатура.Номенклатура);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИспользоватьОднуКромку();
	ИспользоватьОдинМатериал(); 
	ЗаголовкиЗакладок("");	
    ВидимостьВкладкиКартинка();

	НачальноеЗначениеАктуальнаяСмета = ЭтаФорма.АктуальнаяСмета; 
	НачальноеЗначениеИзделияЗаказчика = Объект.Изделие;

	ДоступностьАктуальности();
		
    // СтандартныеПодсистемы.РаботаСФайлами
    РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
    // Конец СтандартныеПодсистемы.РаботаСФайлами
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаписатьАктуальностьНаСервере(Объект.Ссылка,Объект.Изделие,ЭтаФорма.АктуальнаяСмета,НачальноеЗначениеИзделияЗаказчика);
	СохранитьЦены(Объект.Изделие,Объект.Ссылка,мНоменклатура);
	ЗаполнитьЦены();
КонецПроцедуры 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		ЗаполнитьЦены();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ОдинМатериалПокрытия = Истина; 
		Объект.ОднаКромка 			= Истина;
	Иначе
		АдресКартинки = ВывестиКартинкуНаСервере(Объект.Изделие);
		ПроверитьАктуальность();
	КонецЕсли; 
	
	Если НЕ омРолиНаСервере.ДоступностьПредварительногоРасчета() Тогда
	
		ЭтаФорма.Элементы.ГруппаРасчеты.Видимость = Ложь;	
		ЭтаФорма.Элементы.ГруппаРасчеты.Видимость = Ложь;	
	
	КонецЕсли;
	
	Если НЕ РольДоступна("ЦеныЗакупки") Тогда
	
		ЭтаФорма.Элементы.ДополнительныеРасходыЦена.Видимость 		= Ложь;	
		ЭтаФорма.Элементы.ДополнительныеРасходыСтоимость.Видимость 	= Ложь;	
	
	КонецЕсли;

	// СтандартныеПодсистемы.РаботаСФайлами
    ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
    ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
    РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
    // Конец СтандартныеПодсистемы.РаботаСФайлами
КонецПроцедуры

#КонецОбласти


#Область СобытиеРеквизитов

&НаКлиенте
Процедура ОдинМатериалПокрытияПриИзменении(Элемент)
	ИспользоватьОдинМатериал();
КонецПроцедуры

&НаКлиенте
Процедура ОднаКромкаПриИзменении(Элемент)
	ИспользоватьОднуКромку();
КонецПроцедуры

&НаКлиенте
Процедура ИзделиеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Изделие) Тогда
		АдресКартинки = ВывестиКартинкуНаСервере(Объект.Изделие);
	Иначе
		АдресКартинки = "";
	КонецЕсли;
	ВидимостьВкладкиКартинка();
	ДоступностьАктуальности();
КонецПроцедуры
#КонецОбласти 

#Область СобытияТЧ

&НаКлиенте
Процедура ДеталиЛистовыеПриИзменении(Элемент)
	ЗаголовкиЗакладок("Детали листовые");	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиЛистовыеНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	НазначитТипПолюТЧ(Элементы.ДеталиЛистовые,"Номенклатура");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеталиЛистовыеМатериалПокрытия1НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НазначитТипПолюТЧ(Элементы.ДеталиЛистовые,"МатериалПокрытия1");
КонецПроцедуры 

&НаКлиенте
Процедура ДеталиЛистовыеМатериалПокрытия2НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	НазначитТипПолюТЧ(Элементы.ДеталиЛистовые,"МатериалПокрытия2");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеталиЛистовыеКромкаХ1НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	НазначитТипПолюТЧ(Элементы.ДеталиЛистовые,"КромкаХ1");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеталиЛистовыеКромкаХ2НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	НазначитТипПолюТЧ(Элементы.ДеталиЛистовые,"КромкаХ2");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеталиЛистовыеКромкаУ1НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	НазначитТипПолюТЧ(Элементы.ДеталиЛистовые,"КромкаУ1");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеталиЛистовыеКромкаУ2НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	НазначитТипПолюТЧ(Элементы.ДеталиЛистовые,"КромкаУ2");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеталиПоганажныеНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	НазначитТипПолюТЧ(Элементы.ДеталиПоганажные,"Номенклатура");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеталиШтучныеНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	НазначитТипПолюТЧ(Элементы.ДеталиШтучные,"Номенклатура");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеталиОбъемныеНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	НазначитТипПолюТЧ(Элементы.ДеталиОбъемные,"Номенклатура");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеталиПрочиеНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	НазначитТипПолюТЧ(Элементы.ДеталиПрочие,"Номенклатура");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеталиШтучныеПриИзменении(Элемент)
	ЗаголовкиЗакладок("Детали штучные");	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиПоганажныеПриИзменении(Элемент)
	ЗаголовкиЗакладок("Детали поганажные");
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНоменклатураПриИзменении(Элемент)
	ТД = Элементы.Номенклатура.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТД.Номенклатура) Тогда
		
		стПараметрыНоменклатуры = ПолучитьПараметрыНоменклатуры(ТД.Номенклатура);
		
		ТД.НормаРасхода = стПараметрыНоменклатуры.НормаРасхода;
		ТД.СтатьяЗатрат = стПараметрыНоменклатуры.СтатьяЗатрат;
		РасчитатьСуммуНоменклатуры();
	Иначе
		ТД.Цена 		= 0;
		ТД.Сумма 		= 0;
		ТД.Количество 	= 0;
		ТД.НормаРасхода	= 0;
		ТД.СтатьяЗатрат = ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура НоменклатураКоличествоПриИзменении(Элемент)
	РасчитатьСуммуНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНормаРасходаПриИзменении(Элемент)
	РасчитатьСуммуНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураЦенаПриИзменении(Элемент)
	РасчитатьСуммуНоменклатуры();
	ПроверкаВозможностиИзмененияЦены();
КонецПроцедуры 

&НаКлиенте
Процедура НоменклатураСуммаПриИзменении(Элемент)
	РасчитатьСуммуНоменклатуры(,Истина);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.РучноеДобавление = Истина;
		ПроверкаВозможностиИзмененияЦены();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаботаЦенаПриИзменении(Элемент)
	РасчитатьСуммуРаботы();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПередУдалением(Элемент, Отказ)
	Отказ = НЕ ТекущаяСтрокаРучная(Элементы.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПередНачаломИзменения(Элемент, Отказ) 
	Если Элемент.ТекущийЭлемент.Имя = "НоменклатураНоменклатура" Тогда
		ТД = Неопределено;
		Если НЕ ТекущаяСтрокаРучная(Элементы.Номенклатура, ТД) Тогда
			Отказ = Истина;	
			Если ЗначениеЗаполнено(ТД.Номенклатура) Тогда
				ПоказатьЗначение(,ТД.Номенклатура);
			КонецЕсли;
		КонецЕсли;		
	ИначеЕсли НЕ (Элемент.ТекущийЭлемент.Имя = "НоменклатураЦена" ИЛИ ТекущаяСтрокаРучная(Элементы.Номенклатура)) Тогда 
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры 
                   
&НаКлиенте
Процедура РаботаПередУдалением(Элемент, Отказ)
	Отказ = НЕ ТекущаяСтрокаРучная(Элементы.Работа);
КонецПроцедуры

&НаКлиенте
Процедура РаботаПередНачаломИзменения(Элемент, Отказ)
	ТД = Элементы.Работа.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	
	Отказ = НЕ ТД.РучноеДобавление;
	
	Если Элементы.Работа.ТекущийЭлемент.Имя = "РаботаРасценки" Тогда
		ПоказатьЗначение(,ТД.Расценки);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаботаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.РучноеДобавление = Истина; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеталиЛистовыеПередНачаломИзменения(Элемент, Отказ)
	ДеталиПередНачаломИзменения(Элемент, "ДеталиЛистовыеДеталь");
КонецПроцедуры

&НаКлиенте
Процедура ДеталиПоганажныеПередНачаломИзменения(Элемент, Отказ)
	ДеталиПередНачаломИзменения(Элемент, "ДеталиПоганажныеДеталь");
КонецПроцедуры

&НаКлиенте
Процедура ДеталиЛистовыеДетальНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Листовая"); 
	ДоВыбораДетали(Элемент,ТипНоменклатуры);  
	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиПоганажныеДетальНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Поганажная"); 
	ДоВыбораДетали(Элемент,ТипНоменклатуры);
КонецПроцедуры

&НаКлиенте
Процедура ДеталиЛистовыеМатериалПокрытия1ПриИзменении(Элемент)
	УстановкаОсновногоМатериала("МатериалПокрытия1",1);
КонецПроцедуры


&НаКлиенте
Процедура ДеталиЛистовыеМатериалПокрытия2ПриИзменении(Элемент)
	УстановкаОсновногоМатериала("МатериалПокрытия2",2);
КонецПроцедуры


#КонецОбласти

#Область ПродолжениеПроцедуры

&НаКлиенте
Процедура УстановкаОсновногоМатериала(НаименованиеКолонки,Индекс)
	ТД = Элементы.ДеталиЛистовые.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТД[НаименованиеКолонки]) Тогда
		ТД["ОбработкаПокрытие" + Индекс] = ПолучитьОсновнуюОбработку(ТД[НаименованиеКолонки]);	
	Иначе
		ТД["ОбработкаПокрытие" + Индекс] = ПредопределенноеЗначение("Справочник.ВидыРабот.ПустаяСсылка");	
	КонецЕсли;
КонецПроцедуры // УстановкаОсновногоМатериала()


&НаКлиенте
Процедура НазначитТипПолюТЧ(ЭлементТЧ,НаименованиеКолонки)

	ТекущиеДанные = ЭлементТЧ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораМатериала",ЭтаФорма,Новый Структура("ТекущаяСтрока,НаименованиеКолонки",ТекущиеДанные,НаименованиеКолонки));
	
	Если ЭтаФорма.ПодборНоменклатуры Тогда
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора"
		,,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	Иначе
		ОткрытьФорму("Справочник.ПредварительнаяНоменклатура.ФормаВыбора"
		,,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;
	
КонецПроцедуры // НазначитТипПолюТЧ()
  
&НаКлиенте
Процедура ПослеВыбораМатериала(Результат,ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ДопПараметры.ТекущаяСтрока[ДопПараметры.НаименованиеКолонки] = Результат; 
	
	Если Тип("СправочникСсылка.ПредварительнаяНоменклатура") = ТипЗнч(Результат) Тогда
		ВидРаботыОсновной = ПолучитьОсновнойВидРаботы(Результат);
	Иначе
		ВидРаботыОсновной = ПредопределенноеЗначение("Справочник.ВидыРабот.ПустаяСсылка");	
	КонецЕсли;  
	
	Если ДопПараметры.НаименованиеКолонки = "МатериалПокрытия1" Тогда
		ДопПараметры.ТекущаяСтрока.ОбработкаПокрытие1 = ВидРаботыОсновной;		
	ИначеЕсли ДопПараметры.НаименованиеКолонки = "МатериалПокрытия2" Тогда
		ДопПараметры.ТекущаяСтрока.ОбработкаПокрытие2 = ВидРаботыОсновной;		
	ИначеЕсли ДопПараметры.НаименованиеКолонки = "Номенклатура" Тогда
		ДопПараметры.ТекущаяСтрока.ОбработкаДетали = ВидРаботыОсновной;		
	КонецЕсли;
	
КонецПроцедуры // ПолеВыбораДетали() 

&НаСервереБезКонтекста
Функция ПолучитьОсновнойВидРаботы(ПредварительнаяНоменклатура)

	Возврат ПредварительнаяНоменклатура.ВидРаботыОсновной;	

КонецФункции // ПолучитьОсновнойВидРаботы()



&НаКлиенте
Процедура ДоВыбораДетали(Элемент,ТипНоменклатуры)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПослеВыбораДетали",ЭтаФорма,Новый Структура("ТекущаяСтрока,ТипНоменклатуры", ТекущиеДанные, ТипНоменклатуры));
	
	ОткрытьФорму("Справочник.ДеталиИзделияЭлемент.ФормаВыбора"
	,Новый Структура("ТипНоменклатуры", ТипНоменклатуры
		),ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
КонецПроцедуры // ДоВыбораДетали()

&НаКлиенте
Процедура ПослеВыбораДетали(Результат,ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДопПараметры.ТекущаяСтрока, ПолучитьИнформациюОДетале(ДопПараметры.ТипНоменклатуры, Результат));
КонецПроцедуры // ПолеВыбораДетали() 

&НаКлиенте
Процедура ДеталиПередНачаломИзменения(Элемент, ИмяКолонки)
	Если Элемент.ТекущийЭлемент.Имя = ИмяКолонки Тогда
		ТД = Элемент.ТекущиеДанные;
		Если НЕ ЗначениеЗаполнено(ТД.Деталь) Тогда
			Если НЕ ЭтаФорма.ПодборНоменклатуры Тогда
				ТД.Деталь = "";	
			КонецЕсли;
			
			//МассивТипов = Новый Массив;
			//МассивТипов.Добавить(?(ЭтаФорма.ПодборНоменклатуры,Тип("СправочникСсылка.Номенклатура"),Тип("Строка")));
			//Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ДеталиПередНачаломИзменения(Элемент,ИмяКолонки)
#КонецОбласти


#Область Команды
	
&НаКлиенте
Процедура ЗаполнитьНоменклатуру(Команда)
	стДанные = ПолучитьНоменклатуруВДокументе();
	Если НЕ ПустаяСтрока(стДанные.Ошибка) Тогда
		ПоказатьПредупреждение(,стДанные.Ошибка);
		Объект.ТребуетсяПерерасчет = Истина;
		Возврат;
	КонецЕсли;
	
	мРучноеДобавление = Новый Массив;
	мЦеныНоменклатуры = Новый Массив;
	
	Для каждого текСтрока Из Объект.Номенклатура Цикл 
		
		Если текСтрока.Цена > 0 Тогда
			стСтрока = Новый Структура("Номенклатура,Цена", );
			ЗаполнитьЗначенияСвойств(стСтрока,текСтрока);
			мЦеныНоменклатуры.Добавить(стСтрока);
		КонецЕсли;
		
		Если НЕ текСтрока.РучноеДобавление Тогда
			Продолжить;
		КонецЕсли;
		
		стСтрока = Новый Структура("Номенклатура,Количество,НормаРасхода,РучноеДобавление,СтатьяЗатрат", );
		ЗаполнитьЗначенияСвойств(стСтрока,текСтрока);
		
	    мРучноеДобавление.Добавить(стСтрока);
		
	КонецЦикла;
	
	ДобавитьНоменклатуруОбработки(стДанные.мНоменклатура,стДанные.мВидыРабот);
	ДобавитьНоменклатуруКомплекта(стДанные.мНоменклатура);
	
	ЗаполнитьНоменклатуруНаСерверестДанные(стДанные.мНоменклатура); 
	
	Для каждого стРучноеДобавление Из мРучноеДобавление Цикл
		ЗаполнитьЗначенияСвойств(Объект.Номенклатура.Добавить(),стРучноеДобавление); 
	КонецЦикла; 
	
	мНеНайденыеЦены = Новый Массив;
	
	Для каждого текСтрока Из Объект.Номенклатура Цикл
		ЦенаНеНайдена = Истина;
		Для каждого текЦена Из мЦеныНоменклатуры Цикл
			Если текСтрока.Номенклатура = текЦена.Номенклатура Тогда
				текСтрока.Цена = текЦена.Цена;
				РасчитатьСуммуНоменклатуры(текСтрока);
				
				ЦенаНеНайдена = Ложь;
				
			КонецЕсли;
		КонецЦикла;
		
		Если ЦенаНеНайдена Тогда
		
			мНеНайденыеЦены.Добавить(текСтрока.Номенклатура);	
		
		КонецЕсли;	
	КонецЦикла;
	
	Если мНеНайденыеЦены.Количество() > 0 Тогда
	
		мЦеныНоменклатурыНеНайденой = омЦеныНаСервере.ПолучитьТекущиеЦеныПредварительнойНоменклатуры(мНеНайденыеЦены);
		
		Для каждого текЦена Из мЦеныНоменклатурыНеНайденой Цикл
			Для каждого текСтрока Из Объект.Номенклатура Цикл
				Если текСтрока.Номенклатура = текЦена.ПредварительнаяНоменклатура Тогда
					текСтрока.Цена = текЦена.Цена;
					РасчитатьСуммуНоменклатуры(текСтрока);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьЦеныНоменклатуры(Команда)
	ЗаполнитьЦены();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРаботу(Команда)
	стДанные = ПолучитьРаботуВДокументе();
	Если НЕ ПустаяСтрока(стДанные.Ошибка) Тогда
		ПоказатьПредупреждение(,стДанные.Ошибка);
		Объект.ТребуетсяПерерасчет = Истина;
		Возврат;
	КонецЕсли;
	
	мРучноеДобавление = Новый Массив;
	
	Для каждого текСтрока Из Объект.Работа Цикл
		Если НЕ текСтрока.РучноеДобавление Тогда
			Продолжить;
		КонецЕсли;
		стСтрока = Новый Структура("ВремяНаРаботу,Количество,Расценки,РучноеДобавление,СтатьяЗатрат,Цена,Сумма", );
		ЗаполнитьЗначенияСвойств(стСтрока,текСтрока);
	    мРучноеДобавление.Добавить(стСтрока);
	КонецЦикла;  
	
	ЗаполнитьРаботуНаСерверестДанные(стДанные.мРабота); 
	
	Для каждого стРучноеДобавление Из мРучноеДобавление Цикл
		ЗаполнитьЗначенияСвойств(Объект.Работа.Добавить(),стРучноеДобавление); 
	КонецЦикла; 
КонецПроцедуры  

&НаКлиенте
Процедура ОдинаковаяКромка(Команда)
	ТД = Элементы.ДеталиЛистовые.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
	
		ПоказатьПредупреждение(,"Не выбрана строка.");
		
	Иначе
		
		Если ЗначениеЗаполнено(ТД.КромкаХ1) Тогда
			ТД.КромкаХ2 			= ТД.КромкаХ1;	
			ТД.КромкаУ1 			= ТД.КромкаХ1;	
			ТД.КромкаУ2 			= ТД.КромкаХ1;	
		Иначе	
			ПоказатьПредупреждение(,"Не заполнена кромка.");
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОдинаковыйМатериалПокрытия(Команда)
	ТД = Элементы.ДеталиЛистовые.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
	
		ПоказатьПредупреждение(,"Не выбрана строка.");
		
	Иначе
		
		Если ЗначениеЗаполнено(ТД.МатериалПокрытия1) Тогда
			ТД.МатериалПокрытия2 	= ТД.МатериалПокрытия1;	
			ТД.ОбработкаПокрытие2 	= ТД.ОбработкаПокрытие1;	
		Иначе	
			ПоказатьПредупреждение(,"Не заполнен материал покрытия 1.");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Работа

&НаКлиенте
Процедура РаботаКоличествоПриИзменении(Элемент)
	РасчитатьСуммуРаботы();
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьСуммуРаботы()
	
	ТД = Элементы.Работа.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТД.Сумма = ТД.Количество * ТД.Цена;
	
КонецПроцедуры // РасчитатьСумму()

&НаСервере
Процедура ЗаполнитьРаботуНаСерверестДанные(мРабота)
	Объект.Работа.Очистить();
	
	тзНовыйДанныые = Новый ТаблицаЗначений;
	тзНовыйДанныые.Колонки.Добавить("Обработка",Новый ОписаниеТипов("СправочникСсылка.ВидыРабот"));
	тзНовыйДанныые.Колонки.Добавить("Штука",Новый ОписаниеТипов("Число"));
	тзНовыйДанныые.Колонки.Добавить("РазмерХ",Новый ОписаниеТипов("Число"));
	тзНовыйДанныые.Колонки.Добавить("РазмерУ",Новый ОписаниеТипов("Число"));
	тзНовыйДанныые.Колонки.Добавить("РазмерZ",Новый ОписаниеТипов("Число"));
		
	Для каждого текСтрока Из мРабота Цикл 
		ЗаполнитьЗначенияСвойств(тзНовыйДанныые.Добавить(), текСтрока);
	КонецЦикла; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(тзРабота.Обработка КАК Справочник.ВидыРабот) КАК Обработка,
		|	тзРабота.Штука КАК Штука,
		|	тзРабота.РазмерХ КАК РазмерХ,
		|	тзРабота.РазмерУ КАК РазмерУ,
		|	тзРабота.РазмерZ КАК РазмерZ
		|ПОМЕСТИТЬ втРабота
		|ИЗ
		|	&тзРабота КАК тзРабота
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыРаботРасценки.Расценка КАК Расценки,
		|	ВидыРаботРасценки.Расценка.ЦенаРаботы КАК Цена,
		|	ВидыРаботРасценки.ЧеловекоЧасы КАК ВремяНаРаботу,
		|	ВидыРаботРасценки.Расценка.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ВЫБОР
		|		КОГДА ВидыРаботРасценки.Расценка.ЕдиницыВидРаботы = ЗНАЧЕНИЕ(Перечисление.ВидыЕдиницДляРаботы.ПоОбъему)
		|			ТОГДА втРабота.РазмерХ * втРабота.РазмерУ * втРабота.РазмерZ / 1000000000 * ВидыРаботРасценки.Расценка.ЦенаРаботы
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВидыРаботРасценки.Расценка.ЕдиницыВидРаботы = ЗНАЧЕНИЕ(Перечисление.ВидыЕдиницДляРаботы.ПоПлощади)
		|					ТОГДА втРабота.РазмерХ * втРабота.РазмерУ / 1000000 * ВидыРаботРасценки.Расценка.ЦенаРаботы
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВидыРаботРасценки.Расценка.ЕдиницыВидРаботы = ЗНАЧЕНИЕ(Перечисление.ВидыЕдиницДляРаботы.ПоПериметру)
		|							ТОГДА втРабота.РазмерХ * втРабота.РазмерУ / 500000 * ВидыРаботРасценки.Расценка.ЦенаРаботы
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВидыРаботРасценки.Расценка.ЕдиницыВидРаботы = ЗНАЧЕНИЕ(Перечисление.ВидыЕдиницДляРаботы.ПоДлине)
		|									ТОГДА втРабота.РазмерХ / 1000 * ВидыРаботРасценки.Расценка.ЦенаРаботы
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВидыРаботРасценки.Расценка.ЕдиницыВидРаботы = ЗНАЧЕНИЕ(Перечисление.ВидыЕдиницДляРаботы.ПоШтучно)
		|											ТОГДА втРабота.Штука * ВидыРаботРасценки.Расценка.ЦенаРаботы
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВидыРаботРасценки.Расценка.ЕдиницыВидРаботы = ЗНАЧЕНИЕ(Перечисление.ВидыЕдиницДляРаботы.ПоОбъему)
		|			ТОГДА втРабота.РазмерХ * втРабота.РазмерУ * втРабота.РазмерZ / 1000000000
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВидыРаботРасценки.Расценка.ЕдиницыВидРаботы = ЗНАЧЕНИЕ(Перечисление.ВидыЕдиницДляРаботы.ПоПлощади)
		|					ТОГДА втРабота.РазмерХ * втРабота.РазмерУ / 1000000
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВидыРаботРасценки.Расценка.ЕдиницыВидРаботы = ЗНАЧЕНИЕ(Перечисление.ВидыЕдиницДляРаботы.ПоПериметру)
		|							ТОГДА втРабота.РазмерХ * втРабота.РазмерУ / 500000
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВидыРаботРасценки.Расценка.ЕдиницыВидРаботы = ЗНАЧЕНИЕ(Перечисление.ВидыЕдиницДляРаботы.ПоДлине)
		|									ТОГДА втРабота.РазмерХ / 1000
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВидыРаботРасценки.Расценка.ЕдиницыВидРаботы = ЗНАЧЕНИЕ(Перечисление.ВидыЕдиницДляРаботы.ПоШтучно)
		|											ТОГДА втРабота.Штука
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Количество,
		|	ВидыРаботРасценки.Ссылка.ПоказательЦены КАК ПоказательЦены,
		|	ВидыРаботРасценки.Ссылка.ПоказательРассчетаЦены КАК ПоказательРассчетаЦены,
		|	втРабота.Обработка.ЕдиницыВидРаботы КАК ОбработкаЕдиницыВидРаботы
		|ИЗ
		|	втРабота КАК втРабота
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыРабот.Расценки КАК ВидыРаботРасценки
		|		ПО втРабота.Обработка = ВидыРаботРасценки.Ссылка
		|ГДЕ
		|	втРабота.Обработка.ПоказательРассчетаЦены <> 2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРабота.Обработка КАК Расценки,
		|	втРабота.Штука КАК Штука,
		|	втРабота.РазмерХ КАК РазмерХ,
		|	втРабота.РазмерУ КАК РазмерУ,
		|	втРабота.РазмерZ КАК РазмерZ,
		|	втРабота.Обработка.ПоказательЦены КАК ПоказательЦены,
		|	втРабота.Обработка.ЕдиницыВидРаботы КАК ЕдиницыВидРаботы,
		|	0 КАК Цена,
		|	0 КАК Сумма,
		|	0 КАК Количество,
		|	втРабота.Обработка.СтатьяЗатрат КАК СтатьяЗатрат,
		|	втРабота.Обработка.ВремяНаРаботу КАК ВремяНаРаботу
		|ИЗ
		|	втРабота КАК втРабота
		|ГДЕ
		|	втРабота.Обработка.ПоказательРассчетаЦены = 2";
	
	
	Запрос.УстановитьПараметр("тзРабота",тзНовыйДанныые);
	
	Объект.Работа.Очистить();

	ПакетЗапроса = Запрос.ВыполнитьПакет();
	
	тзРезультатФиксЦена = ПакетЗапроса[2].Выгрузить();
	тзРезультат 		= ПакетЗапроса[1].Выгрузить();
	
	Для каждого Выборка Из тзРезультат Цикл
		
		Если Выборка.ПоказательРассчетаЦены = 1 Тогда
			
			Выборка.Цена 	= Выборка.Цена * (1 + Выборка.ПоказательЦены/100);	
			Выборка.Сумма 	= Выборка.Цена * Выборка.Количество;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Выборка Из тзРезультатФиксЦена Цикл
		
		
		Если Выборка.ЕдиницыВидРаботы = Перечисления.ВидыЕдиницДляРаботы.ПоДлине Тогда
			Выборка.Количество 	= Выборка.РазмерХ / 1000;	
			Выборка.Цена 		= Выборка.ПоказательЦены;	
			Выборка.Сумма 		= Выборка.Цена * Выборка.Количестао;	
		ИначеЕсли Выборка.ЕдиницыВидРаботы = Перечисления.ВидыЕдиницДляРаботы.ПоОбъему Тогда
			Выборка.Количество 	= Выборка.РазмерХ * Выборка.РазмерУ * Выборка.РазмерZ / 1000000000;	
			Выборка.Цена 		= Выборка.ПоказательЦены;	
			Выборка.Сумма 		= Выборка.Цена * Выборка.Количество;	
		ИначеЕсли Выборка.ЕдиницыВидРаботы = Перечисления.ВидыЕдиницДляРаботы.ПоПлощади Тогда
			Если Выборка.РазмерZ = 0 Тогда
				Выборка.Количество 	= Выборка.РазмерХ * Выборка.РазмерУ  / 1000000;	
				Выборка.Цена 		= Выборка.ПоказательЦены;	
				Выборка.Сумма 		= Выборка.Цена * Выборка.Количество;	
			Иначе
				Выборка.Количество	= (Выборка.РазмерХ * Выборка.РазмерУ + Выборка.РазмерХ * Выборка.РазмерZ + Выборка.РазмерZ * Выборка.РазмерУ) / 5000000;	
				Выборка.Цена 		= Выборка.ПоказательЦены;	
				Выборка.Сумма 		= Выборка.Цена * Выборка.Количество;	
			КонецЕсли;
		ИначеЕсли Выборка.ЕдиницыВидРаботы = Перечисления.ВидыЕдиницДляРаботы.ПоПериметру Тогда
			Выборка.Количество 	= (Выборка.РазмерХ + Выборка.РазмерУ) / 500;	
			Выборка.Цена 		= Выборка.ПоказательЦены;	
			Выборка.Сумма 		= Выборка.Цена * Выборка.Количество;	
		ИначеЕсли Выборка.ЕдиницыВидРаботы = Перечисления.ВидыЕдиницДляРаботы.ПоШтучно Тогда
			Выборка.Количество 	= Выборка.Штука;	
			Выборка.Цена 		= Выборка.ПоказательЦены;	
			Выборка.Сумма 		= Выборка.Цена * Выборка.Количество;	
		КонецЕсли;
		
	КонецЦикла;  
	
	тзРезультат.Свернуть("Расценки,СтатьяЗатрат,Цена","ВремяНаРаботу,Количество,Сумма");
	тзРезультатФиксЦена.Свернуть("Расценки,СтатьяЗатрат,Цена","ВремяНаРаботу,Количество,Сумма");
	
 	Объект.Работа.Загрузить(тзРезультат);
	
	Для каждого х Из тзРезультатФиксЦена Цикл
		ЗаполнитьЗначенияСвойств(Объект.Работа.Добавить(),х);
	КонецЦикла;
КонецПроцедуры // ЗаполнитьНоменклатуруНаСерверестДанные(мНоменклатура,Номенклатура)   

&НаКлиенте
Функция ПолучитьРаботуВДокументе()
	
	стВозврата = Новый Структура("Ошибка,мРабота","",Новый Массив);
	
	тзВидыРабот = ПолучитьВидыРабот();
	
	Для каждого текCтрока Из Объект.ДеталиЛистовые Цикл
		
		Если НЕ ЗначениеЗаполнено(текCтрока.ДлинаХ) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнена длина X у детали " + текCтрока.Деталь ,Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(текCтрока.ДлинаУ) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнена длина Y у детали " + текCтрока.Деталь ,Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ПустаяСтрока(стВозврата.Ошибка) Тогда
			Продолжить;	
		КонецЕсли;
		
		Если Объект.ОдинМатериалПокрытия Тогда
			Если ЗначениеЗаполнено(текCтрока.ОбработкаПокрытие1) Тогда
				ДобавитьВМассивОбработку(стВозврата.мРабота,текCтрока.ОбработкаПокрытие1,текCтрока.ДлинаХ, текCтрока.ДлинаУ,,1);	
				ДобавитьВМассивОбработку(стВозврата.мРабота,текCтрока.ОбработкаПокрытие1,текCтрока.ДлинаХ, текCтрока.ДлинаУ,,1);	
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(текCтрока.ОбработкаПокрытие1) Тогда
				ДобавитьВМассивОбработку(стВозврата.мРабота,текCтрока.ОбработкаПокрытие1,текCтрока.ДлинаХ, текCтрока.ДлинаУ,,1);	
			КонецЕсли;
			Если ЗначениеЗаполнено(текCтрока.ОбработкаПокрытие2) Тогда
				ДобавитьВМассивОбработку(стВозврата.мРабота,текCтрока.ОбработкаПокрытие2,текCтрока.ДлинаХ, текCтрока.ДлинаУ,,1);	
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого текCтрока Из Объект.ДеталиОбъемные Цикл
		
		Если НЕ ЗначениеЗаполнено(текCтрока.ДлинаХ) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнена длина X у детали " + текCтрока.Деталь ,Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(текCтрока.ДлинаУ) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнена длина Y у детали " + текCтрока.Деталь ,Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(текCтрока.ДлинаZ) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнена длина Z у детали " + текCтрока.Деталь ,Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ПустаяСтрока(стВозврата.Ошибка) Тогда
			Продолжить;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(текCтрока.Обработка) Тогда
			ДобавитьВМассивОбработку(стВозврата.мРабота,текCтрока.Обработка,текCтрока.ДлинаХ, текCтрока.ДлинаУ, текCтрока.ДлинаZ,1);	
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого текCтрока Из Объект.ДеталиПоганажные Цикл
		Если НЕ ЗначениеЗаполнено(текCтрока.Обработка) Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(текCтрока.ДлинаХ) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнена длина X у детали " + текCтрока.Деталь ,Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ПустаяСтрока(стВозврата.Ошибка) Тогда
			Продолжить;	
		КонецЕсли;
		
		ДобавитьВМассивОбработку(стВозврата.мРабота,текCтрока.Обработка,текCтрока.ДлинаХ,,,1);	
	
	КонецЦикла;
	
	Для каждого текCтрока Из Объект.ДеталиШтучные Цикл
		Если НЕ ЗначениеЗаполнено(текCтрока.Обработка) Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(текCтрока.Количество) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнено Количество у детали " + текCтрока.Номенклатура ,Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ПустаяСтрока(стВозврата.Ошибка) Тогда
			Продолжить;	
		КонецЕсли;
		
		ДобавитьВМассивОбработку(стВозврата.мРабота,текCтрока.Обработка,текCтрока.Количество,,,текCтрока.Количество);	
	
	КонецЦикла;
	
	Для каждого текCтрока Из Объект.ДеталиПрочие Цикл
		Если НЕ ЗначениеЗаполнено(текCтрока.Обработка) Тогда
			Продолжить;
		КонецЕсли;

		
		Если НЕ ЗначениеЗаполнено(текCтрока.Количество) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнено Количество у детали " + текCтрока.Номенклатура ,Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ПустаяСтрока(стВозврата.Ошибка) Тогда
			Продолжить;	
		КонецЕсли;
		
		ДобавитьВМассивОбработку(стВозврата.мРабота,текCтрока.Обработка,текCтрока.Количество,,,текCтрока.Количество);	
	
	КонецЦикла;
	
	Возврат стВозврата;
КонецФункции // ПолучитьНоменклатуруВДокументе()  

&НаСервере
Функция ПолучитьВидыРабот()

	

КонецФункции // ПолучитьВидыРабот()

#КонецОбласти

#Область Номенклатура

&НаСервере
Процедура ДобавитьНоменклатуруКомплекта(мНоменклатура)
	
	мОтборНомерклатура 					= Новый Массив;
	мОтборПредварительнаяНомерклатура 	= Новый Массив;
	
	мНовыйМассивНоменклатуры = Новый Массив; 
	
	ТипНоменклатура = Тип("СправочникСсылка.Номенклатура");
	
	Для каждого текНоменклатура Из мНоменклатура Цикл
		Если ТипЗнч(текНоменклатура.Номенклатура) = ТипНоменклатура Тогда
			мОтборНомерклатура.Добавить(текНоменклатура.Номенклатура);
		Иначе
		    мОтборПредварительнаяНомерклатура.Добавить(текНоменклатура.Номенклатура);
		КонецЕсли;
	КонецЦикла; 
	

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураКомплекты.Ссылка КАК Ссылка,
		|	НоменклатураКомплекты.Номенклатура КАК Номенклатура,
		|	НоменклатураКомплекты.Количество КАК Количество
		|ИЗ
		|	Справочник.Номенклатура.Комплекты КАК НоменклатураКомплекты
		|ГДЕ
		|	НоменклатураКомплекты.Ссылка В(&мОтборНомерклатура)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПредварительнаяНоменклатураКомплекты.Ссылка КАК Ссылка,
		|	ПредварительнаяНоменклатураКомплекты.Номенклатура КАК Номенклатура,
		|	ПредварительнаяНоменклатураКомплекты.Количество КАК Количество
		|ИЗ
		|	Справочник.ПредварительнаяНоменклатура.Комплекты КАК ПредварительнаяНоменклатураКомплекты
		|ГДЕ
		|	ПредварительнаяНоменклатураКомплекты.Ссылка В(&мОтборПредварительнаяНомерклатура)";
	
	Запрос.УстановитьПараметр("мОтборНомерклатура", мОтборНомерклатура);
	Запрос.УстановитьПараметр("мОтборПредварительнаяНомерклатура", мОтборПредварительнаяНомерклатура);
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	тзНоменклатура 					= РезультатПакет[0].Выгрузить();
	тзНоменклатура.Индексы.Добавить("Ссылка");

	тзПредварительнаяНоменклатура 	= РезультатПакет[1].Выгрузить();
	тзПредварительнаяНоменклатура.Индексы.Добавить("Ссылка");
	
	стОтбор = Новый Структура("Ссылка",);
	
	Для каждого текНоменклатура Из мНоменклатура Цикл
		стОтбор.Ссылка = текНоменклатура.Номенклатура; 
		
		Если ТипЗнч(текНоменклатура.Номенклатура) = ТипНоменклатура Тогда
			НайденыеСтроки = тзНоменклатура.НайтиСтроки(стОтбор);
		Иначе
			НайденыеСтроки = тзПредварительнаяНоменклатура.НайтиСтроки(стОтбор);
		КонецЕсли;

		Если НайденыеСтроки.Количество() = 0 Тогда
			стНоменклатура = Новый Структура("Номенклатура,Количество",текНоменклатура.Номенклатура,текНоменклатура.Количество);
			мНовыйМассивНоменклатуры.Добавить(стНоменклатура);
		Иначе
			Для каждого текНом Из НайденыеСтроки Цикл
				стНоменклатура = Новый Структура("Номенклатура,Количество",текНом.Номенклатура,текНоменклатура.Количество * текНом.Количество);
				мНовыйМассивНоменклатуры.Добавить(стНоменклатура);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	
	мНоменклатура = мНовыйМассивНоменклатуры;
КонецПроцедуры // ДобавитьНоменклатуруКомплекта()

&НаСервере
Процедура ЗаполнитьНоменклатуруНаСерверестДанные(мНоменклатура)
	Объект.Номенклатура.Очистить();
	
	тзНовыйДанные = Новый ТаблицаЗначений;
	тзНовыйДанные.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.ПредварительнаяНоменклатура"));
	тзНовыйДанные.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
		
	Для каждого текСтрока Из мНоменклатура Цикл
		ЗаполнитьЗначенияСвойств(тзНовыйДанные.Добавить(),текСтрока);
	КонецЦикла; 
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзНоменклатура.Номенклатура КАК Номенклатура,
		|	тзНоменклатура.Количество КАК Количество
		|ПОМЕСТИТЬ втНоменклатура
		|ИЗ
		|	&тзНоменклатура КАК тзНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втНоменклатура.Номенклатура КАК Номенклатура,
		|	спПредварительнаяНоменклатура.НормаРасхода КАК НормаРасхода,
		|	спПредварительнаяНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	втНоменклатура.Количество КАК Количество,
		|	спПредварительнаяНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	спПредварительнаяНоменклатура.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ЕСТЬNULL(ЦеныСметы.Цена, 0) КАК ЦенаРегистра
		|ИЗ
		|	втНоменклатура КАК втНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПредварительнаяНоменклатура КАК спПредварительнаяНоменклатура
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныСметы КАК ЦеныСметы
		|			ПО (ЦеныСметы.ПредварительнаяНоменклатура = спПредварительнаяНоменклатура.Ссылка)
		|				И (ЦеныСметы.ПредварительнаяСмета = &ПредварительнаяСмета)
		|		ПО втНоменклатура.Номенклатура = спПредварительнаяНоменклатура.Ссылка";
	
	
	Запрос.УстановитьПараметр("тзНоменклатура",тзНовыйДанные);
	Запрос.УстановитьПараметр("ПредварительнаяСмета",Объект.Ссылка);
	тзНовыйДанныые = Запрос.Выполнить().Выгрузить();
	
	тзКэшНормаРасхода = омНормыРасхода.ПолучитьПустуюТаблицуКэнНормыРасходов();
	
    Для каждого текСтрока Из тзНовыйДанныые Цикл
		НС = Объект.Номенклатура.Добавить();
		ЗаполнитьЗначенияСвойств(НС,текСтрока);
		Если НС.НормаРасхода = 0 Тогда
			НС.НормаРасхода = омНормыРасхода.ПолучитьНормуРасходаИзТипа(текСтрока.ТипНоменклатуры,тзКэшНормаРасхода);	
		КонецЕсли;
		
		Если НС.Цена = 0 Тогда
			НС.Цена 	= текСтрока.ЦенаРегистра;
			НС.Сумма 	= НС.Количество * НС.Цена * (1 + НС.НормаРасхода / 100);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьНоменклатуруНаСерверестДанные(мНоменклатура,Номенклатура)   

&НаКлиенте
Функция ПолучитьНоменклатуруВДокументе()
	
	стВозврата = Новый Структура("Ошибка,мНоменклатура,мВидыРабот","",Новый Массив,Новый Массив); 
	
	Для каждого текCтрока Из Объект.ДеталиЛистовые Цикл
		Если НЕ ЗначениеЗаполнено(текCтрока.Номенклатура) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнена номенклатура у детали " + текCтрока.Деталь ,Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(текCтрока.ДлинаХ) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнена длина X у детали " + текCтрока.Деталь ,Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(текCтрока.ДлинаУ) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнена длина Y у детали " + текCтрока.Деталь ,Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ПустаяСтрока(стВозврата.Ошибка) Тогда
			Продолжить;	
		КонецЕсли;
		
		ДобавитьВМассивНоменклатуры(стВозврата.мНоменклатура,текCтрока.Номенклатура,текCтрока.ДлинаХ * текCтрока.ДлинаУ / 1000000);
		
		Если ЗначениеЗаполнено(текCтрока.МатериалПокрытия1) Тогда
			Если Объект.ОдинМатериалПокрытия Тогда
				ДобавитьВМассивНоменклатуры(стВозврата.мНоменклатура,текCтрока.МатериалПокрытия1,текCтрока.ДлинаХ * текCтрока.ДлинаУ / 500000);
			Иначе
				ДобавитьВМассивНоменклатуры(стВозврата.мНоменклатура,текCтрока.МатериалПокрытия1,текCтрока.ДлинаХ * текCтрока.ДлинаУ / 1000000);
			КонецЕсли; 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(текCтрока.МатериалПокрытия2) И НЕ Объект.ОдинМатериалПокрытия Тогда
			ДобавитьВМассивНоменклатуры(стВозврата.мНоменклатура,текCтрока.МатериалПокрытия2,текCтрока.ДлинаХ * текCтрока.ДлинаУ / 1000000);
		КонецЕсли;
		
		Если Объект.ОдинМатериалПокрытия Тогда
			Если ЗначениеЗаполнено(текCтрока.ОбработкаПокрытие1) Тогда
				ДобавитьВМассивОбработку(стВозврата.мВидыРабот,текCтрока.ОбработкаПокрытие1,текCтрока.ДлинаХ,текCтрока.ДлинаУ);	
				ДобавитьВМассивОбработку(стВозврата.мВидыРабот,текCтрока.ОбработкаПокрытие1,текCтрока.ДлинаХ,текCтрока.ДлинаУ);	
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(текCтрока.ОбработкаПокрытие1) Тогда
				ДобавитьВМассивОбработку(стВозврата.мВидыРабот,текCтрока.ОбработкаПокрытие1,текCтрока.ДлинаХ,текCтрока.ДлинаУ);	
			КонецЕсли;
			Если ЗначениеЗаполнено(текCтрока.ОбработкаПокрытие2) Тогда
				ДобавитьВМассивОбработку(стВозврата.мВидыРабот,текCтрока.ОбработкаПокрытие2,текCтрока.ДлинаХ,текCтрока.ДлинаУ);	
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(текCтрока.ОбработкаДетали) Тогда
			ДобавитьВМассивОбработку(стВозврата.мВидыРабот,текCтрока.ОбработкаДетали,текCтрока.ДлинаХ,текCтрока.ДлинаУ);	
		КонецЕсли;
		
		Если НЕ Объект.ОднаКромка Тогда
			Если ЗначениеЗаполнено(текCтрока.КромкаХ1) Тогда                            
				ДобавитьВМассивНоменклатуры(стВозврата.мНоменклатура,текCтрока.КромкаХ1,текCтрока.ДлинаХ / 1000);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(текCтрока.КромкаХ2) Тогда                            
				ДобавитьВМассивНоменклатуры(стВозврата.мНоменклатура,текCтрока.КромкаХ2,текCтрока.ДлинаХ / 1000);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(текCтрока.КромкаУ1) Тогда                            
				ДобавитьВМассивНоменклатуры(стВозврата.мНоменклатура,текCтрока.КромкаУ1,текCтрока.ДлинаУ / 1000);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(текCтрока.КромкаУ2) Тогда                            
				ДобавитьВМассивНоменклатуры(стВозврата.мНоменклатура,текCтрока.КромкаУ2,текCтрока.ДлинаУ / 1000);
			КонецЕсли;
			
		Иначе	
			Если ЗначениеЗаполнено(текCтрока.КромкаХ1) Тогда                            
				ДобавитьВМассивНоменклатуры(стВозврата.мНоменклатура,текCтрока.КромкаХ1,(текCтрока.ДлинаХ + текCтрока.ДлинаУ) / 500);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого текCтрока Из Объект.ДеталиПоганажные Цикл
		Если НЕ ЗначениеЗаполнено(текCтрока.Номенклатура) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнена номенклатура у детали " + текCтрока.Деталь ,Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(текCтрока.ДлинаХ) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнена длина X у детали " + текCтрока.Деталь ,Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ПустаяСтрока(стВозврата.Ошибка) Тогда
			Продолжить;	
		КонецЕсли;
		
		ДобавитьВМассивНоменклатуры(стВозврата.мНоменклатура,текCтрока.Номенклатура,текCтрока.ДлинаХ / 1000);	
	
		Если ЗначениеЗаполнено(текCтрока.Обработка) Тогда
			ДобавитьВМассивОбработку(стВозврата.мВидыРабот,текCтрока.Обработка,текCтрока.ДлинаХ);	
		КонецЕсли;
	КонецЦикла;
	
	Для каждого текCтрока Из Объект.ДеталиШтучные Цикл
		Если НЕ ЗначениеЗаполнено(текCтрока.Номенклатура) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнена номенклатура в Детали штучные." ,Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(текCтрока.Количество) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнено Количество у детали " + текCтрока.Номенклатура ,Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ПустаяСтрока(стВозврата.Ошибка) Тогда
			Продолжить;	
		КонецЕсли;
		
		ДобавитьВМассивНоменклатуры(стВозврата.мНоменклатура,текCтрока.Номенклатура,текCтрока.Количество);	
	
		Если ЗначениеЗаполнено(текCтрока.Обработка) Тогда
			ДобавитьВМассивОбработку(стВозврата.мВидыРабот,текCтрока.Обработка,текCтрока.Количество);	
		КонецЕсли;
	КонецЦикла;
	
	Для каждого текCтрока Из Объект.ДеталиПрочие Цикл
		Если НЕ ЗначениеЗаполнено(текCтрока.Номенклатура) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнена номенклатура в Детали прочие.",Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(текCтрока.Количество) Тогда
			 ДобавитьСтроку(стВозврата.Ошибка,"Не заполнено Количество у детали " + текCтрока.Номенклатура ,Символы.ВК);
		КонецЕсли;		
		
		Если НЕ ПустаяСтрока(стВозврата.Ошибка) Тогда
			Продолжить;	
		КонецЕсли;
		
		ДобавитьВМассивНоменклатуры(стВозврата.мНоменклатура,текCтрока.Номенклатура,текCтрока.Количество);	
	
		Если ЗначениеЗаполнено(текCтрока.Обработка) Тогда
			ДобавитьВМассивОбработку(стВозврата.мВидыРабот,текCтрока.Обработка,текCтрока.Количество);	
		КонецЕсли;
	КонецЦикла;
	
	
	
	Возврат стВозврата;
КонецФункции // ПолучитьНоменклатуруВДокументе()  

&НаКлиенте
Процедура ДобавитьНоменклатуруОбработки(мНоменклатура,мВидыРабот)
 	мОбработка = Новый Массив;
	
	Для каждого текОбработка Из мВидыРабот Цикл
		Если мОбработка.Найти(текОбработка.Обработка) = Неопределено Тогда
			мОбработка.Добавить(текОбработка.Обработка);
		КонецЕсли;
	КонецЦикла;

    мОбработка = ДобавитьНоменклатуруОбработкиНаСервере(мОбработка);
	
	ПоДлине 	= ПредопределенноеЗначение("Перечисление.ВидыЕдиницДляРаботы.ПоДлине");
	ПоШтучно 	= ПредопределенноеЗначение("Перечисление.ВидыЕдиницДляРаботы.ПоШтучно");
	ПоОбъему 	= ПредопределенноеЗначение("Перечисление.ВидыЕдиницДляРаботы.ПоОбъему");
	ПоПлощади 	= ПредопределенноеЗначение("Перечисление.ВидыЕдиницДляРаботы.ПоПлощади");
	ПоПериметру = ПредопределенноеЗначение("Перечисление.ВидыЕдиницДляРаботы.ПоПериметру");
	
	Для каждого Выборка Из мОбработка Цикл
		Для каждого текCтрока Из мВидыРабот Цикл
			Если НЕ текCтрока.Обработка = Выборка.Обоработка Тогда
				Продолжить;
			КонецЕсли;
			
			Если Выборка.ЕдиницыВидРаботы = ПоПлощади Тогда
				Если текCтрока.РазмерZ = 0 Тогда
					ДобавитьВМассивНоменклатуры(мНоменклатура,Выборка.Номенклатура,Выборка.Количество * текCтрока.РазмерХ * текCтрока.РазмерУ / 1000000);
				Иначе
					ПлощадьПоверхности = (текCтрока.РазмерХ * текCтрока.РазмерУ + текCтрока.РазмерХ * текCтрока.РазмерZ + текCтрока.РазмерZ * текCтрока.РазмерУ) / 500000;
					ДобавитьВМассивНоменклатуры(мНоменклатура,Выборка.Номенклатура,Выборка.Количество * ПлощадьПоверхности);
				КонецЕсли;
			ИначеЕсли Выборка.ЕдиницыВидРаботы = ПоПериметру Тогда
				Если текCтрока.ДлинаZ = 0 Тогда
					ДобавитьВМассивНоменклатуры(мНоменклатура,Выборка.Номенклатура,Выборка.Количество * (текCтрока.РазмерХ + текCтрока.РазмерУ) / 500);
				Иначе
					ДобавитьВМассивНоменклатуры(мНоменклатура,Выборка.Номенклатура,Выборка.Количество * (текCтрока.РазмерХ + текCтрока.РазмерУ + текCтрока.РазмерZ) / 250);
				КонецЕсли;
			ИначеЕсли Выборка.ЕдиницыВидРаботы = ПоДлине Тогда	
				ДобавитьВМассивНоменклатуры(мНоменклатура,Выборка.Номенклатура, Выборка.Количество * текCтрока.РазмерХ / 1000000);
			ИначеЕсли Выборка.ЕдиницыВидРаботы = ПоШтучно Тогда	
				ДобавитьВМассивНоменклатуры(мНоменклатура,Выборка.Номенклатура, Выборка.Количество);
			ИначеЕсли Выборка.ЕдиницыВидРаботы = ПоОбъему Тогда	
				ДобавитьВМассивНоменклатуры(мНоменклатура,Выборка.Номенклатура, (текCтрока.РазмерХ * текCтрока.РазмерУ * текCтрока.РазмерZ / 1000000000) * Выборка.Количество);
			КонецЕсли;
		
		КонецЦикла;
	КонецЦикла;
	

КонецПроцедуры // ДобавитьНоменклатуруОбработки()


&НаСервереБезКонтекста
Функция ДобавитьНоменклатуруОбработкиНаСервере(мВидыРабот)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыРаботМатериалы.Ссылка КАК Обоработка,
		|	ВидыРаботМатериалы.Номенклатура КАК Номенклатура,
		|	ВидыРаботМатериалы.ЕдиницыВидРаботы КАК ЕдиницыВидРаботы,
		|	ВидыРаботМатериалы.Количество КАК Количество
		|ИЗ
		|	Справочник.ВидыРабот.Материалы КАК ВидыРаботМатериалы
		|ГДЕ
		|	ВидыРаботМатериалы.Ссылка В(&мВидыРабот)";
	
	Запрос.УстановитьПараметр("мВидыРабот", мВидыРабот);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции // ДобавитьНоменклатуруОбработки()


&НаКлиенте
Процедура ДобавитьВМассивНоменклатуры(мНоменклатураДокумента,Номенклатура,Количество)

	Для каждого текЭлемент Из мНоменклатураДокумента Цикл
		Если текЭлемент.Номенклатура = Номенклатура Тогда
			текЭлемент.Количество = текЭлемент.Количество + Количество;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	мНоменклатураДокумента.Добавить(Новый Структура("Номенклатура,Количество",Номенклатура,Количество));

КонецПроцедуры // ДобавитьВМассивНоменклатуры()

&НаКлиенте
Процедура ДобавитьВМассивОбработку(мОбработкаДокумента,Обработка,РазмерХ,РазмерУ = 0,РазмерZ = 0,Штука = 0)


	мОбработкаДокумента.Добавить(Новый Структура("Обработка,РазмерХ,РазмерУ,РазмерZ,Штука",Обработка,РазмерХ,РазмерУ,РазмерZ,Штука));

КонецПроцедуры // ДобавитьВМассивОбработку()

//
&НаСервереБезКонтекста
Функция ПолучитьОсновнуюОбработку(Материал)

	Возврат Материал.ВидРаботыОсновной;	

КонецФункции // ПолучитьОсновнуюОбработку()


#КонецОбласти 

#Область Картинка

&НаСервереБезКонтекста
функция ВывестиКартинкуНаСервере(ИзделиеЗаказчика)

	КлючКартинки = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартинкиНоменклатуры.Картинка КАК КлючКартинки
		|ИЗ
		|	РегистрСведений.КартинкиНоменклатуры КАК КартинкиНоменклатуры
		|ГДЕ
		|	КартинкиНоменклатуры.ИзделиеЭлемент = &ИзделиеЭлемент";
	
	Запрос.УстановитьПараметр("ИзделиеЭлемент", ИзделиеЗаказчика);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		КлючКартинки = Выборка.КлючКартинки;
	КонецЦикла;
	
	Если ПустаяСтрока(КлючКартинки) Тогда
		Возврат КлючКартинки;	
	КонецЕсли;

	КлючКартинки = РегистрыСведений.КартинкиНоменклатуры.СоздатьКлючЗаписи(Новый Структура("ИзделиеЭлемент", ИзделиеЗаказчика));
	Возврат ПолучитьНавигационнуюСсылку(КлючКартинки, "Картинка");
КонецФункции // ВывестиКартинкуНаСервере()

&НаКлиенте
Процедура ВидимостьВкладкиКартинка()
	
	Элементы.ГруппаКартинка.Видимость = ЗначениеЗаполнено(ЭтаФорма.АдресКартинки);

КонецПроцедуры // ВывестиКартинку()

#КонецОбласти 

#Область Актуальность 

&НаКлиенте
Процедура ДоступностьАктуальности()
	
	Если ЗначениеЗаполнено(Объект.Изделие) Тогда
		Если КоличествоСметИзделия(Объект.Изделие, Объект.Ссылка) = 0 Тогда
			Элементы.АктуальнаяСмета.ТолькоПросмотр = Истина;
			ЭтаФорма.АктуальнаяСмета 				= Истина;
		Иначе
			Элементы.АктуальнаяСмета.ТолькоПросмотр = Ложь;
		КонецЕсли;
	Иначе
		Элементы.АктуальнаяСмета.ТолькоПросмотр = Истина;
		ЭтаФорма.АктуальнаяСмета 				= Ложь;
	КонецЕсли;

КонецПроцедуры // ДоступностьАктуальности()


&НаСервереБезКонтекста
Процедура ЗаписатьАктуальностьНаСервере(Ссылка,ИздельеЗаказчика,АктуальнаяСмета,НачальноеЗначениеИзделияЗаказчика)
	
	НаборЗаписей = РегистрыСведений.АктуальныеСметы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИздельеЗаказчика.Установить(ИздельеЗаказчика);
	
	Если АктуальнаяСмета Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ИзделиеЭлемент = ИздельеЗаказчика;
		НоваяЗапись.Смета = Ссылка;
	КонецЕсли; 
	
	НаборЗаписей.Записать();
КонецПроцедуры // ЗаписатьАктуальностьНаСервере(Ссылка,Изделие,АктуальнаяСмета)

&НаСервереБезКонтекста
Функция КоличествоСметИзделия(ИздельеЗаказчика,Смета)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АктуальныеСметы.Смета) КАК Смета
		|ИЗ
		|	РегистрСведений.АктуальныеСметы КАК АктуальныеСметы
		|ГДЕ
		|	АктуальныеСметы.ИзделиеЭлемент = &ИзделиеЭлемент
		|	И АктуальныеСметы.Смета <> &Смета";
	
	Запрос.УстановитьПараметр("ИзделиеЭлемент", ИздельеЗаказчика);
	Запрос.УстановитьПараметр("Смета", Смета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Смета;
	КонецЦикла;
	
	Возврат 0;
КонецФункции // КоличествоСметИзделия()

&НаСервере
Процедура ПроверитьАктуальность()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктуальныеСметы.ИзделиеЭлемент КАК ИзделиеЭлемент
		|ИЗ
		|	РегистрСведений.АктуальныеСметы КАК АктуальныеСметы
		|ГДЕ
		|	АктуальныеСметы.Смета = &Смета";
	
	Запрос.УстановитьПараметр("Смета", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.АктуальнаяСмета = Истина;
	КонецЦикла;

КонецПроцедуры // ПроверитьАктуальность()


	
#КонецОбласти

&НаКлиенте
Процедура ИспользоватьОднуКромку()

	Если Объект.ОднаКромка Тогда
		Элементы.ДеталиЛистовыеКромкаХ1.Заголовок = "Кромка со всех сторон";
		Элементы.ДеталиЛистовыеКромкаХ2.Видимость = Ложь;
		Элементы.ДеталиЛистовыеКромкаУ1.Видимость = Ложь;
		Элементы.ДеталиЛистовыеКромкаУ2.Видимость = Ложь;
		Элементы.ОдинаковаяКромка.Видимость 	  = Ложь;
	Иначе
		Элементы.ДеталиЛистовыеКромкаХ1.Заголовок = "Кромка X1";
		Элементы.ДеталиЛистовыеКромкаХ2.Видимость = Истина;
		Элементы.ДеталиЛистовыеКромкаУ1.Видимость = Истина;
		Элементы.ДеталиЛистовыеКромкаУ2.Видимость = Истина;
		Элементы.ОдинаковаяКромка.Видимость 	  = Истина;
	КонецЕсли;	

КонецПроцедуры // ИспользоватьОднуКромку()

&НаКлиенте
Процедура ИспользоватьОдинМатериал()

	Если Объект.ОдинМатериалПокрытия Тогда
		Элементы.ДеталиЛистовыеМатериалПокрытия1.Заголовок 	= "Материал покрытия с двух сторон";
		Элементы.ДеталиЛистовыеМатериалПокрытия2.Видимость 	= Ложь;
		Элементы.ДеталиЛистовыеОбработкаПокрытие2.Видимость = Ложь;
		Элементы.ОдинаковыйМатериалПокрытия.Видимость		= Ложь;
	Иначе
		Элементы.ДеталиЛистовыеМатериалПокрытия1.Заголовок 	= "Материал покрытия1";
		Элементы.ДеталиЛистовыеМатериалПокрытия2.Видимость 	= Истина;
		Элементы.ДеталиЛистовыеОбработкаПокрытие2.Видимость = Истина;
		Элементы.ОдинаковыйМатериалПокрытия.Видимость		= Истина;
	КонецЕсли;	

КонецПроцедуры // ИспользоватьОднуКромку()

&НаКлиенте
Процедура ЗаголовкиЗакладок(ИмяЗакладки = "")

	Если ИмяЗакладки = "" Тогда
		омОформлениеФормы.ЗаголовокЗакладки(Элементы,"ГруппаДеталиЛистовые"		,"Детали листовые"	,Объект.ДеталиЛистовые);
		омОформлениеФормы.ЗаголовокЗакладки(Элементы,"ГруппаДеталиПоганажные"	,"Детали поганажные",Объект.ДеталиПоганажные);
		омОформлениеФормы.ЗаголовокЗакладки(Элементы,"ГруппаДеталиШтучные"		,"Детали штучные"	,Объект.ДеталиШтучные);
	ИначеЕсли ИмяЗакладки = "Детали листовые" Тогда
		омОформлениеФормы.ЗаголовокЗакладки(Элементы,"ГруппаДеталиЛистовые"	,ИмяЗакладки,Объект.ДеталиЛистовые);
	ИначеЕсли ИмяЗакладки = "Детали поганажные" Тогда
		омОформлениеФормы.ЗаголовокЗакладки(Элементы,"ГруппаДеталиПоганажные"	,ИмяЗакладки,Объект.ДеталиПоганажные);
	ИначеЕсли ИмяЗакладки = "Детали штучные" Тогда
		омОформлениеФормы.ЗаголовокЗакладки(Элементы,"ГруппаДеталиШтучные"		,ИмяЗакладки,Объект.ДеталиШтучные);
	КонецЕсли;

КонецПроцедуры // ЗаголовкиЗакладок()

&НаКлиенте
Функция ДобавитьСтроку(ИсходнаяСтрока,ДополняемаяСтрока,Резделитель = ",")

	Если НЕ ПустаяСтрока(ИсходнаяСтрока) Тогда
		
		ИсходнаяСтрока = ИсходнаяСтрока + Резделитель;	
		
	КонецЕсли;
	
	ИсходнаяСтрока = ИсходнаяСтрока + ДополняемаяСтрока;	
	

КонецФункции // ДобавитьСтроку()

&НаКлиенте
Процедура ПроверкаВозможностиИзмененияЦены()
	мРучныеДобавления 	= Новый Массив;		
	мАвтоРасчет 		= Новый Массив;
	
	Для каждого х Из Объект.Номенклатура Цикл
		Если х.РучноеДобавление Тогда
			мРучныеДобавления.Добавить(х.Номенклатура);
		Иначе
			стДанные = Новый Структура("Номенклатура,Цена", );
			ЗаполнитьЗначенияСвойств(стДанные,х);
			мАвтоРасчет.Добавить(стДанные);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого х Из мАвтоРасчет Цикл
		Если мРучныеДобавления.Найти(х.Номенклатура) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для каждого у Из Объект.Номенклатура Цикл
			Если у.РучноеДобавление И у.Номенклатура = х.Номенклатура Тогда
				у.Цена = х.Цена;
				РасчитатьСуммуНоменклатуры(у);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры // ПроверкаВозможностиИзмененияЦены()


&НаКлиенте
Процедура РасчитатьСуммуНоменклатуры(текСтрока = Неопределено, РасчитатьЦену = Ложь)
	
	Если текСтрока = Неопределено Тогда
		ТД = Элементы.Номенклатура.ТекущиеДанные;
		
		Если ТД = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		ТД = текСтрока;	
	КонецЕсли;
	
	Если РасчитатьЦену Тогда
	    Если ТД.Количество = 0 Тогда
			ТД.Цена = ТД.Сумма;
		Иначе
			текКоличество = (ТД.Количество + (ТД.Количество * ТД.НормаРасхода / 100));
			ТД.Цена = ?(текКоличество = 0, ТД.Сумма, ТД.Сумма / текКоличество); 
		КонецЕсли;
	Иначе
		ТД.Сумма = (ТД.Количество + (ТД.Количество * ТД.НормаРасхода / 100)) * ТД.Цена;
	КонецЕсли;
	
КонецПроцедуры // РасчитатьСумму()


&НаСервереБезКонтекста
Функция ПолучитьПараметрыНоменклатуры(ПредварительнаяНоменклатура)
	стДанные = Новый Структура("ЕдиницаИзмерения,НормаРасхода,СтатьяЗатрат,ТипНоменклатуры",);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредварительнаяНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ПредварительнаяНоменклатура.НормаРасхода КАК НормаРасхода,
		|	ПредварительнаяНоменклатура.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ПредварительнаяНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры
		|ИЗ
		|	Справочник.ПредварительнаяНоменклатура КАК ПредварительнаяНоменклатура
		|ГДЕ
		|	ПредварительнаяНоменклатура.Ссылка = &ПредварительнаяНоменклатура";
	
	Запрос.УстановитьПараметр("ПредварительнаяНоменклатура", ПредварительнаяНоменклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стДанные,Выборка);
	КонецЦикла;
	
    Возврат стДанные;
КонецФункции // ПолучитьПараметрыНоменклатуры(Номенклатура)

&НаСервереБезКонтекста
Процедура СохранитьЦены(Изделие,ПредварительнаяСмета,мНоменклатура)
	
	Сделка = Изделие.Проект;
	
	НаборЗаписей = РегистрыСведений.ЦеныСметы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сделка.Установить(Сделка);
	НаборЗаписей.Отбор.ПредварительнаяСмета.Установить(ПредварительнаяСмета);
	
	мНоменклатураПредворительная = Новый Массив;
	
	Для каждого стНоменклатура Из мНоменклатура Цикл
	
		НоваяЗапись = НаборЗаписей.Добавить();  
		НоваяЗапись.Цена						= стНоменклатура.Цена; 
		НоваяЗапись.проект 						= Сделка;
		НоваяЗапись.ПредварительнаяСмета 		= ПредварительнаяСмета;
		НоваяЗапись.ПредварительнаяНоменклатура = стНоменклатура.Номенклатура;
		
		мНоменклатураПредворительная.Добавить(стНоменклатура.Номенклатура);
	КонецЦикла;
	
    НаборЗаписей.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураПроекта.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.НоменклатураПроекта КАК НоменклатураПроекта
		|ГДЕ
		|	НоменклатураПроекта.Проект = &Проект
		|	И НоменклатураПроекта.Номенклатура В(&Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", мНоменклатураПредворительная);
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		мНоменклатураПредворительная.Удалить(мНоменклатураПредворительная.Найти(Выборка.Номенклатура));
	КонецЦикла;
	
	Для каждого текНоменклатураПредворительная Из мНоменклатураПредворительная Цикл
		Цена = 0;
		Для каждого стНоменклатура Из мНоменклатура Цикл
			Если текНоменклатураПредворительная = стНоменклатура.Номенклатура Тогда
				Цена = стНоменклатура.Цена;
				Прервать;	
			КонецЕсли;
		КонецЦикла;	
		
	    Если Цена = 0 Тогда
			Продолжить;	
		КонецЕсли; 
		
		МенеджерЗаписи = РегистрыСведений.НоменклатураПроекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номенклатура = текНоменклатураПредворительная;
		МенеджерЗаписи.Проект = Сделка;
		МенеджерЗаписи.Цена = Цена;
		
		МенеджерЗаписи.Записать();
		

	КонецЦикла;
	
КонецПроцедуры // СохранитьЦены()


&НаСервере
Процедура ЗаполнитьЦены()
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныПредварительнойСметы.ПредварительнаяНоменклатура КАК Номенклатура,
		|	ЦеныПредварительнойСметы.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныСметы КАК ЦеныПредварительнойСметы
		|ГДЕ
		|	ЦеныПредварительнойСметы.ПредварительнаяСмета = &ПредварительнаяСмета";
	
	Запрос.УстановитьПараметр("ПредварительнаяСмета", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Для каждого текНоменклатура Из Объект.Номенклатура Цикл
			Если текНоменклатура.Номенклатура = Выборка.Номенклатура Тогда
				текНоменклатура.Цена = Выборка.Цена;	
				текНоменклатура.Сумма = (текНоменклатура.Количество + (текНоменклатура.Количество * текНоменклатура.НормаРасхода / 100)) * Выборка.Цена;	
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	

КонецПроцедуры // ЗаполнитьЦены()

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОДетале(ТипНоменклатуры, Деталь)

 	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Листовая Тогда
		стВозврата = Новый Структура("Деталь,ДлинаХ,ДлинаУ,Номенклатура,МатериалПокрытия1,МатериалПокрытия2,КромкаХ1,КромкаХ2,КромкаУ1,КромкаУ2,ОбработкаПокрытие1,ОбработкаПокрытие2"
		,"",0,0 );	
	Иначе
		стВозврата = Новый Структура("Деталь,ДлинаХ,Номенклатура,Обработка"
		,"",0,0 );	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДеталиИзделияЭлемент.Наименование КАК Деталь,
		|	ДеталиИзделияЭлемент.ДлинаХ КАК ДлинаХ,
		|	ДеталиИзделияЭлемент.ДлинаУ КАК ДлинаУ,
		|	ДеталиИзделияЭлемент.Номенклатура КАК Номенклатура,
		|	ДеталиИзделияЭлемент.МатериалПокрытия1 КАК МатериалПокрытия1,
		|	ДеталиИзделияЭлемент.МатериалПокрытия2 КАК МатериалПокрытия2,
		|	ДеталиИзделияЭлемент.КромкаХ1 КАК КромкаХ1,
		|	ДеталиИзделияЭлемент.КромкаХ2 КАК КромкаХ2,
		|	ДеталиИзделияЭлемент.КромкаУ1 КАК КромкаУ1,
		|	ДеталиИзделияЭлемент.КромкаУ2 КАК КромкаУ2,
		|	ДеталиИзделияЭлемент.ОбработкаПокрытие1 КАК ОбработкаПокрытие1,
		|	ДеталиИзделияЭлемент.ОбработкаПокрытие2 КАК ОбработкаПокрытие2,
		|	ДеталиИзделияЭлемент.Обработка КАК Обработка
		|ИЗ
		|	Справочник.ДеталиИзделияЭлемент КАК ДеталиИзделияЭлемент
		|ГДЕ
		|	ДеталиИзделияЭлемент.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Деталь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата, Выборка);
	КонецЦикла;
	
    Возврат стВозврата;

КонецФункции // ПолучитьИнформациюОДетале()

&НаКлиенте
Функция ТекущаяСтрокаРучная(ЭлементТаблица, ТД = Неопределено)

	ТД = ЭлементТаблица.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
    Возврат ТД.РучноеДобавление;
КонецФункции // ТекущаяСтрокаРучная()


&НаКлиенте
Процедура НоменклатураЦенаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТД = Элемент.Родитель.ТекущиеДанные;
	
	Номенклатура = ТД.Номенклатура;
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) ИЛИ НЕ ЗначениеЗаполнено(Объект.Изделие) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДопПараметры = Новый Структура("ТекущаяСтрокаТаблицы", ТД);
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораЦеныНоменклатуры",ЭтаФорма,ДопПараметры);
	
	стПараметры = Новый Структура("Номенклатура,ИзделиеЭлемент",Номенклатура, Объект.Изделие);
	
	ОткрытьФорму("Документ.ПредварительнаяСмета.Форма.ФормаВыборЦены",стПараметры,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораЦеныНоменклатуры(Результат,ДопПараметры) Экспорт

	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;	
	
	ТД = ДопПараметры.ТекущаяСтрокаТаблицы;
	ТД.Цена = Результат;
	ТД.Сумма = (ТД.Количество + (ТД.Количество * ТД.НормаРасхода / 100)) * ТД.Цена;	
	
КонецПроцедуры // ПослеВыбораЦеныНоменклатуры()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
    // СтандартныеПодсистемы.РаботаСФайлами
    РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
    // Конец СтандартныеПодсистемы.РаботаСФайлами
КонецПроцедуры

#Область СтандартныеПодсистемы_РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
     РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
     РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
     РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
     РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры



// Конец СтандартныеПодсистемы.РаботаСФайлами

#КонецОбласти