Функция ПолучитьТаймингКомплектов(Комплект) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингКомплекта.Период КАК ДатаНачала,
		|	ТаймингКомплекта.Автор КАК Автор,
		|	ТаймингКомплекта.Статус КАК Статус,
		|	СтадииКомплектаРеквизитыСтадии.Ссылка КАК Стадия,
		|	ВЫБОР
		|		КОГДА ТаймингКомплекта.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ПустаяСсылка)
		|			ТОГДА ТаймингКомплекта.ОписаниеДействия
		|		ИНАЧЕ СтадииКомплектаРеквизитыСтадии.Ссылка.ПолноеНаименование
		|	КОНЕЦ КАК СтадияНаименование,
		|	ТаймингКомплекта.ВСоставеКомпозиции КАК ВСоставеКомпозиции,
		|	ТаймингКомплекта.ДатаОтказаСогласования КАК ДатаОтказаСогласования,
		|	ТаймингКомплекта.ДатаОтправкиСогласования КАК ДатаОтправкиСогласования,
		|	ТаймингКомплекта.ДатаСогласования КАК ДатаСогласования,
		|	ТаймингКомплекта.ОписаниеДействия КАК ОписаниеДействия
		|ИЗ
		|	РегистрСведений.ТаймингКомплекта КАК ТаймингКомплекта
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|		ПО ТаймингКомплекта.Статус = СтадииКомплектаРеквизитыСтадии.Статус
		|			И (НЕ ТаймингКомплекта.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ПустаяСсылка))
		|ГДЕ
		|	ТаймингКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Возврат  Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТаймингКомплектов()      
