Функция ПолучитьТаймингКомплектов(Комплект) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингКомплекта.Период КАК ДатаНачала,
		|	ТаймингКомплекта.Автор КАК Автор,
		|	ТаймингКомплекта.Статус КАК Статус,
		|	СтадииКомплектаРеквизитыСтадии.Ссылка КАК Стадия,
		|	СтадииКомплектаРеквизитыСтадии.Ссылка.ПолноеНаименование КАК СтадияНаименование
		|ИЗ
		|	РегистрСведений.ТаймингКомплекта КАК ТаймингКомплекта
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплектаРеквизитыСтадии
		|		ПО ТаймингКомплекта.Статус = СтадииКомплектаРеквизитыСтадии.Статус
		|ГДЕ
		|	ТаймингКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Возврат  Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТаймингКомплектов()      
