
&НаКлиенте
Процедура ПолеКартинкиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеКартинкиОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеКартинкиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриВставкеИзБуфераОбмена(Значение, СтандартнаяОбработка)
	
	ВставитьКартинкуИзБуфера(Значение); 
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзБуфера(Команда)    
	
	ПриВставкеИзБуфераОбменаКартинки(); 
	
КонецПроцедуры

&НаКлиенте
Асинх Функция ПриВставкеИзБуфераОбменаКартинки()
    Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
        ФорматКартинка = СтандартныйФорматДанныхБуфераОбмена.Картинка;
        Если Ждать СредстваБуфераОбмена.ПоддерживаетсяФорматДанных(ФорматКартинка) Тогда
			КартинкаИзБуфера = Ждать СредстваБуфераОбмена.ПолучитьДанныеАсинх(ФорматКартинка);
			ВставитьКартинкуИзБуфера(КартинкаИзБуфера);
        КонецЕсли;
    КонецЕсли;                                                                                                                 
КонецФункции


&НаКлиенте
Процедура ВставитьКартинкуИзБуфера(КартинкаИзБуфера)
	
	Если ТипЗнч(КартинкаИзБуфера) = Тип("Картинка") Тогда
		
		ПутьККартинке = КаталогВременныхФайлов()+"screen.jpg";
		КартинкаИзБуфера.Записать(ПутьККартинке); 
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ПутьККартинке);    	
		АдресКартинки = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор); 
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Сообщить(ПараметрыПеретаскивания.Значение.Файл.Имя);
КонецПроцедуры

