
&НаКлиенте
Процедура ПолеКартинкиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеКартинкиОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеКартинкиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриВставкеИзБуфераОбмена(Значение, СтандартнаяОбработка)
	
	ВставитьКартинкуИзБуфера(Значение); 
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура КартинкаИзБуфера(Команда)    
	
	Картинка = Ждать ПриВставкеИзБуфераОбменаКартинки(); 
	ВставитьКартинкуИзБуфера(Картинка);  
	
КонецПроцедуры

&НаКлиенте
Асинх Функция ПриВставкеИзБуфераОбменаКартинки()
	
    Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
        ФорматДанных = СтандартныйФорматДанныхБуфераОбмена.Картинка;
        Если Ждать СредстваБуфераОбмена.ПоддерживаетсяФорматДанных(ФорматДанных) Тогда
			Возврат Ждать СредстваБуфераОбмена.ПолучитьДанныеАсинх(ФорматДанных);
        КонецЕсли;
    КонецЕсли;                                                                                                                 
КонецФункции

	
		                                                                                                                        
&НаКлиенте
Процедура ВставитьКартинкуИзБуфера(Картинка)
	
	Если ТипЗнч(Картинка) = Тип("Картинка") Тогда
		ПутьККартинке = КаталогВременныхФайлов()+"screen.jpg";
		Картинка.Записать(ПутьККартинке); 
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ПутьККартинке);    	
		Скриншот = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор); 
	КонецЕсли;	
	
КонецПроцедуры