
&НаКлиенте
Процедура ПолеКартинкиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеКартинкиОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеКартинкиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриВставкеИзБуфераОбмена(Значение, СтандартнаяОбработка)
	
	ВставитьКартинкуИзБуфера(Значение); 
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура КартинкаИзБуфера(Команда)    
	
	ЗначениеКартинка = Ждать ПриВставкеИзБуфераОбменаКартинки(); 
	ВставитьКартинкуИзБуфера(ЗначениеКартинка);  
	
КонецПроцедуры

&НаКлиенте
Асинх Функция ПриВставкеИзБуфераОбменаКартинки()
	
    Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
        ФорматДанных = СтандартныйФорматДанныхБуфераОбмена.Картинка;
        Если Ждать СредстваБуфераОбмена.ПоддерживаетсяФорматДанных(ФорматДанных) Тогда
			ЗначениеКартинка = Ждать СредстваБуфераОбмена.ПолучитьДанныеАсинх(ФорматДанных);
			Возврат ЗначениеКартинка;
        КонецЕсли;
    КонецЕсли;                                                                                                                 
КонецФункции

&НаКлиенте
Процедура ВставитьКартинкуИзБуфера(ЗначениеКартинка)
	
	Если ТипЗнч(ЗначениеКартинка) = Тип("Картинка") Тогда
		ПутьККартинке = КаталогВременныхФайлов()+"screen.jpg";
		ЗначениеКартинка.Записать(ПутьККартинке); 
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ПутьККартинке);    	
		Картинка = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УИДПервойФормы); 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Сообщить(ПараметрыПеретаскивания.Значение.Файл.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	Закрыть(Картинка);
КонецПроцедуры


Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УИДПервойФормы 	= Параметры.УИДПервойФормы;
КонецПроцедуры



