

//Колонки ДанныеКомментария Автор, Дата, Текст, ТипКомментария
Функция Получить_HTML_комментарий(ДанныеКомментария, СтрокаСортировки = "") Экспорт
	
	Если НЕ ПустаяСтрока(СтрокаСортировки) Тогда
		
		ДанныеКомментария.Сортировать(СтрокаСортировки);	
		
	КонецЕсли;
	
	стрВозврата = омHTML.ПолучитьЗаголовокHTML();
	
	стрВозврата = стрВозврата + "<table>";
	стрВозврата = стрВозврата + "<tr><td>Дата</td><td>Текст</td><td>Автор</td><td>Тип</td></tr>";
	
	ШаблонСтроки = "<tr><td>%1</td><td>%2</td><td>%3</td><td>%4</td></tr>";
	
	Для каждого СтрокаТаблицы Из ДанныеКомментария Цикл
		стрВозврата = стрВозврата + СтрШаблон(ШаблонСтроки, Формат(СтрокаТаблицы.Дата, "ДФ=dd.MM.yy"), СтрокаТаблицы.Текст, СтрокаТаблицы.Автор, СтрокаТаблицы.ТипКомментария);	
	КонецЦикла;
	
	стрВозврата = стрВозврата + "</table>";
	
	стрВозврата = стрВозврата + омHTML.ПолучитьХвостHTML();
	
	Возврат стрВозврата;
	
	
	
КонецФункции // Получить_HTML_комментарий()
