

//Колонки ДанныеКомментария Автор, Дата, Текст, ТипКомментария
Функция Получить_HTML_комментарий(ДанныеКомментария, ОтображатьТип = Ложь, СтрокаСортировки = "") Экспорт
	
	Если НЕ ПустаяСтрока(СтрокаСортировки) Тогда
		
		ДанныеКомментария.Сортировать(СтрокаСортировки);	
		
	КонецЕсли;
	
	стрВозврата = омHTML.ПолучитьЗаголовокHTML();
	стрВозврата = стрВозврата + омHTML.ПолучитьHeadHTML("", 3);
	
	стрВозврата = стрВозврата + "<table>";
	стрВозврата = стрВозврата + "<tr><th style=""min-width: 70px;"">Дата</th><th>Текст</th><th style=""min-width: 65px;"">Автор</th>";
	
	Если ОтображатьТип Тогда
		стрВозврата = стрВозврата + "<th>Тип</th></tr>";
		ШаблонСтроки = "<tr><td>%1</td><td>%2</td><td>%3</td><td>%4</td></tr>";
	Иначе
		стрВозврата = стрВозврата + "</tr>";
		ШаблонСтроки = "<tr><td>%1</td><td>%2</td><td>%3</td></tr>";
	КонецЕсли; 
	
	
	Для каждого СтрокаТаблицы Из ДанныеКомментария Цикл
		
		ТестСообщения = СтрЗаменить(СтрокаТаблицы.Текст, "&", "&amp;");
		ТестСообщения = СтрЗаменить(ТестСообщения, ">",  "&gt;");
		ТестСообщения = СтрЗаменить(ТестСообщения, "<",  "&lt;");
		ТестСообщения = СтрЗаменить(ТестСообщения, """", "&quot;");
		ТестСообщения = СтрЗаменить(ТестСообщения, "'",  "&apos;");
		
		Если ОтображатьТип Тогда
			стрВозврата = стрВозврата + СтрШаблон(ШаблонСтроки, Формат(СтрокаТаблицы.Дата, "ДФ=dd.MM.yy"), ТестСообщения, СтрокаТаблицы.Автор, СтрокаТаблицы.ТипКомментария);	
		Иначе
			стрВозврата = стрВозврата + СтрШаблон(ШаблонСтроки, Формат(СтрокаТаблицы.Дата, "ДФ=dd.MM.yy"), ТестСообщения, СтрокаТаблицы.Автор);	
		КонецЕсли;
		
	КонецЦикла;
	
	стрВозврата = стрВозврата + "</table>";
	
	стрВозврата = стрВозврата + омHTML.ПолучитьХвостHTML();
	
	Возврат стрВозврата;
	
	
КонецФункции // Получить_HTML_комментарий()
