&НаКлиенте
Функция Получить_HTML_комментарий(ДанныеКомментария, СтрокаСортировки = "") Экспорт

	 стрВозврата = омHTML.ПолучитьЗаголовокHTML();
	 
	 //стрВозврата = стрВозврата + омHTML.ПолучитьHeadHTML(Строка(ИзделиеКомплект), 1);
	 
	 стрВозврата = стрВозврата + "<table>";
	 стрВозврата = стрВозврата + "<tr><td>Дата</td><td>Отгрузка</td><td>Автор</td></tr>";
	 
	 ШаблонСтроки = "<tr><td>%1</td><td>%2</td><td>%3</td></tr>";
	 
	 //Для каждого СтрокаТаблицы Из ПолучитьЧастичныеОтгрузки(ИзделиеКомплект) Цикл
	 //    стрВозврата = стрВозврата + СтрШаблон(ШаблонСтроки, Формат(СтрокаТаблицы.Дата, "ДЛФ=DD"), СтрокаТаблицы.Отгрузка, СтрокаТаблицы.Автор);	
	 //КонецЦикла;
	 //
	 стрВозврата = стрВозврата + "</table>";
	 
	 стрВозврата = стрВозврата + омHTML.ПолучитьХвостHTML();
	 
	 Возврат стрВозврата;
 
	

КонецФункции // Получить_HTML_комментарий()
