
Функция ПолучитьПутьКИменамПапокПроекта(Проект) Экспорт

	СтруктураПутиКПапкам = Новый Структура("ИмяКорневойПапкиВPDM, ИмяПапкиГЧВPDM, ИмяПапкиКомпозицииВPDM", "", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.ИмяКорневойПапкиВPDM КАК ИмяКорневойПапкиВPDM,
		|	Проекты.ИмяПапкиГЧВPDM КАК ИмяПапкиГЧВPDM,
		|	Проекты.ИмяПапкиКомпозицииВPDM КАК ИмяПапкиКомпозицииВPDM
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.Ссылка = &Проект";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПутиКПапкам, Выборка);
	КонецЦикла;
	
	Возврат СтруктураПутиКПапкам; 
	
КонецФункции // ПолучитьПутьКИменамПапокПроекта()
