
&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервере(Проект, НеПоказывть)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		
		НеПоказывть = Новый Массив;
		Для каждого СтрокаТЧ Из Объект.Комплекты Цикл
			НеПоказывть.Добавить(СтрокаТЧ.Комплект);
		КонецЦикла;
		
		ЗаполнитьНаСервере(Проект, НеПоказывть);
		
	Иначе
		
		ПоказатьПредупреждение(, "Не заполнен проект.");	
	
	КонецЕсли;
	
КонецПроцедуры
