
&НаСервере
Процедура ОбновитьНаСервере()
	
	ПолеВывода.Очистить();
	ТаблицаДанных = омФайлыPDM.РезультатПереносовФайловВПДМ(Проект, Исполнитель);
	
	ТаблицаЭтапов = омФайлыPDM.ПолучитьЭтапыФайловВПДМ(ТаблицаДанных.ВыгрузитьКолонку("УИДДействия"));
	
	Макет = Обработки.РабочийСтол.ПолучитьМакет("Макет");
	
	Область = Макет.ПолучитьОбласть("Шапка"); 
	Область.Параметры.Фильтры = Формат(ТекущаяДатаСеанса(), "ДЛФ=DT") + ". ";
	
	Если ЗначениеЗаполнено(Проект) Тогда
		Область.Параметры.Фильтры = Область.Параметры.Фильтры + "Проект " + Проект;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		Область.Параметры.Фильтры = Область.Параметры.Фильтры + "Исполнитель " + Исполнитель;
	КонецЕсли;
	ПолеВывода.Вывести(Область);
	
	Область 	= Макет.ПолучитьОбласть("Строка"); 
	ОбластьЭтап = Макет.ПолучитьОбласть("Этап");
	
	Отбор = Новый Структура("УИДДействия", );
	
	Для каждого х Из ТаблицаДанных Цикл
	
		Область.Параметры.Заполнить(х);
		ПолеВывода.Вывести(Область);
		Отбор.УИДДействия = х.УИДДействия;
		
		Для каждого Этап Из ТаблицаЭтапов.НайтиСтроки(Отбор) Цикл
			ОбластьЭтап.Параметры.Заполнить(Этап);
			ОбластьЭтап.Параметры.Продолжительность = (Этап.МиллисекундыОкончания - Этап.Миллисекунды) / 1000;
			ПолеВывода.Вывести(ОбластьЭтап);
		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Исполнитель", 	Исполнитель);
	Параметры.Свойство("Проект", 		Проект);
	
	ОбновитьНаСервере();
	
КонецПроцедуры
