
&НаСервере
Процедура ОбновитьНаСервере()
	
	ПолеВывода.Очистить();
	ТаблицаДанных = омФайлыPDM.РезультатПереносовФайловВПДМ(Проект, Исполнитель);
	
	ТаблицаЭтапов = омФайлыPDM.ПолучитьЭтапыФайловВПДМ(ТаблицаДанных.ВыгрузитьКолонку("УИДДействия"));
	
	Макет = Обработки.РабочийСтол.ПолучитьМакет("Макет");
	
	Область = Макет.ПолучитьОбласть("Шапка"); 
	Область.Параметры.Фильтры = Формат(ТекущаяДатаСеанса(), "ДЛФ=DT") + ". ";
	
	Если ЗначениеЗаполнено(Проект) Тогда
		Область.Параметры.Фильтры = Область.Параметры.Фильтры + "Проект " + Проект;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		Область.Параметры.Фильтры = Область.Параметры.Фильтры + "Исполнитель " + Исполнитель;
	КонецЕсли;
	ПолеВывода.Вывести(Область);
	
	Область 	= Макет.ПолучитьОбласть("Строка"); 
	ОбластьЭтап = Макет.ПолучитьОбласть("Этап");
	
	Отбор = Новый Структура("УИДДействия", );
	
	Для каждого х Из ТаблицаДанных Цикл
	
		Область.Параметры.Заполнить(х);
		
		Область.Параметры.СтруктураОбъектДействия = Новый Структура("ОбъектДействия, УИДДействия, КомплектНаименование", 
				х.ОбъектДействия, х.УИДДействия, х.КомплектНаименование);
		ПолеВывода.Вывести(Область);
		Отбор.УИДДействия = х.УИДДействия;
		
		Для каждого Этап Из ТаблицаЭтапов.НайтиСтроки(Отбор) Цикл
			ОбластьЭтап.Параметры.Заполнить(Этап);
			ОбластьЭтап.Параметры.Продолжительность = (Этап.МиллисекундыОкончания - Этап.Миллисекунды) / 1000;
			ПолеВывода.Вывести(ОбластьЭтап);
		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Исполнитель", 	Исполнитель);
	Параметры.Свойство("Проект", 		Проект);
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыводаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Если Расшифровка.Свойство("ОбъектДействия") Тогда
			ПоказатьЗначение(, Расшифровка.ОбъектДействия);	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПолеВыводаОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	                                                                                    
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Если Расшифровка.Свойство("ОбъектДействия") И Расшифровка.Свойство("УИДДействия") Тогда
			ПослеВопросаООтменеДействия = Новый ОписаниеОповещения("ПослеВопросаООтменеДействия"
				, ЭтотОбъект, Новый Структура("УИДДействия", Расшифровка.УИДДействия));
			ПоказатьВопрос(ПослеВопросаООтменеДействия, "Вы хотите отменить действие для " +
			Расшифровка.КомплектНаименование + "?", РежимДиалогаВопрос.ДаНет, , , "Отмена действия");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаООтменеДействия(Результат, ДополнительныеДействия) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
	
		ОтменитьДействияНаСервере(ДополнительныеДействия.УИДДействия);	
	
	КонецЕсли;	

КонецПроцедуры // ПослеВопросаООтменеДействия()

&НаСервереБезКонтекста
Процедура ОтменитьДействияНаСервере(УИДДействия)

    УстановитьПривилегированныйРежим(Истина);
	
	ТекстДопСообщения = "(Отменено пользователем " + Строка(ПараметрыСеанса.ТекущийПользователь) + ")";
	
	МенеджерЗаписей = РегистрыСведений.ДлительныеДействия.СоздатьМенеджерЗаписи();
	МенеджерЗаписей.УИДДействия = УИДДействия;
	
	МенеджерЗаписей.Прочитать();
	
	Если НЕ МенеджерЗаписей.Выбран() Тогда
		Возврат;	
	КонецЕсли;
	
	МенеджерЗаписей.ОтменитьДействие = Истина;
	МенеджерЗаписей.НаименованиеДействия = МенеджерЗаписей.НаименованиеДействия + ТекстДопСообщения;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ
		|	РегистрСведений.ДлительныеДействияЭтап КАК ДлительныеДействияЭтап
		|ГДЕ
		|	ДлительныеДействияЭтап.УИДДействия = &УИДДействия
		|	И НЕ ДлительныеДействияЭтап.Завершен";
	
	Запрос.УстановитьПараметр("УИДДействия", УИДДействия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ДлительныеДействияЭтап.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.УИДДействия.Установить(УИДДействия);
		НаборЗаписей.Отбор.Миллисекунды.Установить(Выборка.Миллисекунды);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.Завершен = Истина;
		НоваяЗапись.ОписаниеЭтапаДействия = Выборка.ОписаниеЭтапаДействия + ТекстДопСообщения;
		
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры // ОтменитьДействияНаСервере(УИДДействия)



