
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаКонтрагентыПриИзменении(Элемент)
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаОбъектыПриИзменении(Элемент)
	ОбновитьФорму();
КонецПроцедуры

&НаСервере
Процедура ОбновитьФорму()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакзазыМатериаловОстатки.Объект КАК Объект,
		|	ЗакзазыМатериаловОстатки.Номенклатура КАК Номенклатура,
		|	ЗакзазыМатериаловОстатки.КоличествоОстаток КАК Количество,
		|	ЗакзазыМатериаловОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения КАК Единица,
		|	ЗакзазыМатериаловОстатки.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрНакопления.ЗаказыМатериалов.Остатки(
		|			,
		|			ВЫБОР
		|					КОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Контрагент = &Контрагент
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &Объект = ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Объект = &Объект
		|				КОНЕЦ) КАК ЗакзазыМатериаловОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗакзазыМатериаловОстатки.Контрагент.Наименование,
		|	ЗакзазыМатериаловОстатки.Объект.Наименование,
		|	ЗакзазыМатериаловОстатки.Номенклатура.Наименование,
		|	ЗакзазыМатериаловОстатки.Номенклатура.ВидНоменклатуры.Наименование";
	
	Запрос.УстановитьПараметр("Контрагент",ЭтаФорма.ФормаКонтрагент);
	Запрос.УстановитьПараметр("Объект",ЭтаФорма.ФормаОбъект);

	тзРезультат = Запрос.Выполнить().Выгрузить();
	
	стОтбор = Новый Структура();
	
	Макет = Отчеты.ОжидаемыеПоставки.ПолучитьМакет("Макет");
	
	Таб = ЭтаФорма.ПолеВывода;
	Таб.Очистить();
	
	Таб.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	обСтрока = Макет.ПолучитьОбласть("Строка"); 
	
	Если ЭтаФорма.ГруппировкаКонтрагенты И ЭтаФорма.ГруппировкаОбъекты Тогда
		мОбъекты = омТЧ_НаКлиентеСервере.КолонкуВМассив(тзРезультат,"Объект");
		мКонтрагенты = омТЧ_НаКлиентеСервере.КолонкуВМассив(тзРезультат,"Контрагент"); 
		стОтбор.Вставить("Контрагент",Неопределено);
		стОтбор.Вставить("Объект",Неопределено);
		обОбъект = Макет.ПолучитьОбласть("Объект"); 
		обКонтрагент = Макет.ПолучитьОбласть("Контрагент"); 
		
		Для каждого Контрагент Из мКонтрагенты Цикл
			обКонтрагент.Параметры.Контрагент = Контрагент;			
			Таб.Вывести(обКонтрагент);
			стОтбор.Контрагент = Контрагент;
			
			Для каждого Объект Из мОбъекты Цикл
				стОтбор.Объект = Объект;
				НайденыеСтроки = тзРезультат.НайтиСтроки(стОтбор); 
				Если НайденыеСтроки.Количество() > 0 Тогда
					обОбъект.Параметры.Объект = Объект;			
					Таб.Вывести(обОбъект);
					стОтбор.Объект = Объект;
					ВывестиСтроки(НайденыеСтроки,обСтрока);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	ИначеЕсли ЭтаФорма.ГруппировкаКонтрагенты Тогда
		мКонтрагенты = омТЧ_НаКлиентеСервере.КолонкуВМассив(тзРезультат,"Контрагент");
		тзРезультат.Свернуть("Номенклатура,Единица,Контрагент","Количество");
		стОтбор.Вставить("Контрагент",Неопределено);
		обКонтрагент = Макет.ПолучитьОбласть("Контрагент"); 
		Для каждого Контрагент Из мКонтрагенты Цикл
			обКонтрагент.Параметры.Контрагент = Контрагент;			
			стОтбор.Контрагент = Контрагент;
			
			НайденыеСтроки = тзРезультат.НайтиСтроки(стОтбор); 
			Если НайденыеСтроки.Количество() > 0 Тогда
				обКонтрагент.Параметры.Контрагент = Контрагент;			
				Таб.Вывести(обКонтрагент);
				ВывестиСтроки(НайденыеСтроки,обСтрока);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ЭтаФорма.ГруппировкаОбъекты Тогда
		мОбъекты = омТЧ_НаКлиентеСервере.КолонкуВМассив(тзРезультат,"Объект");
		тзРезультат.Свернуть("Номенклатура,Единица,Объект","Количество");
		стОтбор.Вставить("Объект",Неопределено);
		обОбъект = Макет.ПолучитьОбласть("Объект"); 
		Для каждого Объект Из мОбъекты Цикл
			обОбъект.Параметры.Объект = Объект;			
			стОтбор.Объект = Объект;
			
			НайденыеСтроки = тзРезультат.НайтиСтроки(стОтбор); 
			Если НайденыеСтроки.Количество() > 0 Тогда
				обОбъект.Параметры.Объект = Объект;			
				Таб.Вывести(обОбъект);
				ВывестиСтроки(НайденыеСтроки,обСтрока);
			КонецЕсли;
		КонецЦикла;
	Иначе
		тзРезультат.Свернуть("Номенклатура,Единица","Количество");
		ВывестиСтроки(тзРезультат,обСтрока);
	КонецЕсли;	
	
КонецПроцедуры // ОбновитьФорму()

&НаСервере
Процедура ВывестиСтроки(НаборСтрок,обСтрока)
	Для каждого х Из НаборСтрок Цикл
		обСтрока.Параметры.Заполнить(х);
		ЭтаФорма.ПолеВывода.Вывести(обСтрока);
	КонецЦикла;
КонецПроцедуры // ВывестиСтроки()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьФорму();
КонецПроцедуры
