
&НаКлиенте
Процедура Настройки(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияОкнаНастроек", ЭтотОбъект);
	ОткрытьФорму("Отчет.ОтчетМенеджера.Форма.ФормаНастройкиОтчета", , ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияОкнаНастроек(Результат, ДополнительныеПараметры) Экспорт
	Обновить(Неопределено);
КонецПроцедуры // ПослеЗакрытияОкнаНастроек()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчеты.ОтчетМенеджера.ПолучитьНаименованияПроектов(Элементы.НаименованиеОтчета.СписокВыбора);
КонецПроцедуры



&НаСервере
Процедура ОбновитьНаСервере()
	
	ПолеОтчета.Очистить();
	
	Если НЕ (ЗначениеЗаполнено(НаименованиеОтчета) И ЗначениеЗаполнено(Проект)) Тогда
		Возврат;	
	КонецЕсли;
	
	КолонкиОтчета = ПолучитКолонкиОтчета(НаименованиеОтчета);

КонецПроцедуры

Функция ПолучитКолонкиОтчета(НаименованиеОтчета)

	ДаннеОКолонках = Отчеты.ОтчетМенеджера.ПолучитьКолонкиОтчета(НаименованиеОтчета);	

КонецФункции // ПолучитКолонкиОтчета(НаименованиеОтчета)



&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура НаименованиеОтчетаПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры
