
&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьНаСервере(Дата, Проект, НеПоказывть)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешнееПроизводствоСрезПоследних.Комплект КАК Комплект,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия.ПолноеНаименование КАК ТекущаяСтадияСтрокой
		|ИЗ
		|	РегистрСведений.ВнешнееПроизводство.СрезПоследних(
		|			&Дата,
		|			Комплект.Проект = &Проект
		|				И НЕ Комплект В (&МассивКомплектов)) КАК ВнешнееПроизводствоСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних(&Дата, Комплект.Проект = &Проект) КАК ДанныеКомплектаСрезПоследних
		|		ПО ВнешнееПроизводствоСрезПоследних.Комплект = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	НЕ ВнешнееПроизводствоСрезПоследних.Отмена
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВнешнееПроизводствоСрезПоследних.Комплект.Наименование";
	
	Запрос.УстановитьПараметр("Дата", 				Дата);
	Запрос.УстановитьПараметр("МассивКомплектов", 	НеПоказывть);
	Запрос.УстановитьПараметр("Проект", 			Проект);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	

КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		
		НеПоказывть = Новый Массив;
		Для каждого СтрокаТЧ Из Объект.Комплекты Цикл
			НеПоказывть.Добавить(СтрокаТЧ.Комплект);
		КонецЦикла;
		
		Если Параметры.Ключ.Пустая() Тогда
		    ДатаРасчета = ТекущаяДата();
		Иначе	
			ДатаРасчета = Объект.Дата;
		КонецЕсли;
		
		Для каждого ТекущийКомплект Из ЗаполнитьНаСервере(ДатаРасчета, Объект.Проект, НеПоказывть) Цикл
		
			ЗаполнитьЗначенияСвойств(Объект.Комплекты.Добавить(), ТекущийКомплект);
		
		КонецЦикла;
		
	Иначе
		
		ПоказатьПредупреждение(, "Не заполнен проект.");	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если Объект.Комплекты.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		Описание = Новый ОписаниеОповещения("ПослеВопросаОчисткиТЧ", ЭтаФорма);
		ПоказатьВопрос(Описание, "Если изменить проект, то очиститься табличная часть. Продолжить?", РежимДиалогаВопрос.ДаНет, , , "Выбор проекта");
		
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВопросаОчисткиТЧ(Значение, ДополнительныеПараметры) Экспорт

	Если Значение = КодВозвратаДиалога.Да Тогда
	
		Объект.Комплекты.Очистить();
	
	КонецЕсли;	

КонецПроцедуры // ПослеВопросаОчисткиТЧ()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
	
		омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


