
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектТЗ", 			ОбъектТЗ);
	Параметры.Свойство("НомерПоПорядку", 	НомерПоПорядку);
	
	Если ЗначениеЗаполнено(ОбъектТЗ) Тогда
		Элементы.ОбъектТЗ.Заголовок = ОбъектТЗ.Метаданные().Представление();
		
		омКартинкиНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКартинки, , Истина);
		
	Иначе
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	омКартинкиНаКлиенте.ВывестиКартинку(ОбъектТЗ, НомерПоПорядку, ЭтаФорма, 1);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьНаСервере(ОбъектТЗ, НомерПоПорядку)           
	
	МенеджерЗаписи = РегистрыСведений.КартинкиОбъектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОбъектТЗ 		= ОбъектТЗ;
	МенеджерЗаписи.НомерПоПорядку 	= НомерПоПорядку;
	
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	УдалитьНаСервере(ОбъектТЗ, НомерПоПорядку);
	Оповестить("ИзменилииКартинкиОбъектТЗ", Новый Структура("ОбъектТЗ", ОбъектТЗ));
	Закрыть();
	
КонецПроцедуры
