
Процедура _ОбработкаПроведения(Отказ, Режим)

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОбещаниеПодрадчика
	Движения.ОбещаниеПодрядчика.Записывать = Истина;
	Для Каждого ТекСтрокаИзделияКомплекты Из ИзделияКомплекты Цикл
		Движение = Движения.ОбещаниеПодрядчика.Добавить();
		Движение.Период				= Дата;
		Движение.Подрядчик 			= Подрядчик;
		Движение.ИзделиеКомплект 	= ТекСтрокаИзделияКомплекты.ИзделиеКомплект;
		Движение.ДатаОбещания 		= ТекСтрокаИзделияКомплекты.ДатаВозвратаКомплекта;
		Движение.ВозвратНаСклад 	= ТекСтрокаИзделияКомплекты.ВозвратНаСклад;
	КонецЦикла;

	// регистр КомплектыУПодрядчика Приход
	Движения.КомплектыУПодрядчика.Записывать = Истина;
	Для Каждого ТекСтрокаИзделияКомплекты Из ИзделияКомплекты Цикл
		Движение = Движения.КомплектыУПодрядчика.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
		Движение.Период 			= Дата;
		Движение.Подрядчик			= Подрядчик;
		Движение.ИзделиеКомплект 	= ТекСтрокаИзделияКомплекты.ИзделиеКомплект;
		Движение.Количество 		= 1;
	КонецЦикла;

КонецПроцедуры
