&НаКлиенте
Перем ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, СтркутураНастроекПечати, СтруктураВариантов;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Образец", Образец);
	
	Если НЕ ЗначениеЗаполнено(Образец) Тогда
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	НачальныеНастройки();
	ДанныеОбразца 				= ПолучитьДанныеОбразца(Образец);
	СтркутураНастроекПечати 	= ПолучитьСтруктуруПечати();
	СтруктураВариантов			= ПолучитьВариантыНастроек();
	ТекстНаименование 			= ДанныеОбразца.Наименование;
	

	
	Если ПустаяСтрока(ДанныеОбразца.Обработка) Тогда
	
		Элементы.ГруппаОбработка.ТолькоПросмотр = Истина;
		Элементы.Обработка.Видимость = Ложь;
	
	КонецЕсли;
	
	Если ДанныеОбразца.Материалы.Количество() = 0 Тогда
	
		Элементы.ГруппаМатериалы.ТолькоПросмотр = Истина;
		Элементы.Метериалы.Видимость = Ложь;
	
	КонецЕсли;
	
	ПриИзмененииНастроек();
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПечати()

	Возврат Справочники.Образцы.ПолучитьСтркутуруНастроекПечати()	

КонецФункции // ПолучитьСтруктуруПечати()
 
&НаСервереБезКонтекста
Функция ПолучитьВариантыНастроек()

	Возврат Справочники.Образцы.ПолучитьВариантыНастроек()	

КонецФункции // ПолучитьСтруктуруПечати()
 
&НаСервереБезКонтекста
Функция ПолучитьДанныеОбразца(Образец)
		
    Возврат Справочники.Образцы.ПолучитьДанныеОбразца(Образец);
	
КонецФункции // ПолучитьДанныеОбразца()

&НаКлиенте
Процедура НачальныеНастройки()

	РазмерШрифтаНаименования 	= ?(РазмерШрифтаНаименования = 0, 	9,  РазмерШрифтаНаименования);
	РазмерШрифтаОбработка 		= ?(РазмерШрифтаОбработка = 0, 		8,  РазмерШрифтаОбработка);
	РазмерШрифтаМатериалы 		= ?(РазмерШрифтаМатериалы = 0, 		8,  РазмерШрифтаМатериалы);
	РазмерШКпоВысоте			= ?(РазмерШКпоВысоте = 0,			7,  РазмерШКпоВысоте);
	РазмерШКпоШирине			= ?(РазмерШКпоШирине = 0,			15, РазмерШКпоШирине);

КонецПроцедуры // НачальныеНастройки() 

&НаСервереБезКонтекста
Функция СформироватьТаблицуНаСервере(Образец, СтркутураНастроекПечати, ДанныеОбразца = Неопределено)
	
	Справочники.Образцы.СформироватьТаблицуНаСервере(Образец, СтркутураНастроекПечати, ДанныеОбразца);
	
Конецфункции

&НаКлиенте
Процедура ПриИзмененииНастроек()
	
	//ЗаполнитьЗначенияСвойств(СтруктураПечати, ЭтаФорма);
	//СформироватьТаблицуНаСервере(Образец, ДанныеОбразца, СтруктураПечати);

КонецПроцедуры // ПриИзмененииНастроек()

&НаКлиенте
Процедура РазмерШрифтаНаименованияПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ТекстНаименованиеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ТекстНаШтрихКодеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШрифтаОбработкаПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура МетериалыПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШрифтаМатериалыПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПолужирныйНаименованиеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПолужирныйОбработкаПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПолужирныйМатериалыПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьШКПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШКпоВысотеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШКпоШиринеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьРамкуПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ИдентификаторПечатнойФормы = "ШилдикОбразца";
	НазваниеПечатнойФормы = НСтр("ru = 'Шильдик образца'");
	
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	
	ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент = Пример;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	
	ОбластиОбъектов = Новый СписокЗначений;
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВариантНастройки(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры



