&НаКлиенте
Перем ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, СтркутураНастроекПечати, СтруктураВариантов, СтруктураПечати, Префикс;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Образец", Образец);
	
	Если НЕ ЗначениеЗаполнено(Образец) Тогда
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Префикс = "ПечатьШильдика_";
	
	НачальныеНастройки();
	ДанныеОбразца 				= ПолучитьДанныеОбразца(Образец);
	СтркутураНастроекПечати 	= ПолучитьСтруктуруПечати();
	ТекстНаименование 			= ДанныеОбразца.Наименование;
	СтруктураВариантов			= ПолучитьВариантыНастроек();

	ЗаполнитьВарианты();
	
	Элементы.УдалитьВариант.Доступность = СтруктураВариантов.Количество() > 0;
	
	Если ПустаяСтрока(ДанныеОбразца.Обработка) Тогда
	
		Элементы.ГруппаОбработка.ТолькоПросмотр = Истина;
		Элементы.Обработка.Видимость = Ложь;
	
	КонецЕсли;
	
	Если ДанныеОбразца.Материалы.Количество() = 0 Тогда
	
		Элементы.ГруппаМатериалы.ТолькоПросмотр = Истина;
		Элементы.Материалы.Видимость = Ложь;
	
	КонецЕсли;
	
	Элементы.Группа1.ТолькоПросмотр = Истина;
	Элементы.Печать.Доступность 	= Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВарианты()

	Элементы.ВариантНастройки.СписокВыбора.Очистить();
	
	Для каждого х Из СтруктураВариантов Цикл
	
		Элементы.ВариантНастройки.СписокВыбора.Добавить(х.Ключ); 
	
	КонецЦикла;
	
	Элементы.ВариантНастройки.СписокВыбора.СортироватьПоЗначению();
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПечати()

	Возврат Справочники.Образцы.ПолучитьСтркутуруНастроекПечати()	

КонецФункции // ПолучитьСтруктуруПечати()
 
&НаСервереБезКонтекста
Функция ПолучитьВариантыНастроек()

	Возврат Справочники.Образцы.ПолучитьВариантыНастроек()	

КонецФункции // ПолучитьСтруктуруПечати()
 
&НаСервереБезКонтекста
Функция ПолучитьДанныеОбразца(Образец)
		
    Возврат Справочники.Образцы.ПолучитьДанныеОбразца(Образец);
	
КонецФункции // ПолучитьДанныеОбразца()

&НаКлиенте
Процедура НачальныеНастройки()

	РазмерШрифтаНаименования 	= ?(РазмерШрифтаНаименования = 0, 	9,  РазмерШрифтаНаименования);
	РазмерШрифтаОбработка 		= ?(РазмерШрифтаОбработка = 0, 		8,  РазмерШрифтаОбработка);
	РазмерШрифтаМатериалы 		= ?(РазмерШрифтаМатериалы = 0, 		8,  РазмерШрифтаМатериалы);
	РазмерШКпоВысоте			= ?(РазмерШКпоВысоте = 0,			7,  РазмерШКпоВысоте);
	РазмерШКпоШирине			= ?(РазмерШКпоШирине = 0,			15, РазмерШКпоШирине);

КонецПроцедуры // НачальныеНастройки() 

&НаСервереБезКонтекста
Функция СформироватьТаблицуНаСервере(Образец, СтркутураНастроекПечати, Пример, ДанныеОбразца = Неопределено)
	
	Справочники.Образцы.СформироватьТаблицуНаСервере(Образец, СтркутураНастроекПечати, Пример, ДанныеОбразца);
	
Конецфункции

&НаКлиенте
Процедура ПриИзмененииНастроек()
	
	ЗаполнитьЗначенияСвойств(СтркутураНастроекПечати, ЭтаФорма);
	СформироватьТаблицуНаСервере(Образец, СтркутураНастроекПечати, Пример, ДанныеОбразца); 
	
	Модифицированность 	= Истина;
	
	СтатусИзменения		= 1;

КонецПроцедуры // ПриИзмененииНастроек()

&НаКлиенте
Процедура РазмерШрифтаНаименованияПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ТекстНаименованиеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ТекстНаШтрихКодеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШрифтаОбработкаПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура МетериалыПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШрифтаМатериалыПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПолужирныйНаименованиеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПолужирныйОбработкаПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПолужирныйМатериалыПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьШКПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШКпоВысотеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШКпоШиринеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьРамкуПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ИдентификаторПечатнойФормы = "ШилдикОбразца";
	НазваниеПечатнойФормы = НСтр("ru = 'Шильдик образца'");
	
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	
	ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент = Пример;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	
	ОбластиОбъектов = Новый СписокЗначений;
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВариантНастройки(Команда)

	ПослеВводаВарианта = Новый ОписаниеОповещения("ПослеВводаНаименованиеВарианта", ЭтаФорма);
	ПоказатьВводСтроки(ПослеВводаВарианта, "", "Наименование варианта", 100);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаНаименованиеВарианта(ИмяВарианта, ДполнительыеЗначения) Экспорт

	Если ЗначениеЗаполнено(ИмяВарианта) Тогда
		
		ИмяВарианта = СтрЗаменить(ИмяВарианта, " ", "_");
		ИмяВарианта = СтрЗаменить(ИмяВарианта, ".", "_");
		ИмяВарианта = СтрЗаменить(ИмяВарианта, ",", "_");
		ИмяВарианта = СтрЗаменить(ИмяВарианта, "!", "_");
		ИмяВарианта = СтрЗаменить(ИмяВарианта, """", "_");
		ИмяВарианта = СтрЗаменить(ИмяВарианта, "№", "_");
	
		Если Элементы.ВариантНастройки.СписокВыбора.НайтиПоЗначению(ИмяВарианта) = Неопределено Тогда
			
			Элементы.УдалитьВариант.Доступность = Истина;
			Элементы.ВариантНастройки.СписокВыбора.Добавить(ИмяВарианта);
			
			СтруктураВариантов.Вставить(ИмяВарианта, ПолучитьСтруктуруПечати());
			ЗаполнитьЗначенияСвойств(СтруктураВариантов[ИмяВарианта], ЭтаФорма);
			ВариантНастройки = ИмяВарианта;
			Модифицированность = Истина;
			СтатусИзменения		= 1;
			
			Элементы.Группа1.ТолькоПросмотр = Ложь;
			Элементы.Печать.Доступность 	= Истина;
			
		Иначе	
			ПоказатьПредупреждение(, "Вариант " + ИмяВарианта + " уже существует");
		КонецЕсли;	
		
	КонецЕсли;
	

КонецПроцедуры // ПослеВводаНаименованиеВарианта() 


&НаКлиенте
Процедура УдалитьВариант(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВариант(Команда)
	
	Если ПустаяСтрока(ВариантНастройки) Тогда
	
		ПоказатьПредупреждение(, "Не выбран вариант.");	
	
	Иначе
	
		Модифицированность = Ложь;
		СтатусИзменения		= 2;
		ЗаполнитьЗначенияСвойств(СтруктураВариантов[ВариантНастройки], ЭтаФорма);
		
		ЗаписатьНеСервере(СтруктураВариантов[ВариантНастройки], ВариантНастройки);

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьНеСервере(ВариантНастройки, ИмяВарианта)

	Справочники.Образцы.ЗаписатьВариантНастройки(ВариантНастройки, ИмяВарианта);	

КонецПроцедуры


&НаКлиенте
Процедура ВариантНастройкиПриИзменении(Элемент)
	
	Элементы.Группа1.ТолькоПросмотр = Ложь;
	Элементы.Печать.Доступность 	= Истина; 
	СтатусИзменения		= 2;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантНастройкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Если Модифицированность Тогда
		
		СтандартнаяОбработка = Ложь;
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма);
		ПоказатьВопрос(Оповещение, "Настройки изменены. Если продолжить, то изменения не будут сохранены. Продолжить?", Режим, 0);
		
	КонецЕсли;
	
КонецПроцедуры

 &НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
        Модифицированность = Ложь;
		СтатусИзменения		= 2;
   КонецЕсли;

КонецПроцедуры


