&НаСервере
Функция ПолучитьМонажныйКомплект(ПроизводственныйКомплект) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МонтажныеКомплектыПроизводственныеКомплекты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.МонтажныеКомплекты.ПроизводственныеКомплекты КАК МонтажныеКомплектыПроизводственныеКомплекты
		|ГДЕ
		|	МонтажныеКомплектыПроизводственныеКомплекты.ПроизводственныйКомплект = &ПроизводственныйКомплект";
	
	Запрос.УстановитьПараметр("ПроизводственныйКомплект", ПроизводственныйКомплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.МонтажныеКомплекты.ПустаяСсылка();
	

КонецФункции // ПолучитьМонажныйКомплект()
