&НаКлиенте
Перем ПутьКФайлуЧастичный, ФоновоеДействие, ТекущийКаталог, ИДТекущейПапки, МассивПодПапок, ИндексПодпапки, СтруктураСчетчиков;

&НаКлиенте
Процедура СтруктураКаталоговПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтруктураКаталоговПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтруктураКаталоговПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Комплект", Комплект);
	Параметры.Свойство("ЗадачаПКД", ЗадачаПКД);
	
	Если ЗначениеЗаполнено(Комплект) Тогда
		
		Элементы.ГруппаЗадачаПКД.Видимость = Ложь;
		
	ИначеЕсли ЗначениеЗаполнено(ЗадачаПКД) Тогда 
		
		Комплект = ЗадачаПКД.ОбъектТЗ;
		
	Иначе		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	КодPDM = омPDMНаСервере.ПолучитьКодPDM(Комплект);
	
	Если КодPDM = 0 Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	АдресРезультата = ПоместитьВоВременноеХранилище("", УникальныйИдентификатор);
	
	ПараметрыФункции 	= Новый Массив(2);
	ПараметрыФункции[0] = КодPDM;	
	ПараметрыФункции[1] = АдресРезультата;	
	
	Задание = ФоновыеЗадания.Выполнить("омФайлыPDM.ИнформацияОФайлеPDM", ПараметрыФункции, , "ИнформацияОФайлеPDM");
	ЗаданиеУникальныйИдентификатор = Задание.УникальныйИдентификатор;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапускФоновогоЗаданияПолученияПапок(ПутьКФалу, УникальныйИдентификатор)
	
	АдресРезультата = ПоместитьВоВременноеХранилище("", УникальныйИдентификатор);
	ПараметрыФункции 	= Новый Массив(3);
	ПараметрыФункции[0] = ПутьКФалу;	
	ПараметрыФункции[1] = АдресРезультата;	
	ПараметрыФункции[2] = Истина;	
	
	Задание = ФоновыеЗадания.Выполнить("омФайлыPDM.ПолучитьПодПапкиИФайлыИзПапки", ПараметрыФункции, , "ПолучитьПодПапкиИФайлыИзПапки");
	ЗаданиеУникальныйИдентификатор = Задание.УникальныйИдентификатор;
	
	Возврат Новый Структура("ЗаданиеУникальныйИдентификатор, АдресРезультата", ЗаданиеУникальныйИдентификатор, АдресРезультата);
	
КонецФункции // ЗапускФоновогоЗаданияПолученияПапок()

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	СтруктураСчетчиков = Новый Структура("Всего, Утвержденных, ВРазработке, Заблокированных", 0, 0, 0, 0);
	
	МассивПодПапок = Новый Массив; 
	ИндексПодпапки		= 0;
	ИДТекущейПапки		= 0;
	ФоновоеДействие 	= 0;
	ПутьКФайлуЧастичный = "";
	ТекущийКаталог		= "";
	
	Элементы.ДекорацияДействие.Заголовок = "Получение конрневого каталога";
	ПодключитьОбработчикОжидания("ПроверкаВыполненияФоновогоЗадания", 0.8, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаВыполненияФоновогоЗадания()

	ДанныеВыполнения = ПроверитьВыполнениеФоновогоЗаданияНаСервере(ЗаданиеУникальныйИдентификатор);
	
	Если ДанныеВыполнения.Активно Тогда
		ПодключитьОбработчикОжидания("ПроверкаВыполненияФоновогоЗадания", 0.3, Истина)
	Иначе
		
		Если ФоновоеДействие = 0 Тогда
			
			СтрокаХМЛ = ПолучитьИзВременногоХранилища(АдресРезультата);
			
			Если ПустаяСтрока(СтрокаХМЛ) Тогда
				
				ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияОповещения", ЭтаФорма);
				ПоказатьПредупреждение(ОписаниеОповещения, "Не удалось получить данные");
				
			Иначе	
				
				ЗаполнитьДанные(СтрокаХМЛ);
				ФоновоеДействие 				= 1;
				ТекущийКаталог 					= КореневаяПапка;
				СтруктураДанных 				= ЗапускФоновогоЗаданияПолученияПапок(ПутьКФайлуЧастичный, УникальныйИдентификатор);
				АдресРезультата 				= СтруктураДанных.АдресРезультата;
				ЗаданиеУникальныйИдентификатор 	= СтруктураДанных.ЗаданиеУникальныйИдентификатор;
				ПодключитьОбработчикОжидания("ПроверкаВыполненияФоновогоЗадания", 0.7, Истина);
				ИДТекущейПапки = 0;

			КонецЕсли;
			
		ИначеЕсли ФоновоеДействие = 1 Тогда
			
			Элементы.ДекорацияДействие.Заголовок = "Получение файлов из " + ПутьКФайлуЧастичный;
			СтрокаХМЛ = ПолучитьИзВременногоХранилища(АдресРезультата);
			
			ДобавитьСтрокиВДерево(СтрокаХМЛ);
			
			Если МассивПодПапок.Количество() = 0 Тогда
				Элементы.ДекорацияДействие.Видимость 			= Ложь;	
				Элементы.ДекорацияДлительноеОжидание.Видимость 	= Ложь;	
				Элементы.ЗавершитьЗадачу.Доступность			= СтруктураСчетчиков.Заблокированных = 0; 
			Иначе
				
				ИДТекущейПапки 		= МассивПодПапок[0].ID;
				ПутьКФайлуЧастичный = МассивПодПапок[0].local_path;
				
				СтруктураДанных 				= ЗапускФоновогоЗаданияПолученияПапок(ПутьКФайлуЧастичный, УникальныйИдентификатор);
				АдресРезультата 				= СтруктураДанных.АдресРезультата;
				ЗаданиеУникальныйИдентификатор 	= СтруктураДанных.ЗаданиеУникальныйИдентификатор;

				ПодключитьОбработчикОжидания("ПроверкаВыполненияФоновогоЗадания", 0.7, Истина);
				Элементы.ДекорацияДействие.Заголовок = "Получение файлов из " + ПутьКФайлуЧастичный;
				МассивПодПапок.Удалить(0);
				
			КонецЕсли;
			
		Иначе
			
			
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Функция ДобавитьСтрокиВДерево(СтрокаХМЛ)

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаХМЛ);
	ИмяПоля = "";
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.Имя = "files_folders" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ЧтениеXML.Имя = "file_folders" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если ИДТекущейПапки = 0 Тогда
				
				НоваяСтрока = СтруктураКаталогов.ПолучитьЭлементы().Добавить();
				
			Иначе
				
				НоваяСтрока = ПолучитьСтрокуПоID().ПолучитьЭлементы().Добавить();
				
			КонецЕсли;
				
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ИмяПоля = ЧтениеXML.Имя;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст И Не ПустаяСтрока(ИмяПоля) Тогда
			НоваяСтрока[ИмяПоля] = ЧтениеXML.Значение;
		КонецЕсли; 
		
		Если ЧтениеXML.Имя = "file_folders" И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			Если НоваяСтрока.This_folder Тогда
			
				МассивПодПапок.Добавить(Новый Структура("ID, local_path", НоваяСтрока.ID, НоваяСтрока.local_path));	
				
			Иначе 
				
				СтруктураСчетчиков.Всего = СтруктураСчетчиков.Всего + 1;
				
				Если НоваяСтрока.IsLocked Тогда
					СтруктураСчетчиков.Заблокированных = СтруктураСчетчиков.Заблокированных + 1;	
				КонецЕсли; 
				Если НоваяСтрока.CurrentState = "В разработке" Тогда
					СтруктураСчетчиков.ВРазработке = СтруктураСчетчиков.ВРазработке + 1;	
				ИначеЕсли НоваяСтрока.CurrentState = "Утвержден"  Тогда
					СтруктураСчетчиков.Утвержденных = СтруктураСчетчиков.м + 1;	
				КонецЕсли; 
				
				ВывестиСообщениеОФайлах(СтруктураСчетчиков);
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат МассивПодПапок;
	
КонецФункции // ДобавитьСтрокиВДерево() 

&НаКлиенте
Процедура ВывестиСообщениеОФайлах(СтруктураСчетчиков)

	РезультатЗагрузки = СтрШаблон("Всего файлов - %1. В разаработке - %2. Утвержденных - %3. Заблокированных - %4",
			СтруктураСчетчиков.Всего, СтруктураСчетчиков.ВРазработке, СтруктураСчетчиков.Утвержденных, СтруктураСчетчиков.Заблокированных);					

КонецПроцедуры // ВывестиСообщениеОФайлах(СтруктураСчетчиков)

&НаКлиенте
Функция ПолучитьСтрокуПоID()

	ЭлементыДерева = СтруктураКаталогов.ПолучитьЭлементы();
	
	Для х = 0 По ЭлементыДерева.Количество() - 1 Цикл
	
		ТекущаяСтрока = ЭлементыДерева.Получить(х);	
		
		Если ТекущаяСтрока.ID = ИДТекущейПапки Тогда
		
			Возврат ТекущаяСтрока;	
		
		КонецЕсли; 
		
		Если ТекущаяСтрока.This_folder Тогда
			
			ТекущаяСтрока = ПроверкаПодчиненыхСтрок(ТекущаяСтрока);
			
			Если Не ТекущаяСтрока = Неопределено Тогда
				Возврат ТекущаяСтрока;	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции // ПолучитьСтрокуПоID() 

&НаКлиенте
Функция ПроверкаПодчиненыхСтрок(ТекущаяСтрока)
	
	ЭлементыДерева = ТекущаяСтрока.ПолучитьЭлементы();
	
	Для х = 0 По ЭлементыДерева.Количество() - 1  Цикл
		
		ТекущаяСтрока = ЭлементыДерева.Получить(х);	
		
		Если ТекущаяСтрока.ID = ИДТекущейПапки Тогда
			
			Возврат ТекущаяСтрока;	
			
		КонецЕсли; 
		
		Если ТекущаяСтрока.This_folder Тогда
			
			ТекущаяСтрока = ПроверкаПодчиненыхСтрок(ТекущаяСтрока);
			
			Если Не ТекущаяСтрока = Неопределено Тогда
				Возврат ТекущаяСтрока;	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции // ПроверкаПодчиненыхСтрок()

&НаСервереБезКонтекста
Функция ПроверитьВыполнениеФоновогоЗаданияНаСервере(ЗаданиеУникальныйИдентификатор)
	
	ДанныеВыполнения = Новый Структура("Активно, Сообщение", Ложь ,"");
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ЗаданиеУникальныйИдентификатор);
	
	Если Задание = Неопределено Тогда
	
		Возврат ДанныеВыполнения;	
	
	КонецЕсли; 
	
	ДанныеВыполнения.Активно = Задание.Состояние = СостояниеФоновогоЗадания.Активно;
	
	Если НЕ ДанныеВыполнения.Активно Тогда
		
		Для Каждого Сообщение Из Задание.ПолучитьСообщенияПользователю(Истина) Цикл
			ДанныеВыполнения.Сообщение = Сообщение;
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат ДанныеВыполнения;
	
КонецФункции // ПроверитьВыполнениеФоновогоЗаданияНаСервере()

&НаКлиенте 
Процедура ЗаполнитьДанные(СтрокаХМЛ)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаХМЛ);
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "file_information" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Для х = 0 по ЧтениеXML.КоличествоАтрибутов() - 1 Цикл
			
				ИмяАтрибута 		= ЧтениеXML.ИмяАтрибута(х);		
				ЗначениеАтрибута 	= ЧтениеXML.ЗначениеАтрибута(х);	
				
				Если ИмяАтрибута = "error" Тогда
				
					Если ПустаяСтрока(ЗначениеАтрибута) Тогда
						Продолжить;
					КонецЕсли;
					
					ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияОповещения", ЭтаФорма);
					ПоказатьПредупреждение(ОписаниеОповещения, "Ошибка данных из PDM");
					Прервать;
				
				ИначеЕсли ИмяАтрибута = "Path" Тогда
					ПутьКФайлуЧастичный = омФайлыPDMНаСервереКлиенте.ПолучитьПутьКПапкеИзделия(ЗначениеАтрибута);
					КореневаяПапка 		= ПутьКФайлуЧастичный;
					
					Если ПутьКФайлуЧастичный = "" Тогда
						
						ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияОповещения", ЭтаФорма);
						ПоказатьПредупреждение(ОписаниеОповещения, "Ошибка получения пути к папке изделия (" + КореневаяПапка + ")");
						Прервать;
						
					КонецЕсли;
					
				КонецЕсли;
			
			КонецЦикла;
			
        КонецЕсли;
    КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДанные() 

&НаКлиенте

&НаКлиенте
Процедура ПослеЗакрытияОповещения(ДополнительныеПараметры) Экспорт

	Закрыть();	

КонецПроцедуры // ПослеЗакрытияОповещения()

&НаСервереБезКонтекста
Процедура ЗавершитьЗадачуНаСервере(ЗадачаПКД) 
	мКомплектыДляАналогичногоДействия = Новый Массив;
	Задачи.Задачи_ПКД.ДействияНаСервере("ЗавершениеРаботы", мКомплектыДляАналогичногоДействия, ЗадачаПКД, ЗадачаПКД.ТипЗадачи, ЗадачаПКД.Исполнитель, ЗадачаПКД.ОбъектТЗ);	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЗадачу(Команда)
	
	ЗавершитьЗадачуНаСервере(ЗадачаПКД);
	стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(ЗадачаПКД, "ЗабратьПрава");
	
	Если ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
		
		Закрыть();
	Иначе	
		ПоказатьПредупреждение(,стВозврата.ОписаниеОшибки);
		
	КонецЕсли;
КонецПроцедуры

