Функция ПолучитьПутьКПапкеИзделия(ПолныеПутьКФайлу, ЭтоКомпозиция = Ложь) Экспорт

    МассивПути = СтрРазделить(ПолныеПутьКФайлу, "\");
	
	КоличествоЭлементов = МассивПути.Количество();
	
	Если КоличествоЭлементов < 4 Тогда
		Возврат "";
	КонецЕсли;
	
	ГлубинаПросмотра = ?(ЭтоКомпозиция, 2, 3);
	
	ПутьКФайлуЧастичный = МассивПути[0];
	
	Для х = 1 По КоличествоЭлементов - ГлубинаПросмотра Цикл
	
		ПутьКФайлуЧастичный = ПутьКФайлуЧастичный + "\" + МассивПути[х];	
	
	КонецЦикла;
	
	Возврат ПутьКФайлуЧастичный;
	
КонецФункции // ПолучитьПутьКПапкеИзделия()
