&НаКлиенте
Процедура ЗаполнитьСписокДолжности(СписокВыбора) Экспорт
	
	СписокВыбора.Добавить("Дизайнер");
	СписокВыбора.Добавить("Менеджер");
	СписокВыбора.Добавить("Замерщик");
	СписокВыбора.Добавить("Ведущий конструктор");
	СписокВыбора.Добавить("Конструктор");
	
КонецПроцедуры // ЗаполнитьСписокДолжности()

&НаКлиенте
Функция ТипАдресацииПоОбъекту(ОбъектАдресации) Экспорт

	ТипАдресации = "";
	
	Если ЗначениеЗаполнено(ОбъектАдресации) Тогда
	
		ТипОбъектАдресации = ТипЗнч(ОбъектАдресации);
		
		Если ТипОбъектАдресации = Тип("СправочникСсылка.ИзделияЗаказчика") Тогда
		
			ТипАдресации = "Изделие заказчика";	

		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.ИзделияКомплект") Тогда
		
			ТипАдресации = "Комплект";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Композиции") Тогда
		
			ТипАдресации = "Композиция";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Проекты") Тогда
		
			ТипАдресации = "Проект";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Помещения") Тогда
		
			ТипАдресации = "Помещение";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Контрагенты") Тогда
		
			ТипАдресации = "Контрагент";		
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТипАдресации;

КонецФункции // ТипАдресацииПоОбъекту()
