&НаКлиенте
Процедура ЗаполнитьСписокДолжности(СписокВыбора) Экспорт
	
	СписокВыбора.Добавить("Дизайнер");
	СписокВыбора.Добавить("Менеджер");
	СписокВыбора.Добавить("Замерщик");
	СписокВыбора.Добавить("Ведущий конструктор");
	СписокВыбора.Добавить("Конструктор");
	
КонецПроцедуры // ЗаполнитьСписокДолжности()

&НаКлиенте
Функция ТипАдресацииПоОбъекту(ОбъектАдресации) Экспорт

	ТипАдресации = "";
	
	Если ЗначениеЗаполнено(ОбъектАдресации) Тогда
	
		ТипОбъектАдресации = ТипЗнч(ОбъектАдресации);
		
		Если ТипОбъектАдресации = Тип("СправочникСсылка.ИзделияЗаказчика") Тогда
		
			ТипАдресации = "Изделие заказчика";	

		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.ИзделияКомплект") Тогда
		
			ТипАдресации = "Комплект";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Композиции") Тогда
		
			ТипАдресации = "Композиция";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Проекты") Тогда
		
			ТипАдресации = "Проект";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Помещения") Тогда
		
			ТипАдресации = "Помещение";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("СправочникСсылка.Контрагенты") Тогда
		
			ТипАдресации = "Контрагент";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("ЗадачаСсылка.Задачи_РКД") Тогда
		
			ТипАдресации = "Задачи РКД";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
		
			ТипАдресации = "Задачи ПКД";		
		
		ИначеЕсли ТипОбъектАдресации = Тип("ДокументСсылка.Рекламации") Тогда
		
			ТипАдресации = "Рекламация";		
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТипАдресации;

КонецФункции // ТипАдресацииПоОбъекту()

&НаКлиенте
Функция ОткрытьПустуюОбщуюЗадачу(ПараметыОткрытия, ФормаРодитель, ОписаниеОповещение = Неопределено) Экспорт
	
	ОткрытьФорму("Задача.ЗадачиОбщие.ФормаОбъекта", ПараметыОткрытия, ФормаРодитель, , , , ОписаниеОповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	

КонецФункции // ОткрытьПустуюОбщуюЗадачу()

&НаКлиенте
Функция ПолучитьПараметОткрытияОбщейЗадачи(СвязаннаяЗадача = Неопределено) Экспорт

	ПараметыОткрытия = Новый Структура();
	ПараметыОткрытия.Вставить("ТипЗадачи", 			ПредопределенноеЗначение("Перечисление.ТипыОбщихЗадач.Вопрос"));	
	ПараметыОткрытия.Вставить("СвязаннаяЗадача", 	СвязаннаяЗадача);	
	ПараметыОткрытия.Вставить("Проект", 			);	
	ПараметыОткрытия.Вставить("Исполнитель", 		);	
	ПараметыОткрытия.Вставить("ОбъектАдресации", 	);	         	
	
	Возврат ПараметыОткрытия;

КонецФункции // ПолучитьПараметОткрытияОбщейЗадачи()
