&НаСервере
Функция ПолучитьНормуРасхода(ЗначениеДляНормы) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЗначениеДляНормы) Тогда
		Возврат 0;
	КонецЕсли;
	
	ТипЗначениеДляНормы = ТипЗнч(ЗначениеДляНормы);
	
	Если ТипЗначениеДляНормы = Тип("ПеречислениеСсылка.ТипыНоменклатуры") Тогда
		стСписокИмен = Отчеты.ОбщиеНастройки.Создать().ПолучитьСписокИменРеквизитов(Истина);
		
		НаименованиеНастройки = "";
		
		Для каждого х Из стСписокИмен Цикл
			Если х.Значение = ЗначениеДляНормы Тогда
				НаименованиеНастройки = х.Ключ;	
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		
		Если НЕ ПустаяСтрока(НаименованиеНастройки) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НастройкиПроекта.Значение КАК Значение
			|ИЗ
			|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
			|ГДЕ
			|	НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)
			|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
			
			Запрос.УстановитьПараметр("ИмяНастройки", НаименованиеНастройки);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Возврат Выборка.Значение;
			КонецЦикла;
		КонецЕсли;
		
		
	ИначеЕсли ТипЗначениеДляНормы = Тип("ПеречислениеСсылка.ПредварительнаяНоменклатура") Тогда
		
		Возврат ЗначениеДляНормы.НормаРасхода;
		
		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции // ПолучитьНормуРасхода()

&НаСервере
Функция ПолучитьНормуРасходаИзТипа(ТипНоменклатуры,тзКэшНормаРасхода) Экспорт
	
	НайденаяСтрока = тзКэшНормаРасхода.Найти(ТипНоменклатуры, "ТипНоменклатуры");
	Если НайденаяСтрока = Неопределено Тогда
		НайденаяСтрока = тзКэшНормаРасхода.Добавить();
		НайденаяСтрока.ТипНоменклатуры = ТипНоменклатуры;
		НайденаяСтрока.НормаРасхода = ПолучитьНормуРасхода(ТипНоменклатуры);
	КонецЕсли;
	
	Возврат НайденаяСтрока.НормаРасхода
	

КонецФункции // ПолучитьНормуРасходаИзТипа(ТипНоменклатуры,тзКэшНормаРасхода)


&НаСервере
Функция ПолучитьПустуюТаблицуКэнНормыРасходов() Экспорт

	тзКэшНормаРасхода = Новый ТаблицаЗначений;
	тзКэшНормаРасхода.Колонки.Добавить("ТипНоменклатуры",Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"));
	тзКэшНормаРасхода.Колонки.Добавить("НормаРасхода",Новый ОписаниеТипов("Число"));
	
	Возврат тзКэшНормаРасхода;
КонецФункции // ПолучитьПустуюТаблицуКэнНормыРасходов()
