
&НаКлиенте
Процедура Заменить(Команда)

	стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(ИзделиеКомплект, "Конструктор", Новый Структура("Отменить", 1));
	
	Если НЕ ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
		ПоказатьПредупреждение(,стВозврата.ОписаниеОшибки);	
	КонецЕсли;
	
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК ИзделиеКомплект,
		|	ДанныеКомплекта.Конструктор КАК Конструктор
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|		ПО ДанныеКомплекта.Комплект = ИзделияКомплект.Ссылка
		|ГДЕ
		|	ИзделияКомплект.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Параметры.КодКомплекта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ИзделиеКомплект = Выборка.ИзделиеКомплект;
		Конструктор 	= Выборка.Конструктор;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ИзделиеКомплект) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

