
Процедура СоздатьЗадачуПересоглосования(Композиция) Экспорт
	
	ОбъектЗадача 						= Задачи.ПересогласованиеКомпозиции.СоздатьЗадачу();
	ОбъектЗадача.ОбъектТЗ 				= Композиция;
	ОбъектЗадача.Дата 					= ТекущаяДата();
	ОбъектЗадача.Наименование			= ОбъектЗадача.ПолучитьЗаголовок();	
    ОбъектЗадача.Заголовок				= ОбъектЗадача.Наименование;
    ОбъектЗадача.КрайняяДатаИсполнения	= омДаты.ДобавитьДниСУчетомВыходных(ОбъектЗадача.Дата, 1);
	
	ДанныеКомпозиции = ПолучитьПроектНаСервере(Композиция);
	
	ОбъектЗадача.Проект = ДанныеКомпозиции.Проект;
	
	Для каждого х Из ДанныеКомпозиции.Комплекты Цикл
		ЗаполнитьЗначенияСвойств(ОбъектЗадача.Комплекты.Добавить(), х);
	КонецЦикла;
	
	ОбъектЗадача.Исполнитель 			= омСотрудники.СотрудникиОбъекта(ОбъектЗадача.ОбъектТЗ).ВедущийКонструктор;
	ОбъектЗадача.КонструкторКомпозиции 	= омСотрудники.ПолучитьКонструктораРазработкиСотрудникПоОбъекту(ОбъектЗадача.ОбъектТЗ);
	
	ОбъектЗадача.Записать();
	
КонецПроцедуры

Функция ПолучитьПроектНаСервере(ОбъектТЗ) Экспорт
	
	ДанныеКомпозиции =  Новый Структура("Проект, Комплекты", ОбъектТЗ.Проект, Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Комплект,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО (ДанныеКомплектаСрезПоследних.Комплект = ИзделияКомплект.Ссылка)
		|ГДЕ
		|	ИзделияКомплект.Родитель.Композиция = &Композиция
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзделияКомплект.Наименование";
	
	Запрос.УстановитьПараметр("Композиция", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДанныеКомплета = Новый Структура("Комплект, Конструктор", Выборка.Комплект, Выборка.Конструктор);
		ДанныеКомпозиции.Комплекты.Добавить(ДанныеКомплета);
	КонецЦикла;
	
	Возврат ДанныеКомпозиции;	
	
КонецФункции // ПолучитьПроектНаСервере()
