
Процедура ПередЗаписью(Отказ)
	Заголовок 	= ПолучитьЗаголовок();
КонецПроцедуры

Функция ПолучитьЗаголовок() Экспорт 
	Возврат Строка(ОбъектТЗ) + ".Пересогласование";	
КонецФункции // ПолучитьЗаголовок()

Процедура ПриВыполнении(Отказ)
	
	ДополнительныеСвойстваЗадачи = Новый СписокЗначений;
	ДополнительныеСвойстваЗадачи.Добавить("НеПроверятьОбобщеность", Истина);
	
	
	стПараметры = омЗадачиПКДСервер.ПолучитьСтркутуркДляСозданияПКД(ОбъектТЗ, Проект); 
	стПараметры.Вставить("Статус", 		Перечисления.СтатусыЗадач.Редакция);
	стПараметры.Вставить("Состояние", 	Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
	стПараметры.Вставить("ТипЗадачи", 	Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором);
	
	омЗадачиПКДСервер.СоздатьЗадачуПКД(ОбъектТЗ, КонструкторКомпозиции, стПараметры, Ссылка, , ДополнительныеСвойстваЗадачи);
	омКонструктор.ИзменитьКонструктораНаСервере(ОбъектТЗ, КонструкторКомпозиции);
	
	Для каждого ТекущийКомплект Из Комплекты Цикл
		
		стПараметры.ОбобщеннаяЗадача = КонструкторКомпозиции = ТекущийКомплект.Конструктор;
		омЗадачиПКДСервер.СоздатьЗадачуПКД(ТекущийКомплект.Комплект, ТекущийКомплект.Конструктор, стПараметры, Ссылка, , ДополнительныеСвойстваЗадачи);
		омКонструктор.ИзменитьКонструктораНаСервере(ТекущийКомплект.Комплект, ТекущийКомплект.Конструктор);
		
	КонецЦикла;
	
	
КонецПроцедуры


