
Процедура ПередЗаписью(Отказ)
	Заголовок 	= ПолучитьЗаголовок();
КонецПроцедуры

Функция ПолучитьЗаголовок() Экспорт 
	Возврат Строка(ОбъектТЗ) + ".Пересогласование";	
КонецФункции // ПолучитьЗаголовок()

Процедура ПриВыполнении(Отказ)
	
	ДополнительныеСвойстваЗадачи = Новый СписокЗначений;
	ДополнительныеСвойстваЗадачи.Добавить("НеПроверятьОбобщеность", Истина);
	
	
	стПараметры = омЗадачиПКДСервер.ПолучитьСтркутуркДляСозданияПКД(ОбъектТЗ, Проект); 
	стПараметры.Вставить("Статус", 		Перечисления.СтатусыЗадач.Редакция);
	стПараметры.Вставить("Состояние", 	Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
	стПараметры.Вставить("ТипЗадачи", 	Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором);
	
	омЗадачиПКДСервер.СоздатьЗадачуПКД(ОбъектТЗ, омСотрудники.ПолучитьПользователяПоСотруднтку(КонструкторКомпозиции), стПараметры, Ссылка, , ДополнительныеСвойстваЗадачи);
	омКонструктор.ИзменитьКонструктораНаСервере(ОбъектТЗ, КонструкторКомпозиции); 
	
	КомплектДляЗакрытия = Новый Массив;
	
	НачатьТранзакцию();
	
	Для каждого ТекущийКомплект Из Комплекты Цикл
		
		Если ТекущийКомплект.Выбрать Тогда
			
			стПараметры.ОбобщеннаяЗадача = КонструкторКомпозиции = ТекущийКомплект.Конструктор;
			омЗадачиПКДСервер.СоздатьЗадачуПКД(ТекущийКомплект.Комплект, ТекущийКомплект.Конструктор, стПараметры, Ссылка, , ДополнительныеСвойстваЗадачи);
			омКонструктор.ИзменитьКонструктораНаСервере(ТекущийКомплект.Комплект, омСотрудники.ПолучитьПользователяПоСотруднтку(ТекущийКомплект.Конструктор));
			
			КомплектДляЗакрытия.Добавить(ТекущийКомплект.Комплект);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК Задача
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ В(&КомплектдляЗакрытия)
		|	И НЕ Задачи_РКД.Выполнена";
	
	Запрос.УстановитьПараметр("КомплектДляЗакрытия", КомплектДляЗакрытия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		омЗадачиРКДНаСервере.ЗакрытьЗадачуРКД(Выборка.Задача);
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры


