
Процедура ПередЗаписью(Отказ)
	Заголовок 	= ПолучитьЗаголовок();
КонецПроцедуры

Функция ПолучитьЗаголовок() Экспорт 
	Возврат Строка(ОбъектТЗ) + ".Пересогласование";	
КонецФункции // ПолучитьЗаголовок()

Процедура ПриВыполнении(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДополнительныеСвойстваЗадачи = Новый СписокЗначений;
	ДополнительныеСвойстваЗадачи.Добавить("НеПроверятьОбобщеность", Истина);
	
	СтатусыДействия = омЗадачиПКДСервер.ПолучитьСтатусЗадачиПоДействию(Действие);
	
	стПараметры = омЗадачиПКДСервер.ПолучитьСтркутуркДляСозданияПКД(ОбъектТЗ, Проект); 
	стПараметры.Вставить("Статус", 		СтатусыДействия.Статус);
	стПараметры.Вставить("Состояние", 	Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
	стПараметры.Вставить("ТипЗадачи", 	СтатусыДействия.Тип);
	
	омЗадачиПКДСервер.СоздатьЗадачуПКД(ОбъектТЗ, омСотрудники.ПолучитьПользователяПоСотруднтку(КонструкторКомпозиции), стПараметры, Ссылка, , ДополнительныеСвойстваЗадачи);
	омКонструктор.ИзменитьКонструктораНаСервере(ОбъектТЗ, КонструкторКомпозиции); 
	
	КомплектДляЗакрытия = Новый Массив;
	
	НачатьТранзакцию();
	
	Для каждого ТекущийКомплект Из Комплекты Цикл
		
		Если ТекущийКомплект.Выбрать Тогда
			
			стПараметры.ОбобщеннаяЗадача = КонструкторКомпозиции = ТекущийКомплект.Конструктор;
			омЗадачиПКДСервер.СоздатьЗадачуПКД(ТекущийКомплект.Комплект, ТекущийКомплект.Конструктор, стПараметры, Ссылка, , ДополнительныеСвойстваЗадачи);
			омКонструктор.ИзменитьКонструктораНаСервере(ТекущийКомплект.Комплект, омСотрудники.ПолучитьПользователяПоСотруднтку(ТекущийКомплект.Конструктор));
			
			КомплектДляЗакрытия.Добавить(ТекущийКомплект.Комплект);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК Задача
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ В(&КомплектдляЗакрытия)
		|	И НЕ Задачи_РКД.Выполнена";
	
	Запрос.УстановитьПараметр("КомплектДляЗакрытия", КомплектДляЗакрытия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		омЗадачиРКДНаСервере.ЗакрытьЗадачуРКД(Выборка.Задача, , "Закрыта на пересогласование");
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК Задача
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ В(&КомплектдляЗакрытия)
		|	И НЕ Задачи_РКД.Выполнена";
	
	Запрос.УстановитьПараметр("КомплектДляЗакрытия", КомплектДляЗакрытия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		омЗадачиРКДНаСервере.ЗакрытьЗадачуРКД(Выборка.Задача);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКарточки.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
		|		ПО КанбанКарточки.УИД = КанбанПереходКарточкиСрезПоследних.УИДКарточка
		|ГДЕ
		|	КанбанКарточки.Ресурс В(&КомплектДляЗакрытия)
		|	И КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка В(&УИДКудаКолонка)";
	
	
	УИДДоски 		= омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиПроизводство");
	
	УИДКудаКолонка 	= омКанбанДоскиНаСервереПовтор.ПолучитьУИДКолонокДоски(УИДДоски);  
	УИД_Ожидания 	= омКанбанДоскиНаСервереПовтор.ПолучитьУИДКолонки(УИДДоски, "_Ожидание_Производства");
	ИндексОжидания 	= УИДКудаКолонка.Найти(УИД_Ожидания);
	
	Если НЕ ИндексОжидания = Неопределено Тогда
		УИДКудаКолонка.Удалить(ИндексОжидания);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("УИДКудаКолонка", 		УИДКудаКолонка);
	Запрос.УстановитьПараметр("КомплектДляЗакрытия", 	КомплектДляЗакрытия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТегПересогласования = Справочники.Теги.Пересогласование;
	
	Пока Выборка.Следующий() Цикл
		Если омКанбанПроизводство.РесурсВПроизводстве(Выборка.УИД) Тогда
			омКанбанДоскиНаСервере.ПеревестиКарточкуВПриостановку(УИДДоски, Неопределено, Строка(Ссылка), Выборка.УИД, УИД_Ожидания);
			омКанбанДоскиНаСервере.ЗаписатьТег(ТегПересогласования, Выборка.УИД);
		КонецЕсли;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры


