
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектТЗ", ОбъектТЗ);
	
	Если ЗначениеЗаполнено(ОбъектТЗ) Тогда
		Элементы.ОбъектТЗ.Заголовок = ОбъектТЗ.Метаданные().Представление();
	Иначе
		Отказ = Истина
	КонецЕсли; 
	
	//омКартинкиНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКартинки);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайл(Команда)
	омКартинкиНаКлиенте.ВыбратьКартинку(ОбъектТЗ, ОписаниеФайла, УникальныйИдентификатор);
	Оповестить("ИзменилииКартинкиОбъектТЗ", Новый Структура("ОбъектТЗ", ОбъектТЗ));
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеФайлаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элементы.ВыбратьФайл.Доступность = ЗначениеЗаполнено(Текст);
КонецПроцедуры
