
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектТЗ", 					ОбъектТЗ);
	Параметры.Свойство("ДополнительныеТипыФайлов", 	ДополнительныеТипыФайлов);
	
	Если ЗначениеЗаполнено(ОбъектТЗ) Тогда
		Элементы.ОбъектТЗ.Заголовок = ОбъектТЗ.Метаданные().Представление();
	Иначе
		Отказ = Истина
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайл(Команда)
	омКартинкиНаКлиенте.ВыбратьКартинку(ОбъектТЗ, ОписаниеФайла, УникальныйИдентификатор, ДополнительныеТипыФайлов);
	Оповестить("ИзменилииКартинкиОбъектТЗ", Новый Структура("ОбъектТЗ", ОбъектТЗ));
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеФайлаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элементы.ВыбратьФайл.Доступность = ЗначениеЗаполнено(Текст);
КонецПроцедуры
