&НаКлиенте
Функция СохранитьФайлТЗВоВременномКаталоге(ОбъектТЗ, Версия, УникальныйИдентификатор, ПараметрыСохранения) Экспорт
	
	ИмяФайла = "";
	АдресВХ = омТЗСервер.ПолучитьАдресВременногоХранилища(ОбъектТЗ, Версия, ИмяФайла, УникальныйИдентификатор);
	
	Если ПустаяСтрока(ИмяФайла) Тогда
		
		Возврат Новый Структура("Ошибка", "Файл не найден");
		
	КонецЕсли;
	
	ПолноеИмяФайла = КаталогВременныхФайлов() + ИмяФайла + ".pdf";
	Файл = Новый Файл(ПолноеИмяФайла);
	
	Если Файл.Существует() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытиеФайлаПродолжение", омТЗКлиент, Новый Структура("АдресВХ, ПолноеИмяФайла, ПараметрыСохранения, Версия, ОбъектТЗ", АдресВХ, ПолноеИмяФайла, ПараметрыСохранения, Версия, ОбъектТЗ));
		
		Попытка
			
			НачатьУдалениеФайлов(ОписаниеОповещения, ПолноеИмяФайла);
			
		Исключение
			
			Возврат Новый Структура("Ошибка", "Файл уже открыт");
			
		КонецПопытки;
		
	Иначе
		
		ОткрытиеФайлаПродолжение(Новый Структура("АдресВХ, ПолноеИмяФайла, ПараметрыСохранения, Версия, ОбъектТЗ", АдресВХ, ПолноеИмяФайла, ПараметрыСохранения, Версия, ОбъектТЗ));
		
	КонецЕсли;
	
	Возврат Новый Структура("Ошибка", "");
	
КонецФункции // СохранитьФайлТЗВоВременномКаталоге() 

&НаКлиенте
Процедура ОткрытиеФайлаПродолжение(стПараметры) Экспорт

	Если ПустаяСтрока(стПараметры.АдресВХ) Тогда
		Возврат;	
	КонецЕсли;
	
	Двоичное = ПолучитьИзВременногоХранилища(стПараметры.АдресВХ);  // по адресу временного хранилища получаем двоичные данные
	Двоичное.Записать(стПараметры.ПолноеИмяФайла);
	
	Оповестить("ЗаписанФайлТЗ", Новый Структура("ПолноеИмяФайла, ПараметрыСохранения, Версия, ОбъектТЗ"
	, стПараметры.ПолноеИмяФайла, стПараметры.ПараметрыСохранения, стПараметры.Версия, стПараметры.ОбъектТЗ)); 
		
КонецПроцедуры // ОткрытиеФайлаПродолжение()


