
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПоступлениеМатериалов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеМатериалов.Автор,
	|	ПоступлениеМатериалов.Дата,
	|	ПоступлениеМатериалов.Комментарий,
	|	ПоступлениеМатериалов.Номер,
	|	ПоступлениеМатериалов.Поставщик,
	|	ПоступлениеМатериалов.Склад,
	|	ПоступлениеМатериалов.Материалы.(
	|		НомерСтроки,
	|		Номенклатура,
	|		ЕдиницыИзмерения,
	|		Коэффициент,
	|		Количество,
	|		Цена,
	|		Сумма,
	|		Проект,
	|		ДопРасходы
	|	),
	|	ПоступлениеМатериалов.ДопРасходы.(
	|		НомерСтроки,
	|		Услуга,
	|		Количество,
	|		Цена,
	|		СуммаСНДС
	|	)
	|ИЗ
	|	Документ.ПоступлениеМатериалов КАК ПоступлениеМатериалов
	|ГДЕ
	|	ПоступлениеМатериалов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьМатериалыШапка = Макет.ПолучитьОбласть("МатериалыШапка");
	ОбластьМатериалы = Макет.ПолучитьОбласть("Материалы");
	ОбластьДопРасходыШапка = Макет.ПолучитьОбласть("ДопРасходыШапка");
	ОбластьДопРасходы = Макет.ПолучитьОбласть("ДопРасходы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьМатериалыШапка);
		ВыборкаМатериалы = Выборка.Материалы.Выбрать();
		Пока ВыборкаМатериалы.Следующий() Цикл
			ОбластьМатериалы.Параметры.Заполнить(ВыборкаМатериалы);
			ТабДок.Вывести(ОбластьМатериалы, ВыборкаМатериалы.Уровень());
		КонецЦикла;
		
		ВыборкаДопРасходы = Выборка.ДопРасходы.Выбрать();
		Если ВыборкаДопРасходы.Количество() > 0 Тогда
			ТабДок.Вывести(ОбластьДопРасходыШапка);
			Пока ВыборкаДопРасходы.Следующий() Цикл
				ОбластьДопРасходы.Параметры.Заполнить(ВыборкаДопРасходы);
				ТабДок.Вывести(ОбластьДопРасходы, ВыборкаДопРасходы.Уровень());
			КонецЦикла;
			
		КонецЕсли;
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
