
Процедура ОбработкаПроведения(Отказ, Режим)
	
		
	ПустойКомплект = Справочники.ИзделияКомплект.ПустаяСсылка();
	
    тзЗаказы = омРассчетИзделияКомплект.ОпределениеОстаткаПоступления(Дата,Материалы.ВыгрузитьКолонку("Номенклатура"),Поставщик);

	стОтбор = Новый Структура("Номенклатура", );
	Движения.ЗаказПоставщику.Записывать = Истина;
	Движения.ОстаткиТоваровНаСкладах.Записывать = Истина;

	Для Каждого ТекСтрокаНоменклатура Из Материалы Цикл
		текКоличество = ТекСтрокаНоменклатура.Количество * ТекСтрокаНоменклатура.Коэффициент;
		
		Если текКоличество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ОстаткиТоваровНаСкладах.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
		Движение.Период 			= Дата;
		Движение.Номенклатура 		= ТекСтрокаНоменклатура.Номенклатура;
		Движение.Склад 				= Склад;
		Движение.Количество 		= ТекСтрокаНоменклатура.Количество;
		Движение.СуммаСНДС 			= ТекСтрокаНоменклатура.Сумма;
		
		стОтбор.Номенклатура = ТекСтрокаНоменклатура.Номенклатура;
		НайденыеСтроки = тзЗаказы.НайтиСтроки(стОтбор);
		ВсегоСтрок = НайденыеСтроки.Количество() - 1;
		Для текИндекс = 0 По ВсегоСтрок Цикл
			х = НайденыеСтроки[текИндекс];
			Если текКоличество > х.Количество Тогда
				текКоличество = текКоличество - х.Количество;
				
				Движение 					= Движения.ЗаказПоставщику.Добавить();
				Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
				Движение.Период 			= Дата;
				Движение.Номенклатура 		= ТекСтрокаНоменклатура.Номенклатура;
				Движение.Поставщик 			= Поставщик;
				Движение.Количество 		= х.Количество;
				
				х.Количество = 0;
			Иначе
				х.Количество = х.Количество - текКоличество;	
				
				Движение 					= Движения.ЗаказПоставщику.Добавить();
				Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
				Движение.Период 			= Дата;
				Движение.Номенклатура 		= ТекСтрокаНоменклатура.Номенклатура;
				Движение.Поставщик 			= Поставщик;
				Движение.ИзделиеКомплект 	= х.ИзделиеКомплект;
				Движение.Количество 		= текКоличество;
				
				текКоличество = 0;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры     


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ОбщаяСуммаДопРасхода = ДопРасходы.Итог("СуммаСНДС");
	ОбщаяСуммаМатериала = Материалы.Итог("Сумма");
	СуммаДокумента = ОбщаяСуммаДопРасхода + ОбщаяСуммаМатериала; 
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказыПоставщику") Тогда
		// Заполнение шапки
		Поставщик = ДанныеЗаполнения.Поставщик;
		Для Каждого ТекСтрокаНоменклатура Из ДанныеЗаполнения.Номенклатура Цикл
			НоваяСтрока = Материалы.Добавить();
			НоваяСтрока.Количество = ТекСтрокаНоменклатура.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаНоменклатура.Номенклатура;
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.ЕдиницыИзмерения = ТекСтрокаНоменклатура.Номенклатура.ОсновнаяЕдиницаИзмерения;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


