
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СозданаИзмененаНастройка" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	лПараметры = Новый Структура;
	лПараметры.Вставить("НастройкаПодключения", ВыбраннаяСтрока); 
	ОткрытьФорму("РегистрСведений.Б24_СМ_НастройкиСмартПроцессов.Форма.ФормаЗаписи", лПараметры);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Настроить(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		лПараметры = Новый Структура;
		лПараметры.Вставить("НастройкаПодключения", ТекущаяСтрока); 
		ОткрытьФорму("РегистрСведений.Б24_СМ_НастройкиСмартПроцессов.Форма.ФормаЗаписи", лПараметры);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо создать настройку подключения");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСинхронизацию(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Если Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(ТекущаяСтрока, "ПометкаУдаления") = Ложь Тогда
			
			Если НЕ НастройкаСинхронизацииСуществует(ТекущаяСтрока) Тогда
				ПоказатьПредупреждение(, "Не заданы настройки синхронизации",10);
				Возврат;
			КонецЕсли;
			
			Если Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.РасширениеВБезопасномРежиме() Тогда
				ПоказатьПредупреждение(, "Расширение модуля в безопасном режиме. Продолжение невозможно",10);
				Возврат;
			КонецЕсли;
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("НастройкаПодключения"	, ТекущаяСтрока);
			ПараметрыФормы.Вставить("ВидСинхронизации"		, 7);
			ПараметрыФормы.Вставить("ПолнаяСинхронизация"	, Ложь);
			
			ОткрытьФорму("РегистрСведений.Б24_СМ_НастройкиСмартПроцессов.Форма.ФормаВыполнениеСинхронизации", ПараметрыФормы, , ТекущаяСтрока);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПолнуюСинхронизацию(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Если Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(ТекущаяСтрока, "ПометкаУдаления") = Ложь Тогда
			
			Если НЕ НастройкаСинхронизацииСуществует(ТекущаяСтрока) Тогда
				ПоказатьПредупреждение(, "Не заданы настройки синхронизации",10);
				Возврат;
			КонецЕсли;
			
			Если Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.РасширениеВБезопасномРежиме() Тогда
				ПоказатьПредупреждение(, "Расширение модуля в безопасном режиме. Продолжение невозможно",10);
				Возврат;
			КонецЕсли;
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("НастройкаПодключения"	, ТекущаяСтрока);
			ПараметрыФормы.Вставить("ВидСинхронизации"		, 7);
			ПараметрыФормы.Вставить("ПолнаяСинхронизация"	, Истина);
			
			ОткрытьФорму("РегистрСведений.Б24_СМ_НастройкиСмартПроцессов.Форма.ФормаВыполнениеСинхронизации", ПараметрыФормы, , ТекущаяСтрока);
			
		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Функция НастройкаСинхронизацииСуществует(НастройкаПодключения)
	
	Возврат РегистрыСведений.Б24_СМ_НастройкиСмартПроцессов.ПолучитьМассивНастроекСинхронизации("НастройкаПодключения", НастройкаПодключения).Количество() > 0;
	
КонецФункции

&НаКлиенте
Процедура ЗарегистрированныеИзменения(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ПараметрыВыбора = Новый Структура("НастройкаПодключения", ТекущаяСтрока);
		ОткрытьФорму("РегистрСведений.Б24_СМ_ТаблицаИзменений.ФормаСписка", ПараметрыВыбора, ЭтаФорма);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторыЭлементов(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ПараметрыВыбора = Новый Структура("НастройкаПодключения", ТекущаяСтрока);
		ОткрытьФорму("РегистрСведений.Б24_СМ_ИдентификаторыОбъектов.ФормаСписка", ПараметрыВыбора, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры


