&НаКлиенте
Процедура ПодключитьОпросСообщений() Экспорт
	
	ИнтервалОпросаСообщений = омСообщенияНаСервере.ПолучитьИнтервалОпросаСообщений();
	
	Если ИнтервалОпросаСообщений = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("НачатьПоискСообщений", ИнтервалОпросаСообщений);
	
	
КонецПроцедуры // ПодключитьОпросСообщений()

&НаКлиенте
Процедура ВывестиСообщениеПриНеАктивной1С(ТекстСообщения, ТекстЗаголовка = "", ВремяПоказа = 10, Кнопки = 0, Значок = 48) Экспорт
	
	//Shell= Новый COMОбъект("Wscript.Shell");
	//Shell.Popup(ТекстСообщения, ВремяПоказа, ТекстЗаголовка, Кнопки + Значок);
	
	// где <Кнопка> это
	
	//0 - кнопка ОК.
	//1 - кнопки ОК и Отмена.
	//2 - кнопки Стоп, Повтор, Пропустить.
	//3 - кнопки Да, Нет, Отмена.
	//4 - кнопки Да и Нет.
	//5 - кнопки Повтор и Отмена.
	
	//где <Значок> это:
	
	//16 - значок Stop.
	//32 - значок Question.
	//48 - значок Exclamation.
	//64 - значок Information.
	
	
КонецПроцедуры // ВывестиСообщениеПриНеАктивной1С()

