
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыездНаЗамер.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВыездНаЗамер КАК ВыездНаЗамер
		|ГДЕ
		|	ВыездНаЗамер.Основание = &Ссылка
		|	И ВыездНаЗамер.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ДокументыДляВыезда.Документы КАК Документ.ЗаявкаНаЗамер) КАК Документ,
		|	ДокументыДляВыезда.ДатаВыезда КАК ДатаВыезда
		|ИЗ
		|	РегистрСведений.ДокументыДляВыезда КАК ДокументыДляВыезда
		|ГДЕ
		|	ДокументыДляВыезда.Документы = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	
	ЕстьВыездНаЗамер = Ложь;
	
	Пока Выборка.Следующий() Цикл
		ЕстьВыездНаЗамер = Истина;
	КонецЦикла;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	
	ЕстьВРегистре = Ложь;
	
	Пока Выборка.Следующий() Цикл
		ЕстьВРегистре = ДатаВыездаПлан = Выборка.ДатаВыезда;
	КонецЦикла;
	
	Если ЕстьВыездНаЗамер И ЕстьВРегистре Тогда
		
		НаборЗаписей = РегистрыСведений.ДокументыДляВыезда.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документы.Установить(Ссылка);
		
	    НаборЗаписей.Записать();
		
	ИначеЕсли НЕ (ЕстьВыездНаЗамер ИЛИ ЕстьВРегистре) Тогда
		
		МенеджерЗаписей = РегистрыСведений.ДокументыДляВыезда.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.Документы 		= Ссылка; 
		МенеджерЗаписей.ДатаВыезда 		= ДатаВыездаПлан;
		МенеджерЗаписей.ДатаСоздания 	= Дата;
		
	    МенеджерЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		Префикс = Проект.Префикс + "-";
		УстановитьНовыйНомер(Префикс); 
	КонецЕсли;

	СокращенноеНазвание = омЗаполнениеРеквизиов.ПолучитьСокращенноеНазвание(ЭтотОбъект);
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НаборЗаписей = РегистрыСведений.ДокументыДляВыезда.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документы.Установить(Ссылка);
		
	НаборЗаписей.Записать();
		
КонецПроцедуры
 
