
#Область СтандартизированныеПроцедурыИФункции

Функция СформироватьСтруктуруНастроек(НастройкаПодключения, ПолнаяСинхронизация = Ложь, ВидСинхронизации = "", ДляДругихПодсистем = Ложь) Экспорт
		          
	//Если НЕ Б24_К_СлужебныйВызовСервера.МодульСинхронизацииДоступен(НастройкаПодключения) Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	
	Если РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьМассивНастроекСинхронизации("НастройкаПодключения", НастройкаПодключения).Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураНастроек = Б24_К_ОбщегоНазначенияВызовСервера.СформироватьСтруктуруНастроек(НастройкаПодключения, Истина);
	//СтруктураНастроек = НастройкаПодключения;
	Если СтруктураНастроек = Неопределено Тогда
		ТипыСообщений = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыСообщений();
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, ТипыСообщений.КритическаяОшибка, "Невозможно получить общие настройки. Продолжение невозможно.");
		Возврат СтруктураНастроек; 
	КонецЕсли;
	СтруктураНастроек.ПараметрКоннектора = "auth_connector=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(СтруктураНастроек.ИдентификаторПодключения);

	Если ВидСинхронизации = 1 Тогда
		СтруктураНастроек.Логирование.Измерение1 = "В режиме реального времени";
	ИначеЕсли ВидСинхронизации = 0 Тогда
		СтруктураНастроек.Логирование.Измерение1 = "По расписанию";
	ИначеЕсли ВидСинхронизации = 2 Тогда
		СтруктураНастроек.Логирование.Измерение1 = "Интеграция сервисов";
	ИначеЕсли ВидСинхронизации = 3 Тогда
		СтруктураНастроек.Логирование.Измерение1 = "Смарт-процесс";
	Иначе
		СтруктураНастроек.Логирование.Измерение1 = "Интерактивно";    
		СтруктураНастроек.Вставить("ИнтерактивныйЗапуск");	
	КонецЕсли;
	  	
	РазрешенныеТипыКартинок = Новый Массив;
	РазрешенныеТипыКартинок.Добавить("gif");
	РазрешенныеТипыКартинок.Добавить("jpg");
	РазрешенныеТипыКартинок.Добавить("jpeg");
	РазрешенныеТипыКартинок.Добавить("png");
	РазрешенныеТипыКартинок.Добавить(".gif");
	РазрешенныеТипыКартинок.Добавить(".jpg");
	РазрешенныеТипыКартинок.Добавить(".jpeg");
	РазрешенныеТипыКартинок.Добавить(".png");
	РазрешенныеТипыКартинок.Добавить("");
	СтруктураНастроек.Вставить("РасширенияКартинок", РазрешенныеТипыКартинок);
	
	СтруктураНастроек.Вставить("ВидСинхронизации"				, ВидСинхронизации);	
	СтруктураНастроек.Вставить("ПолнаяЗагрузка"					, ПолнаяСинхронизация);	
	СтруктураНастроек.Вставить("ПолнаяВыгрузка"					, ПолнаяСинхронизация);	
	СтруктураНастроек.Вставить("СтатусПроверкиОчереди"			, 0);	
	СтруктураНастроек.Вставить("КоличествоДанныхВПакете"		, 50); 	
	
	СтруктураНастроек.Вставить("ВыполненоБезОшибок"				, Истина);
	СтруктураНастроек.Вставить("ИдПроцессаЗагрузки"				, "");
	СтруктураНастроек.Вставить("ТаблицаСопоставленияИзменений"	, Новый Массив);
	СтруктураНастроек.Вставить("НеобновляемыеДанныеНаПортале"	, Новый Массив);       // например данные которые не должны обновляться на сайте(флаг)
	
	СтруктураНастроек.Вставить("ВыгружаемыеТовары"			, Неопределено);
	СтруктураНастроек.Вставить("ВыгружаемыеПредложения"		, Неопределено);
	СтруктураНастроек.Вставить("КартинкиИФайлы"			 	, Новый Массив);
	
	//СтруктураНастроек.Вставить("ИспользуетсяЦенообразование25", ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование25"));
	//СтруктураНастроек.Вставить("ИспользуетсяЦенообразование20", ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование20"));
	СтруктураНастроек.Вставить("ИспользуетсяЦенообразование25", Ложь);
	СтруктураНастроек.Вставить("ИспользуетсяЦенообразование20", Ложь);
	
	НастройкиСинхронизации = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);
	
	СтруктураНастроек.Вставить("ПорядокВыполненияСинхронизации"			, НастройкиСинхронизации.ПорядокВыполненияСинхронизации);
	СтруктураНастроек.Вставить("ИгнорироватьОшибкиВоВремяСинхронизации"	, НастройкиСинхронизации.ИгнорироватьОшибкиВоВремяСинхронизации);
	СтруктураНастроек.Вставить("КоличествоПовторенийПриОшибках"			, НастройкиСинхронизации.КоличествоПовторенийПриОшибках);
	СтруктураНастроек.Вставить("НеРегистрироватьИзмененияАвтоматически"	, НастройкиСинхронизации.НеРегистрироватьИзмененияАвтоматически);
	СтруктураНастроек.Вставить("СпособСинхронизацииДанных"				, НастройкиСинхронизации.СпособСинхронизацииДанных);
	СтруктураНастроек.Вставить("ОбрабатыватьУдалениеОбъектовВ1С"		, НастройкиСинхронизации.ОбрабатыватьУдалениеОбъектовВ1С);
	СтруктураНастроек.Вставить("ОбрабатыватьУдалениеОбъектовВБ24"		, НастройкиСинхронизации.ОбрабатыватьУдалениеОбъектовВБ24);
	СтруктураНастроек.Вставить("ВерсияСчетов"							, НастройкиСинхронизации.ВерсияСчетов);
	СтруктураНастроек.Вставить("ВерсияТоваров"							, НастройкиСинхронизации.ВерсияТоваров);
	
	СтруктураНастроек.Вставить("СинхронизацияЗаказов"					, НастройкиСинхронизации.СинхронизацияЗаказов);
	СтруктураНастроек.Вставить("СинхронизацияКлиентов"					, НастройкиСинхронизации.СинхронизацияКлиентов);
	СтруктураНастроек.Вставить("СинхронизацияСделок"					, НастройкиСинхронизации.СинхронизацияСделок);
	СтруктураНастроек.Вставить("СинхронизацияСчетов"					, НастройкиСинхронизации.СинхронизацияСчетов);
	СтруктураНастроек.Вставить("СинхронизацияТоваров"					, НастройкиСинхронизации.СинхронизацияТоваров);
	
	СохраненныеНастройкиСинхронизации = НастройкиСинхронизации.Настройки.Получить();
	Если СохраненныеНастройкиСинхронизации = Неопределено Тогда
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.КритическаяОшибка, "Невозможно получить настройки синхронизации. Будут взяты по умолчанию");
		СохраненныеНастройкиСинхронизации = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьНастройкиСинхронизацииПоУмолчанию();
	КонецЕсли;
	
	СтруктураНастроек.Вставить("Сущности"												, СохраненныеНастройкиСинхронизации.Сущности);
	
	СтруктураНастроек.Вставить("СоответствияПолейСущностейДляВыгрузкиНаПортал"			, СохраненныеНастройкиСинхронизации.СоответствияПолейСущностейДляВыгрузкиНаПортал);
	СтруктураНастроек.Вставить("СоответствияПолейСущностейДляЗагрузкиВ1С"				, СохраненныеНастройкиСинхронизации.СоответствияПолейСущностейДляЗагрузкиВ1С);
	СтруктураНастроек.Вставить("СоответствияПолейСущностейТабЧастейДляВыгрузкиНаПортал"	, СохраненныеНастройкиСинхронизации.СоответствияПолейСущностейТабЧастейДляВыгрузкиНаПортал);
	СтруктураНастроек.Вставить("СоответствияПолейСущностейТабЧастейДляЗагрузкиВ1С"		, СохраненныеНастройкиСинхронизации.СоответствияПолейСущностейТабЧастейДляЗагрузкиВ1С);
	СтруктураНастроек.Вставить("ОтборыДляВыгрузкиНаПортал"								, СохраненныеНастройкиСинхронизации.ОтборыДляВыгрузкиНаПортал);
	СтруктураНастроек.Вставить("ОтборыДляЗагрузкиДанныхВ1С"								, СохраненныеНастройкиСинхронизации.ОтборыДляЗагрузкиДанныхВ1С);
	
	СтруктураНастроек.Вставить("СтруктураСхемКомпоновки"				, РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСтруктуруСхемКомпоновки());
	
	СтруктураНастроек.Вставить("НастройкиСинхронизацииКлиентов"			, СохраненныеНастройкиСинхронизации.НастройкиСинхронизацииКлиентов);
	СтруктураНастроек.Вставить("НастройкиСинхронизацииТоваров"			, СохраненныеНастройкиСинхронизации.НастройкиСинхронизацииТоваров);
	СтруктураНастроек.Вставить("НастройкиСинхронизацииСчетов"			, СохраненныеНастройкиСинхронизации.НастройкиСинхронизацииСчетов);
	СтруктураНастроек.Вставить("НастройкиСинхронизацииСделок"			, СохраненныеНастройкиСинхронизации.НастройкиСинхронизацииСделок);
	СтруктураНастроек.Вставить("НастройкиСинхронизацииЗаказов"			, СохраненныеНастройкиСинхронизации.НастройкиСинхронизацииЗаказов);
	
	СтруктураНастроек.Вставить("ДеревоГрупп"							, СтруктураНастроек.НастройкиСинхронизацииТоваров.ДеревоГрупп);
	
	СтруктураНастроек.Вставить("ПредопределенныеСвойства", Б24_КС_ОбщегоНазначенияВызовСервераПовтИсп.СформироватьСтруктуруСвойств(НастройкаПодключения, ДляДругихПодсистем));

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Портал", СтруктураНастроек.Портал);
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_ПользователиБитрикс24.Идентификатор КАК ИдПользователя,
	|	Б24_К_ПользователиБитрикс24.Пользователь1С КАК Пользователь1С
	|ИЗ
	|	РегистрСведений.Б24_К_ПользователиБитрикс24 КАК Б24_К_ПользователиБитрикс24
	|ГДЕ
	|	Б24_К_ПользователиБитрикс24.Портал = &Портал";
	
	Запрос.Выполнить().Выгрузить();
	СтруктураНастроек.Вставить("ТаблицаСопоставленияПользователей", Запрос.Выполнить().Выгрузить()); 
	
	СтруктураНастроек.Вставить("КлючиПодчиненныхБатчЗапросов"	, Новый Соответствие);
	
	Возврат СтруктураНастроек;

КонецФункции


Процедура ПереходНаВерсию2() Экспорт
			
	ОбщегоНазначения.СообщитьПользователю("Осуществляется переход подсистемы синхронизации модуля интеграции с Битрикс24 на версию 2.0.0.0");
			
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = РегистрыСведений.Б24_КС_НастройкиСинхронизации.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка  
		
			Настройки = Выборка.Настройки.Получить();    
			
			Если Настройки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ Настройки.НастройкиСинхронизацииТоваров.Свойство("ВыгружатьПредложения") Тогда
				Настройки.НастройкиСинхронизацииТоваров.Вставить("ВыгружатьПредложения", Истина);
			КонецЕсли;
			
			Если НЕ Настройки.НастройкиСинхронизацииТоваров.Свойство("ИдентификаторКаталогаТоваров") Тогда
				Настройки.НастройкиСинхронизацииТоваров.Вставить("ИдентификаторКаталогаТоваров", "");
			КонецЕсли;   
			
			Если НЕ Настройки.НастройкиСинхронизацииТоваров.Свойство("ИдентификаторКаталогаПредложений") Тогда
				Настройки.НастройкиСинхронизацииТоваров.Вставить("ИдентификаторКаталогаПредложений", "");
			КонецЕсли;
			
			Если НЕ Настройки.НастройкиСинхронизацииСделок.Свойство("НоменклатураДоставка") Тогда
				Настройки.НастройкиСинхронизацииТоваров.Вставить("НоменклатураДоставка", Справочники.Номенклатура.ПустаяСсылка());
			КонецЕсли;
			
#Область ЗаполнениеПоТовару2     
            // очистка, если ранее уже было.
			//Для каждого ТекЭлемент Из Настройки.Сущности Цикл
			//	Если ТекЭлемент.ВидСущности = "Товар2" ИЛИ ТекЭлемент.ВидСущности = "Предложение" Тогда     
			//		 ТекЭлемент.ВидСущности = "НеИспользовать";
			//	КонецЕсли;
			//КонецЦикла;
			//
			//Для каждого ТекЭлемент Из Настройки.ОтборыДляВыгрузкиНаПортал Цикл
			//	Если ТекЭлемент.ВидСущности = "Товар2" ИЛИ ТекЭлемент.ВидСущности = "Предложение" Тогда     
			//		 ТекЭлемент.ВидСущности = "НеИспользовать";
			//	КонецЕсли;
			//КонецЦикла;
			
			ЕстьТовары2 	= Ложь;
			ЕстьПредложения = Ложь;    
			Для каждого ТекЭлемент Из Настройки.Сущности Цикл
				Если ТекЭлемент.ВидСущности = "Товар2" Тогда  
					ЕстьТовары2 = Истина;
				КонецЕсли;
				Если ТекЭлемент.ВидСущности = "Предложение" Тогда
					ЕстьПредложения = Истина;
				КонецЕсли;
			КонецЦикла;
			              
			СтруктураДанныхКонструктораИнтеграцийПоУмолчанию = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСтруктуруДанныхКонструктораИнтеграцийПоУмолчанию();   
			
			мНовыеСущности = Новый Массив;
			Для каждого ТекЭлемент Из СтруктураДанныхКонструктораИнтеграцийПоУмолчанию.Сущности Цикл
				Если НЕ ЕстьТовары2 И ТекЭлемент.ВидСущности = "Товар2" Тогда
					мНовыеСущности.Добавить(ТекЭлемент);   
					Настройки.Сущности.Добавить(ТекЭлемент); 
				КонецЕсли;  
				Если НЕ ЕстьПредложения И ТекЭлемент.ВидСущности = "Предложение" Тогда
					мНовыеСущности.Добавить(ТекЭлемент);
					Настройки.Сущности.Добавить(ТекЭлемент); 
				КонецЕсли;  
			КонецЦикла;

			ДанныеСущности = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСоответствияВыгрузкиПоУмолчанию(мНовыеСущности);
			Для каждого ТекЭлемент Из ДанныеСущности Цикл
				Настройки.СоответствияПолейСущностейДляВыгрузкиНаПортал.Добавить(ТекЭлемент);		
			КонецЦикла;         
			
			ДанныеСущности = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСоответствияЗагрузкиПоУмолчанию(мНовыеСущности); 
			Для каждого ТекЭлемент Из ДанныеСущности Цикл
				Настройки.СоответствияПолейСущностейДляЗагрузкиВ1С.Добавить(ТекЭлемент);		
			КонецЦикла;  
			
			ДанныеСущности = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьОтборыПоВыгрузкеДанныхНаПорталПоУмолчанию(мНовыеСущности);
			Для каждого ТекЭлемент Из ДанныеСущности Цикл
				Настройки.ОтборыДляВыгрузкиНаПортал.Добавить(ТекЭлемент);		
			КонецЦикла;    
	#КонецОбласти
			
			Для каждого ТекЭлемент Из Настройки.СоответствияПолейСущностейДляЗагрузкиВ1С Цикл
				Если ТекЭлемент.ИсточникДанных = "Из заказа" Тогда
					ТекЭлемент.ИсточникДанных = "Из основания"; 	
				КонецЕсли;
			КонецЦикла;
			
			ТекЗапись = Выборка.ПолучитьМенеджерЗаписи();
			ТекЗапись.Настройки = Новый ХранилищеЗначения(Настройки);
			ТекЗапись.Записать();
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось конвертировать настройки синхронизации для настройки подключения: " + Строка(Выборка.НастройкаПодключения));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПереходНаВерсию3010() Экспорт
			
	ОбщегоНазначения.СообщитьПользователю("Осуществляется переход подсистемы синхронизации модуля интеграции с Битрикс24 на версию 3.0.1.0");
			
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = РегистрыСведений.Б24_КС_НастройкиСинхронизации.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка  
		
			Настройки = Выборка.Настройки.Получить();    
			
			Если Настройки = Неопределено Тогда
				Продолжить;
			КонецЕсли;    
			
#Область ЗаполнениеПоПредложениямНоменклатуре     
			ЕстьПредложенияНоменклатура = Ложь;    
			Для каждого ТекЭлемент Из Настройки.Сущности Цикл
				Если ТекЭлемент.ВидСущности = "Товар2" Тогда  
					ЕстьТовары2 = Истина;
				КонецЕсли;
				Если ТекЭлемент.ВидСущности = "Предложение"  И ТекЭлемент.ИмяОбъекта = "Номенклатура" Тогда
					ЕстьПредложенияНоменклатура = Истина;
				КонецЕсли;
			КонецЦикла;
			
			СтруктураДанныхКонструктораИнтеграцийПоУмолчанию = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСтруктуруДанныхКонструктораИнтеграцийПоУмолчанию();   
			
			мНовыеСущности = Новый Массив;
			Для каждого ТекЭлемент Из СтруктураДанныхКонструктораИнтеграцийПоУмолчанию.Сущности Цикл
				Если НЕ ЕстьПредложенияНоменклатура И ТекЭлемент.ВидСущности = "Предложение" И ТекЭлемент.ИмяОбъекта = "Номенклатура" Тогда
					мНовыеСущности.Добавить(ТекЭлемент);
					Настройки.Сущности.Добавить(ТекЭлемент); 
				КонецЕсли;  
			КонецЦикла;

			ДанныеСущности = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСоответствияВыгрузкиПоУмолчанию(мНовыеСущности);
			Для каждого ТекЭлемент Из ДанныеСущности Цикл
				Настройки.СоответствияПолейСущностейДляВыгрузкиНаПортал.Добавить(ТекЭлемент);		
			КонецЦикла;         
			
			ДанныеСущности = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьСоответствияЗагрузкиПоУмолчанию(мНовыеСущности); 
			Для каждого ТекЭлемент Из ДанныеСущности Цикл
				Настройки.СоответствияПолейСущностейДляЗагрузкиВ1С.Добавить(ТекЭлемент);		
			КонецЦикла;  
			
			ДанныеСущности = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьОтборыПоВыгрузкеДанныхНаПорталПоУмолчанию(мНовыеСущности);
			Для каждого ТекЭлемент Из ДанныеСущности Цикл
				Настройки.ОтборыДляВыгрузкиНаПортал.Добавить(ТекЭлемент);		
			КонецЦикла;    
	#КонецОбласти
			
			ТекЗапись = Выборка.ПолучитьМенеджерЗаписи();
			ТекЗапись.Настройки = Новый ХранилищеЗначения(Настройки);
			ТекЗапись.Записать();
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось конвертировать настройки синхронизации для настройки подключения: " + Строка(Выборка.НастройкаПодключения));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПереходНаВерсию3115() Экспорт
			
	ОбщегоНазначения.СообщитьПользователю("Осуществляется переход подсистемы синхронизации модуля интеграции с Битрикс24 на версию 3.1.1.5");
			
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = РегистрыСведений.Б24_КС_НастройкиСинхронизации.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка  
		
			Настройки = Выборка.Настройки.Получить();    
			
			Если Настройки = Неопределено Тогда
				Продолжить;
			КонецЕсли;    
			
			Для каждого ТекЭлемент Из Настройки.СоответствияПолейСущностейДляВыгрузкиНаПортал Цикл
				Если ТекЭлемент.ВидСущности = "Контакт" И ТекЭлемент.ИмяОбъекта = "Контрагенты"  И ТекЭлемент.КлючЗапроса = "HONORIFIC" Тогда
					ТекЭлемент.ИсточникДанных 	= "Предопределенный алгоритм";	
					ТекЭлемент.Значение 		= "Это ИП";	
				КонецЕсли;
			КонецЦикла;
			
			ТекЗапись = Выборка.ПолучитьМенеджерЗаписи();
			ТекЗапись.Настройки = Новый ХранилищеЗначения(Настройки);
			ТекЗапись.Записать();
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось конвертировать настройки синхронизации для настройки подключения: " + Строка(Выборка.НастройкаПодключения));
		КонецПопытки;
		
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.Б24_К_ОчередьФоновыхЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ПереходНаВерсию4000() Экспорт
			
	ОбщегоНазначения.СообщитьПользователю("Осуществляется переход подсистемы синхронизации модуля интеграции с Битрикс24 на версию 4.0.0.0");
			
	УстановитьПривилегированныйРежим(Истина);
	
	
	Выборка = РегистрыСведений.Б24_КС_НастройкиСинхронизации.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка  
			
			НастройкиСинхронизации = Выборка.Настройки.Получить();	
			Если НастройкиСинхронизации = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НастройкаПодключенияОбъект = Выборка.НастройкаПодключения.ПолучитьОбъект();       
			
			НастройкаПодключенияОбъект.ПресетыСтавокНДС.Очистить();     
			Если НастройкиСинхронизации.НастройкиСинхронизацииТоваров.Свойство("СтавкиНДС") Тогда
				НастройкаПодключенияОбъект.ПресетыСтавокНДС.Загрузить(НастройкиСинхронизации.НастройкиСинхронизацииТоваров.СтавкиНДС);
			КонецЕсли;
			
			НастройкаПодключенияОбъект.ПресетыШаблоновРеквизитов.Очистить();    
			Если НастройкиСинхронизации.НастройкиСинхронизацииКлиентов.Свойство("Пресеты") Тогда
				НастройкаПодключенияОбъект.ПресетыШаблоновРеквизитов.Загрузить(НастройкиСинхронизации.НастройкиСинхронизацииКлиентов.Пресеты);
			КонецЕсли;
			
			НастройкаПодключенияОбъект.ЗависимостиКлиентовОтТиповКонтрагентов.Очистить();    
			Если НастройкиСинхронизации.НастройкиСинхронизацииКлиентов.Свойство("ТипыКонтрагентовДляКомпаний") Тогда    
				Для каждого ТекЭлемент Из НастройкиСинхронизации.НастройкиСинхронизацииКлиентов.ТипыКонтрагентовДляКомпаний Цикл
					НоваяСтрока = НастройкаПодключенияОбъект.ЗависимостиКлиентовОтТиповКонтрагентов.Добавить();
					НоваяСтрока.ВидКлиента = "Компания";
					НоваяСтрока.Тип = ТекЭлемент.Значение;	
				КонецЦикла;
			КонецЕсли;
			Если НастройкиСинхронизации.НастройкиСинхронизацииКлиентов.Свойство("ТипыКонтрагентовДляКонтактов") Тогда    
				Для каждого ТекЭлемент Из НастройкиСинхронизации.НастройкиСинхронизацииКлиентов.ТипыКонтрагентовДляКонтактов Цикл
					НоваяСтрока = НастройкаПодключенияОбъект.ЗависимостиКлиентовОтТиповКонтрагентов.Добавить();
					НоваяСтрока.ВидКлиента = "Контакт";
					НоваяСтрока.Тип = ТекЭлемент.Значение;	
				КонецЦикла;
			КонецЕсли;
			
			НастройкаПодключенияОбъект.ПресетыТиповКлиентов.Очистить();    
			Если НастройкиСинхронизации.НастройкиСинхронизацииКлиентов.Свойство("СоответствияТиповКомпаний") Тогда    
				Для каждого ТекЭлемент Из НастройкиСинхронизации.НастройкиСинхронизацииКлиентов.СоответствияТиповКомпаний Цикл
					НоваяСтрока = НастройкаПодключенияОбъект.ПресетыТиповКлиентов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекЭлемент); 
					НоваяСтрока.ВидКлиента = "Компания";
				КонецЦикла;
			КонецЕсли;
			Если НастройкиСинхронизации.НастройкиСинхронизацииКлиентов.Свойство("СоответствияТиповКонтактов") Тогда    
				Для каждого ТекЭлемент Из НастройкиСинхронизации.НастройкиСинхронизацииКлиентов.СоответствияТиповКонтактов Цикл
					НоваяСтрока = НастройкаПодключенияОбъект.ПресетыТиповКлиентов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекЭлемент); 
					НоваяСтрока.ВидКлиента = "Контакт";
				КонецЦикла;
			КонецЕсли;
			
			НастройкаПодключенияОбъект.Записать();
	
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось конвертировать настройки синхронизации для настройки подключения: " + Строка(Выборка.НастройкаПодключения));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область ОбщиеПроцедурыИФункцииСинхронизации

Процедура ВыгрузкаВРеальномВремени(ПараметрыВыгрузки, АдресРезультата) Экспорт
	
	НастройкаПодключения = ПараметрыВыгрузки.НастройкаПодключения;
	Если НЕ Б24_К_СлужебныйВызовСервера.МодульСинхронизацииДоступен(НастройкаПодключения) Тогда
		Возврат;
	КонецЕсли;                          
	
	ИнформационнаяБазаФайловая = Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.ИнформационнаяБазаФайловая();
	Если ПараметрыВыгрузки.Свойство("УстановитьТаймаут") И НЕ ИнформационнаяБазаФайловая Тогда
		Б24_К_ОбщегоНазначенияВызовСервера.Таймаут(ПараметрыВыгрузки.УстановитьТаймаут);    // для того, чтобы транзакции завершились.
	КонецЕсли;  
	
	СтруктураНастроек = СформироватьСтруктуруНастроек(НастройкаПодключения, ЛОЖЬ, 1);
	Если СтруктураНастроек = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураНастроек.Логирование.Измерение2 = "Выгрузка данных на Битрикс24";
	СтруктураНастроек.СтатусПроверкиОчереди = 0;
	ЗапуститьВыполнениеОчередиВыгрузки(СтруктураНастроек);
	
	НаличиеИзмененийНаДату = РегистрыСведений.Б24_КС_ТаблицаИзменений.НаличиеИзмененийНаДату(НастройкаПодключения, СтруктураНастроек.ВремяЗапускаВМиллисекундах);
	Если НаличиеИзмененийНаДату Тогда    
		ПараметрыВыгрузки = Новый Структура;     
		ПараметрыВыгрузки.Вставить("НастройкаПодключения", НастройкаПодключения);  
		ВыгрузкаВРеальномВремени(ПараметрыВыгрузки, "");	
	КонецЕсли;   
	
КонецПроцедуры

Процедура ВыполнитьСинхронизациюПоФоновомуЗаданию(ПараметрыСинхронизации, АдресРезультата = Неопределено) Экспорт
	
	НастройкаПодключения 	= ПараметрыСинхронизации.НастройкаПодключения;
	
	ВидСинхронизации 		= ПараметрыСинхронизации.ВидСинхронизации;
	ПолнаяСинхронизация 	= ПараметрыСинхронизации.ПолнаяСинхронизация;
	ВыполнятьЗагрузку 		= ?(ПараметрыСинхронизации.ВыполнятьЗагрузку = Неопределено, Истина, ПараметрыСинхронизации.ВыполнятьЗагрузку);
	ВыполнятьВыгрузку 		= ?(ПараметрыСинхронизации.ВыполнятьВыгрузку = Неопределено, Истина, ПараметрыСинхронизации.ВыполнятьВыгрузку);
	
	ВыполнитьСинхронизацию(НастройкаПодключения, ВидСинхронизации, ПолнаяСинхронизация, ВыполнятьЗагрузку, ВыполнятьВыгрузку);
	
	ПоместитьВоВременноеХранилище(ПолучитьСообщенияПользователю(Истина), АдресРезультата);

КонецПроцедуры

Процедура СинхронизацияПоРасписанию(НастройкаПодключения) Экспорт
	
	НастройкаСинхронизации = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);
	
	Если НастройкаСинхронизации.СпособСинхронизацииДанных = "ПоРасписанию" И НЕ НастройкаПодключения.ПометкаУдаления Тогда
				
		ВыполнитьСинхронизацию(НастройкаПодключения, 0, Ложь);
			
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Выполняет синхронизацию с порталом
//
// Параметры:
//  ВидСинхронизации				 - 	 1 - Обмен в режиме реального времени, 7 - интерактивный
//  ПолныйОбмен						 - 	 Признак выполнения полной синхронизации 
//  ВыполнятьЗагрузку				 - 	 Признак выполнения загрузки данных с портала 
//  ВыполнятьВыгрузку				 - 	 Признак выполнения выгрузки данных на портал  
//
Процедура ВыполнитьСинхронизацию(НастройкаПодключения, ВидСинхронизации, ПолнаяСинхронизация, ВыполнятьЗагрузку = Истина, ВыполнятьВыгрузку = Истина) Экспорт
	
	СтруктураНастроек = СформироватьСтруктуруНастроек(НастройкаПодключения, ПолнаяСинхронизация, ВидСинхронизации);
	Если СтруктураНастроек = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураНастроек.ПорядокВыполненияСинхронизации = "Сперва 1С, затем Битрикс24" Тогда
		
		СтруктураНастроек.ВыполненоБезОшибок = Истина;
		
		Если ВыполнятьВыгрузку Тогда
			СтруктураНастроек.Логирование.Измерение2 = "Выгрузка данных на Битрикс24";
			СтруктураНастроек.СтатусПроверкиОчереди = 0;
			ЗапуститьВыполнениеОчередиВыгрузки(СтруктураНастроек);
		КонецЕсли;
		
		Если СтруктураНастроек.ВыполненоБезОшибок ИЛИ СтруктураНастроек.ИгнорироватьОшибкиВоВремяСинхронизации Тогда
			
			Если ВыполнятьЗагрузку Тогда
				СтруктураНастроек.Логирование.Измерение2 = "Загрузка данных с Битрикс24";
				ЗапуститьВыполнениеЗагрузки(СтруктураНастроек);
			КонецЕсли;
			
		Иначе
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Во время выгрузки данных 1С были критические ошибки. Загрузка данных Битрикс24 не будет произведена");
		КонецЕсли;
		
	Иначе
		
		СтруктураНастроек.ВыполненоБезОшибок = Истина;
		
		Если ВыполнятьЗагрузку Тогда
			СтруктураНастроек.Логирование.Измерение2 = "Загрузка данных с Битрикс24";
			ЗапуститьВыполнениеЗагрузки(СтруктураНастроек);
		КонецЕсли;
		
		Если СтруктураНастроек.ВыполненоБезОшибок ИЛИ СтруктураНастроек.ИгнорироватьОшибкиВоВремяСинхронизации Тогда
			
			Если ВыполнятьВыгрузку Тогда
				СтруктураНастроек.Логирование.Измерение2 = "Выгрузка данных на Битрикс24";
				СтруктураНастроек.СтатусПроверкиОчереди = 0;
				ЗапуститьВыполнениеОчередиВыгрузки(СтруктураНастроек);
			КонецЕсли;
			
		Иначе
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Во время загрузки данных из Битрикс24 были критические ошибки. Выгрузка данных из 1С не будет произведена");
		КонецЕсли;
		
	КонецЕсли;
	
	УдалениеНеВыгружаемыхДанныхИзРегистраИзменений(НастройкаПодключения, СтруктураНастроек.ВремяЗапускаВМиллисекундах);
	
КонецПроцедуры

Процедура УдалениеНеВыгружаемыхДанныхИзРегистраИзменений(НастройкаПодключения, ВремяЗапускаВМиллисекундах)
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Попытка                  
		
		БлокировкаДанных = Новый БлокировкаДанных;
		БлокировкаДанных.Добавить("РегистрСведений.Б24_КС_ТаблицаИзменений");
	
		БлокировкаДанных.Заблокировать();	
		
		Запрос = Новый Запрос;
		Если Тип("Структура") = ТипЗнч(НастройкаПодключения) Тогда
			Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения.НастройкаПодключения);
		Иначе
			Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ВремяЗаписиВМиллисекундах"	, ВремяЗапускаВМиллисекундах);
		Запрос.Текст = "ВЫБРАТЬ
		|	Б24_КС_ТаблицаИзменений.НастройкаПодключения КАК НастройкаПодключения,
		|	Б24_КС_ТаблицаИзменений.ТипДанных КАК ТипДанных,
		|	Б24_КС_ТаблицаИзменений.Объект КАК Объект,
		|	Б24_КС_ТаблицаИзменений.ПодчиненныйОбъект КАК ПодчиненныйОбъект,
		|	Б24_КС_ТаблицаИзменений.ВремяЗаписиВМиллисекундах КАК ВремяЗаписиВМиллисекундах
		|ИЗ
		|	РегистрСведений.Б24_КС_ТаблицаИзменений КАК Б24_КС_ТаблицаИзменений
		|ГДЕ
		|	Б24_КС_ТаблицаИзменений.НастройкаПодключения = &НастройкаПодключения
		|	И Б24_КС_ТаблицаИзменений.ВремяЗаписиВМиллисекундах >= &ВремяЗаписиВМиллисекундах";
		
		ТзнИзменений = Запрос.Выполнить().Выгрузить();
		
		НаборЗаписей = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.НастройкаПодключения.Установить(НастройкаПодключения); 
		НаборЗаписей.Загрузить(ТзнИзменений); 
		НаборЗаписей.Записать(Истина);

 ЗафиксироватьТранзакцию();
	Исключение
 ОтменитьТранзакцию();
	КонецПопытки;

КонецПроцедуры


Функция ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, ВидСущности)
	
	Результат = Новый Массив;
	
	ТипыОперацийСинхронизации = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыОпераций();
	
	Если ВидСущности = "Компания" Тогда
		Результат.Добавить(ТипыОперацийСинхронизации.СвойстваКомпаний);
		Результат.Добавить(ТипыОперацийСинхронизации.Компании);
	ИначеЕсли ВидСущности = "Контакт"  Тогда
		Результат.Добавить(ТипыОперацийСинхронизации.СвойстваКонтактов);
		Результат.Добавить(ТипыОперацийСинхронизации.Контакты);
	ИначеЕсли ВидСущности = "Реквизит"  Тогда
		Результат.Добавить(ТипыОперацийСинхронизации.Реквизиты);
	ИначеЕсли ВидСущности = "Банковский счет" Тогда
		Результат.Добавить(ТипыОперацийСинхронизации.БанковскиеСчета);
	ИначеЕсли ВидСущности = "Товар"  Тогда
		Результат.Добавить(ТипыОперацийСинхронизации.СвойстваТоваров);	
		Результат.Добавить(ТипыОперацийСинхронизации.ЕдиницыИзмерения);	
		Результат.Добавить(ТипыОперацийСинхронизации.ГруппыТоваров);	
		Результат.Добавить(ТипыОперацийСинхронизации.Товары); 
	ИначеЕсли ВидСущности = "Прайс"  Тогда
		Результат.Добавить(ТипыОперацийСинхронизации.Прайсы);
	ИначеЕсли ВидСущности = "ЕдиницаИзмерения"  Тогда
		Результат.Добавить(ТипыОперацийСинхронизации.ЕдиницыИзмерения);
	ИначеЕсли ВидСущности = "Товар2"  Тогда
		Результат.Добавить(ТипыОперацийСинхронизации.СвойстваТоваров);
		Результат.Добавить(ТипыОперацийСинхронизации.ЕдиницыИзмерения);	
		Результат.Добавить(ТипыОперацийСинхронизации.ГруппыТоваров);	
		Результат.Добавить(ТипыОперацийСинхронизации.Товары);
	ИначеЕсли ВидСущности = "КартинкиФайлыТоваров"  Тогда
		Результат.Добавить(ТипыОперацийСинхронизации.КартинкиФайлыТоваров);	
	ИначеЕсли ВидСущности = "КартинкиФайлыПредложений"  Тогда
		Результат.Добавить(ТипыОперацийСинхронизации.КартинкиФайлыПредложений);	
	ИначеЕсли ВидСущности = "Предложение"  Тогда         
		Результат.Добавить(ТипыОперацийСинхронизации.СвойстваПредложений);
		Результат.Добавить(ТипыОперацийСинхронизации.Предложения);
	ИначеЕсли ВидСущности = "Цена" Тогда   
		Результат.Добавить(ТипыОперацийСинхронизации.Цены);
	ИначеЕсли ВидСущности = "Остаток" Тогда         
		Результат.Добавить(ТипыОперацийСинхронизации.Остатки);  
	ИначеЕсли ВидСущности = "Счет" Тогда
		Результат.Добавить(ТипыОперацийСинхронизации.СвойстваСчетов);
		Результат.Добавить(ТипыОперацийСинхронизации.Счета);
	ИначеЕсли ВидСущности = "Счет2" Тогда
		Результат.Добавить(ТипыОперацийСинхронизации.СвойстваСчетов);
		Результат.Добавить(ТипыОперацийСинхронизации.Счета);
	ИначеЕсли ВидСущности = "Проект" Тогда
		Результат.Добавить(ТипыОперацийСинхронизации.СвойстваСделок);
		Результат.Добавить(ТипыОперацийСинхронизации.Проекты);
	ИначеЕсли ВидСущности = "Заказ"  Тогда
		Результат.Добавить(ТипыОперацийСинхронизации.СвойстваЗаказов);
		Результат.Добавить(ТипыОперацийСинхронизации.Заказы);
	ИначеЕсли ВидСущности = "Оплата"  Тогда
		Результат.Добавить(ТипыОперацийСинхронизации.Оплаты);
	ИначеЕсли ВидСущности = "Отгрузка" Тогда
		Результат.Добавить(ТипыОперацийСинхронизации.Отгрузки);     
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

Процедура РазобратьОшибку(СтруктураНастроек, ТипДанных, Объект, ОписаниеОшибки)
	
	НастройкаПодключения = СтруктураНастроек.НастройкаПодключения;
	
	Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Компания Тогда
		
		Если СтрНайти(ОписаниеОшибки, "Company is not found") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 Тогда	
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Контакт Тогда
		
		Если СтрНайти(ОписаниеОшибки, "Contact is not found") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 Тогда	
			
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Реквизит Тогда
		
		Если (СтрНайти(ОписаниеОшибки, "The Requisite with ID") > 0 И СтрНайти(ОписаниеОшибки, " is not found") > 0) 
			ИЛИ  СтрНайти(ОписаниеОшибки, "не найден") > 0 ИЛИ  СтрНайти(ОписаниеОшибки, "Access denied") > 0 ИЛИ  СтрНайти(ОписаниеОшибки, "is not assigned") > 0 Тогда	
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
			Возврат;
		КонецЕсли;
		
		Если СтрНайти(ОписаниеОшибки, "ENTITY_ID is not defined or invalid.") > 0 Тогда
			Если ЗначениеЗаполнено(Объект) Тогда
				//Б24_КС_РегистрацияИзмененийВызовСервера.ЗарегистрироватьИзмененияВладельцевДанных(НастройкаПодключения, ТипДанных, Объект);
			КонецЕсли;
			
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Невозможно определить владельца реквизита. Будет попытка выгрузки владельца");
			
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЮрАдресРеквизита ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ФактАдресРеквизита 
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.АдресДоставкиРеквизита Тогда
		
		Если СтрНайти(ОписаниеОшибки, "Type") > 0 И СтрНайти(ОписаниеОшибки, " exists.") > 0 Тогда	
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, "Помечаем, что такой адрес уже был выгружен.");
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект, Истина);  
			Возврат;
		ИначеЕсли СтрНайти(ОписаниеОшибки, "Type") > 0 И СтрНайти(ОписаниеОшибки, " not found.") > 0 Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		ИначеЕсли СтрНайти(ОписаниеОшибки, "ENTITY_ID is not defined or invalid") > 0 Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
			
			Если ЗначениеЗаполнено(Объект) Тогда
				//Б24_КС_РегистрацияИзмененийВызовСервера.ЗарегистрироватьИзмененияВладельцевДанных(НастройкаПодключения, ТипДанных, Объект);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.БанковскийСчетРеквизита Тогда
		
		Если СтрНайти(ОписаниеОшибки, "ot found") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "Access denied")Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		КонецЕсли;
		
		Если СтрНайти(ОписаниеОшибки, "ENTITY_ID is not defined or invalid.") > 0 Тогда
			
			Если ЗначениеЗаполнено(Объект) Тогда
				//Б24_КС_РегистрацияИзмененийВызовСервера.ЗарегистрироватьИзмененияВладельцевДанных(НастройкаПодключения, ТипДанных, Объект);
			КонецЕсли;
			
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Ошибка, "Невозможно определить владельца реквизита. Будет попытка выгрузки владельца");
			
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара Тогда
		
		Если СтрНайти(ОписаниеОшибки, "ot found") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден.") > 0 Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		КонецЕсли;
		
		Если СтрНайти(ОписаниеОшибки, "Неверный раздел-родитель") > 0 Тогда
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, "Ид родителя был изменен. Нужно сделать повторную выгрузку элемента.");
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Товар Тогда
		
		Если СтрНайти(ОписаниеОшибки, "ot found") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "Access denied") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0  Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения Тогда
		
		Если СтрНайти(ОписаниеОшибки, "ot found") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "Access denied") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		ИначеЕсли СтрНайти(ОписаниеОшибки, "already exists.") > 0 Тогда
			
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, "В Б24 уже есть единица измерения с кодом указанным ранее. Загружаем ее Из Битрикс24");
			
			ПервоеВхождение = СтрНайти(ОписаниеОшибки, """");	
			ВтороеВхождение = СтрНайти(ОписаниеОшибки, """",,ПервоеВхождение+1);	
			КодЭлемента 	= Сред(ОписаниеОшибки, ПервоеВхождение+1, ВтороеВхождение - ПервоеВхождение-1); 

			Если ЗначениеЗаполнено(КодЭлемента) Тогда   
				ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "crm.measure.list",, "filter[CODE]=" + КодЭлемента  + "&start=-1");		
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара Тогда
		
		Если СтрНайти(ОписаниеОшибки, "ot found") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "Access denied") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект); 
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Счет ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Счет2 Тогда
		
		Если СтрНайти(ОписаниеОшибки, "ot found.") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
			
			Если ЗначениеЗаполнено(Объект) Тогда
				
				Если Объект.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено Тогда
					ТекущийОбъект = Объект.ПолучитьОбъект();  						
					Для каждого ТекСтрока Из ТекущийОбъект.Товары Цикл   
						ТекСтрока.Б24_К_ИдентификаторПозиции = "";
					КонецЦикла;
					ТекущийОбъект.Записать();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения2 Тогда  
		
		Если СтрНайти(ОписаниеОшибки, "not exists") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		ИначеЕсли СтрНайти(ОписаниеОшибки, "Duplicate entry") > 0 Тогда
			
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, "В Б24 уже есть единица измерения с кодом указанным ранее. Загружаем ее из Битрикс24");
			
			КодЭлемента = XMLСтрока(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "Код"));	
			Если ЗначениеЗаполнено(КодЭлемента) Тогда        
				ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "catalog.measure.list", , "filter[code]=" + КодЭлемента  + "&start=-1");		
			КонецЕсли;
			
		КонецЕсли;   
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Прайс Тогда  
		
		Если СтрНайти(ОписаниеОшибки, "not exists") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "Access Denied") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара2 Тогда  
		
		Если СтрНайти(ОписаниеОшибки, "ot found") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "Access Denied") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Товар2 ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Предложение Тогда
		
		//Если СтрНайти(ОписаниеОшибки, "not exists") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "Access Denied") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 Тогда
		Если СтрНайти(ОписаниеОшибки, "not exists") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		ИначеЕсли СтрНайти(ОписаниеОшибки, "Access Denied") > 0 Тогда
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, "Возможно неверно указан ид раздела у товара: " +Строка(Объект));
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара2 ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоПредложения Тогда  
		
		Если СтрНайти(ОписаниеОшибки, "not exist") > 0 Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		КонецЕсли;	
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара2 ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваПредложения Тогда
		
		Если СтрНайти(ОписаниеОшибки, "not exist") > 0 Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		КонецЕсли;	
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Предложение Тогда 
		
		//Если СтрНайти(ОписаниеОшибки, "not exists") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "Access Denied") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 Тогда
		Если СтрНайти(ОписаниеОшибки, "not exists") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Цена Тогда    
		
		//Если СтрНайти(ОписаниеОшибки, "Неверный ID типа цены") > 0 Тогда	
		//	мЧасти = СтрРазделить(Объект, "#");
		//	Если мЧасти.Количество() = 3 Тогда
		//		Прайс = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоXML(Тип("СправочникСсылка.ВидыЦен"), мЧасти[0]); 
		//	    Если ЗначениеЗаполнено(Прайс) Тогда
		//			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Прайс, Прайс);  
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;  
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Остаток Тогда
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлТовара2 
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлПредложения Тогда
		
		Если СтрНайти(ОписаниеОшибки, "Image product property does not exists") > 0 Тогда
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Не удалось выгрузить картинку.");
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Необходимо создать на установке множественное свойство файл с кодом MORE_PHOTO в инфоблоке СКУ и товаров");
		ИначеЕсли СтрНайти(ОписаниеОшибки, "not exist") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "Could not find description of update") > 0 Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Проект Тогда
		
		Если СтрНайти(ОписаниеОшибки, "ot found") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 Тогда
			
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
			
			Если Объект.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено Тогда
					
				ТекущийОбъект = Объект.ПолучитьОбъект();  						
				Для каждого ТекСтрока Из ТекущийОбъект.Товары Цикл
					ТекСтрока.Б24_К_ИдентификаторПозиции = "";
				КонецЦикла;     
				
				Попытка
					ТекущийОбъект.Записать();   
				Исключение     
					Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Не удалось очистить идентификаторы позиций");
				КонецПопытки;
					
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКомпании 
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКонтакта
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета2
		ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСделки Тогда
		
		Если СтрНайти(ОписаниеОшибки, "ot found") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "ot find") > 0 
			ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не можете изменить наст") > 0 Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ДелоКомпании Тогда 
		РегистрыСведений.Б24_К_ИдентификаторыДел.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		//Б24_КС_РегистрацияИзмененийВызовСервера.ПроверитьИДобавитьОбъектВТаблицуИзменений(НастройкаПодключения, СтруктураНастроек.ТипыОбъектовОбмена.Компания, Объект);
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ДелоКонтакта Тогда  
		РегистрыСведений.Б24_К_ИдентификаторыДел.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		//Б24_КС_РегистрацияИзмененийВызовСервера.ПроверитьИДобавитьОбъектВТаблицуИзменений(НастройкаПодключения, СтруктураНастроек.ТипыОбъектовОбмена.Контакт, Объект);
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ДелоСчета Тогда  
		РегистрыСведений.Б24_К_ИдентификаторыДел.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		//Б24_КС_РегистрацияИзмененийВызовСервера.ПроверитьИДобавитьОбъектВТаблицуИзменений(НастройкаПодключения, СтруктураНастроек.ТипыОбъектовОбмена.Счет2, Объект);
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ДелоСделки Тогда 
		РегистрыСведений.Б24_К_ИдентификаторыДел.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		//Б24_КС_РегистрацияИзмененийВызовСервера.ПроверитьИДобавитьОбъектВТаблицуИзменений(НастройкаПодключения, СтруктураНастроек.ТипыОбъектовОбмена.Сделка, Объект);

	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Заказ Тогда
		
		Если СтрНайти(ОписаниеОшибки, "entity not exists") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "не найден") > 0 Тогда
			РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект);  
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Оплата Тогда
		
		Если СтрНайти(ОписаниеОшибки, "Can't find payment") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "Оплата не найдена") > 0 Тогда
			
			ПервоеВхождение = СтрНайти(ОписаниеОшибки, "- ");	
			ВтороеВхождение = СтрНайти(ОписаниеОшибки, " ",,ПервоеВхождение+2);	
			
			Если ВтороеВхождение > 0 Тогда
				КодЭлемента 	= СокрЛП(Сред(ОписаниеОшибки, ПервоеВхождение+1, ВтороеВхождение - ПервоеВхождение-1)); 
			Иначе
				КодЭлемента 	= СокрЛП(Прав(ОписаниеОшибки, СтрДлина(ОписаниеОшибки)-ПервоеВхождение));	
			КонецЕсли;
			
			Оплата = РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьЗначениеПоИдБ24Объекта(СтруктураНастроек.Портал, ТипДанных, КодЭлемента);
			
			Если ЗначениеЗаполнено(Оплата) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Оплата.Объект);  
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Отгрузка Тогда
		
		Если СтрНайти(ОписаниеОшибки, "Can't find shipment") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "Отгрузка не найдена") > 0 Тогда
			
			ПервоеВхождение = СтрНайти(ОписаниеОшибки, "- ");	
			ВтороеВхождение = СтрНайти(ОписаниеОшибки, " ",,ПервоеВхождение+2);	
			
			Если ВтороеВхождение > 0 Тогда
				КодЭлемента 	= СокрЛП(Сред(ОписаниеОшибки, ПервоеВхождение+1, ВтороеВхождение - ПервоеВхождение-1)); 
			Иначе
				КодЭлемента 	= СокрЛП(Прав(ОписаниеОшибки, СтрДлина(ОписаниеОшибки)-ПервоеВхождение));	
			КонецЕсли;
			
			Отгрузка = РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьЗначениеПоИдБ24Объекта(СтруктураНастроек.Портал, ТипДанных, КодЭлемента);
			
			Если ЗначениеЗаполнено(Отгрузка) Тогда
				
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Отгрузка.Объект);  
					
				НаборЗаписейИд = РегистрыСведений.Б24_К_ИдентификаторыОбъектов.СоздатьНаборЗаписей();
				НаборЗаписейИд.Отбор.Портал.Установить(СтруктураНастроек.Портал);
				НаборЗаписейИд.Отбор.ТипДанных.Установить(СтруктураНастроек.ТипыОбъектовОбмена.ТоварыОтгрузки);
				НаборЗаписейИд.Отбор.Объект.Установить(Отгрузка.Объект);
				НаборЗаписейИд.Записать();
					
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ПроцедурыИФункцииВыгрузки

Процедура ЗапуститьВыполнениеВыгрузкиОпределенныхТиповВФоне(ПередаваемыеПараметры, АдресРезультата) Экспорт

	Б24_К_ОбщегоНазначенияВызовСервера.Таймаут(5);    // на случай когда не будет данных другого потока, ждем.
	
	НастройкаПодключения 	= ПередаваемыеПараметры.НастройкаПодключения;
	СоответствияТипов 		= ПередаваемыеПараметры.СоответствияТипов;
	ВидСинхронизации 		= ПередаваемыеПараметры.ВидСинхронизации;
	ПолнаяЗагрузка 			= ПередаваемыеПараметры.ПолнаяЗагрузка;
	ПолнаяВыгрузка 			= ПередаваемыеПараметры.ПолнаяВыгрузка;
	
	СтруктураНастроек = СформироватьСтруктуруНастроек(НастройкаПодключения, ПолнаяВыгрузка, ВидСинхронизации);  
	Если СтруктураНастроек = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось подключиться");
		Перейти ~КонецПроцедурыВФоне;
	КонецЕсли;
	
	НастройкаПодключения = СтруктураНастроек.НастройкаПодключения;
	
	Если СтруктураНастроек.ОбщиеНастройки.ДелатьЗапросНаВнешнийСервис Тогда
		Если ЗначениеЗаполнено(СтруктураНастроек.ОбщиеНастройки.АдресЗапросаНаВнешнийСервис) Тогда
			Б24_К_RestApiВызовСервера.ОтправитьЗапросаНаВнешнийСервис(СтруктураНастроек.ОбщиеНастройки.АдресЗапросаНаВнешнийСервис);
		КонецЕсли;
	КонецЕсли;
	
	ОчередьВыгрузки = Новый Массив;
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.Компания) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Компания");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.Контакт) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Контакт");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.Реквизит) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Реквизит");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.БанковскийСчетРеквизита) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Банковский счет");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.Товар) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Товар");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;

	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.Прайс) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Прайс");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения2) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "ЕдиницаИзмерения");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.Товар2) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Товар2");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлТовара2) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "КартинкиФайлыТоваров");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.Предложение) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Предложение");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлПредложения) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "КартинкиФайлыПредложений");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.Цена) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Цена");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;               
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.Остаток) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Остаток");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.Проект) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Проект");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.Счет) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Счет");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;   
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.Счет2) = Истина  Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Счет2");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли; 
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.Заказ) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Заказ");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;
	
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.Оплата) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Оплата");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;
	
	Если СоответствияТипов.Получить(СтруктураНастроек.ТипыОбъектовОбмена.Отгрузка) = Истина Тогда
		мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Отгрузка");
		Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
			ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, ОчередьВыгрузки, ТекЭлемент, ПолнаяВыгрузка);
		КонецЦикла;
	КонецЕсли;
	
	ПроверитьОчередьВыполненияВыгрузки(СтруктураНастроек, ОчередьВыгрузки);
	
~КонецПроцедурыВФоне:	

	Б24_К_ОбщегоНазначенияВызовСервера.ПроверитьФоновоеЗаданиеВОчереди(ПередаваемыеПараметры);
	
КонецПроцедуры


Процедура ЗапуститьВыполнениеОчередиВыгрузки(СтруктураНастроек) Экспорт
	
	Если СтруктураНастроек.ОбщиеНастройки.ДелатьЗапросНаВнешнийСервис Тогда
		Если ЗначениеЗаполнено(СтруктураНастроек.ОбщиеНастройки.АдресЗапросаНаВнешнийСервис) Тогда
			Б24_К_RestApiВызовСервера.ОтправитьЗапросаНаВнешнийСервис(СтруктураНастроек.ОбщиеНастройки.АдресЗапросаНаВнешнийСервис);
		КонецЕсли;
	КонецЕсли;
	
	ОчередьВыгрузки = ПолучитьОчередьВыгрузки(СтруктураНастроек);
	
	ПроверитьОчередьВыполненияВыгрузки(СтруктураНастроек, ОчередьВыгрузки);
	
КонецПроцедуры

Функция ПолучитьОчередьВыгрузки(СтруктураНастроек)
	
	МассивОчереди = Новый Массив;
	
	НастройкаПодключения = СтруктураНастроек.НастройкаПодключения; 
	
	НастройкиСинхронизации = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);
	СохраненныеНастройки = НастройкиСинхронизации.Настройки.Получить();
	
	НастройкиСинхронизацииТоваров = СтруктураНастроек.НастройкиСинхронизацииТоваров;
	
	ВыгружатьКомпании 		= Ложь;
	ВыгружатьКонтакты 		= Ложь;
	ВыгружатьРеквизиты		= Ложь;
	ВыгружатьБанкСчета		= Ложь;
	ВыгружатьТовары 		= Ложь;
	ВыгружатьТовары2 		= Ложь;
	ВыгружатьПредложения	= Ложь;    
	ВыгружатьКартинкиТоваров = Ложь;
	ВыгружатьКартинкиПредложений = Ложь;      
	ВыгружатьЦены			= НастройкиСинхронизации.ВерсияТоваров = "v.2" 
		И НастройкиСинхронизацииТоваров.Свойство("Прайсы") И НастройкиСинхронизацииТоваров.Прайсы.Количество() >0;
	ВыгружатьОстатки		= НастройкиСинхронизации.ВерсияТоваров = "v.2" 
		И НастройкиСинхронизацииТоваров.Свойство("Склады") И НастройкиСинхронизацииТоваров.Склады.Количество() >0;
	ВыгружатьСчета 			= Ложь;
	ВыгружатьСчета2 		= Ложь;
	ВыгружатьСделки 		= Ложь;
	ВыгружатьЗаказы 		= Ложь;
	ВыгружатьОплаты 		= Ложь;
	ВыгружатьОтгрузки 		= Ложь;
#Область ОпределениеТиповВыгружаемыхДанных	
	Для каждого ТекСущность Из СохраненныеНастройки.Сущности Цикл
		
		Если НастройкиСинхронизации.СинхронизацияКлиентов Тогда
			Если ТекСущность.ВидСущности = "Компания" И ТекСущность.ВыгружатьНаПортал Тогда
				ВыгружатьКомпании = Истина;	
			ИначеЕсли ТекСущность.ВидСущности = "Контакт" И ТекСущность.ВыгружатьНаПортал Тогда
				ВыгружатьКонтакты = Истина;	
			ИначеЕсли ТекСущность.ВидСущности = "Реквизит" И ТекСущность.ВыгружатьНаПортал Тогда
				ВыгружатьРеквизиты = Истина;	
			ИначеЕсли ТекСущность.ВидСущности = "Банковский счет" И ТекСущность.ВыгружатьНаПортал Тогда
				ВыгружатьБанкСчета = Истина;	
			КонецЕсли;
		КонецЕсли;
		
		Если НастройкиСинхронизации.СинхронизацияТоваров И НЕ НастройкиСинхронизации.ВерсияТоваров = "v.2" Тогда
			Если ТекСущность.ВидСущности = "Товар" И ТекСущность.ВыгружатьНаПортал Тогда
				ВыгружатьТовары = Истина;	
			КонецЕсли;
		КонецЕсли;
		
		Если НастройкиСинхронизации.СинхронизацияТоваров И НастройкиСинхронизации.ВерсияТоваров = "v.2" Тогда
			Если ТекСущность.ВидСущности = "Товар2" И ТекСущность.ВыгружатьНаПортал Тогда
				ВыгружатьТовары2 = Истина;
				
				Если СохраненныеНастройки.НастройкиСинхронизацииТоваров.ВыгружатьКартинкиИФайлы Тогда
					ВыгружатьКартинкиТоваров = Истина; 
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;   
		
		Если НастройкиСинхронизации.СинхронизацияТоваров И НастройкиСинхронизации.ВерсияТоваров = "v.2" Тогда
			Если ТекСущность.ВидСущности = "Предложение" И ТекСущность.ВыгружатьНаПортал Тогда
				ВыгружатьПредложения = Истина;	 
				
				Если СохраненныеНастройки.НастройкиСинхронизацииТоваров.ВыгружатьКартинкиИФайлы Тогда
					ВыгружатьКартинкиПредложений = Истина; 
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;           
		
		Если НастройкиСинхронизации.СинхронизацияСделок Тогда
			Если ТекСущность.ВидСущности = "Проект" И ТекСущность.ВыгружатьНаПортал Тогда
				ВыгружатьСделки = Истина;	
			КонецЕсли;
		КонецЕсли;
		
		Если НастройкиСинхронизации.СинхронизацияСчетов И НЕ НастройкиСинхронизации.ВерсияСчетов = "v.2" Тогда
			Если ТекСущность.ВидСущности = "Счет" И ТекСущность.ВыгружатьНаПортал Тогда
				ВыгружатьСчета = Истина;	
			КонецЕсли;
		КонецЕсли;
		
		Если НастройкиСинхронизации.СинхронизацияСчетов И НастройкиСинхронизации.ВерсияСчетов = "v.2" Тогда
			Если ТекСущность.ВидСущности = "Счет2" И ТекСущность.ВыгружатьНаПортал Тогда
				ВыгружатьСчета2 = Истина;	
			КонецЕсли;
		КонецЕсли;
		
		Если НастройкиСинхронизации.СинхронизацияЗаказов Тогда
			Если ТекСущность.ВидСущности = "Заказ" И ТекСущность.ВыгружатьНаПортал Тогда
				ВыгружатьЗаказы = Истина;	
			ИначеЕсли ТекСущность.ВидСущности = "Оплата" И ТекСущность.ВыгружатьНаПортал Тогда
				ВыгружатьОплаты = Истина;	
			ИначеЕсли ТекСущность.ВидСущности = "Отгрузка" И ТекСущность.ВыгружатьНаПортал Тогда
				ВыгружатьОтгрузки = Истина;	
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;   
	
	ВыгружатьЦены		= ВыгружатьЦены И (ВыгружатьТовары2 ИЛИ ВыгружатьПредложения); 
	ВыгружатьОстатки	= ВыгружатьОстатки И (ВыгружатьТовары2 ИЛИ ВыгружатьПредложения); 
	
#КонецОбласти	


	ВыгружатьФайлыКомпаний	= Ложь;
	ВыгружатьФайлыКонтактов	= Ложь;      
#Область ОпределениеВыгрузкиФайлов	
	Если СохраненныеНастройки.НастройкиСинхронизацииКлиентов.Свойство("ВыгружатьФайлыКлиентов") И СохраненныеНастройки.НастройкиСинхронизацииКлиентов.ВыгружатьФайлыКлиентов Тогда
		
		ВыгружатьФайлыКомпаний = СохраненныеНастройки.НастройкиСинхронизацииКлиентов.Свойство("СвойствоФайловБ24Компаний") 
		И ЗначениеЗаполнено(СохраненныеНастройки.НастройкиСинхронизацииКлиентов.СвойствоФайловБ24Компаний);
		
		ВыгружатьФайлыКонтактов = СохраненныеНастройки.НастройкиСинхронизацииКлиентов.Свойство("СвойствоФайловБ24Контактов") 
		И ЗначениеЗаполнено(СохраненныеНастройки.НастройкиСинхронизацииКлиентов.СвойствоФайловБ24Контактов);   
		
	КонецЕсли;
 #КонецОбласти 

	Если СтруктураНастроек.ПолнаяВыгрузка Тогда     // при полной выгрузке не выгружаем подчиненные данные т.к. выгрузится все
		
		Если ВыгружатьФайлыКомпаний ИЛИ ВыгружатьФайлыКонтактов Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Файл");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		
		Если ВыгружатьКомпании Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Компания");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		
		Если ВыгружатьКонтакты Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Контакт");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		
		Если ВыгружатьРеквизиты Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Реквизит");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		
		Если ВыгружатьБанкСчета Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Банковский счет");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		
		Если ВыгружатьТовары Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Товар");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		
		Если ВыгружатьТовары2 ИЛИ ВыгружатьПредложения Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "ЕдиницаИзмерения");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		
		Если ВыгружатьТовары2 Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Товар2");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		
		Если ВыгружатьПредложения Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Предложение");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		
		Если ВыгружатьЦены Тогда    
			
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Прайс");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;   
			
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Цена");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла; 
			
		КонецЕсли;
		
		Если ВыгружатьОстатки Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Остаток");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		
		Если ВыгружатьКартинкиТоваров Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "КартинкиФайлыТоваров");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		Если ВыгружатьКартинкиПредложений Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "КартинкиФайлыПредложений");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		
		Если ВыгружатьСделки Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Проект");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		
		Если ВыгружатьСчета Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Счет");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		
		Если ВыгружатьСчета2 Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Счет2");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;       
		
		Если ВыгружатьЗаказы Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Заказ");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		
		
		Если ВыгружатьОплаты Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Оплата");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		
		
		Если ВыгружатьОтгрузки Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Отгрузка");
			Для каждого ТекЭлемент Из мТипыОперацийСинхронизации Цикл
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТекЭлемент, Истина);
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		ТипыДанныхДляОбменаСПорталом 	= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
		
		ТипыОперацийСинхронизации 		= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыОпераций();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВремяЗапускаВМиллисекундах"	, СтруктураНастроек.ВремяЗапускаВМиллисекундах);
		Запрос.УстановитьПараметр("НастройкаПодключения"		, НастройкаПодключения);
		Запрос.Текст ="ВЫБРАТЬ
		|	Б24_КС_ПакетыВыгрузки.ТипДанных КАК ТипДанных
		|ИЗ
		|	РегистрСведений.Б24_КС_ПакетыВыгрузки КАК Б24_КС_ПакетыВыгрузки
		|ГДЕ
		|	Б24_КС_ПакетыВыгрузки.НастройкаПодключения = &НастройкаПодключения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Б24_КС_ТаблицаИзменений.ТипДанных
		|ИЗ
		|	РегистрСведений.Б24_КС_ТаблицаИзменений КАК Б24_КС_ТаблицаИзменений
		|ГДЕ
		|	Б24_КС_ТаблицаИзменений.ВремяЗаписиВМиллисекундах <= &ВремяЗапускаВМиллисекундах
		|	И Б24_КС_ТаблицаИзменений.НастройкаПодключения = &НастройкаПодключения";
		
		тзнДанных = Запрос.Выполнить().Выгрузить();
		тзнДанных.Свернуть("ТипДанных");
		
		Если ВыгружатьКомпании Тогда
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.СвойствоКомпании) <> Неопределено
				ИЛИ тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваКомпании) <> Неопределено Тогда
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.СвойстваКомпаний, Ложь);
			КонецЕсли;
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.Компания) <> Неопределено Тогда
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.Компании, Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыгружатьКонтакты Тогда
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.СвойствоКонтакта) <> Неопределено 
				ИЛИ тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваКонтакта) <> Неопределено Тогда
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.СвойстваКонтактов, Ложь);
			КонецЕсли;
			
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.Контакт) <> Неопределено Тогда
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.Контакты, Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыгружатьРеквизиты Тогда
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.Реквизит) <> Неопределено Тогда
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.Реквизиты, Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыгружатьБанкСчета Тогда
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.БанковскийСчетРеквизита) <> Неопределено Тогда
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.БанковскиеСчета, Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыгружатьТовары Тогда
		 
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.СвойствоТовара) <> Неопределено 
				ИЛИ тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваТовара) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.СвойстваТоваров, Ложь);
			КонецЕсли;
		 
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.ГруппаТовара) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.ГруппыТоваров, Ложь);
			КонецЕсли;
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.ЕдиницаИзмерения) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.ЕдиницыИзмерения, Ложь);
			КонецЕсли;
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.Товар) <> Неопределено 
				ИЛИ тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.КартинкаФайлТовара) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.Товары, Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыгружатьТовары2 ИЛИ ВыгружатьПредложения Тогда 
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.ЕдиницаИзмерения2) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.ЕдиницыИзмерения, Ложь);
			КонецЕсли;
			
		КонецЕсли;                         
		
		Если ВыгружатьТовары2 Тогда
		 
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.СвойствоТовара2) <> Неопределено 
				ИЛИ тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваТовара2) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.СвойстваТоваров, Ложь);
			КонецЕсли;
		 
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.ГруппаТовара2) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.ГруппыТоваров, Ложь);
			КонецЕсли;
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.Товар2) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.Товары, Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыгружатьПредложения Тогда
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.СвойствоПредложения) <> Неопределено 
				ИЛИ тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваПредложения) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.СвойстваПредложений, Ложь);
			КонецЕсли;
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.Предложение)  <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.Предложения, Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыгружатьЦены Тогда    
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.Прайс) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.Прайсы, Ложь);
			 КонецЕсли;    
			 
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.Цена) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.Цены, Ложь);
			КонецЕсли;

		КонецЕсли;   
		
		Если ВыгружатьОстатки Тогда  
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.Остаток) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.Остатки, Ложь);
			КонецЕсли;

		КонецЕсли;
		
		
		Если ВыгружатьКартинкиТоваров Тогда  
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.КартинкаФайлТовара2) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.КартинкиФайлыТоваров, Ложь);
			КонецЕсли;
		КонецЕсли;
		
		Если ВыгружатьКартинкиПредложений Тогда  
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.КартинкаФайлПредложения) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.КартинкиФайлыПредложений, Ложь);
			КонецЕсли;
		КонецЕсли;
		
		Если ВыгружатьСделки Тогда
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.СвойствоСделки) <> Неопределено 
				ИЛИ тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваСделки) <> Неопределено Тогда
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.СвойстваСделок, Ложь);
			КонецЕсли;
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.Проект) <> Неопределено Тогда
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.Проекты, Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыгружатьСчета Тогда
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.СвойствоСчета) <> Неопределено
				ИЛИ тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваСчета) <> Неопределено Тогда
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.СвойстваСчетов, Ложь);
			КонецЕсли;
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.Счет) <> Неопределено Тогда
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.Счета, Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыгружатьСчета2 Тогда
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.СвойствоСчета2) <> Неопределено
				ИЛИ тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваСчета2) <> Неопределено Тогда
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.СвойстваСчетов, Ложь);
			КонецЕсли;
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.Счет2) <> Неопределено Тогда
				ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.Счета, Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыгружатьЗаказы Тогда
				
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.СвойствоЗаказа) <> Неопределено
				ИЛИ тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.ЗначениеСвойстваЗаказа) <> Неопределено Тогда
					 //ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.СвойстваЗаказов, Ложь);
			КонецЕсли;
				
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.Заказ) <> Неопределено 
				ИЛИ тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.ТоварыЗаказа) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.Заказы, Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыгружатьОплаты Тогда
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.Оплата) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.Оплаты, Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыгружатьОтгрузки Тогда
			
			Если тзнДанных.Найти(ТипыДанныхДляОбменаСПорталом.Отгрузка) <> Неопределено Тогда
				 ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипыОперацийСинхронизации.Отгрузки, Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МассивОчереди;
	
КонецФункции

Процедура ДобавитьЗаписьВОчередьВыгрузкиДанных(НастройкаПодключения, МассивОчереди, ТипОперацийСинхронизации, ПолнаяВыгрузка) 
	
		НоваяЗапись = Новый Структура;
		НоваяЗапись.Вставить("НастройкаПодключения"	 , НастройкаПодключения);
		НоваяЗапись.Вставить("Операция"				 , ТипОперацийСинхронизации);
		НоваяЗапись.Вставить("ДатаУстановкиВОчередь" , ТекущаяУниверсальнаяДатаВМиллисекундах());
		НоваяЗапись.Вставить("ПолнаяВыгрузка"		 , ПолнаяВыгрузка);
		НоваяЗапись.Вставить("Статус"		 		 , 0);
		НоваяЗапись.Вставить("КоличествоВыполнений"	 , 0);
		
		МассивОчереди.Добавить(НоваяЗапись);
	
КонецПроцедуры

Процедура ПроверитьОчередьВыполненияВыгрузки(СтруктураНастроек, ОчередьВыгрузки)
	
	// 0 - Новый
	// 1 - выгружен	
	// 2 - ошибка  
	
	ЕстьОчередь = Истина;
	
	Пока ЕстьОчередь Цикл
		
		ЕстьОчередь = Ложь;
	
		Для Каждого ЭлементОчереди Из ОчередьВыгрузки Цикл

			Если ЭлементОчереди.Статус <> 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЭлементОчереди.КоличествоВыполнений > СтруктураНастроек.КоличествоПовторенийПриОшибках Тогда
				ЭлементОчереди.Статус = 2; 
				Продолжить;
			КонецЕсли;
			
			ЕстьОчередь = Истина;
			
			СтруктураНастроек.Операция 			 = ЭлементОчереди.Операция; 
			СтруктураНастроек.СтатусПроверкиОчереди = ЭлементОчереди.Статус;
			
			СтруктураНастроек.ВыполненоБезОшибок = Истина;
			
			
			Если СтруктураНастроек.ПолнаяВыгрузка Тогда
				СтруктураНастроек.Логирование.Измерение3 = "Полная выгрузка данных на портал с типом: " + Строка(СтруктураНастроек.Операция);
			Иначе
				СтруктураНастроек.Логирование.Измерение3 = "Выгрузка изменений на портал с типом: " + Строка(СтруктураНастроек.Операция);
			КонецЕсли;
			
			ОбработатьЭлементОчередиВыполненияВыгрузки(СтруктураНастроек, ЭлементОчереди);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьЭлементОчередиВыполненияВыгрузки(СтруктураНастроек, ЭлементОчереди)  
	
	ТипОперацийСинхронизации = СтруктураНастроек.Операция;
	
	Если ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.Компании Тогда
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Компания);	
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.Контакты Тогда
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Контакт);
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.Реквизиты Тогда
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Реквизит);
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.БанковскиеСчета Тогда
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.БанковскийСчетРеквизита);
		
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.ГруппыТоваров Тогда
		
		Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда	
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара2);
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара2);
		Иначе
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара);
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара);  
		КонецЕсли;
		
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.ЕдиницыИзмерения Тогда  
		
		Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда	
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения2);
		Иначе
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения);
		КонецЕсли;
		
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.Товары Тогда  
		
		Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда	
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Товар2);
		Иначе
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Товар);
		КонецЕсли;   
		
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.Предложения Тогда  
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Предложение);
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.Прайсы Тогда  
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Прайс);
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.Цены Тогда  
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Цена);
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.Остатки Тогда  
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Остаток);
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.КартинкиФайлыТоваров Тогда  
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлТовара2);
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.КартинкиФайлыПредложений Тогда  
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлПредложения);
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.СвойстваТоваров Тогда  
		
		Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда	
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара2);
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара2);
		Иначе
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара);
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара);
		КонецЕсли;
		
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.СвойстваПредложений Тогда  
		
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоПредложения);
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваПредложения);
		
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.Счета Тогда
		
		Если СтруктураНастроек.ВерсияСчетов = "v.2" Тогда
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Счет2);
		Иначе
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Счет);
		КонецЕсли;
		
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.Проекты Тогда
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Проект);
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.СвойстваКомпаний Тогда
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКомпании);
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКомпании);
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.СвойстваКонтактов Тогда
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКонтакта);
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКонтакта);
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.СвойстваСчетов Тогда
		
		Если СтруктураНастроек.ВерсияСчетов = "v.2" Тогда
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета2);
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСчета2);
		Иначе
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета);
			СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСчета);
		КонецЕсли;
	
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.СвойстваСделок Тогда
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСделки);
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСделки);
		
		
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.Заказы Тогда
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Заказ);
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.Отгрузки Тогда
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Отгрузка);
		
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.Оплаты Тогда
		СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Оплата);
	ИначеЕсли ТипОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации.СвойстваЗаказов Тогда
		//СформироватьИОтправить(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоЗаказа);
	КонецЕсли;
	
	СтруктураНастроек.Логирование.Измерение4 = "";
	СтруктураНастроек.Логирование.Измерение5 = "";
	
	Если СтруктураНастроек.ВыполненоБезОшибок Тогда		
		ЭлементОчереди.Статус = 1; 
	Иначе
		ЭлементОчереди.КоличествоВыполнений = ЭлементОчереди.КоличествоВыполнений + 1; 
	КонецЕсли;
	
КонецПроцедуры



Процедура СформироватьИОтправить(СтруктураНастроек, ТипДанных) Экспорт
	
	СтруктураНастроек.Логирование.Измерение4 = Строка(ТипДанных);
	
	Если СтруктураНастроек.СтатусПроверкиОчереди = 0 Тогда
		СтруктураНастроек.Логирование.Измерение5 = "Первая отправка данных на портал"
	ИначеЕсли СтруктураНастроек.СтатусПроверкиОчереди = 2 Тогда
		СтруктураНастроек.Логирование.Измерение5 = "Повторная отправка данных на портал"
	КонецЕсли;
	
	Если СтруктураНастроек.СтатусПроверкиОчереди = 0 Тогда
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало выгрузки объектов с типом: " + Строка(ТипДанных));
	ИначеЕсли СтруктураНастроек.СтатусПроверкиОчереди = 2 Тогда
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Повторная выгрузки объектов с типом: " + Строка(ТипДанных));
	КонецЕсли;
	
	СтруктураНастроек.НеобновляемыеДанныеНаПортале.Очистить();
	
	СтруктураНастроек.Логирование.Измерение6 = "Формирование пакетов для выгрузки на портал";
	Б24_КС_ВыгрузкаСервер.ФормированиеПакетовДанных(СтруктураНастроек, ТипДанных);
	СтруктураНастроек.Логирование.Измерение6 = "";
	
	ПодготовкаИВыгрузкаДанныхНаПортал(СтруктураНастроек, ТипДанных);
	
	Если СтруктураНастроек.СтатусПроверкиОчереди = 0 Тогда
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, "Завершение выгрузки объектов с типом: " + Строка(ТипДанных));
	ИначеЕсли СтруктураНастроек.СтатусПроверкиОчереди = 2 Тогда
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Повторная выгрузка объектов с типом: " + Строка(ТипДанных) + " завершена");
	КонецЕсли;
	
	СтруктураНастроек.Логирование.Измерение4 = "";
	СтруктураНастроек.Логирование.Измерение5 = "";
	СтруктураНастроек.Логирование.Измерение6 = "";
	
КонецПроцедуры


Процедура ПодготовкаИВыгрузкаДанныхНаПортал(СтруктураНастроек, ТипДанных)
	
	Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования данных для объектов с типом: " + Строка(ТипДанных));
	
	КоличествоПакетов = Б24_КС_ВыгрузкаСервер.ПолучитьКоличествоВыгружаемыхПакетов(СтруктураНастроек, ТипДанных);
	
	Для Пакет = 1 По КоличествоПакетов Цикл
		
		СтруктураНастроек.Логирование.Измерение6 = "Выгрузка на портал " + Строка(Пакет) + " пакета";
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, "Начало формирования пакета для выгрузки: " + Строка(Пакет));
		
		МассивДанных = Б24_КС_ВыгрузкаСервер.ПолучитьПакетИзРегистраПакетов(СтруктураНастроек, ТипДанных, Пакет);
		
		Б24_КС_ВыгрузкаСервер.УдалениеРегистрацииПоТипуДанных(СтруктураНастроек, ТипДанных, МассивДанных);
		
		СформированныеДанные = Новый Массив;
		СтруктураНастроек.КлючиПодчиненныхБатчЗапросов 	= Новый Соответствие;
		
		Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Компания Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоКомпаниям(СтруктураНастроек, МассивДанных);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Контакт Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоКонтактам(СтруктураНастроек, МассивДанных);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Реквизит Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоРеквизитам(СтруктураНастроек, МассивДанных);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.БанковскийСчетРеквизита Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоБанковскимСчетамКомпанийКонтактов(СтруктураНастроек, МассивДанных);
			
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоГруппамТоваров(СтруктураНастроек, МассивДанных);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоЕдиницамИзмеренияТоваров(СтруктураНастроек, МассивДанных);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоСвойствамТоваров(СтруктураНастроек, МассивДанных, Пакет);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара Тогда
			СформированныеДанные = Б24_КС_ВыгрузкаСервер.СформироватьЗапросПолученияIDЗначенийСвойствТоваров(СтруктураНастроек, МассивДанных, Пакет);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Товар Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоТоварам(СтруктураНастроек, МассивДанных);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Прайс Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоПрайсам(СтруктураНастроек, МассивДанных);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения2 Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоЕдиницамИзмеренияТоваров2(СтруктураНастроек, МассивДанных);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара2 ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоПредложения Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоСвойствамТоваровПредложений(СтруктураНастроек, ТипДанных, МассивДанных, Пакет);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара2 ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваПредложения Тогда
			СформированныеДанные = Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоЗначениямСвойствТоваровПредложений(СтруктураНастроек, ТипДанных, МассивДанных, Пакет);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара2 Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоГруппамТоваров2(СтруктураНастроек, МассивДанных);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Товар2 Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоТоварам2(СтруктураНастроек, МассивДанных);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлТовара2 ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлПредложения Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоКартинкамФайламТоваровПредложений(СтруктураНастроек, ТипДанных, МассивДанных);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Предложение Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоПредложениям(СтруктураНастроек, МассивДанных);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Цена Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоЦенам(СтруктураНастроек, МассивДанных, Пакет);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Остаток Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоОстаткам(СтруктураНастроек, МассивДанных, Пакет);
			
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Счет Тогда    			
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоСчетам(СтруктураНастроек, МассивДанных);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Счет2 Тогда    			
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоСчетам2(СтруктураНастроек, МассивДанных, Пакет);
			
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Проект Тогда    			
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоСделкам(СтруктураНастроек, МассивДанных, Пакет);
			
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКомпании
			ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКонтакта 
			ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета 
			ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета2 
			ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСделки 
			ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоЗаказа Тогда
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоПользовательскимПолям(СтруктураНастроек, ТипДанных, МассивДанных, Пакет);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКомпании 
			ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКонтакта 
			ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСчета 
			ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСчета2 
			ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСделки 
			ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваЗаказа Тогда
			СформированныеДанные = Б24_КС_ВыгрузкаСервер.СформироватьЗапросПолученияIDЗначенийПользовательскихПолей(СтруктураНастроек, ТипДанных, МассивДанных, Пакет);
			
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Заказ Тогда    			
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоЗаказам(СтруктураНастроек, МассивДанных, Пакет);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.УказанныеСвойстваЗаказа Тогда    			
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоУстановленнымЗначениямСвойствЗаказов(СтруктураНастроек, МассивДанных, Пакет);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Отгрузка Тогда    			
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоОтгрузкам(СтруктураНастроек, МассивДанных, Пакет);
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.Оплата Тогда    			
			СформированныеДанные =  Б24_КС_ВыгрузкаСервер.СформироватьДанныеПоОплатам(СтруктураНастроек, МассивДанных, Пакет);
		КонецЕсли;
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, "Завершено формирование пакета для выгрузки: " + Строка(Пакет));
		
		Если ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара Тогда
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, "Получение идентификаторов значений свойств товаров");
			ПолучениеИдБ24ЗначенийСвойств(СтруктураНастроек, СформированныеДанные, ТипДанных, Пакет);	
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, "Завершено получение идентификаторов значений свойств товаров");
		ИначеЕсли ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКомпании 
			ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваКонтакта 
			ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСчета 
			ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСчета2 
			ИЛИ ТипДанных = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваСделки Тогда
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, "Получение идентификаторов значений пользовательских полей");
			ПолучениеИдБ24ЗначенийПользовательскихПолей(СтруктураНастроек, СформированныеДанные, ТипДанных, Пакет);	
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, "Завершено получение идентификаторов значений пользовательских полей");
			
		Иначе   
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, "Начало выгрузки данных пакета на портал. Тип данных: " + Строка(ТипДанных));
			ВыгрузкаДанныхНаПортал(СтруктураНастроек, ТипДанных, СформированныеДанные, Пакет);
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, "Завершена выгрузка данных пакета на портал. Тип данных: " + Строка(ТипДанных));
		КонецЕсли;
		 		
		Если СтруктураНастроек.ВыполненоБезОшибок И СтруктураНастроек.КартинкиИФайлы.Количество() > 0 Тогда
			Б24_КС_ВыгрузкаСервер.УдалениеРегистрацииКартинокИФайлов(СтруктураНастроек, СтруктураНастроек.КартинкиИФайлы);
			СтруктураНастроек.КартинкиИФайлы.Очистить();
		КонецЕсли;		
		
		Для каждого ТекЭлемент Из СтруктураНастроек.НеобновляемыеДанныеНаПортале Цикл
			Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ТипДанных, Пакет, ТекЭлемент);
		КонецЦикла;
		
		СтруктураНастроек.Логирование.Измерение6 ="";
		
	КонецЦикла;
	
	Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Информация, "Завершение формирования данных для объектов с типом: " + Строка(ТипДанных));
	
КонецПроцедуры

Процедура ВыгрузкаДанныхНаПортал(СтруктураНастроек, ТипДанных, СформированныеДанные, Пакет)
	
	Если СформированныеДанные.Количество() > 0 Тогда
		
		ТелоHTTPЗапроса= "";
		Для каждого ТекЭлемент Из СформированныеДанные Цикл
			ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + ТекЭлемент;	
		КонецЦикла;
		
		СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);
		
		Если СтруктураОтвета = Неопределено Тогда
			СтруктураНастроек.ВыполненоБезОшибок = Ложь;
			Возврат;	
		КонецЕсли;
		
		ВремКлючиИдВладельцев 	= Новый Соответствие;
		ВремКлючиИдДел 			= Новый Соответствие;
		
		result = СтруктураОтвета.Получить("result");
		Если result <> Неопределено Тогда
			
			result2 = result.Получить("result");
			Если result2 <> Неопределено Тогда
				
				Для каждого ТекСтрока Из result2 Цикл
					
					Если ТипЗнч(ТекСтрока) = Тип("Булево") ИЛИ ТипЗнч(ТекСтрока) = Тип("Соответствие") ИЛИ СтрДлина(ТекСтрока.Ключ) < 30 Тогда
						Продолжить;
					КонецЕсли;
						
					ДанныеКлюча = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Получить(ТекСтрока.Ключ);
					
					Если ДанныеКлюча = Неопределено Тогда
						Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Не найден объект с ид:" + Строка(ТекСтрока.Ключ));  
						СтруктураНастроек.ВыполненоБезОшибок = Ложь;
						Продолжить;
					КонецЕсли;
					
					Если ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКомпании ИЛИ ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКонтакта 
						ИЛИ ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета ИЛИ ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета2 
						ИЛИ ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСделки Тогда
						
						Если ТипЗнч(ТекСтрока.Значение) = Тип("Соответствие") Тогда
						    field = ТекСтрока.Значение.Получить("field"); 
						    Если field <> Неопределено Тогда
								
								ИдЭлемента = Формат(field.Получить("id"), "ЧГ=0");
								
								ВремКлючиИдВладельцев.Вставить(ТекСтрока.Ключ, ИдЭлемента);
								
								РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, ДанныеКлюча, ИдЭлемента, field.Получить("fieldName"));
								Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, ДанныеКлюча);
								
							КонецЕсли;         
						КонецЕсли;	
						
					ИначеЕсли ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара2 ИЛИ ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.СвойствоПредложения Тогда 
						
						Если ТипЗнч(ТекСтрока.Значение) = Тип("Соответствие") Тогда
						    productProperty = ТекСтрока.Значение.Получить("productProperty"); 
						    Если productProperty <> Неопределено Тогда
								
								ИдЭлемента = Формат(productProperty.Получить("id"), "ЧГ=0");
								
								ВремКлючиИдВладельцев.Вставить(ТекСтрока.Ключ, ИдЭлемента);
								
								РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, ДанныеКлюча, ИдЭлемента);
								Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, ДанныеКлюча);
								
							КонецЕсли;         
						КонецЕсли;	
						
					ИначеЕсли ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара2 ИЛИ ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваПредложения Тогда 
						
						Если ТипЗнч(ТекСтрока.Значение) = Тип("Соответствие") Тогда
						    productPropertyEnum = ТекСтрока.Значение.Получить("productPropertyEnum"); 
						    Если productPropertyEnum <> Неопределено Тогда
								
								ИдЭлемента = Формат(productPropertyEnum.Получить("id"), "ЧГ=0");
								
								ВремКлючиИдВладельцев.Вставить(ТекСтрока.Ключ, ИдЭлемента);
								
								РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, ДанныеКлюча, ИдЭлемента);   
								
								Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, ДанныеКлюча);
								
							КонецЕсли;         
						КонецЕсли;	
						
					ИначеЕсли ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.Прайс Тогда 
						
						Если ТипЗнч(ТекСтрока.Значение) = Тип("Соответствие") Тогда
						    priceType = ТекСтрока.Значение.Получить("priceType"); 
						    Если priceType <> Неопределено Тогда
								
								ИдЭлемента = Формат(priceType.Получить("id"), "ЧГ=0");
								
								ВремКлючиИдВладельцев.Вставить(ТекСтрока.Ключ, ИдЭлемента);
								
								РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, ДанныеКлюча, ИдЭлемента);
								Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, ДанныеКлюча);
								
							КонецЕсли;         
						КонецЕсли;	
						
					ИначеЕсли ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения2 Тогда 
						
						Если ТипЗнч(ТекСтрока.Значение) = Тип("Соответствие") Тогда
						    measure = ТекСтрока.Значение.Получить("measure"); 
						    Если measure <> Неопределено Тогда
								
								ИдЭлемента = Формат(measure.Получить("id"), "ЧГ=0");
								
								ВремКлючиИдВладельцев.Вставить(ТекСтрока.Ключ, ИдЭлемента);
								
								РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, ДанныеКлюча, ИдЭлемента);
								Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, ДанныеКлюча);
								
							КонецЕсли;         
						КонецЕсли;	
						
					ИначеЕсли ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара2 Тогда 
						
						Если ТипЗнч(ТекСтрока.Значение) = Тип("Соответствие") Тогда
						    section = ТекСтрока.Значение.Получить("section"); 
						    Если section <> Неопределено Тогда
								
								ИдЭлемента = Формат(section.Получить("id"), "ЧГ=0");
								
								ВремКлючиИдВладельцев.Вставить(ТекСтрока.Ключ, ИдЭлемента);
								
								РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, ДанныеКлюча, ИдЭлемента);
								Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, ДанныеКлюча);
								
							КонецЕсли;         
						КонецЕсли;	
						
					ИначеЕсли ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.Товар2 Тогда 
						
						Если ТипЗнч(ТекСтрока.Значение) = Тип("Соответствие") Тогда
						    element = ТекСтрока.Значение.Получить("element"); 
						    Если element <> Неопределено Тогда
								                   
								ИдЭлемента = Формат(element.Получить("id"), "ЧГ=0");
								
								ВремКлючиИдВладельцев.Вставить(ТекСтрока.Ключ, ИдЭлемента);
								
								РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, ДанныеКлюча, ИдЭлемента);
								Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, ДанныеКлюча);
								
							КонецЕсли;         
						КонецЕсли;
						
					ИначеЕсли ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.Предложение Тогда 
						
						Если ТипЗнч(ТекСтрока.Значение) = Тип("Соответствие") Тогда
						    offer = ТекСтрока.Значение.Получить("offer"); 
						    Если offer <> Неопределено Тогда
								                   
								ИдЭлемента = Формат(offer.Получить("id"), "ЧГ=0");
								
								ВремКлючиИдВладельцев.Вставить(ТекСтрока.Ключ, ИдЭлемента);
								
								РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, ДанныеКлюча, ИдЭлемента);
								Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, ДанныеКлюча);
								
							КонецЕсли;         
						КонецЕсли;	
						
					ИначеЕсли ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.Цена Тогда 
						
						Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, ДанныеКлюча);
						
					ИначеЕсли ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.Остаток Тогда 
						
						Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, ДанныеКлюча);
						
					ИначеЕсли ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлТовара2
						ИЛИ ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.КартинкаФайлПредложения Тогда 
						
						Если ТипЗнч(ТекСтрока.Значение) = Тип("Соответствие") Тогда
						    productImage = ТекСтрока.Значение.Получить("productImage"); 
						    Если productImage <> Неопределено Тогда
								                   
								ИдЭлемента = Формат(productImage.Получить("id"), "ЧГ=0");
								
								ВремКлючиИдВладельцев.Вставить(ТекСтрока.Ключ, ИдЭлемента);
								
								РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, ДанныеКлюча, ИдЭлемента);
								Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, ДанныеКлюча);
								
							КонецЕсли;         
						КонецЕсли;	
						
					ИначеЕсли ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.Счет2 Тогда
						
						Если ТипЗнч(ТекСтрока.Значение) = Тип("Соответствие") Тогда
						
						    item = ТекСтрока.Значение.Получить("item"); 
						    Если item <> Неопределено Тогда
								
								ИдЭлемента = Формат(item.Получить("id"), "ЧГ=0");
								
								ВремКлючиИдВладельцев.Вставить(ТекСтрока.Ключ, ИдЭлемента);
								
								РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, ДанныеКлюча, ИдЭлемента);
								Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, ДанныеКлюча);
								
								ИнформацияОДеле = ВремКлючиИдДел.Получить(ТекСтрока.Ключ);
								Если ИнформацияОДеле <> Неопределено Тогда
									РегистрыСведений.Б24_К_ИдентификаторыДел.ЗаписатьИдБ24Объекта(СтруктураНастроек, ИнформацияОДеле.ТипДанных, ИнформацияОДеле.Данные, ИнформацияОДеле.Ид, ИдЭлемента);
								КонецЕсли; 
								
							КонецЕсли;         
						КонецЕсли;	
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////						
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////						
					ИначеЕсли ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.Заказ Тогда
						
						Если ТипЗнч(ТекСтрока) = Тип("КлючИЗначение") Тогда
						
							ВремКлючиИдВладельцев.Вставить(ТекСтрока.Ключ, Формат(ТекСтрока.Значение, "ЧГ=0"));
							
							РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, ДанныеКлюча, ТекСтрока.Значение);
						
							ИнформацияОЗаказе = ТекСтрока.Значение.Получить("order");
							Если ИнформацияОЗаказе <> Неопределено Тогда
								
								ИдБитрикс24	= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоXML(Тип("Строка"), Формат(ИнформацияОЗаказе.Получить("id"),"ЧГ=0"));
								РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, ДанныеКлюча.Объект, ИдБитрикс24);  
								Б24_КС_ЗагрузкаСервер.ОбновитьДополнительнуюИнформациюОЗаказе(ДанныеКлюча.Объект, ИнформацияОЗаказе);						
								Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, ДанныеКлюча.Объект);
							КонецЕсли;
							
						КонецЕсли;
						
					ИначеЕсли ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.ТоварыЗаказа Тогда
						
						Если ТипЗнч(ТекСтрока) = Тип("КлючИЗначение") Тогда
							basketItems = ТекСтрока.Значение.Получить("basketItems");	
							Если basketItems <> Неопределено Тогда
								
								Для каждого ПозицияЗаказа Из basketItems Цикл
									
									Если ТипЗнч(ПозицияЗаказа) = Тип("Соответствие") Тогда
										КлючСвязи 	= Число(ПозицияЗаказа.Получить("xmlId")); 
										ИдКорзины 	= Формат(ПозицияЗаказа.Получить("id"), "ЧГ=0"); 
									Иначе
										КлючСвязи 	= Число(ПозицияЗаказа.Значение.Получить("xmlId")); 
										ИдКорзины 	= Формат(ПозицияЗаказа.Значение.Получить("id"), "ЧГ=0"); 
									КонецЕсли;
									
									ДанныеОПозиции = Новый Структура;
									ДанныеОПозиции.Вставить("Объект"			, ДанныеКлюча.Объект);
									ДанныеОПозиции.Вставить("ПодчиненныйОбъект"	, КлючСвязи);
									
									РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, ДанныеОПозиции, ИдКорзины);  
									
								КонецЦикла;
							КонецЕсли;
						КонецЕсли;
						
					ИначеЕсли ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.Оплата Тогда
						
						ИнформацияООплатах = ТекСтрока.Значение.Получить("payments");
						
						Если ИнформацияООплатах <> Неопределено Тогда
							
							ПрефиксыВнешнихКодовБитрикс24 = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьПрефиксВнешнихКодовБитрикс24();
							
							Для Каждого ТекОплата Из ИнформацияООплатах Цикл
								
								Если ТипЗнч(ТекОплата) = Тип("Соответствие") Тогда
									ВнешнийКодОплаты 	= ТекОплата.Получить("xmlId"); 
									ИдОплаты 			= Формат(ТекОплата.Получить("id"), "ЧГ=0"); 
								Иначе
									ВнешнийКодОплаты 	= ТекОплата.Значение.Получить("xmlId"); 
									ИдОплаты 			= Формат(ТекОплата.Значение.Получить("id"), "ЧГ=0"); 
								КонецЕсли;
								
								Оплата = Неопределено;
							    Если Лев(ВнешнийКодОплаты, СтрДлина(ПрефиксыВнешнихКодовБитрикс24.ОперацияПоПлатежнымКартам)) = ПрефиксыВнешнихКодовБитрикс24.ОперацияПоПлатежнымКартам Тогда
									ВнешнийКодОплаты = Прав(ВнешнийКодОплаты, СтрДлина(ВнешнийКодОплаты)-СтрДлина(ПрефиксыВнешнихКодовБитрикс24.ОперацияПоПлатежнымКартам));	
									Оплата = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоXML(Тип("ДокументСсылка.ОперацияПоПлатежнойКарте"), ВнешнийКодОплаты);
								ИначеЕсли Лев(ВнешнийКодОплаты, СтрДлина(ПрефиксыВнешнихКодовБитрикс24.ПоступлениеВКассу)) = ПрефиксыВнешнихКодовБитрикс24.ПоступлениеВКассу Тогда
									ВнешнийКодОплаты = Прав(ВнешнийКодОплаты, СтрДлина(ВнешнийКодОплаты)-СтрДлина(ПрефиксыВнешнихКодовБитрикс24.ПоступлениеВКассу));	
									Оплата = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоXML(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"), ВнешнийКодОплаты);
								ИначеЕсли Лев(ВнешнийКодОплаты, СтрДлина(ПрефиксыВнешнихКодовБитрикс24.ПоступлениеНаСчет)) = ПрефиксыВнешнихКодовБитрикс24.ПоступлениеНаСчет Тогда
									ВнешнийКодОплаты = Прав(ВнешнийКодОплаты, СтрДлина(ВнешнийКодОплаты)-СтрДлина(ПрефиксыВнешнихКодовБитрикс24.ПоступлениеНаСчет));	
									Оплата = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоXML(Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств"), ВнешнийКодОплаты);
								КонецЕсли;
								
								Если ЗначениеЗаполнено(Оплата) Тогда
									РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, Оплата, ИдОплаты); 
									Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, Оплата);
								КонецЕсли;
								
							КонецЦикла;
							
						КонецЕсли;
						
					ИначеЕсли ДанныеКлюча.Тип = СтруктураНастроек.ТипыОбъектовОбмена.Отгрузка Тогда
						
						ИнформацияООтгрузках = ТекСтрока.Значение.Получить("shipments");
						
						Если ИнформацияООтгрузках <> Неопределено Тогда
							
							Для Каждого ТекИнфОтгрузка Из ИнформацияООтгрузках Цикл
								
								Если ТипЗнч(ТекИнфОтгрузка) = Тип("Соответствие") Тогда
									ТекОтгрузка = ТекИнфОтгрузка; 
								Иначе
									ТекОтгрузка = ТекИнфОтгрузка.Значение; 
								КонецЕсли;
								
								ВнешнийКодОтгрузки 	= ТекОтгрузка.Получить("xmlId"); 
								Отгрузка 	= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоXML(Тип("ДокументСсылка.РеализацияТоваровУслуг"), ВнешнийКодОтгрузки);
								ИдОтгрузки 	= Формат(ТекОтгрузка.Получить("id"), "ЧГ=0"); 
								
								Если ЗначениеЗаполнено(Отгрузка) Тогда
									РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, Отгрузка, ИдОтгрузки); 
									Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, Отгрузка);
									
									ПозицииОтгрузки = ТекОтгрузка.Получить("shipmentItems");
									Если ТипЗнч(ПозицииОтгрузки) = Тип("Массив") Тогда
										Для Каждого ТоварОтгрузки Из ПозицииОтгрузки Цикл
											
											ИдПозицииОтгрузки	= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоXML(Тип("Строка"), Формат(ТоварОтгрузки.Получить("id"),"ЧГ=0"));
											
											КлючСвязиПозицииСтрока	= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоXML(Тип("Строка"), ТоварОтгрузки.Получить("xmlId"));
											Если Лев(КлючСвязиПозицииСтрока, 2) = "S_" Тогда
												КлючСвязиПозиции = Число(Прав(КлючСвязиПозицииСтрока, СтрДлина(КлючСвязиПозицииСтрока)-2));	
											Иначе
												КлючСвязиПозиции = "";	       // не смогли проанализировать.
											КонецЕсли;
											
											ДанныеОПозиции = Новый Структура;
											ДанныеОПозиции.Вставить("Объект"			, Отгрузка);
											ДанныеОПозиции.Вставить("ПодчиненныйОбъект"	, КлючСвязиПозиции);                                            
											
											РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ТоварыОтгрузки, ДанныеОПозиции, ИдПозицииОтгрузки);
											
										КонецЦикла;
									КонецЕсли;
								КонецЕсли;
								
							КонецЦикла;
							
						КонецЕсли;    
						
					ИначеЕсли (ТипЗнч(ТекСтрока.Значение) = Тип("Булево") И ДанныеКлюча.ЗаписыватьПриИстина) ИЛИ ТипЗнч(ТекСтрока.Значение) <> Тип("Булево") Тогда
						
						Если Лев(ТекСтрока.Ключ, 2) = "D_" Тогда
							
							ВнешнийКодВладельца = Прав(ТекСтрока.Ключ, СтрДлина(ТекСтрока.Ключ)-2);
							
							ДанныеКлючаВладельца = ВремКлючиИдВладельцев.Получить(ВнешнийКодВладельца);
							Если ЗначениеЗаполнено(ДанныеКлючаВладельца) Тогда              
								РегистрыСведений.Б24_К_ИдентификаторыДел.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, ДанныеКлюча, ТекСтрока.Значение, ДанныеКлючаВладельца);
							Иначе
							
								ИнформацияОДеле = Новый Структура;
								ИнформацияОДеле.Вставить("Ид"		, ТекСтрока.Значение);
								ИнформацияОДеле.Вставить("ТипДанных", ДанныеКлюча.Тип);
								ИнформацияОДеле.Вставить("Данные"	, ДанныеКлюча);
								
								ВремКлючиИдДел.Вставить(ВнешнийКодВладельца,  ИнформацияОДеле); 
								
							КонецЕсли;
							
						Иначе
							
							ИдЭлемента = Формат(ТекСтрока.Значение, "ЧГ=0");
							
							
							ВремКлючиИдВладельцев.Вставить(ТекСтрока.Ключ, ИдЭлемента);
							
							РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, ДанныеКлюча.Тип, ДанныеКлюча, ИдЭлемента);
							Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, ДанныеКлюча);
							
							ИнформацияОДеле = ВремКлючиИдДел.Получить(ТекСтрока.Ключ);
							Если ИнформацияОДеле <> Неопределено Тогда
								РегистрыСведений.Б24_К_ИдентификаторыДел.ЗаписатьИдБ24Объекта(СтруктураНастроек, ИнформацияОДеле.ТипДанных, ИнформацияОДеле.Данные, ИнформацияОДеле.Ид, ИдЭлемента);
							КонецЕсли;
							
						КонецЕсли;
						
					ИначеЕсли ТипЗнч(ТекСтрока.Значение) = Тип("Булево") Тогда	
						
						Если ТекСтрока.Значение = Истина Тогда		
							Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ДанныеКлюча.Тип, Пакет, ДанныеКлюча);
						Иначе
							Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Ложь, ДанныеКлюча.Тип, Пакет, ДанныеКлюча);
						КонецЕсли;
						
						ИнформацияОДеле = ВремКлючиИдДел.Получить(ТекСтрока.Ключ);
						Если ИнформацияОДеле <> Неопределено Тогда
							лИдВладельца = РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ПолучитьИдОбъекта(СтруктураНастроек.Портал, ДанныеКлюча.Тип, ДанныеКлюча.Объект); 
							РегистрыСведений.Б24_К_ИдентификаторыДел.ЗаписатьИдБ24Объекта(СтруктураНастроек, ИнформацияОДеле.ТипДанных, ИнформацияОДеле.Данные.Объект, ИнформацияОДеле.Ид, лИдВладельца);
						КонецЕсли;
							
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			result_error = result.Получить("result_error"); 
			Если result_error <> Неопределено Тогда
				
				Для каждого ТекСтрока Из result_error Цикл     					
					
					Если ТипЗнч(ТекСтрока) <> Тип("Соответствие") Тогда                  
					
						ДанныеКлюча = СтруктураНастроек.КлючиПодчиненныхБатчЗапросов.Получить(ТекСтрока.Ключ);
						
						Если ДанныеКлюча = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						
						лОписаниеОшибки = ТекСтрока.Значение.Получить("error_description");
						
						Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, лОписаниеОшибки + " у объекта:" + Строка(ДанныеКлюча.Объект)); 
						
						РазобратьОшибку(СтруктураНастроек, ДанныеКлюча.Тип, ДанныеКлюча.Объект, лОписаниеОшибки);
						
						Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Ложь, ДанныеКлюча.Тип, Пакет, ДанныеКлюча);
						
						СтруктураНастроек.ВыполненоБезОшибок = Ложь;
					
					КонецЕсли;					
					
				КонецЦикла;
				
			КонецЕсли;
		Иначе
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Не удалось разобрать JSON ответа");
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Тело отправляемого запроса: " + ТелоHTTPЗапроса);
			
			СтруктураНастроек.ВыполненоБезОшибок = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучениеИдБ24ЗначенийСвойств(СтруктураНастроек, СформированныеДанные, ТипДанных, Пакет)
	
	Если СформированныеДанные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТелоHTTPЗапроса= "";
	Для каждого ТекЭлемент Из СформированныеДанные Цикл
		ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + ТекЭлемент;	
	КонецЦикла;
	
	СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);
	
	Если СтруктураОтвета = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	result1 = СтруктураОтвета.Получить("result");
	Если result1 <> Неопределено Тогда
		
		result2 = result1.Получить("result");  			
		Если result2 <> Неопределено Тогда
			
			Для каждого ТекСвойство Из result2 Цикл
				
				Если ТекСвойство.Значение.Количество()=0 Тогда
					Продолжить;
				КонецЕсли;
				
				Свойство = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоXML(Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"), ТекСвойство.Ключ);	
				
				VALUES = ТекСвойство.Значение[0].Получить("VALUES");
				
				Если VALUES <> Неопределено Тогда
					
					Для Каждого ТекЗначение Из VALUES Цикл
						
						ВнешнийИД = ТекЗначение.Значение.Получить("XML_ID");
						
						Если ЗначениеЗаполнено(ВнешнийИД) Тогда
							
							лЗначение = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоXML(Тип("СправочникСсылка.ЗначенияСвойствОбъектов"), ВнешнийИД);	
							ИдОбъекта = ТекЗначение.Значение.Получить("ID");
							
							РегистрыСведений.Б24_К_ИдентификаторыОбъектов.ЗаписатьИдБ24Объекта(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ЗначениеСвойстваТовара, лЗначение, ИдОбъекта);  
							
						КонецЕсли;
					КонецЦикла;	
					
				КонецЕсли;
				
				Б24_КС_ВыгрузкаСервер.УдалениеЗаписиИзПакетаДанных(СтруктураНастроек, Истина, ТипДанных, Пакет, Свойство);
				
			КонецЦикла;	
		КонецЕсли;
		
		Если result1.Получить("result_error") <> Неопределено Тогда
			
			Для каждого ТекСтрока Из result1.Получить("result_error") Цикл
				
				лОписаниеОшибки = ТекСтрока.Значение.Получить("error_description");
				
				лОбъект = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоXML(ТИП("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"), ТекСтрока.Ключ);	
				
				Если НЕ ЗначениеЗаполнено(лОбъект) Тогда
					Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, лОписаниеОшибки + " у не найденного объекта с ид:" + Строка(ТекСтрока.Ключ));   
				Иначе   
					Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, лОписаниеОшибки + " у объекта:" + Строка(лОбъект));       
					//Б24_КС_РегистрацияИзмененийВызовСервера.ЗарегистрироватьДопРеквизит(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена, лОбъект);
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучениеИдБ24ЗначенийПользовательскихПолей(СтруктураНастроек, СформированныеДанные, ТипДанных, Пакет)
	
	Если СформированныеДанные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТелоHTTPЗапроса= "";
	Для каждого ТекЭлемент Из СформированныеДанные Цикл
		ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + ТекЭлемент;	
	КонецЦикла;
	
	СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);
	
	Если СтруктураОтвета = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Б24_КС_ВыгрузкаСервер.ОбработатьЗапросПолученияIDЗначенийПользовательскихПолей(СтруктураНастроек, ТипДанных, СтруктураОтвета, Пакет);
	
КонецПроцедуры

#КонецОбласти


#Область ПроцедурыИФункцииЗагрузки

Процедура ЗапуститьВыполнениеЗагрузкиВФоне(ПараметрыВыгрузки, АдресРезультата) Экспорт

	НастройкаПодключения = ПараметрыВыгрузки.НастройкаПодключения;
		
	СтруктураНастроек = СформироватьСтруктуруНастроек(НастройкаПодключения, Ложь, 1);
	Если СтруктураНастроек <> Неопределено Тогда
		ЗапуститьВыполнениеЗагрузки(СтруктураНастроек);
	КонецЕсли;
	
	Б24_К_ОбщегоНазначенияВызовСервера.ПроверитьФоновоеЗаданиеВОчереди(ПараметрыВыгрузки);

КонецПроцедуры

Процедура ЗапуститьВыполнениеЗагрузки(СтруктураНастроек) Экспорт
	
	Если СтруктураНастроек.ОбщиеНастройки.ДелатьЗапросНаВнешнийСервис Тогда
		Если ЗначениеЗаполнено(СтруктураНастроек.ОбщиеНастройки.АдресЗапросаНаВнешнийСервис) Тогда
			Б24_К_RestApiВызовСервера.ОтправитьЗапросаНаВнешнийСервис(СтруктураНастроек.ОбщиеНастройки.АдресЗапросаНаВнешнийСервис);
		КонецЕсли;
	КонецЕсли;
	
	НастройкаПодключения = СтруктураНастроек.НастройкаПодключения; 
	
	НастройкиСинхронизации = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьНастройкуСинхронизацииПоНастройкеПодключения(НастройкаПодключения);
	СохраненныеНастройки = НастройкиСинхронизации.Настройки.Получить();
	
	ЗагружаемыеСущности = Новый Структура;
	ЗагружаемыеСущности.Вставить("ЗагружатьКомпании"	, Ложь);
	ЗагружаемыеСущности.Вставить("ЗагружатьКонтакты"	, Ложь);
	ЗагружаемыеСущности.Вставить("ЗагружатьРеквизиты"	, Ложь );
	ЗагружаемыеСущности.Вставить("ЗагружатьБанкСчета"	, Ложь);
	ЗагружаемыеСущности.Вставить("ЗагружатьТовары"		, Ложь);
	ЗагружаемыеСущности.Вставить("ЗагружатьТовары2"		, Ложь);
	ЗагружаемыеСущности.Вставить("ЗагружатьПредложения"	, Ложь);
	ЗагружаемыеСущности.Вставить("ЗагружатьСчета"		, Ложь);
	ЗагружаемыеСущности.Вставить("ЗагружатьСчета2"		, Ложь);
	ЗагружаемыеСущности.Вставить("ЗагружатьСделки"		, Ложь);
	ЗагружаемыеСущности.Вставить("ЗагружатьЗаказы"		, Ложь);
	ЗагружаемыеСущности.Вставить("ЗагружатьОплаты"		, Ложь);
	ЗагружаемыеСущности.Вставить("ЗагружатьОтгрузки"	, Ложь);
#Область ОпределениеТиповЗагружаемыхДанных	
	Для каждого ТекСущность Из СохраненныеНастройки.Сущности Цикл
		
		Если НастройкиСинхронизации.СинхронизацияКлиентов Тогда
			Если ТекСущность.ВидСущности = "Компания" И ТекСущность.ЗагружатьВ1С Тогда
				ЗагружаемыеСущности.ЗагружатьКомпании = Истина;	
			ИначеЕсли ТекСущность.ВидСущности = "Контакт" И ТекСущность.ЗагружатьВ1С Тогда
				ЗагружаемыеСущности.ЗагружатьКонтакты = Истина;	
			ИначеЕсли ТекСущность.ВидСущности = "Реквизит" И ТекСущность.ЗагружатьВ1С Тогда
				ЗагружаемыеСущности.ЗагружатьРеквизиты = Истина;	
			ИначеЕсли ТекСущность.ВидСущности = "Банковский счет" И ТекСущность.ЗагружатьВ1С Тогда
				ЗагружаемыеСущности.ЗагружатьБанкСчета = Истина;	
			КонецЕсли;
		КонецЕсли;
		
		Если НастройкиСинхронизации.СинхронизацияТоваров И НЕ НастройкиСинхронизации.ВерсияТоваров = "v.2" Тогда
			Если ТекСущность.ВидСущности = "Товар" И ТекСущность.ЗагружатьВ1С Тогда
				ЗагружаемыеСущности.ЗагружатьТовары = Истина;	
			КонецЕсли;
		КонецЕсли;
		
		Если НастройкиСинхронизации.СинхронизацияТоваров И НастройкиСинхронизации.ВерсияТоваров = "v.2" Тогда
			Если ТекСущность.ВидСущности = "Товар2" И ТекСущность.ЗагружатьВ1С Тогда
				ЗагружаемыеСущности.ЗагружатьТовары2 = Истина;	       
				ЗагружаемыеСущности.ЗагружатьПредложения = Истина;	
			КонецЕсли;
		КонецЕсли;
		
		Если НастройкиСинхронизации.СинхронизацияСделок Тогда
			Если ТекСущность.ВидСущности = "Проект" И ТекСущность.ЗагружатьВ1С Тогда
				ЗагружаемыеСущности.ЗагружатьСделки = Истина;	
			КонецЕсли;
		КонецЕсли;
		
		Если НастройкиСинхронизации.СинхронизацияСчетов И НЕ НастройкиСинхронизации.ВерсияСчетов = "v.2" Тогда
			Если ТекСущность.ВидСущности = "Счет" И ТекСущность.ЗагружатьВ1С Тогда
				ЗагружаемыеСущности.ЗагружатьСчета = Истина;	
			КонецЕсли;
		КонецЕсли;
		
		Если НастройкиСинхронизации.СинхронизацияСчетов И НастройкиСинхронизации.ВерсияСчетов = "v.2" Тогда
			Если ТекСущность.ВидСущности = "Счет2" И ТекСущность.ЗагружатьВ1С Тогда
				ЗагружаемыеСущности.ЗагружатьСчета2 = Истина;	
			КонецЕсли;
		КонецЕсли;
		
		Если НастройкиСинхронизации.СинхронизацияЗаказов Тогда
			Если ТекСущность.ВидСущности = "Заказ" И ТекСущность.ЗагружатьВ1С Тогда
				ЗагружаемыеСущности.ЗагружатьЗаказы = Истина;	
			ИначеЕсли ТекСущность.ВидСущности = "Оплата" И ТекСущность.ЗагружатьВ1С Тогда
				ЗагружаемыеСущности.ЗагружатьОплаты = Истина;	
			ИначеЕсли ТекСущность.ВидСущности = "Отгрузка" И ТекСущность.ЗагружатьВ1С Тогда
				ЗагружаемыеСущности.ЗагружатьОтгрузки = Истина;	
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
#КонецОбласти	
	
	Если СтруктураНастроек.ПолнаяЗагрузка Тогда
		
		Если ЗагружаемыеСущности.ЗагружатьКомпании Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Компания");
			ПолнаяЗагрузкаДанных(СтруктураНастроек, мТипыОперацийСинхронизации);
		КонецЕсли;
		
		Если ЗагружаемыеСущности.ЗагружатьКонтакты Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Контакт");
			ПолнаяЗагрузкаДанных(СтруктураНастроек, мТипыОперацийСинхронизации);
		КонецЕсли;
		
		Если ЗагружаемыеСущности.ЗагружатьРеквизиты Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Реквизит");
			ПолнаяЗагрузкаДанных(СтруктураНастроек, мТипыОперацийСинхронизации);
		КонецЕсли;
		
		Если ЗагружаемыеСущности.ЗагружатьБанкСчета Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Банковский счет");
			ПолнаяЗагрузкаДанных(СтруктураНастроек, мТипыОперацийСинхронизации);
		КонецЕсли;
		
		Если ЗагружаемыеСущности.ЗагружатьТовары Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Товар");
			ПолнаяЗагрузкаДанных(СтруктураНастроек, мТипыОперацийСинхронизации);
		КонецЕсли;
		
		Если ЗагружаемыеСущности.ЗагружатьТовары2 Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Товар2");
			ПолнаяЗагрузкаДанных(СтруктураНастроек, мТипыОперацийСинхронизации);
		КонецЕсли;         
		
		Если ЗагружаемыеСущности.ЗагружатьПредложения Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Предложение");
			ПолнаяЗагрузкаДанных(СтруктураНастроек, мТипыОперацийСинхронизации);
		КонецЕсли;
		
		Если ЗагружаемыеСущности.ЗагружатьСчета Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Счет");
			ПолнаяЗагрузкаДанных(СтруктураНастроек, мТипыОперацийСинхронизации);
		КонецЕсли;
		
		Если ЗагружаемыеСущности.ЗагружатьСчета2 Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Счет2");
			ПолнаяЗагрузкаДанных(СтруктураНастроек, мТипыОперацийСинхронизации);
		КонецЕсли;
		
		Если ЗагружаемыеСущности.ЗагружатьСделки Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Проект");
			ПолнаяЗагрузкаДанных(СтруктураНастроек, мТипыОперацийСинхронизации);
		КонецЕсли;
		
		Если ЗагружаемыеСущности.ЗагружатьЗаказы Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Заказ");
			ПолнаяЗагрузкаДанных(СтруктураНастроек, мТипыОперацийСинхронизации);
		КонецЕсли;
		
		Если ЗагружаемыеСущности.ЗагружатьОплаты Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Оплата");
			ПолнаяЗагрузкаДанных(СтруктураНастроек, мТипыОперацийСинхронизации);
		КонецЕсли;
		
		Если ЗагружаемыеСущности.ЗагружатьОтгрузки Тогда
			мТипыОперацийСинхронизации =  ПолучитьТипыОперацийСинхронизацийПоВидуСущности(СтруктураНастроек, "Отгрузка");
			ПолнаяЗагрузкаДанных(СтруктураНастроек, мТипыОперацийСинхронизации);
		КонецЕсли;
		
	Иначе
		
		ИзмененияЗагрузкаДанных(СтруктураНастроек, ЗагружаемыеСущности);	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолнаяЗагрузкаДанных(СтруктураНастроек, ТипыОперацийСинхронизации)
	
	Для каждого ТекЭлемент Из ТипыОперацийСинхронизации Цикл 
		
		СтруктураНастроек.Операция = ТекЭлемент; 
		
		СтруктураНастроек.Логирование.Измерение3 = "Полная загрузка данных с портала с типом: " + Строка(ТекЭлемент);
		СтруктураНастроек.Логирование.Измерение4 = Строка(СтруктураНастроек.Операция);
		
		ТипыОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации;
		
		Если СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Компании Тогда
			ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "crm.company.list", "select[]=ID"	, 							, "filter[ID]");
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Контакты Тогда
			ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "crm.contact.list", "select[]=ID"	, 							, "filter[ID]");
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Реквизиты Тогда
			ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "crm.requisite.list", 			, 							, "filter[ID]");
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.БанковскиеСчета Тогда
			ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "crm.requisite.bankdetail.list", 	, 							, "filter[ID]");
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.ГруппыТоваров Тогда
			
			Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда   
				Фильтр = "filter[iblockId]="+СтруктураНастроек.НастройкиСинхронизацииТоваров.ИдентификаторКаталогаТоваров;	
				ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "catalog.section.list", 		, Фильтр					, "filter[id]");
			Иначе
				ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "crm.productsection.list", 	, 							, "filter[ID]");
			КонецЕсли;
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.ЕдиницыИзмерения Тогда
			
			Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда
				ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "catalog.measure.list",  		,							, "filter[id]");
			Иначе
				ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "crm.measure.list", 			, 							, "filter[ID]");
			КонецЕсли;
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваТоваров Тогда
			
			Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда   
				Фильтр = "filter[iblockId]="+СтруктураНастроек.НастройкиСинхронизацииТоваров.ИдентификаторКаталогаТоваров;	
				ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "catalog.productProperty.list", , Фильтр					, "filter[id]");
			Иначе
				ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "crm.product.property.list", 	, 							, "filter[ID]");
			КонецЕсли;
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваПредложений Тогда    
			
			Фильтр = "filter[iblockId]="+СтруктураНастроек.НастройкиСинхронизацииТоваров.ИдентификаторКаталогаПредложений;	
			ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "catalog.productProperty.list",  	, Фильтр					, "filter[id]");
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Товары Тогда                                        		
			
			Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда   
				Фильтр = "filter[iblockId]="+СтруктураНастроек.НастройкиСинхронизацииТоваров.ИдентификаторКаталогаТоваров;	
				ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "catalog.product.list",  "select[]=id&select[]=iblockId", Фильтр	, "filter[id]");
			Иначе
				ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "crm.product.list",  "select[]=ID"	, 							, "filter[ID]");
			КонецЕсли;
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Предложения Тогда                                        		
			
			Фильтр = "filter[iblockId]="+СтруктураНастроек.НастройкиСинхронизацииТоваров.ИдентификаторКаталогаПредложений;	
			ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "catalog.product.offer.list",  "select[]=id&select[]=iblockId", Фильтр	, "filter[id]");
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Счета Тогда
			
			Если СтруктураНастроек.ВерсияСчетов = "v.2" Тогда
				ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "crm.item.list",  "entityTypeId=31&select[]=id",			, "filter[id]");
			Иначе
				ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "crm.invoice.list",  "select[]=ID", 						, "filter[ID]");
			КонецЕсли;
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Проекты Тогда
			ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "crm.deal.list", "select[]=ID", 								, "filter[ID]");
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваКомпаний Тогда
			ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "userfieldconfig.list",  "moduleId=crm&filter[entityId]=CRM_COMPANY&select[]=id",, "filter[id]");
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваКонтактов Тогда
			ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "userfieldconfig.list",  "moduleId=crm&filter[entityId]=CRM_CONTACT&select[]=id",, "filter[id]");
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваСделок Тогда
			ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "userfieldconfig.list",  "moduleId=crm&filter[entityId]=CRM_DEAL&select[]=id", , "filter[id]");
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваСчетов Тогда
			
			Если СтруктураНастроек.ВерсияСчетов = "v.2" Тогда
				ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "userfieldconfig.list", "moduleId=crm&filter[entityId]=CRM_SMART_INVOICE&select[]=id",, "filter[id]");
			Иначе
				ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "userfieldconfig.list", "moduleId=crm&filter[entityId]=CRM_INVOICE&select[]=id",, "filter[id]");
			КонецЕсли;
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Заказы Тогда
			ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "sale.order.list",  "select[]=id"	, "filter[>id]=0"			, "filter[id]");
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваЗаказов Тогда
			ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, "sale.property.list", "select[]=id"	, "filter[>id]=0"			, "filter[id]");
		КонецЕсли;                                                                                                                                    
		
		СтруктураНастроек.Логирование.Измерение4 = "";
		СтруктураНастроек.Логирование.Измерение3 = "";
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьВсеДанныеСПортала(СтруктураНастроек, Метод, Фильтр = "" ,ОбязательныйОтбор = "", ОтборПоПараметру = "")
		
		МетодПолностью 			= "/rest/" + Метод;
		ПараметрыHTTPЗапроса 	= ?(ЗначениеЗаполнено(Фильтр), "&" + Фильтр, "" ) + ?(ЗначениеЗаполнено(ОбязательныйОтбор), "&" + ОбязательныйОтбор, "" );
		
		СтруктураОтвета 	 		= Неопределено;
		КоличествоВыполнений 		= 0;
		СтруктураНастроек.Логирование.Измерение6 	= "0";
		
		Пока СтруктураОтвета = Неопределено И (КоличествоВыполнений < СтруктураНастроек.КоличествоПовторенийПриОшибках ИЛИ КоличествоВыполнений = 0) Цикл
			
			Если КоличествоВыполнений > 0 Тогда
				СтруктураНастроек.Логирование.Измерение5 = "Повторная загрузка данных с портала с типом: " + Строка(СтруктураНастроек.Операция);
			Иначе
				СтруктураНастроек.Логирование.Измерение5 = "Загрузка данных с портала с типом: " + Строка(СтруктураНастроек.Операция);
			КонецЕсли;
			
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало загрузки данных с портала с типом: " + Строка(СтруктураНастроек.Операция));
			
			СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПортал(СтруктураНастроек, МетодПолностью, ПараметрыHTTPЗапроса); 
			
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Завершение загрузки данных с портала с типом: " + Строка(СтруктураНастроек.Операция));
			
			КоличествоВыполнений = КоличествоВыполнений + 1;
			
		КонецЦикла;
		
		Если СтруктураОтвета = Неопределено Тогда
			СтруктураНастроек.ВыполненоБезОшибок = Ложь;
			Возврат;
		КонецЕсли;
		
		СтруктураНастроек.Логирование.Измерение5 = "Обработка данных с типом: " + Строка(СтруктураНастроек.Операция) + " в 1С";
 
		
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало обработки данных в 1С, пришедших  с портала с типом: " + Строка(СтруктураНастроек.Операция));
		ОбработатьДанныеСПортала(СтруктураНастроек, СтруктураОтвета);
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Завершена обработка данных в 1С, пришедших  с портала с типом: " + Строка(СтруктураНастроек.Операция));
		
		Следующие = СтруктураОтвета.Получить("next");
		
		Пока ЗначениеЗаполнено(Следующие) Цикл
			
			Следующие = Формат(Следующие, "ЧГ=0");
			
			СтруктураНастроек.Логирование.Измерение6 = Строка(Следующие);
			
			КоличествоВыполнений 	= 0;
			СтруктураОтвета 	 	= Неопределено;

			ТелоHTTPЗапроса = ПараметрыHTTPЗапроса + "&start="+Следующие;	
			
			Пока СтруктураОтвета = Неопределено И КоличествоВыполнений < СтруктураНастроек.КоличествоПовторенийПриОшибках Цикл
				
				Если КоличествоВыполнений > 0 Тогда
					СтруктураНастроек.Логирование.Измерение5 = "Повторная загрузка данных с портала с типом: " + Строка(СтруктураНастроек.Операция);
				Иначе
					СтруктураНастроек.Логирование.Измерение5 = "Загрузка данных с портала с типом: " + Строка(СтруктураНастроек.Операция);
				КонецЕсли;
				
				Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало загрузки данных с портала с типом: " + Строка(СтруктураНастроек.Операция));
				
				СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПортал(СтруктураНастроек, МетодПолностью, ТелоHTTPЗапроса); 
				
				Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Завершение загрузки данных с портала с типом: " + Строка(СтруктураНастроек.Операция));
				
				КоличествоВыполнений = КоличествоВыполнений + 1;
				
			КонецЦикла;
			
			Если СтруктураОтвета = Неопределено Тогда
				СтруктураНастроек.ВыполненоБезОшибок = Ложь;
				Возврат;
			КонецЕсли;
			
			СтруктураНастроек.Логирование.Измерение5 = "Обработка данных с типом: " + Строка(СтруктураНастроек.Операция) + " в 1С";
			
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало обработки данных в 1С, пришедших  с портала с типом: " + Строка(СтруктураНастроек.Операция));
			ОбработатьДанныеСПортала(СтруктураНастроек, СтруктураОтвета);
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Завершена обработка данных в 1С, пришедших  с портала с типом: " + Строка(СтруктураНастроек.Операция));
			
			Следующие = СтруктураОтвета.Получить("next");
			СтруктураОтвета = Неопределено;
		КонецЦикла;
	
	СтруктураНастроек.Логирование.Измерение5 = "";
	СтруктураНастроек.Логирование.Измерение6 = "";
	
КонецПроцедуры

Процедура ИзмененияЗагрузкаДанных(СтруктураНастроек, ЗагружаемыеСущности)
	
	ВидыСобытий = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьВидыСобытийЭлементовБ24();
	
	ТелоHTTPЗапроса = "&"+ СтруктураНастроек.ПараметрКоннектора + "&clear=1";	
	
	ЕстьСобытия = Истина;
	
	Пока ЕстьСобытия = Истина Цикл	
		
		СтруктураНастроек.ТаблицаСопоставленияИзменений.Очистить();
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("СвойстваКомпаний"	, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.СвойстваКомпаний));
		СтруктураДанных.Вставить("СвойстваКонтактов", Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.СвойстваКонтактов));
		СтруктураДанных.Вставить("СвойстваСделок"	, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.СвойстваСделок));
		СтруктураДанных.Вставить("СвойстваСчетов"	, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.СвойстваСчетов));
		СтруктураДанных.Вставить("СвойстваСчетов2"	, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.СвойстваСчетов));
		
		СтруктураДанных.Вставить("Компании"			, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.Компании));
		СтруктураДанных.Вставить("Контакты"			, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.Контакты));
		СтруктураДанных.Вставить("Реквизиты"		, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.Реквизиты));
		СтруктураДанных.Вставить("БанковскиеСчета"	, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.БанковскиеСчета));
		
		СтруктураДанных.Вставить("ЕдиницыИзмерения"	, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.ЕдиницыИзмерения));
		СтруктураДанных.Вставить("ЕдиницыИзмерения2", Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.ЕдиницыИзмерения));
		СтруктураДанных.Вставить("СвойстваТоваров"	, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.СвойстваТоваров));
		СтруктураДанных.Вставить("СвойстваТоваров2"	, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.СвойстваТоваров));
		СтруктураДанных.Вставить("СвойстваПредложений", Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.СвойстваПредложений));
		СтруктураДанных.Вставить("ГруппыТоваров"	, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.ГруппыТоваров));
		СтруктураДанных.Вставить("ГруппыТоваров2"	, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.ГруппыТоваров));
		СтруктураДанных.Вставить("Товары"			, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.Товары));
		СтруктураДанных.Вставить("Товары2"			, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.Товары));
		СтруктураДанных.Вставить("Предложения"		, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.Предложения));
		СтруктураДанных.Вставить("Цены"				, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.Цены));
		
		СтруктураДанных.Вставить("Сделки"			, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.Сделки));
		СтруктураДанных.Вставить("Счета"			, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.Счета));
		СтруктураДанных.Вставить("Счета2"			, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.Счета));
		
		СтруктураДанных.Вставить("Заказы"			, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.Заказы));
		
		СтруктураДанных.Вставить("СвойстваЗаказов"	, Новый Структура("Данные, Операция", Новый Массив, СтруктураНастроек.ТипыОперацийСинхронизации.СвойстваЗаказов));
		
		СтруктураНастроек.Логирование.Измерение3 = "Запрос изменений с портала";
		
		мНеиспользуемыеЭлементы = Новый Массив;
		
		ДанныеСПортала = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПортал(СтруктураНастроек, "/rest/event.offline.get", ТелоHTTPЗапроса); 
		
		Если НЕ ЗначениеЗаполнено(ДанныеСПортала) Тогда
			СтруктураНастроек.ВыполненоБезОшибок = Ложь;
			ЕстьСобытия = Ложь;
			Возврат;
		КонецЕсли;
		
		result = ДанныеСПортала.Получить("result");
		
		Если НЕ ЗначениеЗаполнено(result) Тогда
			ЕстьСобытия = Ложь;
			Возврат;
		КонецЕсли;
		
		СтруктураНастроек.ИдПроцессаЗагрузки = Строка(result.Получить("process_id"));
		
		События = result.Получить("events");
		
		Если НЕ ЗначениеЗаполнено(События) Тогда
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Нет изменений на портале");
			ЕстьСобытия = Ложь;
			Возврат;
		КонецЕсли;
		
		Для Каждого ТекСобытие Из События Цикл
			
			НазваниеСобытия 	= ВРег(ТекСобытие.Получить("EVENT_NAME"));
			ИнформацияОСобытии 	= ТекСобытие.Получить("EVENT_DATA");
			ИдЗаписи 			= ТекСобытие.Получить("ID");
			ИдСообщения 		= ТекСобытие.Получить("MESSAGE_ID");
			
			Если НЕ ЗначениеЗаполнено(ИнформацияОСобытии) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПолейСобытия 	= ИнформацияОСобытии.Получить("FIELDS");
			
			Если НЕ ЗначениеЗаполнено(ДанныеПолейСобытия) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ДанныеПолейСобытия.Получить("ENTITY_TYPE_ID") = Неопределено Тогда
				ИдЭлемента = Формат(ДанныеПолейСобытия.Получить("ID"), "ЧГ=0");
			ИначеЕсли ДанныеПолейСобытия.Получить("ENTITY_TYPE_ID") = "REQUISITE" Тогда
				ИдЭлемента = "8_" + Формат(ДанныеПолейСобытия.Получить("ENTITY_ID"), "ЧГ=0");
			ИначеЕсли Формат(ДанныеПолейСобытия.Получить("ENTITY_TYPE_ID"), "ЧГ=0") = "31" Тогда
				ИдЭлемента = Формат(ДанныеПолейСобытия.Получить("ID"), "ЧГ=0");
			Иначе
				Продолжить;
			КонецЕсли;
					
			СтруктураОтборка = Новый Структура;
			СтруктураОтборка.Вставить("ИдЗаписи"	, ИдЗаписи);
			СтруктураОтборка.Вставить("ИдСообщения"	, ИдСообщения);
			СтруктураОтборка.Вставить("Событие"		, НазваниеСобытия);
			СтруктураОтборка.Вставить("ИдЭлемента"	, ИдЭлемента);
			
			СтруктураНастроек.ТаблицаСопоставленияИзменений.Добавить(СтруктураОтборка);
			
#Область ДобавлениеИзмененийПоКомпаниям

			Если ЗагружаемыеСущности.ЗагружатьКомпании Тогда
				
				Если НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеКомпании) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеКомпании) Тогда
					СтруктураДанных.Компании.Данные.Добавить(ИдЭлемента);
				ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеСвойстваКомпаний) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеСвойстваКомпаний) 
					ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеЗначенийСвойствКомпаний) Тогда
					СтруктураДанных.СвойстваКомпаний.Данные.Добавить(ИдЭлемента);
				КонецЕсли;
				
			КонецЕсли;
			
#КонецОбласти			
			
#Область ДобавлениеИзмененийПоКонтактам

			Если ЗагружаемыеСущности.ЗагружатьКонтакты Тогда
				
				Если НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеКонтакта) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеКонтакта) Тогда
					СтруктураДанных.Контакты.Данные.Добавить(ИдЭлемента);
				ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеСвойстваКонтактов) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеСвойстваКонтактов) 
					ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеЗначенийСвойствКонтактов) Тогда
					СтруктураДанных.СвойстваКонтактов.Данные.Добавить(ИдЭлемента);
				КонецЕсли;
				
			КонецЕсли;
			
#КонецОбласти			

#Область ДобавлениеИзмененийПоРеквизитов

			Если ЗагружаемыеСущности.ЗагружатьРеквизиты Тогда
				
				Если НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеРеквизита) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеРеквизита) Тогда
					Если СтруктураДанных.Реквизиты.Данные.Найти(ИдЭлемента) = Неопределено Тогда
						СтруктураДанных.Реквизиты.Данные.Добавить(ИдЭлемента);
					КонецЕсли;
				ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеАдреса) Тогда
					
					Если ДанныеПолейСобытия.Получить("ENTITY_TYPE_ID") = "REQUISITE" Тогда
						Ид = Формат(ДанныеПолейСобытия.Получить("ENTITY_ID"), "ЧГ=0");
						Если СтруктураДанных.Реквизиты.Данные.Найти(Ид) = Неопределено Тогда
							СтруктураДанных.Реквизиты.Данные.Добавить(Ид);
						КонецЕсли;
					Иначе
						мНеиспользуемыеЭлементы.Добавить(Новый Структура("ИдЗаписи, ИдСообщения", ИдЗаписи, ИдСообщения)); 
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
#КонецОбласти			
			

#Область ДобавлениеИзмененийПоБанкСчетам

			Если ЗагружаемыеСущности.ЗагружатьБанкСчета Тогда
				
				Если НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеБанкСчета) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеБанкСчета) Тогда
					СтруктураДанных.БанковскиеСчета.Данные.Добавить(ИдЭлемента);
				КонецЕсли;
				
			КонецЕсли;

#КонецОбласти			
			
#Область ДобавлениеИзмененийПоТоварам
			
			Если ЗагружаемыеСущности.ЗагружатьТовары  Тогда
				
				Если НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеТовара) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеТовара) Тогда
					СтруктураДанных.Товары.Данные.Добавить(ИдЭлемента);
				ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеСвойстваТовара) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеСвойстваТовара) Тогда
					СтруктураДанных.СвойстваТоваров.Данные.Добавить(ИдЭлемента);
				ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеРаздела) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеРаздела) Тогда
					СтруктураДанных.ГруппыТоваров.Данные.Добавить(ИдЭлемента);
				ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеЕдИзм) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеЕдИзм) Тогда
					СтруктураДанных.ЕдиницыИзмерения.Данные.Добавить(ИдЭлемента);
				КонецЕсли;
				
			КонецЕсли;
			
#КонецОбласти			

#Область ДобавлениеИзмененийПоТоварам2
   			
			Если ЗагружаемыеСущности.ЗагружатьТовары2  Тогда
				
				Если НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеТовара2) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеТовара2) Тогда
					СтруктураДанных.Товары2.Данные.Добавить(ИдЭлемента);
				ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеСвойстваТовараПредложения) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеСвойстваТовараПредложения) Тогда
					СтруктураДанных.СвойстваТоваров2.Данные.Добавить(ИдЭлемента);
				//ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеРаздела2) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеРаздела2) Тогда
				//	СтруктураДанных.ГруппыТоваров2.Данные.Добавить(ИдЭлемента);
				ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеЕдИзм2) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеЕдИзм2) Тогда
					СтруктураДанных.ЕдиницыИзмерения2.Данные.Добавить(ИдЭлемента);
				КонецЕсли;
				
			КонецЕсли;    
			
#КонецОбласти			             

#Область ДобавлениеИзмененийПоПредложениям
			Если ЗагружаемыеСущности.ЗагружатьПредложения Тогда
				Если НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеТовара2) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеТовара2) Тогда
					СтруктураДанных.Предложения.Данные.Добавить(ИдЭлемента);   
				ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеСвойстваТовараПредложения) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеСвойстваТовараПредложения) Тогда
					СтруктураДанных.СвойстваПредложений.Данные.Добавить(ИдЭлемента);
				КонецЕсли;
			КонецЕсли;
#КонецОбласти			

#Область ДобавлениеИзмененийПоЦенам

			Если ЗагружаемыеСущности.ЗагружатьПредложения Тогда
				Если НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеЦены) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеЦены) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.УдалениеЦены) Тогда
					СтруктураДанных.Цены.Данные.Добавить(ИдЭлемента);
				КонецЕсли;
			КонецЕсли;
#КонецОбласти			

#Область ДобавлениеИзмененийПоСчетам
			
			Если ЗагружаемыеСущности.ЗагружатьСчета Тогда
				
				Если НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеСчета) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеСчета) 
					ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеСтатусаСчета) Тогда
					СтруктураДанных.Счета.Данные.Добавить(ИдЭлемента);
				ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеСвойстваСчетов) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеСвойстваСчетов) 
					ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеЗначенийСвойствСчетов) Тогда
					СтруктураДанных.СвойстваСчетов.Данные.Добавить(ИдЭлемента);
				КонецЕсли;
				
			КонецЕсли;
			
#КонецОбласти			

#Область ДобавлениеИзмененийПоСчетам2
			
			Если ЗагружаемыеСущности.ЗагружатьСчета2 Тогда
				
				Если НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеСмартПроцесса) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеСмартПроцесса) Тогда
					СтруктураДанных.Счета2.Данные.Добавить(ИдЭлемента);
				ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеСвойстваСмартПроцесса) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеСвойстваСмартПроцесса) 
					ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеЗначенийСвойствСмартПроцесса) Тогда
					СтруктураДанных.СвойстваСчетов2.Данные.Добавить(ИдЭлемента);
				КонецЕсли;
				
			КонецЕсли;
			
#КонецОбласти			
			
#Область ДобавлениеИзмененийПоСделкам

			Если ЗагружаемыеСущности.ЗагружатьСделки Тогда
				
				Если НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеСделки) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеСделки) Тогда
					СтруктураДанных.Сделки.Данные.Добавить(ИдЭлемента);
				ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеСвойстваСделок) ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеСвойстваСделок) 
					ИЛИ НазваниеСобытия = ВРег(ВидыСобытий.ОбновлениеЗначенийСвойствСделок) Тогда
					СтруктураДанных.СвойстваСделок.Данные.Добавить(ИдЭлемента);
				КонецЕсли;
					
			КонецЕсли;
			
#КонецОбласти			
			
#Область ДобавлениеИзмененийПоЗаказам

			Если ЗагружаемыеСущности.ЗагружатьЗаказы Тогда
				
				Если НазваниеСобытия = ВРег(ВидыСобытий.ДобавлениеЗаказа) Тогда
					СтруктураДанных.Заказы.Данные.Добавить(ИдЭлемента);
				КонецЕсли;
				
			КонецЕсли;
			
#КонецОбласти			

#Область УдалениеИдЭлементов
			Если НазваниеСобытия = ВРег(ВидыСобытий.УдалениеКомпании) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Компания, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеКонтакта) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Контакт, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеРеквизита) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Реквизит, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеБанкСчета) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.БанковскийСчетРеквизита, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеТовара) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Товар, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеЕдИзм) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеСвойстваТовара) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеРаздела) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеТовара2) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Товар2, ИдЭлемента); 
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Предложение, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеЕдИзм2) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ЕдиницаИзмерения2, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеСвойстваТовараПредложения) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоТовара2, ИдЭлемента); 
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоПредложения, ИдЭлемента); 
			//ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеРаздела2) Тогда
			//	РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.ГруппаТовара2, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеСчета) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Счет, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеСмартПроцесса) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Счет2, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеСделки) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Проект, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеСвойстваКомпаний) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКомпании, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеСвойстваКонтактов) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКонтакта, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеСвойстваСделок) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСделки, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеСвойстваСчетов) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеСвойстваСмартПроцесса) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета2, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеЗаказа) Тогда
				РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.Заказ, ИдЭлемента); 
			ИначеЕсли НазваниеСобытия = ВРег(ВидыСобытий.УдалениеСвойстваЗаказов) Тогда
				//РегистрыСведений.Б24_К_ИдентификаторыОбъектов.УдалитьОбъектПоИдентификаторуБ24(СтруктураНастроек, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоЗаказа, ИдЭлемента); 
			КонецЕсли;
#КонецОбласти			
			
		КонецЦикла;
		
		Если мНеиспользуемыеЭлементы.Количество() > 0 Тогда
			
			ТелоHTTPЗапросаУдаления = "&process_id=" + СтруктураНастроек.ИдПроцессаЗагрузки;	
			
			Для каждого ТекЭлемент Из мНеиспользуемыеЭлементы Цикл
				
				ТелоHTTPЗапросаУдаления = ТелоHTTPЗапросаУдаления + "&id[]=" + ТекЭлемент.ИдЗаписи;
				
			КонецЦикла;
			
			Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПортал(СтруктураНастроек, "/rest/event.offline.clear", ТелоHTTPЗапросаУдаления); 
			
		КонецЕсли;
		
		Для Каждого ТекСвойство Из СтруктураДанных Цикл
			
			ЗначениеСвойстваСтруктуры = ТекСвойство.Значение;
			
			Если ЗначениеСвойстваСтруктуры.Данные.Количество()> 0 Тогда
				
				СтруктураНастроек.Операция = ЗначениеСвойстваСтруктуры.Операция; 
				СтруктураНастроек.Логирование.Измерение3 = "Загрузка изменений в 1С с типом: " + Строка(СтруктураНастроек.Операция);
				СтруктураНастроек.Логирование.Измерение4 = Строка(СтруктураНастроек.Операция);
				
				Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Начало обработки данных в 1С, пришедших  с портала с типом: " + Строка(СтруктураНастроек.Операция));
				
				ТипыОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации;
				Если СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Реквизиты Тогда
					ОбработатьДанныеСПортала(СтруктураНастроек, ПолучитьСписокЭлементовПоИд(СтруктураНастроек, "crm.requisite.list", ЗначениеСвойстваСтруктуры.Данные,,,"filter[ID]"));   
				ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.БанковскиеСчета Тогда
					ОбработатьДанныеСПортала(СтруктураНастроек, ПолучитьСписокЭлементовПоИд(СтруктураНастроек, "crm.requisite.bankdetail.list", ЗначениеСвойстваСтруктуры.Данные,,,"filter[ID]"));  
				ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.ГруппыТоваров Тогда   
					
					Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда   
						Фильтр = "filter[iblockId]="+СтруктураНастроек.НастройкиСинхронизацииТоваров.ИдентификаторКаталогаТоваров;	
						ОбработатьДанныеСПортала(СтруктураНастроек, ПолучитьСписокЭлементовПоИд(СтруктураНастроек, "catalog.section.list", ЗначениеСвойстваСтруктуры.Данные,,Фильтр , "filter[id]"));  
					Иначе
						ОбработатьДанныеСПортала(СтруктураНастроек, ПолучитьСписокЭлементовПоИд(СтруктураНастроек, "crm.productsection.list", ЗначениеСвойстваСтруктуры.Данные,,,"filter[ID]"));  
					КонецЕсли;
					
				ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.ЕдиницыИзмерения Тогда    
					
					Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда
						ОбработатьДанныеСПортала(СтруктураНастроек, ПолучитьСписокЭлементовПоИд(СтруктураНастроек, "catalog.measure.list", ЗначениеСвойстваСтруктуры.Данные,,,"filter[id]"));  
					Иначе
						ОбработатьДанныеСПортала(СтруктураНастроек, ПолучитьСписокЭлементовПоИд(СтруктураНастроек, "crm.measure.list", ЗначениеСвойстваСтруктуры.Данные,,,"filter[ID]"));  
					КонецЕсли;
					
				ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваТоваров Тогда
					
					Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда   
						Фильтр = "filter[iblockId]="+СтруктураНастроек.НастройкиСинхронизацииТоваров.ИдентификаторКаталогаТоваров;	          
						ОбработатьДанныеСПортала(СтруктураНастроек, ПолучитьСписокЭлементовПоИд(СтруктураНастроек, "catalog.productProperty.list", ЗначениеСвойстваСтруктуры.Данные,, Фильтр, "filter[id]"));  
					Иначе     
						ОбработатьДанныеСПортала(СтруктураНастроек, ПолучитьСписокЭлементовПоИд(СтруктураНастроек, "crm.product.property.list", ЗначениеСвойстваСтруктуры.Данные,,,"filter[ID]"));  
					КонецЕсли;
					
				ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваПредложений Тогда    
					
					Фильтр = "filter[iblockId]="+СтруктураНастроек.НастройкиСинхронизацииТоваров.ИдентификаторКаталогаПредложений;	
					ОбработатьДанныеСПортала(СтруктураНастроек, ПолучитьСписокЭлементовПоИд(СтруктураНастроек, "catalog.productProperty.list", ЗначениеСвойстваСтруктуры.Данные,, Фильтр, "filter[id]"));
					
				ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Товары Тогда
					
					Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда         
						Фильтр = "filter[iblockId]="+СтруктураНастроек.НастройкиСинхронизацииТоваров.ИдентификаторКаталогаТоваров;	
						ОбработатьДанныеСПортала(СтруктураНастроек, ПолучитьСписокЭлементовПоИд(СтруктураНастроек, "catalog.product.list", ЗначениеСвойстваСтруктуры.Данные, "select[]=id&select[]=iblockId", Фильтр, "filter[id]"));  
					Иначе
						ОбработатьДанныеСПортала(СтруктураНастроек, ЗначениеСвойстваСтруктуры.Данные); 
					КонецЕсли; 
					
				ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Предложения Тогда
					Фильтр = "filter[iblockId]="+СтруктураНастроек.НастройкиСинхронизацииТоваров.ИдентификаторКаталогаПредложений;	
					ОбработатьДанныеСПортала(СтруктураНастроек, ПолучитьСписокЭлементовПоИд(СтруктураНастроек, "catalog.product.offer.list", ЗначениеСвойстваСтруктуры.Данные, "select[]=id&select[]=iblockId", Фильтр, "filter[id]"));  
				Иначе
					ОбработатьДанныеСПортала(СтруктураНастроек, ЗначениеСвойстваСтруктуры.Данные); 
				КонецЕсли;
				
				Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.Информация, "Завершена обработка данных в 1С, пришедших  с портала с типом: " + Строка(СтруктураНастроек.Операция));
				
				СтруктураНастроек.Логирование.Измерение4 = "";
				СтруктураНастроек.Логирование.Измерение3 = "";
				
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьДанныеСПортала(СтруктураНастроек, ДанныеПортала)
	
	Если ДанныеПортала = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	ТипыОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации;
	Если СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Заказы Тогда
		ДополнительныйКлюч = "orders";
	ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваЗаказов Тогда
		ДополнительныйКлюч = "properties";
	ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваКомпаний ИЛИ  СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваКонтактов 
		ИЛИ СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваСчетов ИЛИ  СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваСделок Тогда
		ДополнительныйКлюч = "fields";
	ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Счета И СтруктураНастроек.ВерсияСчетов = "v.2" Тогда	
		ДополнительныйКлюч = "items";       
	ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.ЕдиницыИзмерения И СтруктураНастроек.ВерсияТоваров = "v.2" Тогда	
		ДополнительныйКлюч = "measures";  
	ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваТоваров И СтруктураНастроек.ВерсияТоваров = "v.2" Тогда	
		ДополнительныйКлюч = "productProperties"; 
	ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваПредложений И СтруктураНастроек.ВерсияТоваров = "v.2" Тогда	
		ДополнительныйКлюч = "productProperties";
	ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.ГруппыТоваров И СтруктураНастроек.ВерсияТоваров = "v.2" Тогда	
		ДополнительныйКлюч = "sections";    
	ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Товары И СтруктураНастроек.ВерсияТоваров = "v.2" Тогда	
		ДополнительныйКлюч = "products"; 
	ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Предложения Тогда	
		ДополнительныйКлюч = "offers"; 
	Иначе
		ДополнительныйКлюч = Неопределено;
	КонецЕсли;  
	
	мДанных = Новый Массив;
	
	Если ТипЗнч(ДанныеПортала) = Тип("Соответствие") Тогда
		
		result = ДанныеПортала.Получить("result");
		Если result <> Неопределено Тогда
			
			Если ТипЗнч(result)=Тип("Массив") Тогда
				мДанных = result;	
			Иначе
				
				Если ДополнительныйКлюч = Неопределено Тогда
				
					result2 = result.Получить("result");
					Если result2 <> Неопределено Тогда
						
						Для каждого ТекЭлемент Из result2 Цикл
							Для каждого ТекЭлемент2 Из ТекЭлемент Цикл
								мДанных.Добавить(ТекЭлемент2);
							КонецЦикла;
						КонецЦикла;
						
					КонецЕсли;
					
				Иначе                 
					
					result2 = result.Получить(ДополнительныйКлюч);
					Если result2 <> Неопределено Тогда
						
						Для каждого ТекЭлемент Из result2 Цикл
							мДанных.Добавить(ТекЭлемент);
						КонецЦикла;
						
					Иначе
						
						result2 = result.Получить("result");
						Для каждого ТекЭлемент Из result2 Цикл
							
							result3 = ТекЭлемент.Получить(ДополнительныйКлюч);
							Если result3 <> Неопределено Тогда
								Для каждого ТекЭлемент Из result3 Цикл
									мДанных.Добавить(ТекЭлемент);
								КонецЦикла;
							КонецЕсли
							
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;            
		
	Иначе
		Для каждого ТекЭлемент Из ДанныеПортала Цикл
			ВремСоотв = Новый Соответствие;
			ВремСоотв.Вставить("ID", Формат(ТекЭлемент, "ЧГ=0")); 
			мДанных.Добавить(ВремСоотв);   
		КонецЦикла;
	КонецЕсли;
	
	Если мДанных.количество() > 0 Тогда
		
		РезультатОбработки 	= Новый Массив;
		СобытияОперации 	= Новый Массив;
		
		ВидыСобытий = РегистрыСведений.Б24_КС_НастройкиСинхронизации.ПолучитьВидыСобытийЭлементовБ24();
		
		ТипыОперацийСинхронизации = СтруктураНастроек.ТипыОперацийСинхронизации;
		
		Если СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Компании Тогда
			
			ДополнительныеДанные = Новый Структура;
			ДополнительныеДанные.Вставить("ИнформацияОКомпаниях", ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "crm.company.get", мДанных));
			ДополнительныеДанные.Вставить("ИнформацияОРеквизитах", ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "crm.requisite.list", мДанных, "start=-1&filter[ENTITY_TYPE_ID]=4&filter[ENTITY_ID]"));
			
			РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьКомпании(СтруктураНастроек, ДополнительныеДанные);
			
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеКомпании));
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеКомпании));
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Контакты Тогда
			
			ДополнительныеДанные = Новый Структура;
			ДополнительныеДанные.Вставить("ИнформацияОКонтактах", ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "crm.contact.get", мДанных));
			ДополнительныеДанные.Вставить("ИнформацияОРеквизитах", ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "crm.requisite.list", мДанных, "start=-1&filter[ENTITY_TYPE_ID]=3&filter[ENTITY_ID]"));
			
			РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьКонтакты(СтруктураНастроек, ДополнительныеДанные);
			
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеКонтакта));
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеКонтакта));
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Реквизиты Тогда
			
			ДополнительныеДанные = Новый Структура;
			ДополнительныеДанные.Вставить("ИнформацияОРеквизитах"	, мДанных);
			ДополнительныеДанные.Вставить("ИнформацияОАдресах"		, ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "crm.address.list", мДанных, "filter[ENTITY_TYPE_ID]=8&filter[ENTITY_ID]"));
			
			РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьРеквизиты(СтруктураНастроек, ДополнительныеДанные);
			
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеРеквизита));
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеРеквизита));
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеАдреса));
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.БанковскиеСчета Тогда
			
			РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьБанковскиеСчетаКомпанийКонтактов(СтруктураНастроек, мДанных);	
			
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеБанкСчета));
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеБанкСчета));
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.ГруппыТоваров Тогда
			
			Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда     
				РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьРазделыТоваров2(СтруктураНастроек, мДанных);	
				
				//СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеРаздела2));
				//СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеРаздела2));
			Иначе
				РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьРазделыТоваров(СтруктураНастроек, мДанных);	
				
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеРаздела));
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеРаздела));
			КонецЕсли; 
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.ЕдиницыИзмерения Тогда
			
			Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда     
				РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьЕдиницыИзмерения2(СтруктураНастроек, мДанных);	
				
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеЕдИзм2));
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеЕдИзм2));  
			Иначе	
				РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьЕдиницыИзмерения(СтруктураНастроек, мДанных);	
				
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеЕдИзм));
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеЕдИзм));  
			КонецЕсли;
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваТоваров Тогда
			
			Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда     
				РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьСвойстваТоваров2(СтруктураНастроек, мДанных);	
				
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеСвойстваТовараПредложения));
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеСвойстваТовараПредложения));
			Иначе
				РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьСвойстваТоваров(СтруктураНастроек, мДанных);	
				
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеСвойстваТовара));
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеСвойстваТовара));
			КонецЕсли;
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваПредложений Тогда
			
			РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьСвойстваТоваров2(СтруктураНастроек, мДанных);	
				
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеСвойстваТовараПредложения));
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеСвойстваТовараПредложения));
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Товары Тогда
			
			Если СтруктураНастроек.ВерсияТоваров = "v.2" Тогда         
				
				ДополнительныеДанные = Новый Структура;
				ДополнительныеДанные.Вставить("Товары"		, ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "catalog.product.get", мДанных)); 	
				ДополнительныеДанные.Вставить("Предложения"	, Неопределено);
				
				РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьТоварыПредложения(СтруктураНастроек, ДополнительныеДанные, Истина);	
				
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеТовара2));
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеТовара2)); 
				
			Иначе
				ДополнительныеДанные = ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "crm.product.get", мДанных);
				РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьТовары(СтруктураНастроек, ДополнительныеДанные);
				СтруктураНастроек.КартинкиИФайлы.Очистить();     
				
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеТовара));
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеТовара));
			КонецЕсли; 
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Предложения Тогда
			
			ДополнительныеДанные = Новый Структура;
			ДополнительныеДанные.Вставить("Предложения"	, ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "catalog.product.offer.get", мДанных)); 	
			ДополнительныеДанные.Вставить("Товары"		, ПолучитьВладельцевПредложенийЧерезGET(СтруктураНастроек, ДополнительныеДанные.Предложения));
			
			РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьТоварыПредложения(СтруктураНастроек, ДополнительныеДанные, Ложь);	
			
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеТовара2));
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеТовара2));
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Счета Тогда
			
			Если СтруктураНастроек.ВерсияСчетов = "v.2" Тогда

				ИнформацияОСчетах = ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "crm.item.get", мДанных, "entityTypeId=31&id");
				Для каждого ТекЭлемент Из ИнформацияОСчетах Цикл
					
					item = ТекЭлемент.Получить("item");
					Если item <> Неопределено Тогда
						
						ИдЭлемента = Формат(item.Получить("id"), "ЧГ=0");
						
						ТелоЗапросаТЧ = "&filter[%3DownerType]=SI&filter[%3DownerId]="+Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(ИдЭлемента);  
						
						ДанныеЭлементаТЧСмартПроцесса = Б24_К_RestApiВызовСервера.ПолучитьМассивДанныхСПорталаЧерезСписок(СтруктураНастроек, "/rest/crm.item.productrow.list", "id", ТелоЗапросаТЧ, "productRows");
						
						ТекЭлемент.Вставить("productrow", ДанныеЭлементаТЧСмартПроцесса);
						
					КонецЕсли;
					
				КонецЦикла;				
				
				РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьСчета2(СтруктураНастроек, ИнформацияОСчетах);
				
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеСмартПроцесса));
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеСмартПроцесса));
				
			Иначе
				
				ДополнительныеДанные = Новый Структура;
				ДополнительныеДанные.Вставить("ИнформацияОСчетах"			, ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "crm.invoice.get", мДанных));
				ДополнительныеДанные.Вставить("ИнформацияОРеквизитахСчетов"	, ПолучитьПодробныеДанныеРеквизитовСчетовЧерезGET(СтруктураНастроек, "crm.requisite.link.get", "5", мДанных));
				РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьСчета(СтруктураНастроек, ДополнительныеДанные);
				
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеСчета));
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеСчета));
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеСтатусаСчета));
				
			КонецЕсли;
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Проекты Тогда
			
			ДополнительныеДанные = Новый Структура;
			ДополнительныеДанные.Вставить("ИнформацияОСделках"			, ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "crm.deal.get", мДанных));
			ДополнительныеДанные.Вставить("ИнформацияОРеквизитахСделок"	, ПолучитьПодробныеДанныеРеквизитовСделокЧерезGET(СтруктураНастроек, "crm.requisite.link.get", "2", мДанных));
			ДополнительныеДанные.Вставить("ИнформацияОТоварахСделок"	, ПолучитьПодробныеДанныеТоваровСделокЧерезGET(СтруктураНастроек, "crm.deal.productrows.get", мДанных));
			РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьСделки(СтруктураНастроек, ДополнительныеДанные);
			
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеСделки));
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеСделки));
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваКомпаний Тогда
			
			ДополнительныеДанные 	= ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "userfieldconfig.get", мДанных, "moduleId=crm&id");
			РезультатОбработки 	= Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьПользовательскиеПоляОбъектов(СтруктураНастроек, ДополнительныеДанные, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКомпании);
			
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеСвойстваКомпаний));
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеСвойстваКомпаний));
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеЗначенийСвойствКомпаний));
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваКонтактов Тогда
			
			ДополнительныеДанные 	= ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "userfieldconfig.get", мДанных, "moduleId=crm&id");
			РезультатОбработки 	= Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьПользовательскиеПоляОбъектов(СтруктураНастроек, ДополнительныеДанные, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоКонтакта);
			
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеСвойстваКонтактов));
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеСвойстваКонтактов));
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеЗначенийСвойствКонтактов));
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваСделок Тогда
			
			ДополнительныеДанные 	= ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "userfieldconfig.get", мДанных, "moduleId=crm&id");
			РезультатОбработки 	= Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьПользовательскиеПоляОбъектов(СтруктураНастроек, ДополнительныеДанные, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСделки);
			
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеСвойстваСделок));
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеСвойстваСделок));
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеЗначенийСвойствСделок));
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваСчетов Тогда
			
			Если СтруктураНастроек.ВерсияСчетов = "v.2" Тогда
				
				ДополнительныеДанные 	= ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "userfieldconfig.get", мДанных, "moduleId=crm&id");
				РезультатОбработки 	= Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьПользовательскиеПоляОбъектов(СтруктураНастроек, ДополнительныеДанные, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета2);
				
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеСвойстваСмартПроцесса));
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеСвойстваСмартПроцесса));
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеЗначенийСвойствСмартПроцесса));
				
			Иначе
				
				ДополнительныеДанные 	= ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "userfieldconfig.get", мДанных, "moduleId=crm&id");
				РезультатОбработки 	= Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьПользовательскиеПоляОбъектов(СтруктураНастроек, ДополнительныеДанные, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета);
				
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеСвойстваСчетов));
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеСвойстваСчетов));
				СобытияОперации.Добавить(ВРег(ВидыСобытий.ОбновлениеЗначенийСвойствСчетов));
				
			КонецЕсли;	
		
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.СвойстваЗаказов Тогда
			
			// Делаем закладку в архитектуре. В Б24 пока не реализовали функционал
			// ДополнительныеДанные = ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, "userfieldconfig.get", мДанных, "moduleId=crm&id");
			// РезультатОбработки 	= Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьПользовательскиеПоляОбъектов(СтруктураНастроек, ДополнительныеДанные, СтруктураНастроек.ТипыОбъектовОбмена.СвойствоСчета);
			//
			// СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеСвойстваЗаказов));
			
		ИначеЕсли СтруктураНастроек.Операция = ТипыОперацийСинхронизации.Заказы Тогда
			
			ДополнительныеДанные =  ПолучитьПодробныеДанныеЗаказовЧерезGET(СтруктураНастроек, "sale.order.get", мДанных);
			РезультатОбработки = Б24_КС_ЗагрузкаСервер.ЗагрузитьОбновитьЗаказы(СтруктураНастроек, ДополнительныеДанные);
			
			СобытияОперации.Добавить(ВРег(ВидыСобытий.ДобавлениеЗаказа));

		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры   

Функция ПолучитьСписокЭлементовПоИд(СтруктураНастроек, Метод, МассивЭлементов, Фильтр = "" ,ОбязательныйОтбор = "", ОтборПоПараметру = "") 

	ПараметрыHTTPЗапроса 	= ?(ЗначениеЗаполнено(Фильтр), "&" + Фильтр, "" ) + ?(ЗначениеЗаполнено(ОбязательныйОтбор), "&" + ОбязательныйОтбор, "") + ?(ЗначениеЗаполнено(ОтборПоПараметру), "&" + ОтборПоПараметру, "");
	Если Лев(ПараметрыHTTPЗапроса, 1) = "&" Тогда
		ПараметрыHTTPЗапроса = "?" + Прав(ПараметрыHTTPЗапроса, СтрДлина(ПараметрыHTTPЗапроса)-1);				
	КонецЕсли;
	
	СформированныеДанные = Новый Массив;
	Для Каждого ТекЭлемент Из МассивЭлементов Цикл
		СформированныеДанные.Добавить("cmd[]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Метод+ПараметрыHTTPЗапроса + "=" + ТекЭлемент + "&start=-1"));
	КонецЦикла;
	
	Если СформированныеДанные.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТелоHTTPЗапроса= "";
	Для каждого ТекЭлемент Из СформированныеДанные Цикл
		ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + ТекЭлемент;	
	КонецЦикла;
	
	Возврат Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);
	
КонецФункции

Функция ПолучитьПодробныеДанныеЧерезGET(СтруктураНастроек, Метод, мДанных, НазваниеПараметра= "id") Экспорт
	
	РезультатОбработки = Новый Массив; 
	
	ТелоHTTPЗапроса= "";
	
	Для каждого ТекЭлемент Из мДанных Цикл
		
		ИдЭлемента = Формат(ТекЭлемент.Получить("ID"), "ЧГ=0");
		ИдЭлемента = ?(ЗначениеЗаполнено(ИдЭлемента), ИдЭлемента, Формат(ТекЭлемент.Получить("id"), "ЧГ=0"));
			
		ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + "cmd[]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Метод + "?"+НазваниеПараметра+"=" + ИдЭлемента);
	КонецЦикла;
	
	СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);
	
	Если СтруктураОтвета = Неопределено Тогда
		Возврат РезультатОбработки;
	КонецЕсли;
	
	result = СтруктураОтвета.Получить("result");
	Если result <> Неопределено Тогда
		result2 = result.Получить("result");
		Если result2 <> Неопределено Тогда
			РезультатОбработки = result2;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатОбработки;			
	
КонецФункции

Функция ПолучитьПодробныеДанныеРеквизитовСчетовЧерезGET(СтруктураНастроек, Метод, ТипСущности, мДанных)
	
	РезультатОбработки = Новый Массив; 
	
	ТелоHTTPЗапроса= "";
	
	Для каждого ТекЭлемент Из мДанных Цикл
		ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + "cmd[]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Метод + "?entityId=" + ТекЭлемент.Получить("ID") + "&entityTypeId=" + ТипСущности);
	КонецЦикла;
	
	СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);
	
	Если СтруктураОтвета = Неопределено Тогда
		Возврат РезультатОбработки;
	КонецЕсли;
	
	result = СтруктураОтвета.Получить("result");
	Если result <> Неопределено Тогда
		result2 = result.Получить("result");
		Если result2 <> Неопределено Тогда
			
			Для каждого ТекЭлемент2 Из result2 Цикл
				
				Если ТипЗнч(ТекЭлемент2)= Тип("Соответствие") Тогда
					РезультатОбработки.Добавить(ТекЭлемент2);
				Иначе
					РезультатОбработки.Добавить(ТекЭлемент2.Значение);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатОбработки;			
	
КонецФункции

Функция ПолучитьПодробныеДанныеРеквизитовСделокЧерезGET(СтруктураНастроек, Метод, ТипСущности, мДанных)
	
	РезультатОбработки = Новый Массив; 
	
	ТелоHTTPЗапроса= "";
	
	Для каждого ТекЭлемент Из мДанных Цикл
		ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + "cmd[]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Метод + "?entityId=" + ТекЭлемент.Получить("ID") + "&entityTypeId=" + ТипСущности);
	КонецЦикла;
	
	СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);
	
	Если СтруктураОтвета = Неопределено Тогда
		Возврат РезультатОбработки;
	КонецЕсли;
	
	result = СтруктураОтвета.Получить("result");
	Если result <> Неопределено Тогда
		result2 = result.Получить("result");
		Если result2 <> Неопределено Тогда
			Для каждого ТекЭлемент2 Из result2 Цикл
				
				Если ТипЗнч(ТекЭлемент2)= Тип("Соответствие") Тогда
					РезультатОбработки.Добавить(ТекЭлемент2);
				Иначе
					РезультатОбработки.Добавить(ТекЭлемент2.Значение);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатОбработки;			
	
КонецФункции

Функция ПолучитьПодробныеДанныеТоваровСделокЧерезGET(СтруктураНастроек, Метод, мДанных)
	
	РезультатОбработки = Новый Массив; 
	
	ТелоHTTPЗапроса= "";
	
	Для каждого ТекЭлемент Из мДанных Цикл        
		ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + "cmd[]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Метод + "?ID=" + Формат(ТекЭлемент.Получить("ID"), "ЧГ=0"));
	КонецЦикла;
	
	СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);
	
	Если СтруктураОтвета = Неопределено Тогда
		Возврат РезультатОбработки;
	КонецЕсли;
	
	result = СтруктураОтвета.Получить("result");
	Если result <> Неопределено Тогда
		result2 = result.Получить("result");
		
		Если ТипЗнч(result2) = Тип("Массив") Тогда
			Для каждого ТекЭлемент Из result2 Цикл
				Если ТипЗнч(ТекЭлемент) = Тип("Массив") Тогда
					Для каждого ТекЭлемент2 Из ТекЭлемент Цикл
						РезультатОбработки.Добавить(ТекЭлемент2);
					КонецЦикла;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатОбработки;			
	
КонецФункции

Функция ПолучитьПодробныеДанныеЗаказовЧерезGET(СтруктураНастроек, Метод, мДанных)
	
	РезультатОбработки = Новый Массив; 
	
	ТелоHTTPЗапроса= "";
	
	Для каждого ТекДанные Из мДанных Цикл
		
		Если ТипЗнч(ТекДанные) = Тип("Соответствие") Тогда
			
			ТекЗаказ = ТекДанные;
			
			ИдЭлемента = Формат(ТекЗаказ.Получить("ID"), "ЧГ=0");
			ИдЭлемента = ?(ЗначениеЗаполнено(ИдЭлемента), ИдЭлемента, Формат(ТекЗаказ.Получить("id"), "ЧГ=0"));
					
			ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + "cmd[]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Метод + "?id=" + ИдЭлемента);
			
		Иначе
			
			ДанныеЗаказов = ТекДанные.Значение;
			
			Для каждого ТекЗаказ Из ДанныеЗаказов Цикл
			
				ИдЭлемента = Формат(ТекЗаказ.Получить("ID"), "ЧГ=0");
				ИдЭлемента = ?(ЗначениеЗаполнено(ИдЭлемента), ИдЭлемента, Формат(ТекЗаказ.Получить("id"), "ЧГ=0"));
					
				ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + "cmd[]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер(Метод + "?id=" + ИдЭлемента);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);
	
	Если СтруктураОтвета = Неопределено Тогда
		Возврат РезультатОбработки;
	КонецЕсли;
	
	result = СтруктураОтвета.Получить("result");
	Если result <> Неопределено Тогда
		result2 = result.Получить("result");
		Если result2 <> Неопределено Тогда
			
			Если ТипЗнч(result2) = Тип("Массив") Тогда
				Для каждого ТекЭлемент Из result2 Цикл
					Если ТипЗнч(ТекЭлемент) = Тип("Соответствие") Тогда
						РезультатОбработки.Добавить(ТекЭлемент.Получить("order"));
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатОбработки;			
	
КонецФункции

Функция ПолучитьВладельцевПредложенийЧерезGET(СтруктураНастроек, ДанныеПредложений) Экспорт
	
	РезультатОбработки = Новый Массив; 
	
	ТелоHTTPЗапроса	= "";
	Для каждого ЭлементДанных Из ДанныеПредложений Цикл
		
		Если ТипЗнч(ЭлементДанных) = Тип("КлючИЗначение") Тогда
			offer = ЭлементДанных.Значение.Получить("offer");	
		Иначе
			offer = ЭлементДанных.Получить("offer"); 
		КонецЕсли;
		
		ИдТовара = "";
		parentId = offer.Получить("parentId"); 
		Если parentId <> Неопределено Тогда
			ИдТовара = Формат(parentId.Получить("value"), "ЧГ=0");	
		КонецЕсли;       
		
		Если ЗначениеЗаполнено(ИдТовара) Тогда
			ТелоHTTPЗапроса = ТелоHTTPЗапроса + "&" + "cmd[]=" + Б24_К_RestApiВызовСервера.ЗакодироватьСтрокуСервер("catalog.product.get?id=" + ИдТовара);
		КонецЕсли;	
			
	КонецЦикла;
	
	СтруктураОтвета = Б24_К_RestApiВызовСервера.ОтправкаДанныхНаПорталЧерезBatch(СтруктураНастроек, ТелоHTTPЗапроса);
	
	Если СтруктураОтвета = Неопределено Тогда
		Возврат РезультатОбработки;
	КонецЕсли;
	
	result = СтруктураОтвета.Получить("result");
	Если result <> Неопределено Тогда
		result2 = result.Получить("result");
		Если result2 <> Неопределено Тогда
			РезультатОбработки = result2;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатОбработки;			
	
КонецФункции   

#КонецОбласти


#Область Прочее

Функция ПолучитьДвеСоставныеЧастиИзСтроки(СтрокаЦелая, Разделитель) Экспорт  //стрРазделить работает криво
	
	ПозицияРазделителя = СтрНайти(СтрокаЦелая, Разделитель);
	Если ПозицияРазделителя >0 Тогда
		ПерваяЧасть 	= Лев(СтрокаЦелая, ПозицияРазделителя-1);
		ВтораяЧасть 	= Прав(СтрокаЦелая, СтрДлина(СтрокаЦелая)-ПозицияРазделителя-СтрДлина(Разделитель)+1);
	Иначе
		ПерваяЧасть 	= СтрокаЦелая;
		ВтораяЧасть		= "";
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ПерваяЧасть", ПерваяЧасть);
	Результат.Вставить("ВтораяЧасть", ВтораяЧасть);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПрефиксСвойстваХарактеристики() Экспорт
	Возврат "'Характеристика' ";		
КонецФункции

#КонецОбласти
