Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		Префикс = Проект.Префикс + "-";
		УстановитьНовыйНомер(Префикс); 
	КонецЕсли;
	
	СокращенноеНазвание = омЗаполнениеРеквизиов.ПолучитьСокращенноеНазвание(ЭтотОбъект);
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	Если ДатаВыездаФакт = Дата(1, 1, 1) Тогда
		
		
		МенеджерЗаписей = РегистрыСведений.ДокументыДляВыезда.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.Документы 		= Ссылка; 
		МенеджерЗаписей.ДатаВыезда 		= ДатаВыездаПлан;
		МенеджерЗаписей.ДатаСоздания 	= Дата;
		
		МенеджерЗаписей.Записать();
		
		Для каждого х Из Исполнители Цикл
			
			МенеджерЗаписей = РегистрыСведений.ДокументыДляВыезда.СоздатьМенеджерЗаписи();
			МенеджерЗаписей.Документы 		= Ссылка;
			МенеджерЗаписей.Исполнитель		= х.Исполнитель;
			МенеджерЗаписей.ДатаВыезда 		= ДатаВыездаПлан;
			МенеджерЗаписей.ДатаСоздания 	= Дата;
			
			МенеджерЗаписей.Записать(); 
			
		КонецЦикла;
		
	Иначе
		
		
		НаборЗаписей = РегистрыСведений.ДокументыДляВыезда.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документы.Установить(Ссылка);
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НаборЗаписей = РегистрыСведений.ДокументыДляВыезда.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документы.Установить(Ссылка);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	Если ЗначениеЗаполнено(Основание) Тогда
	
		Если ТипЗнч(Основание) = Тип("ЗадачаСсылка.ПодготовкаПроекта") Тогда
		
			Если НЕ Основание.Выполнена Тогда
			
				ПодготовкаПроекта = Основание.ПолучитьОбъект();
				ПодготовкаПроекта.Выполнена = Истина;
				ПодготовкаПроекта.Записать();
			
			КонецЕсли;	
		
		КонецЕсли;	
	
	КонецЕсли;
КонецПроцедуры
 
