&НаКлиенте
Перем мКомплектыДляАналогичногоДействия, ИзмененыСлужебныеНастройки, мТипыЗадачКонструктора;

&НаСервереБезКонтекста
Функция КонтрольСоответствияКонструкторов(ОбъектТЗ)

	Возврат омКонструктор.ПолучитьДанныеОбъекта(ОбъектТЗ).КонструкторПользователь;		

КонецФункции // КонтрольСоответствияКонструкторов()
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мТипыЗадачКонструктора = омЗадачиПКДПовтор.ТипыЗадачКонструктора();
	
	ИзмененыСлужебныеНастройки = Ложь;
	
	мКомплектыДляАналогичногоДействия = Новый Массив;

	Если ПодчиненыеКомплекты.Количество() > 0 Тогда
		КомплектыДляАналогичногоДействия();	
	КонецЕсли;
	
	Элементы.ГруппаИстория.Видимость = Ложь;
	ВидимостьКнопок();
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда 
		
		ТекущиеСостояние = Перечисления.СостоянияЗадач.ПустаяСсылка();
		
	Иначе
		
		стДанные = РегистрыСведений.ТаймингЗадач.ПолучитьСостояниеЗадачи(Объект.Ссылка);
		ТекущиеСостояние 		= стДанные.Состояние;
		ТекущиеСостояниеСтрокой = стДанные.Представление;
		КрайПКД					= ПолучитьКрайПКД();
		
	КонецЕсли;
	
	Если Объект.Выполнена ИЛИ Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.Отмена Тогда
		
		ТолькоПросмотр = Истина;
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		Элементы.ГруппаКнопкиДизайнера.Видимость 			= Ложь;	
		Элементы.ГруппаФиндиректора.Видимость 				= Ложь;
		Элементы.ГруппаКнопкиМенеджера.Видимость 			= Ложь;	
	
	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.Разработка 
		ИЛИ Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором 
		ИЛИ Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ИзменениеКонструктором Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Истина;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		Элементы.ГруппаКнопкиДизайнера.Видимость 			= Ложь;	
		Элементы.ГруппаКнопкиМенеджера.Видимость 			= Ложь;	
		Элементы.ГруппаФиндиректора.Видимость 				= Ложь;
		
	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Истина;	
		Элементы.ГруппаКнопкиДизайнера.Видимость 			= Ложь;	
		Элементы.ГруппаКнопкиМенеджера.Видимость 			= Ложь;	
		Элементы.ГруппаФиндиректора.Видимость 				= Ложь;
		
	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.КонтрольДизайнера Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		Элементы.ГруппаКнопкиДизайнера.Видимость 			= Истина;	
		Элементы.ГруппаКнопкиМенеджера.Видимость 			= Ложь;	
		Элементы.ГруппаФиндиректора.Видимость 				= Ложь;
		
		Если Объект.СтатусЗадачи = Перечисления.СтатусыЗадач.Согласование Тогда
			
			Элементы.ДоработкаДизайнера.Видимость 			= Ложь;	
			Элементы.КорректировкаДизайнер.Видимость 		= Ложь;	
		
		Иначе
			
			Элементы.РекламацияДизайнер.Видимость 			= Ложь;	
			Элементы.РедакцияДизайнер.Видимость 			= Ложь;	
			Элементы.КонтрольКП.Видимость 					= Ложь;	
		
		КонецЕсли;
	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.Согласование Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		Элементы.ГруппаКнопкиДизайнера.Видимость 			= Ложь;	
		Элементы.ГруппаКнопкиМенеджера.Видимость 			= Истина;
		Элементы.ГруппаФиндиректора.Видимость 				= Ложь;
		
		Если Объект.СтатусЗадачи = Перечисления.СтатусыЗадач.Согласование Тогда
			Элементы.ВозвратСЗапроса.Видимость 		= Ложь;	
		Иначе
		
			Элементы.СогласованоМенеджер.Видимость 	= Ложь;	
			Элементы.ВозвратССогласования.Видимость = Ложь;	
		
		КонецЕсли;
		
	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ОжиданиеФиндиректором Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		Элементы.ГруппаКнопкиДизайнера.Видимость 			= Ложь;	
		Элементы.ГруппаКнопкиМенеджера.Видимость 			= Ложь;
		Элементы.ГруппаФиндиректора.Видимость 				= Истина;
		
	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ОжиданиеМенеджером Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		Элементы.ГруппаКнопкиДизайнера.Видимость 			= Ложь;	
		Элементы.ГруппаКнопкиМенеджера.Видимость 			= Истина;
		Элементы.ГруппаФиндиректора.Видимость 				= Ложь;
		
		Если Объект.СтатусЗадачи = Перечисления.СтатусыЗадач.Согласование Тогда
			Элементы.ВозвратСЗапроса.Видимость 		= Ложь;	
		Иначе
		
			Элементы.СогласованоМенеджер.Видимость 	= Ложь;	
			Элементы.ВозвратССогласования.Видимость = Ложь;	
		
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Объект.ОбъектТЗ) = Тип("СправочникСсылка.Композиции") Тогда
		
		ЗаполнитьПодчиненыеКомплекты();
		Элементы.Композиция.Видимость = Ложь;	
		Элементы.ОбъектТЗ.Заголовок = "Композиция";
		
	Иначе
		
		Элементы.ПодчиненыеКомплекты.Видимость = Ложь;	
		Элементы.ОбъектТЗ.Заголовок = "Комплект";
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Композиция) Тогда      
	
		Элементы.Композиция.Видимость = Ложь;	
	
	КонецЕсли;
	
	Элементы.ГруппаСлужебная.Видимость = РольДоступна("ПолныеПрава");
	Состояние = ТекущиеСостояние;
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ЭтаФорма.Заголовок 	= ДокОбъект.ПолучитьЗаголовок();
	
	
	мТипыЗадачДяКонструктора = омЗадачиПКДПовтор.ТипыЗадачКонструктора();
	Если НЕ мТипыЗадачДяКонструктора.Найти(Объект.ТипЗадачи) = Неопределено Тогда
		
		Элементы.Исполнитель.ТолькоПросмотр = Истина;	
		
	КонецЕсли;
	
	

КонецПроцедуры

#Область Команды

&НаКлиенте
Процедура История(Команда)
	
	История = ДействияНаСервере("История", Новый Массив,Объект.Ссылка, Объект.ТипЗадачи);
	Элементы.ГруппаИстория.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИсторию(Команда)
	Элементы.ГруппаИстория.Видимость = Ложь;
КонецПроцедуры

#Область  КомандыКонструктора

&НаКлиенте
Процедура НачатьВыполнение(Команда)
	
	КонструкторОбъекта = КонтрольСоответствияКонструкторов(Объект.ОбъектТЗ);
	
	Если НЕ КонструкторОбъекта = Объект.Исполнитель Тогда
		
		ПоказатьПредупреждение(, "Конструктор в объекте " + КонструкторОбъекта + " не соответствует исполнителю");
		Возврат;
		
	КонецЕсли;
	
	стДанные = ДействияНаСервере("НачатьВыполнение", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.СтатусЗадачи);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыполнение(Команда)
	
	Если Модифицированность Тогда
		
		ПоказатьПредупреждение(, "Не обходимо сохранить задачу.");
		Возврат;
		
	КонецЕсли;
	
	стДанные = ДействияНаСервере("ЗавершениеРаботы", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Приостановить(Команда)
	
	стДанные = ДействияНаСервере("Приостановить", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель);
	Закрыть();
	
КонецПроцедуры
#КонецОбласти

#Область КомандыВедущегоКонструктороа

&НаКлиенте
Процедура ИзменениеВедущийКонструктор(Команда)
	
	стДанные = ДействияНаСервере("ИзменениеВедущийКонструктор", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоработкаВедущийКонструктор(Команда)
	
	стДанные = ДействияНаСервере("ДоработкаВедущийКонструктор", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольВедущийКонструктор(Команда)
	
	стДанные = ДействияНаСервере("КонтрольВедущийКонструктор", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти


#Область КомандыМенеджер

&НаКлиенте
Процедура ВозвратССогласования(Команда)
	стДанные = ДействияНаСервере("ВозвратССогласования", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СогласованоМенеджер(Команда)
	стДанные = ДействияНаСервере("Согласовано", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВозвратСЗапроса(Команда)
	
	стДанные = ДействияНаСервере("ВозвратСЗапроса", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область КомандыДизайнера

&НаКлиенте
Процедура РекламацияДизайнер(Команда)

	стДанные = ДействияНаСервере("РекламацияДизайнер", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РедакцияДизайнер(Команда)

	стДанные = ДействияНаСервере("РедакцияДизайнер", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ДоработкаДизайнера(Команда)
	
	стДанные = ДействияНаСервере("ДоработкаДизайнера", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаДизайнер(Команда)
	
	стДанные = ДействияНаСервере("КорректировкаДизайнер", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовано(Команда)
	стДанные = ДействияНаСервере("Согласовано", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСоглосование(Команда) 
	
	стПараметры = Новый Структура("Задача, Объект, Исполнитель, ТипДействия, мКомплектыДляАналогичногоДействия"
	, Объект.Ссылка, Объект.ОбъектТЗ, Объект.Исполнитель, ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ВнешнееСогласование"), мКомплектыДляАналогичногоДействия);
	ОткрытьФорму("Задача.Задачи_ПКД.Форма.ФормаДатаКомментарий", стПараметры, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнийЗапрос(Команда)
	
	стПараметры = Новый Структура("Задача, Объект, Исполнитель, ТипДействия, мКомплектыДляАналогичногоДействия", Объект.Ссылка, Объект.ОбъектТЗ, Объект.Исполнитель, ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ВнешнийЗапрос"), мКомплектыДляАналогичногоДействия);
	ОткрытьФорму("Задача.Задачи_ПКД.Форма.ФормаДатаКомментарий", стПараметры, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольКП(Команда)
	
	стДанные = ДействияНаСервере("КонтрольКП", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти 

#Область ФинДиректор

&НаКлиенте
Процедура СогласованоСИзменением(Команда)
	стДанные = ДействияНаСервере("СогласованоСИзменением", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СогласованоБезИзменений(Команда)
	стДанные = ДействияНаСервере("СогласованоБезИзменений", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтменаИзделия(Команда)
	стДанные = ДействияНаСервере("ОтменаИзделия", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
КонецПроцедуры

#КонецОбласти 

#КонецОбласти

&НаКлиенте
Процедура КомплектыДляАналогичногоДействия()

	Если ТипЗнч(Объект.ОбъектТЗ) = Тип("СправочникСсылка.Композиции") Тогда
		КонструкторКомпозиции = омКомпозицииСервер.ПолучитьДанныеКомпозиции(Объект.ОбъектТЗ);	
	Иначе
		Возврат;
	КонецЕсли; 
	
	НЕЗадачаКонструктора = мТипыЗадачКонструктора.Найти(Объект.ТипЗадачи) = Неопределено;
	
	Для каждого СтрокаТаблицы Из ПодчиненыеКомплекты Цикл
		
		Если СтрокаТаблицы.Конструктор = КонструкторКомпозиции ИЛИ НЕЗадачаКонструктора Тогда
			мКомплектыДляАналогичногоДействия.Добавить(СтрокаТаблицы.Комплект);	
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // КомплектыДляАналогичногоДайствия()

&НаСервереБезКонтекста
Функция ДействияНаСервере(Действие, Знач мКомплектыДляАналогичногоДействия, Задача, ТипЗадачи, Исполнитель = Неопределено, Параметр = Неопределено)

	Возврат Задачи.Задачи_ПКД.ДействияНаСервере(Действие, мКомплектыДляАналогичногоДействия, Задача, ТипЗадачи, Исполнитель, Параметр);	

КонецФункции // ДействияНаСервере("НачатьВыполнение", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.СтатусЗадачи)()


Функция ПолучитьКрайПКД()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.КрайПКД КАК КрайПКД
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Объект.ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КрайПКД; 
	КонецЦикла; 
	
	Возврат Дата(1, 1, 1);
	
КонецФункции // ПолучитьКрайПКД()

&НаКлиенте
Процедура ВидимостьКнопок()
	
	Если ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ЗавершенаКонструктором") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Ложь;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ВРаботеКонструктора") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Ложь;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Истина;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Истина;
		//Элементы.КнопкаОтложитьКонструктор.Видимость 				= Истина;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ОжиданиеКонструктором") Тогда
		
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Истина;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ПриостановкаКонструктором") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Истина;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		
	Иначе
		
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		
	КонецЕсли;
	
	Элементы.ИзменениеВедущийКонструктор.Видимость 					= Объект.ДополнительноеСвойство = "Добавление комплекта"; //Был добавлен комплект в композицию
	Элементы.ДоработкаВедущийКонструктор.Видимость                  = НЕ Элементы.ИзменениеВедущийКонструктор.Видимость;
	
КонецПроцедуры // ВидимостьКнопок()

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ИзменениеПКД", Объект.ОбъектТЗ);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменениеПКД" И Открыта() И Параметр = Объект.ОбъектТЗ Тогда
		Закрыть();
	ИначеЕсли ИмяСобытия = "ИзделиеКомплектИзменено" И Параметр = Объект.ОбъектТЗ Тогда
		ТекущаяМодифицированость 	= Модифицированность;
		Объект.Исполнитель 			= ПроверитьКонструктораНаСервере(Объект.Ссылка);
		Модифицированность			= ТекущаяМодифицированость;	
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьКонструктораНаСервере(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Исполнитель КАК Исполнитель
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Исполнитель;
	КонецЦикла;
	

КонецФункции		


&НаКлиенте
Процедура ПодчиненыеКомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодчиненыеКомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодчиненыеКомплектыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	ТД = Элементы.ПодчиненыеКомплекты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ПоказатьЗначение(, ТД.Задача);
	
КонецПроцедуры

Процедура ЗаполнитьПодчиненыеКомплекты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.ТипЗадачи КАК ТипЗадачи,
		|	Задачи_ПКД.Ссылка КАК Задача,
		|	Задачи_ПКД.Исполнитель КАК Исполнитель,
		|	Задачи_ПКД.ОбъектТЗ КАК Комплект,
		|	ТаймингЗадачСрезПоследних.Состояние КАК СостояниеЗадачи,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	Задачи_ПКД.ОбобщеннаяЗадача КАК ОбобщеннаяЗадача
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО Задачи_ПКД.Ссылка = ТаймингЗадачСрезПоследних.Задача
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	Задачи_ПКД.Композиция = &Композиция
		|	И ТИПЗНАЧЕНИЯ(Задачи_ПКД.ОбъектТЗ) = ТИП(Справочник.ИзделияКомплект)";
	
	Запрос.УстановитьПараметр("Композиция", Объект.ОбъектТЗ);
	
	ПодчиненыеКомплекты.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодчиненыеКомплекты(Команда)
	ЗаполнитьПодчиненыеКомплекты();
КонецПроцедуры

&НаКлиенте
Процедура ТипЗадачиПриИзменении(Элемент)
	ИзмененыСлужебныеНастройки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтатусЗадачиПриИзменении(Элемент)
	ИзмененыСлужебныеНастройки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	ИзмененыСлужебныеНастройки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ИзмененыСлужебныеНастройки Тогда
		
		ИзменитьСостоянияНаСервере(Объект.Ссылка, Объект.ОбъектТЗ, Объект.ТипЗадачи, Объект.СтатусЗадачи, Состояние);		
	Иначе
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьСостоянияНаСервере(Задача, ОбъектТЗ, ТипЗадачи, СтатусЗадачи, Состояние)
	
	Исполнитель = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадачСрезПоследних.Исполнитель КАК Исполнитель
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Исполнитель = Выборка.Исполнитель			
	КонецЦикла;
	
	МЗ = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	МЗ.Период =  ТекущаяДата();
	МЗ.Автор = ПараметрыСеанса.ТекущийПользователь;
	МЗ.Задача = Задача;
	МЗ.Исполнитель = Исполнитель;
	МЗ.Состояние = Состояние;
	МЗ.Статус = СтатусЗадачи;
	МЗ.ТипЗадачи = ТипЗадачи;
	
	МЗ.Записать();
	
	
КонецПроцедуры // ИзменитьСостоянияНаСервере()

 &НаСервереБезКонтекста
Процедура СнятьСВыполненияНаСервере(Ссылка)
	Об = Ссылка.ПолучитьОбъект();
	об.Выполнена = Ложь;
	Об.Записать();
КонецПроцедуры

&НаКлиенте
Процедура СнятьСВыполнения(Команда)
	СнятьСВыполненияНаСервере(Объект.Ссылка);
	Закрыть();
КонецПроцедуры
