&НаКлиенте
Перем мКомплектыДляАналогичногоДействия, ИзмененыСлужебныеНастройки, мТипыЗадачКонструктора;
&НаКлиенте
Перем ПутьКФайлуПДМ, СтруктураПроектноеВремяРазработкиВДнях, КомментарийУвеличеияПродолжительности;

&НаСервереБезКонтекста
Функция КонтрольСоответствияКонструкторов(ОбъектТЗ, КонструкторПользователь)

	Возврат омКонструктор.ПолучитьДанныеОбъекта(ОбъектТЗ, КонструкторПользователь).КонструкторПользователь;		

КонецФункции // КонтрольСоответствияКонструкторов()

&НаСервереБезКонтекста
Функция ПолучитьПроектноеВремяРазработки(ОбъектТЗ, Задача)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.НормаВремени_ПКД КАК НормаВремени_ПКД,
		|	ВЫБОР
		|		КОГДА ДатыКомплекта.НормаДоработки_ПКД = 0
		|			ТОГДА 0.5
		|		ИНАЧЕ ДатыКомплекта.НормаДоработки_ПКД
		|	КОНЕЦ КАК НормаДоработки_ПКД,
		|	ЕСТЬNULL(ТаймингЗадачСрезПоследних.ТипЗадачи, ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.ПустаяСсылка)) КАК ТипЗадачи
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|		ПО ДатыКомплекта.Комплект = ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Комплект
		|	И ТаймингЗадачСрезПоследних.Задача = &Задача";
	
	Запрос.УстановитьПараметр("Комплект", ОбъектТЗ);
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором Тогда
		
			Возврат Новый Структура("Тип, Время", "Доработка", Выборка.НормаДоработки_ПКД);	
		
		Иначе
		
			Возврат Новый Структура("Тип, Время", "Разработка", Выборка.НормаВремени_ПКД);	
		
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Новый Структура("Тип, Время", "Неопределено, 0");

КонецФункции // ПолучитьПроектноеВремяРазработки()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КомментарийУвеличеияПродолжительности = "";
	
	Если Параметры.Ключ.Пустая() Тогда
		Элементы.ДекорацияПроектноеВремя.Видимость = Ложь;	
	Иначе
		СтруктураПроектноеВремяРазработкиВДнях = ПолучитьПроектноеВремяРазработки(Объект.ОбъектТЗ, Объект.Ссылка);
		Если СтруктураПроектноеВремяРазработкиВДнях.Тип = "Неопределено" Тогда
			Элементы.ДекорацияПроектноеВремя.Видимость = Ложь;	
		Иначе
			Элементы.ДекорацияПроектноеВремя.Заголовок = СтруктураПроектноеВремяРазработкиВДнях.Тип + " " +
			СтруктураПроектноеВремяРазработкиВДнях.Время + " дней";
			
			Если СтруктураПроектноеВремяРазработкиВДнях.Тип = "Доработка" Тогда
				Элементы.ПланРазработкиВДнях.Заголовок = СтрЗаменить(Элементы.ПланРазработкиВДнях.Заголовок, "разработки", "доработки");
			КонецЕсли;
			
		КонецЕсли;
		
		Заголовок = Объект.Наименование;
	КонецЕсли;
	
	ПутьКФайлуПДМ = омФайлы.ПолучитьПутьКФайлуПДМ(Объект.ОбъектТЗ);
	
	мТипыЗадачКонструктора = омЗадачиПКДПовтор.ТипыЗадачКонструктора();
	
	ИзмененыСлужебныеНастройки = Ложь;
	
	Если ПодчиненыеКомплекты.Количество() > 0 Тогда
		мКомплектыДляАналогичногоДействия = омЗадачиНаКлиенте.КомплектыДляАналогичногоДействия(Объект, мТипыЗадачКонструктора, ПодчиненыеКомплекты);
	Иначе
		мКомплектыДляАналогичногоДействия = Новый Массив;
	КонецЕсли;
	
	Элементы.ГруппаИстория.Видимость = Ложь;
	ВидимостьКнопок();
	
	стДополнительноеТЗ = ПроверитьДополнительноеТЗ(Объект.ОбъектТЗ);
	
	Элементы.ОписаниеДополнительногоТЗ.Заголовок 				= стДополнительноеТЗ.стрДополнениеТЗ;
	Элементы.КнопкаЗавершитьВыполнениеКонструктор.Доступность 	= стДополнительноеТЗ.МожноЗавершать;
	Элементы.ГруппаДополнениеТЗ.Видимость						= НЕ ПустаяСтрока(стДополнительноеТЗ.стрДополнениеТЗ); 
	Элементы.КороткаяСрочнаяЗадача1.Видимость					= Объект.КороткаяСрочнаяЗадача;
	
	Если НЕ 
		(ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ПриостановкаКонструктором")
		ИЛИ ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ОтложенаКонструктором")
		ИЛИ ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ОжиданиеКонструктором")) Тогда
	
		Элементы.ПланРазработкиВДнях.Доступность = Ложь;	
		
	КонецЕсли;

	ПланРазработкиВДнях = ПолучитьПланРазработкиВДнях(Объект.Ссылка); 
	
КонецПроцедуры 

Процедура УстановитьКартинкуПриоритета()

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.Приоритет КАК Приоритет,
		|	ДанныеКомплектаСрезПоследних.Приоритет.СтатусПриоритета.МалаяКартинка КАК МалаяКартинка
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", Объект.ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Элементы.ГруппаПриоритет.Видимость = Ложь;
	Иначе
		
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Приоритет) Тогда
			    Приоритет = Выборка.Приоритет;
				
				Попытка
				
					КартинкаПриоритета = ПоместитьВоВременноеХранилище(Выборка.МалаяКартинка.Получить(), 
												   УникальныйИдентификатор);

				
				Исключение
				
				КонецПопытки;
				
			
			Иначе
				Элементы.ГруппаПриоритет.Видимость = Ложь;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	

КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда 
		
		ТекущиеСостояние = Перечисления.СостоянияЗадач.ПустаяСсылка();
		Элементы.СтадияКомплекта.Видимость = Ложь;
		Элементы.ГруппаПриоритет.Видимость = Ложь;
		
	Иначе
		
		стДанные = РегистрыСведений.ТаймингЗадач.ПолучитьСостояниеЗадачи(Объект.Ссылка);
		ТекущиеСостояние 	= стДанные.Состояние;
		Конструктор 		= стДанные.Конструктор;
		КрайПКД				= ПолучитьКрайПКД();

		Если Объект.Выполнена Тогда
			СтадияКомплекта = "Задача выполнена";
			СостояниеГлобальногоСтатуса = Перечисления.СтатусыЗадач.ПустаяСсылка();
		Иначе 
			СтруктураСтатуса 			= омСтадииКомплекта.ПолучитьСтадиюКомплекта(Объект.ОбъектТЗ);
			СостояниеГлобальногоСтатуса = СтруктураСтатуса.Статус;	
			СтадияКомплекта 			= СтруктураСтатуса.ПолноеНаименование;
		КонецЕсли;
		
		Если СостояниеГлобальногоСтатуса = Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы Тогда
		
			ТолькоПросмотр 											= Истина;
			Элементы.ГруппаКнопкиДизайнера.Доступность 				= Ложь;
			Элементы.ГруппаКнопкиМенеджера.Доступность 				= Ложь;
			Элементы.ГруппаКнопкаКонструктора.Доступность 			= Ложь;
			Элементы.ГруппаКнопкиВедущегоКонструктора.Доступность 	= Ложь;
			Элементы.ГруппаФиндиректора.Доступность 				= Ложь;
			Элементы.ФормаЗаписать.Доступность 						= Ложь;
		
		КонецЕсли;
		
		УстановитьКартинкуПриоритета();   
		
	КонецЕсли;
	
	ТипыЗадачКонструктора = омЗадачиПКДПовтор.ТипыЗадачКонструктора();
	
	Если Объект.Выполнена ИЛИ Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.Отмена Тогда
		
		ТолькоПросмотр 					= Истина;
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		Элементы.ГруппаКнопкиДизайнера.Видимость 			= Ложь;	
		Элементы.ГруппаФиндиректора.Видимость 				= Ложь;
		Элементы.ГруппаКнопкиМенеджера.Видимость 			= Ложь;	
	
	ИначеЕсли НЕ ТипыЗадачКонструктора.Найти(Объект.ТипЗадачи) = Неопределено Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Истина;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		Элементы.ГруппаКнопкиДизайнера.Видимость 			= Ложь;	
		Элементы.ГруппаКнопкиМенеджера.Видимость 			= Ложь;	
		Элементы.ГруппаФиндиректора.Видимость 				= Ложь;
		
	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Истина;	
		Элементы.ГруппаКнопкиДизайнера.Видимость 			= Ложь;	
		Элементы.ГруппаКнопкиМенеджера.Видимость 			= Ложь;	
		Элементы.ГруппаФиндиректора.Видимость 				= Ложь;
		
	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.КонтрольДизайнера Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		Элементы.ГруппаКнопкиДизайнера.Видимость 			= Истина;	
		Элементы.ГруппаКнопкиМенеджера.Видимость 			= Ложь;	
		Элементы.ГруппаФиндиректора.Видимость 				= Ложь;
		
		Если Объект.СтатусЗадачи = Перечисления.СтатусыЗадач.Согласование Тогда
			
			Элементы.ДоработкаДизайнера.Видимость 		= Ложь;	
			Элементы.КорректировкаДизайнер.Видимость 	= Ложь;	
			Элементы.ВозвратССогласования1.Видимость 	= Ложь;	
			Элементы.ВозвратСЗапроса1.Видимость 		= Ложь;	
		
		Иначе
			
			Элементы.РекламацияДизайнер.Видимость 			= Ложь;	
			Элементы.РедакцияДизайнер.Видимость 			= Ложь;	
			Элементы.КонтрольКП.Видимость 					= Ложь;	
		
		КонецЕсли; 
		
		КоличествоЗадачЧекЛиста = Объект.ЧекЛист.Количество();
		Элементы.ГруппаЧекЛист.Видимость 	= КоличествоЗадачЧекЛиста > 0;
		Элементы.СоздатьЧекЛист.Видимость 	= НЕ Элементы.ГруппаЧекЛист.Видимость;

	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.Согласование Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		Элементы.ГруппаКнопкиДизайнера.Видимость 			= Ложь;	
		Элементы.ГруппаКнопкиМенеджера.Видимость 			= Истина;
		Элементы.ГруппаФиндиректора.Видимость 				= Ложь;
		
		Если Объект.СтатусЗадачи = Перечисления.СтатусыЗадач.Согласование Тогда
			Элементы.ВозвратСЗапроса.Видимость 		= Ложь;	
			Элементы.ВозвратСЗапроса1.Видимость 	= Ложь;	
		Иначе
		
			Элементы.СогласованоМенеджер.Видимость 		= Ложь;	
			Элементы.ВозвратССогласования.Видимость 	= Ложь;	
			Элементы.ВозвратССогласования1.Видимость 	= Ложь;	
		
		КонецЕсли;
		
		
	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ОжиданиеФиндиректором Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		Элементы.ГруппаКнопкиДизайнера.Видимость 			= Ложь;	
		Элементы.ГруппаКнопкиМенеджера.Видимость 			= Ложь;
		Элементы.ГруппаФиндиректора.Видимость 				= Истина;
		
	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ОжиданиеМенеджером Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		Элементы.ГруппаКнопкиДизайнера.Видимость 			= Ложь;	
		Элементы.ГруппаКнопкиМенеджера.Видимость 			= Истина;
		Элементы.ГруппаФиндиректора.Видимость 				= Ложь;
		
		Если Объект.СтатусЗадачи = Перечисления.СтатусыЗадач.Согласование Тогда
			Элементы.ВозвратСЗапроса.Видимость 		= Ложь;	
			Элементы.ВозвратСЗапроса1.Видимость 	= Ложь;	
		Иначе
		
			Элементы.СогласованоМенеджер.Видимость 		= Ложь;	
			Элементы.ВозвратССогласования.Видимость 	= Ложь;	
			Элементы.ВозвратССогласования1.Видимость 	= Ложь;	
		
		КонецЕсли;

		Элементы.ГруппаЧекЛист.Видимость 	= Объект.ЧекЛист.Количество() > 0;

	КонецЕсли;
	
	Элементы.ОбновитьИсполнителя.Видимость = Элементы.ГруппаКнопкаКонструктора.Видимость;
	
	Если ТипЗнч(Объект.ОбъектТЗ) = Тип("СправочникСсылка.Композиции") Тогда
		
		ЗаполнитьПодчиненыеКомплекты();
		Элементы.Композиция.Видимость = Ложь;	
		Элементы.ОбъектТЗ.Заголовок = "Композиция";
		
	Иначе
		
		Элементы.ПодчиненыеКомплекты.Видимость = Ложь;	
		Элементы.ОбъектТЗ.Заголовок = "Комплект";
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Композиция) Тогда      
		Элементы.Композиция.Видимость = Ложь;	
	КонецЕсли;
	
	Элементы.ГруппаСлужебная.Видимость = РольДоступна("ПолныеПрава");
	Состояние = ТекущиеСостояние;
	
	мТипыЗадачДяКонструктора = омЗадачиПКДПовтор.ТипыЗадачКонструктора();
	Если НЕ мТипыЗадачДяКонструктора.Найти(Объект.ТипЗадачи) = Неопределено Тогда
		Элементы.Исполнитель.ТолькоПросмотр = Истина;	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьПланРазработкиВДнях(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях КАК ПланРазработкиВДнях
		|ИЗ
		|	РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних(, Задача = &Задача) КАК ПлановоеЗначениеПроектированияСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ПланРазработкиВДнях;
	КонецЦикла;
	
	Возврат 0;

КонецФункции // ПолучитьПланРазработкиВДнях()

&НаСервереБезКонтекста
Функция ПроверитьДополнительноеТЗ(Ссылка)

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА Дополнение_к_ТЗ.ЕстьФайл
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ФайлТЗ,
		|	СУММА(ВЫБОР
		|			КОГДА Дополнение_к_ТЗ.ДатаОзнакомления = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК Ознакомлено,
		|	КОЛИЧЕСТВО(Дополнение_к_ТЗ.Комплект) КАК Комплект
		|ИЗ
		|	РегистрСведений.Дополнение_к_ТЗ КАК Дополнение_к_ТЗ
		|ГДЕ
		|	Дополнение_к_ТЗ.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	стрДополнениеТЗ = "";
	МожноЗавершать 	= Истина;
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Комплект > 0 Тогда
			
			стрДополнениеТЗ = СтрШаблон("Всего изменений %1. Ознакомлено %2. С файлами %3"
			, Выборка.Комплект, Выборка.Ознакомлено, Выборка.ФайлТЗ); 
			
			МожноЗавершать = Выборка.Комплект = Выборка.Ознакомлено;
			
		КонецЕсли;
	КонецЦикла;
	
    Возврат Новый Структура("МожноЗавершать, стрДополнениеТЗ", МожноЗавершать, стрДополнениеТЗ)

КонецФункции

#Область Команды

&НаКлиенте
Процедура История(Команда)
	
	История = ДействияНаСервере("История", Новый Массив,Объект.Ссылка, Объект.ТипЗадачи);
	Элементы.ГруппаИстория.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИсторию(Команда)
	Элементы.ГруппаИстория.Видимость = Ложь;
КонецПроцедуры

#Область  КомандыКонструктора

&НаКлиенте
Процедура НачатьВыполнение(Команда)
	
	Если ПланРазработкиВДнях = 0 Тогда
	
		ПоказатьПредупреждение(, "Не заполнен План разработки в днях");
		Возврат;
	
	КонецЕсли;
	
	ЗаписатьПланРазработкиВДняхНаСервере(Объект.Ссылка, ПланРазработкиВДнях, КомментарийУвеличеияПродолжительности);

	КонструкторОбъекта = КонтрольСоответствияКонструкторов(Объект.ОбъектТЗ, Объект.Исполнитель);
	
	Если НЕ КонструкторОбъекта = Объект.Исполнитель Тогда
		
		ПоказатьПредупреждение(, "Конструктор в объекте " + КонструкторОбъекта + " не соответствует исполнителю");
		Возврат;
		
	КонецЕсли;
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	НуженЗапускСкрипта = НЕ Состояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ПриостановкаКонструктором");
	
	стДанные = ДействияНаСервере("НачатьВыполнение", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.СтатусЗадачи);
	
	Если НуженЗапускСкрипта Тогда
		
		стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Объект.Ссылка, "РаздатьПрава");
		
		Если ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
			Закрыть();
		Иначе
			ПоказатьПредупреждение(,стВозврата.ОписаниеОшибки);
		КонецЕсли;
		
	Иначе
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыполнение(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("ЗавершениеРаботы", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	
	стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Объект.Ссылка, "ЗабратьПрава");
	
	Если НЕ ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
		
		ПоказатьПредупреждение(,стВозврата.ОписаниеОшибки);
		
	КонецЕсли;
	
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Приостановить(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("Приостановить", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СбросКонструктором(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("ИзменениеКонструктора", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель);

	стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Объект.Ссылка, "ЗабратьПрава");
	
	Если НЕ ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
		
		ПоказатьПредупреждение(,стВозврата.ОписаниеОшибки);
		
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область КомандыВедущегоКонструктороа

&НаКлиенте
Процедура ИзменениеВедущийКонструктор(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("ИзменениеВедущийКонструктор", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоработкаВедущийКонструктор(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("ДоработкаВедущийКонструктор", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольВедущийКонструктор(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("КонтрольВедущийКонструктор", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область КомандыМенеджер

&НаКлиенте
Процедура ВозвратССогласования(Команда)
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("ВозвратССогласования", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СогласованоМенеджер(Команда)
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ЗаполнитьДатуСогласованияАрхитектором();
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратСЗапроса(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("ВозвратСЗапроса", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область КомандыДизайнера

&НаКлиенте
Процедура СоздатьЧекЛист(Команда)
	Элементы.ГруппаЧекЛист.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РекламацияДизайнер(Команда)

	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("РекламацияДизайнер", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РедакцияДизайнер(Команда)

	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("РедакцияДизайнер", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоработкаДизайнера(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("ДоработкаДизайнера", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаДизайнер(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("КорректировкаДизайнер", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовано(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ЗаполнитьДатуСогласованияАрхитектором();

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСоглосование(Команда) 
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стПараметры = Новый Структура("Задача, Объект, Исполнитель, ТипДействия, мКомплектыДляАналогичногоДействия"
	, Объект.Ссылка, Объект.ОбъектТЗ, Объект.Исполнитель, ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ВнешнееСогласование"), мКомплектыДляАналогичногоДействия);
	ОткрытьФорму("Задача.Задачи_ПКД.Форма.ФормаДатаКомментарий", стПараметры, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнийЗапрос(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стПараметры = Новый Структура("Задача, Объект, Исполнитель, ТипДействия, мКомплектыДляАналогичногоДействия", Объект.Ссылка, Объект.ОбъектТЗ, Объект.Исполнитель, ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ВнешнийЗапрос"), мКомплектыДляАналогичногоДействия);
	ОткрытьФорму("Задача.Задачи_ПКД.Форма.ФормаДатаКомментарий", стПараметры, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольКП(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("КонтрольКП", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти 

#Область ФинДиректор

&НаКлиенте
Процедура СогласованоСИзменением(Команда)
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("СогласованоСИзменением", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СогласованоБезИзменений(Команда)
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("СогласованоБезИзменений", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтменаИзделия(Команда)
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("ОтменаИзделия", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
	Закрыть();
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ОткрытьФайлПДМ(Команда)
	
	Если ПустаяСтрока(ПутьКФайлуПДМ) Тогда
		ПоказатьПредупреждение(, "Не удалось построить путь к файлу");
	Иначе
		
		Файл = Новый Файл(ПутьКФайлуПДМ);
		
		Если Файл.Существует() Тогда
			ФайловаяСистемаКлиент.ОткрытьПроводник(ПутьКФайлуПДМ);
		Иначе
			ПоказатьПредупреждение(, "Не существует файла " + ПутьКФайлуПДМ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ЗаполнитьДатуСогласованияАрхитектором()

    Описание = Новый ОписаниеОповещения("ПослеВводаДатыСогласованияАрхитектора", ЭтаФорма);
	ПоказатьВводДаты(Описание, ТекущаяДата(), "Дата согласования архитектором", ЧастиДаты.Дата);
	
КонецПроцедуры // 	ЗаполнитьДатуСогласованияАрхитектором()

&НаКлиенте
Процедура ПослеВводаДатыСогласованияАрхитектора(ДатаСогласования, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(ДатаСогласования) Тогда
		
		ЗаписатьДатыСогласованияНаСервере(Объект.ОбъектТЗ, ДатаСогласования);
		
		стДанные = ДействияНаСервере("Согласовано", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.ОбъектТЗ);
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры // ПослеВводаДатыСогласованияАрхитектора()

&НаСервереБезКонтекста
Процедура ЗаписатьДатыСогласованияНаСервере(Комплект, ДатаСогласования)

	РегистрыСведений.ДатыСогласования.ЗаписатьДатуСогласования(Комплект, ДатаСогласования);	

КонецПроцедуры


&НаСервереБезКонтекста
Функция ДействияНаСервере(Действие, Знач мКомплектыДляАналогичногоДействия, Задача, ТипЗадачи, Исполнитель = Неопределено, Параметр = Неопределено)

	Возврат Задачи.Задачи_ПКД.ДействияНаСервере(Действие, мКомплектыДляАналогичногоДействия, Задача, ТипЗадачи, Исполнитель, Параметр);	

КонецФункции // ДействияНаСервере("НачатьВыполнение", мКомплектыДляАналогичногоДействия, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель, Объект.СтатусЗадачи)()

Функция ПолучитьКрайПКД()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.КрайПКД КАК КрайПКД
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Объект.ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КрайПКД; 
	КонецЦикла; 
	
	Возврат Дата(1, 1, 1);
	
КонецФункции // ПолучитьКрайПКД()

&НаКлиенте
Процедура ВидимостьКнопок()
	
	Если ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ЗавершенаКонструктором") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Ложь;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаСбросКонструктором.Видимость 				= Ложь;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ВРаботеКонструктора") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Ложь;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Истина;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Истина;
		Элементы.КнопкаСбросКонструктором.Видимость 				= Истина;
		//Элементы.КнопкаОтложитьКонструктор.Видимость 				= Истина;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ОжиданиеКонструктором") Тогда
		
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Истина;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаСбросКонструктором.Видимость 				= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ПриостановкаКонструктором") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Истина;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		Элементы.КнопкаСбросКонструктором.Видимость 				= Ложь;
		
	Иначе
		
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаСбросКонструктором.Видимость 				= Ложь;
		
	КонецЕсли;
	
	Элементы.ДекорацияДатаОкончанияПроектирования.Видимость = Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость;
	Элементы.ДекорацияДатаОкончанияПроектирования.Видимость = Ложь;
	
	Если Элементы.ДекорацияДатаОкончанияПроектирования.Видимость Тогда
		
		
		
	КонецЕсли; 
	
	Если Элементы.КнопкаПриостановитьКонструктор.Видимость Тогда
	
		 ВозвможностьПеревести = омЗадачиПКДСервер.ВозвможностьПеревестиЗадачуВПаузу(Объект.Исполнитель);
		 
		 Если ВозвможностьПеревести.ЕстьВозможность Тогда
		 
			 Элементы.ДекорацияНетВозможностиПоставитьНаПаузу.Видимость = Ложь;
			 
		 Иначе
			 
			 Элементы.ДекорацияНетВозможностиПоставитьНаПаузу.Видимость 	= Истина;
			 Элементы.ДекорацияНетВозможностиПоставитьНаПаузу.Заголовок 	= ВозвможностьПеревести.Описание;
			 Элементы.КнопкаПриостановитьКонструктор.Доступность 			= Ложь;
		 
		 КонецЕсли;
		 
	 Иначе
		 
		 Элементы.ДекорацияНетВозможностиПоставитьНаПаузу.Видимость = Ложь;
		 
	 КонецЕсли; 

	Если Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость Тогда
		
		 ВозвможностьПеревести = омЗадачиПКДСервер.ВозвможностьПеревестиЗадачуВРаботу(Объект.Исполнитель);
		 
		 Если ВозвможностьПеревести.ЕстьВозможность Тогда
		 
			 Элементы.ДекорацияНетВозможностиЗапустить.Видимость = Ложь;
			 
		 Иначе
			 
			 Элементы.ДекорацияНетВозможностиЗапустить.Видимость 	= Истина;
			 Элементы.ДекорацияНетВозможностиЗапустить.Заголовок 	= ВозвможностьПеревести.Описание;
			 Элементы.КнопкаНачатьВыполнениеКонструктор.Доступность = Ложь;
		 
		 КонецЕсли; 
		 
	 Иначе
		 
		 Элементы.ДекорацияНетВозможностиЗапустить.Видимость = Ложь;
		 
	 КонецЕсли;
	
	Элементы.ИзменениеВедущийКонструктор.Видимость 	= Объект.ДополнительноеСвойство = "Добавление комплекта"; //Был добавлен комплект в композицию
	Элементы.ДоработкаВедущийКонструктор.Видимость	= НЕ Элементы.ИзменениеВедущийКонструктор.Видимость;
	
КонецПроцедуры // ВидимостьКнопок()

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Попытка
		Записать();
	Исключение
		
	КонецПопытки;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменениеПКД" И Открыта() И Параметр = Объект.ОбъектТЗ Тогда
		Закрыть();
	ИначеЕсли ИмяСобытия = "ИзделиеКомплектИзменено" И Параметр = Объект.ОбъектТЗ Тогда
		ТекущаяМодифицированость 	= Модифицированность;
		Объект.Исполнитель 			= ПроверитьКонструктораНаСервере(Объект.Ссылка);
		Модифицированность			= ТекущаяМодифицированость;	
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьКонструктораНаСервере(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Исполнитель КАК Исполнитель
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Исполнитель;
	КонецЦикла;
	

КонецФункции		

&НаКлиенте
Процедура ПодчиненыеКомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодчиненыеКомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодчиненыеКомплектыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если омОбщиеФункции.РольПолныеПраваДоступны() Тогда
		
		ТД = Элементы.ПодчиненыеКомплекты.ТекущиеДанные;
		
		Если ТД = Неопределено Тогда
			Возврат;	
		КонецЕсли;
		
		ПоказатьЗначение(, ТД.Задача);
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ЗаполнитьПодчиненыеКомплекты()
	
	ПодчиненыеКомплекты.Загрузить(омЗадачи.ЗаполнитьПодчиненыеКомплекты(Объект.ОбъектТЗ));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодчиненыеКомплекты(Команда)
	ЗаполнитьПодчиненыеКомплекты();
КонецПроцедуры

&НаКлиенте
Процедура ТипЗадачиПриИзменении(Элемент)
	ИзмененыСлужебныеНастройки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтатусЗадачиПриИзменении(Элемент)
	ИзмененыСлужебныеНастройки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	ИзмененыСлужебныеНастройки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ИзмененыСлужебныеНастройки Тогда
		
		ИзменитьСостоянияНаСервере(Объект.Ссылка, Объект.ОбъектТЗ, Объект.ТипЗадачи, Объект.СтатусЗадачи, Состояние);		
	КонецЕсли;
	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Объект.Ссылка);
	
	Если ПланРазработкиВДнях > 0 Тогда
	
		ЗаписатьПланРазработкиВДняхНаСервере(Объект.Ссылка, ПланРазработкиВДнях, КомментарийУвеличеияПродолжительности);
	
	КонецЕсли;
	
	Оповестить("ИзменениеПКД", Объект.ОбъектТЗ);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьПланРазработкиВДняхНаСервере(Задача, ПланРазработкиВДнях, КомментарийУвеличеияПродолжительности)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних(, Задача = &Задача) КАК ПлановоеЗначениеПроектированияСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МенеджерЗаписи = РегистрыСведений.ПлановоеЗначениеПроектирования.СоздатьМенеджерЗаписи();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);	
	КонецЦикла;
	
	МенеджерЗаписи.Период 				= ТекущаяДата();
	МенеджерЗаписи.Задача 				= Задача;
	МенеджерЗаписи.Автор				= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.ПланРазработкиВДнях 	= ПланРазработкиВДнях;
	МенеджерЗаписи.Комментарий 			= КомментарийУвеличеияПродолжительности;
	
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьСостоянияНаСервере(Задача, ОбъектТЗ, ТипЗадачи, СтатусЗадачи, Состояние)
	
	Исполнитель = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадачСрезПоследних.Исполнитель КАК Исполнитель
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Исполнитель = Выборка.Исполнитель			
	КонецЦикла;
	
	МЗ = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	МЗ.Период =  ТекущаяДата();
	МЗ.Автор = ПараметрыСеанса.ТекущийПользователь;
	МЗ.Задача = Задача;
	МЗ.Исполнитель = Исполнитель;
	МЗ.Состояние = Состояние;
	МЗ.Статус = СтатусЗадачи;
	МЗ.ТипЗадачи = ТипЗадачи;
	
	МЗ.Записать();
	
	
КонецПроцедуры // ИзменитьСостоянияНаСервере()

 &НаСервереБезКонтекста
Процедура СнятьСВыполненияНаСервере(Ссылка, Выполнена = Ложь)
	Об = Ссылка.ПолучитьОбъект();
	об.Выполнена = Выполнена;
	Об.Записать();
КонецПроцедуры

&НаКлиенте
Процедура СнятьСВыполнения(Команда)
	СнятьСВыполненияНаСервере(Объект.Ссылка);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЧекЛистПередНачаломИзменения(Элемент, Отказ)
	ТД = Элементы.ЧекЛист.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если ТД.Выполнение Тогда
	
		Отказ = Истина;
		Возврат;
	
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекЛистПриИзменении(Элемент)
	
	ПустаяДата = Дата(1, 1, 1);
	
	Для каждого х Из Объект.ЧекЛист Цикл
	
		Если х.Выполнение И х.ДатаВыполнения = ПустаяДата Тогда
		
			х.ДатаВыполнения 	= ТекущаяДата();	
			х.АвторВыполнения 	= омСотрудники.ПолучитьТекущегоПользователя();	
		
		КонецЕсли;	
	
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Наименование = Задачи.Задачи_ПКД.ПолучитьЗаголовокЗадачи(ТекущийОбъект.ОбъектТЗ);
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьДополнениеТЗ(Команда)
	
	ОповещениеПослеЗакрытия = Новый ОписаниеОповещения("ПослеПрочтенияДополнения", ЭтаФорма);
	ОткрытьФорму("Задача.Задачи_ПКД.Форма.ФормаДополнетельноеТЗ", Новый Структура("Комплект", Объект.ОбъектТЗ), ЭтаФорма, , , , ОповещениеПослеЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры


&НаКлиенте
Процедура ПослеПрочтенияДополнения(Результат, ДополнительныеПараметры) Экспорт

	стДополнительноеТЗ = ПроверитьДополнительноеТЗ(Объект.ОбъектТЗ);
	
	Элементы.ОписаниеДополнительногоТЗ.Заголовок 				= стДополнительноеТЗ.стрДополнениеТЗ;
	Элементы.КнопкаЗавершитьВыполнениеКонструктор.Доступность 	= стДополнительноеТЗ.МожноЗавершать;
	
КонецПроцедуры // ПослеПрочтенияДополнения()


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура ПланРазработкиВДняхПриИзменении(Элемент)
	Если СтруктураПроектноеВремяРазработкиВДнях.Время > 0 
		И СтруктураПроектноеВремяРазработкиВДнях.Время < ПланРазработкиВДнях
		И ПустаяСтрока(КомментарийУвеличеияПродолжительности) Тогда
		
		Подсказка = "Введите причину увеличения срока";
		Оповещение = Новый ОписаниеОповещения("ПослеВводаКомментарияУвеличенияСрока", ЭтаФорма);
		ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, Истина);
		
	Иначе 
		
		КомментарийУвеличеияПродолжительности = "";	
		
	КонецЕсли;
	
	Элементы.ДекорацияДатаОкончания.Видимость = Истина;
	Элементы.ДекорацияДатаОкончания.Заголовок = "Дата окончания " + Формат(ТекущаяДата() + ПланРазработкиВДнях * 24 * 3600, "ДЛФ=DD");

КонецПроцедуры  

&НаКлиенте
Процедура ПослеВводаКомментарияУвеличенияСрока(Строка, Параметры) Экспорт
	Если НЕ Строка = Неопределено Тогда
		КомментарийУвеличеияПродолжительности = Строка;
    КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ОбновитьИсполнителяНаСервере(ОбъектТЗ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Конструктор
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ДанныеКомплектаСрезПоследних.Конструктор = Пользователи.Сотрудник
		|ГДЕ
		|	ДанныеКомплектаСрезПоследних.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Конструктор;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИсполнителя(Команда)
	Объект.Исполнитель = ОбновитьИсполнителяНаСервере(Объект.ОбъектТЗ);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВыполнение(Команда)
	СнятьСВыполненияНаСервере(Объект.Ссылка, Истина);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ТаймингЗадачи(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


