&НаСервере
Функция ПолучитьРаботыНоменклатуры(мНоменклатура) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураРасценки.Ссылка КАК Номенклатура,
		|	НоменклатураРасценки.Расценка КАК Расценка,
		|	НоменклатураРасценки.ЧеловекоЧасы КАК ЧеловекоЧасы,
		|	НоменклатураРасценки.Расценка.ВидРасценки КАК ВидРасценки,
		|	НоменклатураРасценки.СтатьяЗатрат КАК СтатьяЗатрат,
		|	НоменклатураРасценки.Ссылка.НормаРасхода КАК НормаРасхода,
		|	НоменклатураРасценки.Расценка.ЕдиницыВидРаботы КАК ЕдиницыВидРаботы,
		|	НоменклатураРасценки.Расценка.ЦенаРаботы КАК ЦенаРаботы
		|ИЗ
		|	Справочник.Номенклатура.Расценки КАК НоменклатураРасценки
		|ГДЕ
		|	НоменклатураРасценки.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", мНоменклатура);
	
	Возврат Запрос.Выполнить().Выгрузить();
	

КонецФункции // ПолучитьРаботыНоменклатуры(мНоменклатура)
