
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ОсновнаяОрганизация	Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ОсновнаяОрганизация
		|	И Организации.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ОбъектОрганизация = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектОрганизация.ОсновнаяОрганизация = Ложь;
			ОбъектОрганизация.Записать();
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
