
#Область СтандартизированныеПроцедурыИФункции

Функция СформироватьСтруктуруНастроек(НастройкаПодключения) Экспорт

	СтруктураНастроек = Б24_К_ОбщегоНазначенияВызовСервера.СформироватьСтруктуруНастроек(НастройкаПодключения, Истина);
	
	Если СтруктураНастроек = Неопределено Тогда
		ТипыСообщений = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыСообщений();
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, ТипыСообщений.КритическаяОшибка, "Невозможно получить общие настройки. Продолжение невозможно.");
		Возврат СтруктураНастроек; 
	КонецЕсли;
	
	НастройкиИнтеграцииСервисов = РегистрыСведений.Б24_КБ_НастройкиИнтеграцииСервисов.ПолучитьНастройкиИнтеграцииСервисовПоНастройкеПодключения(НастройкаПодключения);
	СохраненныеНастройкиИнтеграцииСервисов = НастройкиИнтеграцииСервисов.Настройки.Получить();
	
	Если СохраненныеНастройкиИнтеграцииСервисов = Неопределено Тогда
		Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек, СтруктураНастроек.ТипыСообщений.КритическаяОшибка, "Невозможно получить настройки интеграции сервисов. Будут взяты по умолчанию");
		СохраненныеНастройкиИнтеграцииСервисов = РегистрыСведений.Б24_КБ_НастройкиИнтеграцииСервисов.ПолучитьНастройкиИнтеграцииСервисовПоУмолчанию();
	КонецЕсли;
	
	СтруктураНастроек.Вставить("НастройкиИнтеграцииСервисов", СохраненныеНастройкиИнтеграцииСервисов);
	
	СтруктураНастроек.Логирование.Измерение1 = "Подсистема интеграции сервисов";
	
	Возврат СтруктураНастроек;

КонецФункции


Процедура ПереходНаВерсию2() Экспорт
			
	ОбщегоНазначения.СообщитьПользователю("Осуществляется переход подсистемы работы в сервисе модуля интеграции с Битрикс24 на версию 2.0.0.0");
			
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = РегистрыСведений.Б24_КБ_НастройкиИнтеграцииСервисов.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка   
			
			Настройки = Выборка.Настройки.Получить();    
			
			Если Настройки = Неопределено Тогда
				Продолжить;
			КонецЕсли;  
			
			ОбщегоНазначения.СообщитьПользователю("Заполнение по умолчанию настроек подсистемы интеграции сервисов");
			
			ЕстьВстройкиОтчетов 		= Настройки.Свойство("ВстройкиОтчетов"); 
			ЕстьВстройкиСсылочныхДанных = Настройки.Свойство("ВстройкиСсылочныхДанных"); 
			
			Если НЕ ЕстьВстройкиОтчетов Тогда
				Настройки.Вставить("ВстройкиОтчетов", РегистрыСведений.Б24_КБ_НастройкиИнтеграцииСервисов.ЗаполнитьВстройкиПоУмолчанию("Отчет"))	
			КонецЕсли;
			
			Если НЕ ЕстьВстройкиСсылочныхДанных Тогда
				Настройки.Вставить("ВстройкиОтчетов", РегистрыСведений.Б24_КБ_НастройкиИнтеграцииСервисов.ЗаполнитьВстройкиПоУмолчанию("Ссылка"))	
			КонецЕсли;  
			
			ТекЗапись = Выборка.ПолучитьМенеджерЗаписи();
			ТекЗапись.Настройки = Новый ХранилищеЗначения(Настройки);
			ТекЗапись.Записать();   
			
			ОбщегоНазначения.СообщитьПользователю("Требуется перевыгрузить встройки для интеграции сервисов настройки подключения: " + Строка(Выборка.НастройкаПодключения));  
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось конвертировать настройки интеграции сервисов для настройки подключения: " + Строка(Выборка.НастройкаПодключения));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
