
Функция ПолучитьДанныеОбразцовНаОснованииПредварительных(МассивПредварительныхОбразцов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Образец.Ссылка КАК Образец,
		|	Образец.Основание КАК Основание
		|ИЗ
		|	Справочник.Образец КАК Образец
		|ГДЕ
		|	Образец.Основание В(&МассивПредварительныхОбразцов)";
	
	Запрос.УстановитьПараметр("МассивПредварительныхОбразцов", МассивПредварительныхОбразцов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьДанныеОбразцовНаОснованииПредварительных()
 