
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	омКартинкиНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКартинки); 
КонецПроцедуры 


&НаКлиенте
Процедура ВидемостьРецепта()

	Элементы.Рецепт.Видимость 	= НЕ ТочныйРецепт;	
	Элементы.Рецепт1.Видимость 	= ТочныйРецепт;
	
	Если ТочныйРецепт Тогда
		Объект.Рецепт = "";
	Иначе
		Объект.ТочныйРецепт.Очистить();
	КонецЕсли;

КонецПроцедуры // ВидемостьРецепта()


#Область Картинки

&НаКлиенте
Процедура ОбщаяКомандаКартинку(Команда)
	//омКомментарииНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры


#КонецОбласти 

&НаКлиенте
Процедура ТочныйРецептПриИзменении(Элемент)
	ВидемостьРецепта();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидемостьРецепта();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ТочныйРецепт И Объект.ТочныйРецепт.Количество() = 0 Тогда
	
		Отказ = Истина;
		ПоказатьПредупреждение(, "Не заполнена рецептура");
	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ИзделияЗаказчикаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ИзделияЗаказчикаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ИзделияЗаказчикаПередНачаломИзменения(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

