
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	омКартинкиНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКартинки);
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		ЗаполнитьИзделияЗаказчика();
	КонецЕсли;
КонецПроцедуры 

Процедура ЗаполнитьИзделияЗаказчика()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИзделияЗаказчикаОбразцы.Ссылка КАК Ссылка,
		|	ВЫРАЗИТЬ(ИзделияЗаказчикаОбразцы.Ссылка.ПолноеНаименование КАК СТРОКА(100)) КАК ПолноеНаименование
		|ИЗ
		|	Справочник.ИзделияЗаказчика.Образцы КАК ИзделияЗаказчикаОбразцы
		|ГДЕ
		|	ИзделияЗаказчикаОбразцы.Образец = &Образец";
	
	Запрос.УстановитьПараметр("Образец", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ИзделияЗаказчика.Добавить(Выборка.Ссылка, Выборка.ПолноеНаименование);
	КонецЦикла;
	
КонецПроцедуры



&НаКлиенте
Процедура ВидимостьРецепта()

	Элементы.Рецепт.Видимость 	= НЕ ТочныйРецепт;	
	Элементы.Рецепт1.Видимость 	= ТочныйРецепт;
	
	Если ТочныйРецепт Тогда
		Объект.Рецепт = "";
	Иначе
		Объект.ТочныйРецепт.Очистить();
	КонецЕсли;

КонецПроцедуры // ВидимостьРецепта()


#Область Картинки

&НаКлиенте
Процедура ОбщаяКомандаКартинку(Команда)
	//омКомментарииНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры


#КонецОбласти 

&НаКлиенте
Процедура ТочныйРецептПриИзменении(Элемент)
	ВидимостьРецепта();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьРецепта();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ТочныйРецепт И Объект.ТочныйРецепт.Количество() = 0 Тогда
	
		Отказ = Истина;
		ПоказатьПредупреждение(, "Не заполнена рецептура");
	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ИзделияЗаказчикаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ИзделияЗаказчикаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ИзделияЗаказчикаПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Значение);
КонецПроцедуры

