

&НаКлиенте
Процедура ПослеВыбораЗначения(Значение,ДополнительныеПараметры) Экспорт

    Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.текЗначение = Значение Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьЗначениеНаСервере(Значение,ДополнительныеПараметры.Комплект,ДополнительныеПараметры.ИмяПараметра);
	Элементы.Список.Обновить(); 
КонецПроцедуры // ПослеВыбораЗначения()

&НаСервереБезКонтекста
Процедура ИзменитьЗначениеНаСервере(Значение,Комплект,ИмяПараметра)

	об = Комплект.ПолучитьОбъект();
	об[ИмяПараметра] = Значение; 
    об.Записать();
КонецПроцедуры // ИзменитьЗначениеНаСервере()



&НаСервереБезКонтекста
Функция ПолучитьДанныеКомплекта(МонтажныйКомплект)
	
	стВозврата = Новый Структура("КоличествоСотрудников,СрокИсполнения",0,Дата(1,1,1));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственныеКомплекты.КоличествоСотрудников КАК КоличествоСотрудников,
		|	ПроизводственныеКомплекты.СрокИсполнения КАК СрокИсполнения
		|ИЗ
		|	Справочник.ПроизводственныеКомплекты КАК ПроизводственныеКомплекты
		|ГДЕ
		|	ПроизводственныеКомплекты.Ссылка = &МонтажныйКомплект";
	
	Запрос.УстановитьПараметр("МонтажныйКомплект", МонтажныйКомплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата,Выборка);
	КонецЦикла;
	
	Возврат стВозврата;
КонецФункции // ПолучитьДанныеКомплекта()
