Функция ПолучитьСтадиюСогласовано() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.НаименованиеКолонкиДляСтадияСогласовано());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Возврат Выборка.Значение;
		
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка();
	
КонецФункции // ПолучитьСтадиюСогласования()       

Функция ПолучитьСтадиюСогласования() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.НаименованиеКолонкиДляСтадияСогласование());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Возврат Выборка.Значение;
		
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка();
	
КонецФункции // ПолучитьСтадиюСогласования()       

Функция ПолучитьСтадиюТЗ() Экспорт
	
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.НаименованиеКолонкиДляСтадияТЗ());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Возврат Выборка.Значение;
		
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка();
	
КонецФункции // ПолучитьСтадиюСогласования()

Функция ПолучитьСтадиюПодтвержденияТЗ() Экспорт
	
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.НаименованиеКолонкиДляСтадияПодтвержденияТЗ());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Возврат Выборка.Значение;
		
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка();
	
КонецФункции // ПолучитьСтадиюСогласования()

Функция ПолучитьСтадиюОкончанияПроизводства() Экспорт

	УстановитьПривилегированныйРежим(Истина);
		
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.НаименованиеКолонкиОжиданиеПроизводства());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Возврат Выборка.Значение;
		
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка();
	

КонецФункции // ПолучитьСтадиюОкончанияПроизводства()

Функция ПолучитьСтадиюНаСкладе() Экспорт

	УстановитьПривилегированныйРежим(Истина);
		
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.НаименованиеКолонкиХранениеНаСкладе());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Возврат Выборка.Значение;
		
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка();
	

КонецФункции // ПолучитьСтадиюНаСкладе()
