Процедура СоздатьЗадачуНаСозданиеГабаритногоЧеритежа(Проект, ГабаритныйЧертеж, КрайняяДатаИсполнения = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоздатьМодельГабаритногоЧертежа.Ссылка КАК СоздатьМодельГабаритногоЧертежа
		|ИЗ
		|	Задача.СоздатьМодельГабаритногоЧертежа КАК СоздатьМодельГабаритногоЧертежа
		|ГДЕ
		|	СоздатьМодельГабаритногоЧертежа.ГабаритныйЧертеж = &ГабаритныйЧертеж";
	
	Запрос.УстановитьПараметр("ГабаритныйЧертеж", ГабаритныйЧертеж);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Если ЗначениеЗаполнено(Выборка.СоздатьМодельГабаритногоЧертежа) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	Исполнитель = Справочники.НазначениеАвтораДляЗадачи.ПолучитьАвтораДляЗадачи(Проект, Перечисления.ОбъектыЗадач.ПроверятьГабаритныеЧерчежи);
	
	НоваяЗадача 						= Задачи.СоздатьМодельГабаритногоЧертежа.СоздатьЗадачу();
	НоваяЗадача.ГабаритныйЧертеж 		= ГабаритныйЧертеж;
	НоваяЗадача.Дата 					= ТекущаяДата();
	НоваяЗадача.Исполнитель 			= Исполнитель;
	НоваяЗадача.Проект 					= ГабаритныйЧертеж.Проект;
	НоваяЗадача.КрайняяДатаИсполнения 	= КрайняяДатаИсполнения;
	НоваяЗадача.Наименование 			= Строка(ГабаритныйЧертеж) + ".Создание";
	
	НоваяЗадача.Записать();
	
КонецПроцедуры

Функция ПолучитьИсполнителя(ОбъектЗадачи = Неопределено, ТолькоПервый = Истина) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НазначениеАвтораДляЗадачи.Исполнитель КАК Исполнитель,
		|	НазначениеАвтораДляЗадачи.ОбъектЗадачи КАК ОбъектЗадачи
		|ИЗ
		|	Справочник.НазначениеАвтораДляЗадачи КАК НазначениеАвтораДляЗадачи
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НазначениеАвтораДляЗадачи.ОбъектЗадачи = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НазначениеАвтораДляЗадачи.ОбъектЗадачи = &ОбъектЗадачи
		|		КОНЕЦ
		|	И НЕ НазначениеАвтораДляЗадачи.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	НазначениеАвтораДляЗадачи.ОбъектЗадачи,
		|	НазначениеАвтораДляЗадачи.Сортировка";
	
	Запрос.УстановитьПараметр("ОбъектЗадачи", ОбъектЗадачи);
	
	
	Если ТолькоПервый ИЛИ НЕ ОбъектЗадачи = Неопределено Тогда
		              
		мИсполнители = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Исполнитель");
		
		Если ТолькоПервый Тогда
			Если мИсполнители.Количество() = 0 Тогда
			
				Возврат Справочники.Пользователи.ПустаяСсылка();	
			
			Иначе
			
				Возврат мИсполнители[0];	
			
			КонецЕсли;
		
		Иначе
		
			Возврат мИсполнители;	
		
		КонецЕсли;
	
	Иначе 
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		соИсполнители = Новый Соответствие;
		
		текОбъектЗадачи = Неопределено;
		мИсполнители 	= Неопределено;
		
		Пока Выборка.Следующий() Цикл
			
			Если НЕ текОбъектЗадачи = Выборка.ОбъектЗадачи Тогда
				
				Если НЕ текОбъектЗадачи = Неопределено Тогда
					соИсполнители.Вставить(текОбъектЗадачи, мИсполнители);	
				КонецЕсли;	
				
			    мИсполнители = Новый Массив;
			КонецЕсли;
			
			мИсполнители.Добавить(Выборка.Исполнитель);
			
		КонецЦикла;
		
		Если НЕ текОбъектЗадачи = Неопределено Тогда
			соИсполнители.Вставить(текОбъектЗадачи, мИсполнители);	
		КонецЕсли;	
		
		Возврат соИсполнители;
		
	КонецЕсли;
	
КонецФункции // ПолучитьИсполнителя()

Функция ЕстьЗакрытаяЗадачаРКД(ОбъектТЗ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.ОбъектТЗ = &ОбъектТЗ
		|	И Задачи_РКД.Выполнена";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;

	Возврат Задачи.Задачи_РКД.ПустаяСсылка();
	
КонецФункции // ЕстьЗакрытаяЗадачаРКД()

Функция ЗаполнитьПодчиненыеКомплекты(ОбъектТЗ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Задача,
		|	Задачи_ПКД.Исполнитель КАК Исполнитель,
		|	Задачи_ПКД.ОбъектТЗ КАК Комплект,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	Задачи_ПКД.ОбобщеннаяЗадача КАК ОбобщеннаяЗадача
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	Задачи_ПКД.Композиция = &Композиция
		|	И ТИПЗНАЧЕНИЯ(Задачи_ПКД.ОбъектТЗ) = ТИП(Справочник.ИзделияКомплект)";
	
	Запрос.УстановитьПараметр("Композиция", ОбъектТЗ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

  
Функция ПолучитьДатуОкончанияРазработкиЗадачи(Задача) Экспорт
	
	СтруктураВозврата = Новый Структура("ПланРазработкиВДнях, ВремяРазработкиВДнях", 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях КАК ПланРазработкиВДнях
		|ИЗ
		|	РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних(, Задача = &Задача) КАК ПлановоеЗначениеПроектированияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаймингЗадач.Период КАК Период,
		|	ТаймингЗадач.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|ГДЕ
		|	ТаймингЗадач.Задача = &Задача";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Результата = Запрос.ВыполнитьПакет();
	Выборка = Результата[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаРезультат = "Дата окончания план "; 
	КонецЦикла;
	
    Возврат СтрокаРезультат;
КонецФункции // ПолучитьДатуОкончанияРазработкиЗадачи()
