
Функция ПолучитьОтчетПоЧастичнойОтгрузкеHTML(ИзделиеКомплект) Экспорт
	 
	 стрВозврата = омHTML.ПолучитьЗаголовокHTML();
	 
	 стрВозврата = стрВозврата + омHTML.ПолучитьHeadHTML(Строка(ИзделиеКомплект), 1);
	 
	 стрВозврата = стрВозврата + "<table>";
	 стрВозврата = стрВозврата + "<tr><td>Дата</td><td>Отгрузка</td><td>Автор</td></tr>";
	 
	 ШаблонСтроки = "<tr><td>%1</td><td>%2</td><td>%3</td></tr>";
	 
	 Для каждого СтрокаТаблицы Из ПолучитьЧастичныеОтгрузки(ИзделиеКомплект) Цикл
		 стрВозврата = стрВозврата + СтрШаблон(ШаблонСтроки, Формат(СтрокаТаблицы.Дата, "ДЛФ=DD"), СтрокаТаблицы.Отгрузка, СтрокаТаблицы.Автор);	
	 КонецЦикла;
	 
	 стрВозврата = стрВозврата + "</table>";
	 
	 стрВозврата = стрВозврата + омHTML.ПолучитьХвостHTML();
	 
	 Возврат стрВозврата;
 
КонецФункции // ПолучитьОтчетПоЧастичнойОтгрузкеHTNL()

Функция ПолучитьЧастичныеОтгрузки(ИзделиеКомплект)
 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧастичнаяОтгрузкаПредметыОтгрузки.ПредметОтгрузки КАК Отгрузка,
		|	ЧастичнаяОтгрузкаПредметыОтгрузки.Ссылка.Автор КАК Автор,
		|	ЧастичнаяОтгрузкаПредметыОтгрузки.Ссылка.Дата КАК Дата
		|ИЗ
		|	Справочник.ЧастичнаяОтгрузка.ПредметыОтгрузки КАК ЧастичнаяОтгрузкаПредметыОтгрузки
		|ГДЕ
		|	ЧастичнаяОтгрузкаПредметыОтгрузки.Ссылка.ИзделиеКомплект = &ИзделиеКомплект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	ПредметОтгрузки";
	
	Запрос.УстановитьПараметр("ИзделиеКомплект", ИзделиеКомплект);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьЧастичныеОтгрузки()
