Процедура ИзменитьДанныеКомплекта(стПараметры) Экспорт
	
	ТД = ТекущаяДата();
	
	НаборЗаписей = РегистрыСведений.ДанныеКомплекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Комплект.Установить(стПараметры.Комплект);
	НаборЗаписей.Отбор.Период.Установить(ТД);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних";
		
	Запрос.УстановитьПараметр("Комплект", стПараметры.Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
	КонецЦикла;
	
	НужнаЗапись = Ложь;
	
	Если стПараметры.Свойство("Конструктор") Тогда
		Если НЕ НоваяЗапись.Конструктор = стПараметры.Конструктор Тогда
			
			СтруктуруДляИзмененияИсполнителя = омЗадачаОбщаяНаСервере.ПолучитьСтруктуруДляИзмененияИсполнителя(стПараметры.Конструктор, , Истина);
			омЗадачаОбщаяНаСервере.ИзменитьИсполнителяЗадачиОбщей(СтруктуруДляИзмененияИсполнителя, стПараметры.Комплект); 
			
			НужнаЗапись = Истина;
			
		КонецЕсли;
		НоваяЗапись.Конструктор = стПараметры.Конструктор; 
	КонецЕсли;
	
	Если стПараметры.Свойство("Приоритет") Тогда
		Если НЕ НоваяЗапись.Приоритет = стПараметры.Конструктор Тогда

			НоваяЗапись.Приоритет	= стПараметры.Приоритет;
			
			НужнаЗапись = Истина;
			
		КонецЕсли;
	КонецЕсли;
	
	Если стПараметры.Свойство("ТекущаяСтадия") Тогда
		Если НЕ НоваяЗапись.ТекущаяСтадия = стПараметры.ТекущаяСтадия Тогда

			НоваяЗапись.ТекущаяСтадия	= стПараметры.ТекущаяСтадия;
			
			НужнаЗапись = Истина;
			
		КонецЕсли;
	КонецЕсли;
	
	Если стПараметры.Свойство("ВнешняяПродолжительностьПроизводства") Тогда
		Если НЕ НоваяЗапись.ВнешняяПродолжительностьПроизводства = стПараметры.ВнешняяПродолжительностьПроизводства Тогда

			НоваяЗапись.ВнешняяПродолжительностьПроизводства	= стПараметры.ВнешняяПродолжительностьПроизводства;
			
			Если НоваяЗапись.ВнешняяПродолжительностьПроизводства > 0 И НоваяЗапись.ВнешняяДатаНачалоПроизводства > Дата(1, 1, 1) Тогда
				
				НоваяЗапись.ВнешняяДатаОкончаниеПроизводства = КонецНедели(НоваяЗапись.ВнешняяДатаНачалоПроизводства + 7 * 24 * 3600 * НоваяЗапись.ВнешняяПродолжительностьПроизводства);		
			
			КонецЕсли;
			
			НужнаЗапись = Истина;
			
		КонецЕсли;
	КонецЕсли;
	
	Если НужнаЗапись Тогда
		
		НоваяЗапись.Комплект			= стПараметры.Комплект;
		НоваяЗапись.Период				= ТД;
		НоваяЗапись.Автор 				= ПараметрыСеанса.ТекущийПользователь;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
