Процедура ИзменитьДанныеКомплекта(стПараметры) Экспорт
	
	ТД = ТекущаяДата();
	
	НаборЗаписей = РегистрыСведений.ДанныеКомплекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Комплект.Установить(стПараметры.Комплект);
	НаборЗаписей.Отбор.Период.Установить(ТД);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних";
		
	Запрос.УстановитьПараметр("Комплект", стПараметры.Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
	КонецЦикла;
	
	Если стПараметры.Свойство("Конструктор") Тогда
		НоваяЗапись.Конструктор = стПараметры.Конструктор; 
	КонецЕсли;
	
	Если стПараметры.Свойство("Приоритет") Тогда
		НоваяЗапись.Приоритет	= стПараметры.Приоритет;
	КонецЕсли;
	
	Если стПараметры.Свойство("ТекущаяСтадия") Тогда
		НоваяЗапись.ТекущаяСтадия	= стПараметры.ТекущаяСтадия;
	КонецЕсли;
	
	НоваяЗапись.Комплект			= стПараметры.Комплект;
	НоваяЗапись.Период				= ТД;
	НоваяЗапись.Автор 				= ПараметрыСеанса.ТекущийПользователь;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
