Процедура ИзменитьДанныеКомплекта(стПараметры) Экспорт
	
	Если стПараметры.Конструктор = "" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор
			|ИЗ
			|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних";
		
		Запрос.УстановитьПараметр("Комплект", стПараметры.Комплект);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			стПараметры.Конструктор = Выборка.Конструктор;
		КонецЦикла;
		
	КонецЕсли;
	
    НаборЗаписей = РегистрыСведений.ДанныеКомплекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Комплект.Установить(стПараметры.Комплект);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяЗапись, стПараметры);
	
	НоваяЗапись.Период				= ТекущаяДата();
	НоваяЗапись.Автор 				= ПараметрыСеанса.ТекущийПользователь;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
