
Процедура ПередЗаписью(Отказ, Замещение)
	
	КоличествоОбъектов = ЭтотОбъект.Количество();
	
	Если ЭтотОбъект.Количество() = 1 Тогда
	
		мКомплектов = ЭтотОбъект[0].Комплект;	
	
	Иначе
		
		мКомплектов = Новый Массив(ЭтотОбъект.Количество());
		Индекс = 0;
		
		Для каждого ТекущаяЗапись Из ЭтотОбъект Цикл
			
			мКомплектов[Индекс] = ТекущаяЗапись.Комплект; 
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеКомплектаСрезПоследних.Приоритет КАК Приоритет,
	|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
	|	ДанныеКомплектаСрезПоследних.Комплект КАК Комплект
	|ИЗ
	|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект В (&мКомплектов)) КАК ДанныеКомплектаСрезПоследних
	|ГДЕ
	|	НЕ ДанныеКомплектаСрезПоследних.Приоритет = ЗНАЧЕНИЕ(Справочник.Приоритеты.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("мКомплектов", мКомплектов);
	
	тзПриоритеты = Запрос.Выполнить().Выгрузить(); 
	
	Если тзПриоритеты.Количество() > 0 Тогда
	
		КонтрольСнятияПриоритетов(тзПриоритеты, мКомплектов);	
	
	КонецЕсли;
	
КонецПроцедуры


Процедура КонтрольСнятияПриоритетов(тзПриоритеты, мКомплектов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриоритетыСтадииКомплекта.Стадия КАК Стадия,
		|	ПриоритетыСтадииКомплекта.Ссылка КАК Приоритет
		|ИЗ
		|	Справочник.Приоритеты.СтадииКомплекта КАК ПриоритетыСтадииКомплекта
		|ГДЕ
		|	ПриоритетыСтадииКомплекта.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", омТЧ_НаКлиентеСервере.КолонкуВМассив(тзПриоритеты,"Приоритет"));
	
	тзСтадииПриоритетов = Запрос.Выполнить().Выгрузить(); 
	тзСтадииПриоритетов.Индексы.Добавить("Приоритет, Стадия");
	
	стОтбор = Новый Структура("Приоритет, Стадия", );
	
	Для каждого ТекущаяЗапись Из ЭтотОбъект Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекущаяЗапись.Приоритет) Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		стОтбор.Приоритет 	= ТекущаяЗапись.Приоритет;
		стОтбор.Стадия 		= ТекущаяЗапись.ТекущаяСтадия;
		
		НайденыеСтроки = тзСтадииПриоритетов.НайтиСтроки(стОтбор);
		
		ОчиситьСтатус = Истина;
		
		Для каждого текПриоритет Из НайденыеСтроки Цикл
			ОчиситьСтатус = Ложь;	
		КонецЦикла;
		
		Если ОчиситьСтатус Тогда
		
			ТекущаяЗапись.Приоритет = Справочники.Приоритеты.ПустаяСсылка();	
		
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	
КонецПроцедуры

