&НаКлиенте
Процедура ОткрытьПодборПомещения(Объект, ЭтаФорма, СтандартнаяОбработка = Ложь, ДополнительныеПараметры = Неопределено, НеПоказыватьПомещения = Неопределено, МножественныйВыбор = Ложь) Экспорт

	СтандартнаяОбработка = Ложь;
	
	СделкаЗаказчика = Объект.Проект;
	
	Если Не ЗначениеЗаполнено(СделкаЗаказчика) Тогда
		ПоказатьПредупреждение(,"Не заполнена Проект.");	
		Возврат;	
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораПомещения", ЭтаФорма, ДополнительныеПараметры);
	
	стПараметры = Новый Структура("Проект, МножественныйВыбор", СделкаЗаказчика, МножественныйВыбор); 
	
	Если НЕ НеПоказыватьПомещения = Неопределено Тогда
		стПараметры.Вставить("НеПоказыватьПомещения", НеПоказыватьПомещения);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Помещения.ФормаВыбора", стПараметры,ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

КонецПроцедуры // ОткрытьПодборИзделий()

