&НаКлиенте
Перем РабочееВремя;

//ИнформацияОДата структура с полями: КоличестивоРабочихЧасовВДне, ВыходныеДни, РабочееВремя
Функция ЗаполнитьТаблицуВывода(ТаблицаВыводаОбъектаТЗ, ТаблицаТайминга, Отбор, СекундВСутках, Период, ИнформацияОДата)
	
	ДанныеВозврата = Новый Структура("Норма, Факт, План, ОписаниеОбъектаТЗ", 0, 0, 0, "");
	
	ВремяПаузы 							= 0;
	ВремяОжидания 						= 0;
	ВремяОжиданияКонструктором 			= 0;
	ВремяПаузыВЧасах					= 0;
	ВремяОжиданияВЧасах 				= 0;
	ВремяОжиданияКонструкторомВЧасах 	= 0;
	
	ТаблицаВыводаОбъектаТЗ.Очистить(); 
	
	НайденыеСтроки = ТаблицаТайминга.НайтиСтроки(Отбор);
	
	МаксимальныйИндекс = НайденыеСтроки.Количество() - 1;
	
	ОжиданиеРаботы = Истина; 
	
	ПериодРаботы = Новый Структура("ДатаНачала, ДатаОкончания",); 
	
	Смещение = 0;

	Для х = 0 По МаксимальныйИндекс Цикл
		
		СтрокаТайминга = НайденыеСтроки[х - Смещение];
		
		Если СтрокаТайминга.ДатаОкончания < Период.ДатаНачала ИЛИ СтрокаТайминга.ДатаОкончания > Период.ДатаОкончания Тогда
			Продолжить;	
		КонецЕсли;  
		
		НС = ТаблицаВыводаОбъектаТЗ.Добавить();
		НС.ДатаСтрокойН 		= СтрокаТайминга.ДатаСтрокойН;
		НС.ДатаСтрокойК 		= СтрокаТайминга.ДатаСтрокойК;
		НС.ДатаНачала 			= СтрокаТайминга.ДатаНачала;
		НС.Задача 				= СтрокаТайминга.Задача;
		НС.Норма 				= СтрокаТайминга.НормаВремени;
		НС.Стадия 				= СтрокаТайминга.Стадия;
		НС.СтадияНаименование	= СтрокаТайминга.СтадияНаименование;
		НС.ВРаботе 				= СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ВРаботеКонструктора;
		НС.ДругиеРаботы			= Истина;
		НС.СтруктураНорма	= Новый Структура("Период, Задача, НормаВремени", НС.ДатаНачала, СтрокаТайминга.Задача, НС.Норма);
	КонецЦикла;
	
	
КонецФункции

Функция СоздатьТаблицуВывода()

	ОписаниеЧисла5_2 	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеБулево		= Новый ОписаниеТипов("Булево");
	
	ТаблицаВыводаОбъектаТЗ = Новый ТаблицаЗначений;
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Стадия", 				Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("СтадияНаименование", 	Новый ОписаниеТипов("Строка"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДатаНачала", 			Новый ОписаниеТипов("Дата"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДатаСтрокойН",			Новый ОписаниеТипов("Строка"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДатаСтрокойК",			Новый ОписаниеТипов("Строка"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Факт", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ФактЧасы", 			ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("План", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Норма", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("СтруктураНорма",		);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Задача",				);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ВРаботе", 				ОписаниеБулево);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДругиеРаботы",			ОписаниеБулево);

	Возврат ТаблицаВыводаОбъектаТЗ;
	
КонецФункции // СоздатьТаблицуВывода()  ДругиеРаботы

Функция ПолучитьВыходныеДниВПериоде()
	
	ВыходныеДни = Новый Массив;
	
	Отбор = Новый Структура("РабочиеЧасы", 0);
	
	Для каждого х Из омДаты.ПолучитьРабочиеДни(Период.ДатаНачала, Период.ДатаОкончания, Ложь).НайтиСтроки(Отбор) Цикл
		ВыходныеДни.Добавить(х.Дата);
	КонецЦикла;
	
	Возврат ВыходныеДни;
	
КонецФункции // ПолучитьВыходныеДниВПериоде()

#Область Команды
	
&НаКлиенте
Процедура Обновить(Команда)
	СформироватьОтчет(РабочееВремя);
КонецПроцедуры

#КонецОбласти                  
#Область ИсполнениеКоманд
	
Процедура СформироватьОтчет(РабочееВремя)

	ПолеВывода.Очистить();
	
	СекундВСутках = 3600 * 24;
	
	МенеджерОтчета = Отчеты.ОтчетКонструктора;
	
	Макет = Отчеты.ОтчетКонструкторов.ПолучитьМакет("Макет");
	
	ТекущаяОбласть = Макет.ПолучитьОбласть("Шапка");
	ТекущаяОбласть.Параметры.Заполнить(ЭтаФорма);
	ТекущаяОбласть.Параметры.КалендарныхДней = "Календарных дней " + (омДаты.КоличествоРабочихДней(Период.ДатаНачала, Период.ДатаОкончания) + 1);	
	ПолеВывода.Вывести(ТекущаяОбласть);
	ПолеВывода.ФиксацияСверху = ПолеВывода.ВысотаТаблицы;
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;
	
	Конструкторы 		= омТабельНаСервере.ПолучитьПоДолжности(Перечисления.Должности.Конструктор);
	
	РабочееВремя 		= омСотрудники.ПолучитьРабочееВремяПользователи(Конструкторы);
	ТаблицаТайминга 	= МенеджерОтчета.ПолучитьТаймингиЗадачКонструктор(Период, Конструкторы).ТайминЗадач;
	
	ОбъектыТЗКонструктора = омТЧ_НаКлиентеСервере.КолонкуВМассив(ТаблицаТайминга, "ОбъектТЗ");
	
	ТаблицаТайминга.Сортировать("ОбъектТЗНаименование, ДатаНачала");
	РаботаПоТабелю = омТабельНаСервере.ПолучитьКоличествоРабочхДнейПоТабелюПоПользователю(Конструкторы, Период.ДатаНачала, Период.ДатаОкончания);
	
	КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Время);
    ОписаниеВремя = Новый ОписаниеТипов("Дата", , , , ,КвалификаторыДаты);
	
	ТаблицаРабочееВремя = Новый ТаблицаЗначений;
	ТаблицаРабочееВремя.Колонки.Добавить("Пользователь", 				Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаРабочееВремя.Колонки.Добавить("НачалаПерерыва", 				ОписаниеВремя);
	ТаблицаРабочееВремя.Колонки.Добавить("НачалаРабочегоДня", 			ОписаниеВремя);
	ТаблицаРабочееВремя.Колонки.Добавить("ОкончаниеПерерыва", 			ОписаниеВремя);
	ТаблицаРабочееВремя.Колонки.Добавить("ОкончаниеРабочегоДня", 		ОписаниеВремя);
	ТаблицаРабочееВремя.Колонки.Добавить("КоличестивоРабочихЧасовВДне", Новый ОписаниеТипов("Число"));
	
	Для каждого х Из РабочееВремя Цикл
		
		НС = ТаблицаРабочееВремя.Добавить();
		ЗаполнитьЗначенияСвойств(НС, х);
		НС.КоличестивоРабочихЧасовВДне = МенеджерРегистра.КоличествоРабочихЧасовСотрудника(НС)
	
	КонецЦикла;
	
	ВыходныеДни					= ПолучитьВыходныеДниВПериоде();
	ИнформацияОДата = Новый Структура("ВыходныеДни, РабочееВремя", ВыходныеДни);
	
	ТаблицаВыводаОбъектаТЗ = СоздатьТаблицуВывода();
	
	ТекущаяОбласть 		= Макет.ПолучитьОбласть("Строка");
	
	Отбор = Новый Структура("Исполнитель", );
	Для каждого СтрокаТабеля Из РаботаПоТабелю Цикл
		
		ТекущаяОбласть.Параметры.Сотрудник 				= СтрокаТабеля.Сотрудник;
		ТекущаяОбласть.Параметры.СотрудникНаименование 	= СтрокаТабеля.СотрудникНаименование;
		ТекущаяОбласть.Параметры.РабочихДней 			= СтрокаТабеля.КоличествоДней; 
		
		ИнформацияОДата.РабочееВремя 	= ТаблицаРабочееВремя.Найти(СтрокаТабеля.Пользователь, "Пользователь"); 
		Отбор.Исполнитель 				= СтрокаТабеля.Пользователь;
		ДанныеРасчета 					= ПолучитьРасчетСотрудника(СтрокаТабеля, ТаблицаРабочееВремя, ТаблицаТайминга.НайтиСтроки(Отбор), ИнформацияОДата);
		
		ТекущаяОбласть.Параметры.Заполнить(ДанныеРасчета);
		
		ПолеВывода.Вывести(ТекущаяОбласть);
		
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьРасчетСотрудника(СтрокаТабеля, ТаблицаРабочееВремя, НайденыеСтроки, ИнформацияОДата)

	ДанныеРасчета = Новый Структура("Оклад, ФактРД, ВыработкаНорматив, ВыработкаЭффективная, Стоимость, СтоимостьЭффективная",
	0, 0, 0, 0, 0, 0); 
	
	НормаДоработок = 0;
	
	Для каждого х Из НайденыеСтроки Цикл
		
		ДанныеРасчета.ВыработкаНорматив = ДанныеРасчета.ВыработкаНорматив + х.НормаВремени;	
		Если НЕ ИнформацияОДата.РабочееВремя.КоличестивоРабочихЧасовВДне = 0 Тогда
			ДанныеРасчета.ФактРД = ДанныеРасчета.ФактРД + РегистрыСведений.ТаймингЗадач.РабочихЧасовВИнтервале(х ,ИнформацияОДата) / ИнформацияОДата.РабочееВремя.КоличестивоРабочихЧасовВДне;
		КонецЕсли;
		
		Если х.Доработка Тогда
		
			НормаДоработок = НормаДоработок + х.НормаВремени; 	
		
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ДанныеРасчета.ВыработкаНорматив = 0 Тогда
	
		ДанныеРасчета.ВыработкаЭффективная = (ДанныеРасчета.ВыработкаНорматив - НормаДоработок) / ДанныеРасчета.ВыработкаНорматив;	
	
	КонецЕсли;
	
	//Если НЕ СтрокаТабеля.КоличествоДней = 0 Тогда
	//	ДанныеРасчета.ВыработкаНорматив = ДанныеРасчета.ВыработкаНорматив / СтрокаТабеля.КоличествоДней;
	//КонецЕсли;
	//
	Возврат ДанныеРасчета;

КонецФункции // ПолучитьРасчетСотрудника(СтрокаТабеля, ТаблицаРабочееВремя, ТаблицаТайминга)


#КонецОбласти

#Область СобытияФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ГлавныйКонструктор") Тогда
		
		Если Параметры.Свойство("Конструктор") Тогда
			
			Конструктор = Параметры.Конструктор;	
			
		КонецЕсли;
		
	Иначе
		
		Конструктор = ПараметрыСеанса.ТекущийПользователь;	
		
	КонецЕсли;
	
	Период.ДатаОкончания 	= КонецДня(ТекущаяДата());
	Период.ДатаНачала		= НачалоМесяца(ДобавитьМесяц(Период.ДатаОкончания, -1));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыводаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
КонецПроцедуры

#КонецОбласти  

