&НаКлиенте
Перем РабочееВремя;

//ИнформацияОДата структура с полями: КоличестивоРабочихЧасовВДне, ВыходныеДни, РабочееВремя
Функция ЗаполнитьТаблицуВывода(ТаблицаВыводаОбъектаТЗ, ТаблицаТайминга, Отбор, СекундВСутках, Период, ИнформацияОДата)
	
	ДанныеВозврата = Новый Структура("Норма, Факт, План, ОписаниеОбъектаТЗ", 0, 0, 0, "");
	
	ВремяПаузы 							= 0;
	ВремяОжидания 						= 0;
	ВремяОжиданияКонструктором 			= 0;
	ВремяПаузыВЧасах					= 0;
	ВремяОжиданияВЧасах 				= 0;
	ВремяОжиданияКонструкторомВЧасах 	= 0;
	
	ТаблицаВыводаОбъектаТЗ.Очистить(); 
	
	НайденыеСтроки = ТаблицаТайминга.НайтиСтроки(Отбор);
	
	МаксимальныйИндекс = НайденыеСтроки.Количество() - 1;
	
	ОжиданиеРаботы = Истина; 
	
	ПериодРаботы = Новый Структура("ДатаНачала, ДатаОкончания",); 
	
	Смещение = 0;

	Для х = 0 По МаксимальныйИндекс Цикл
		
		СтрокаТайминга = НайденыеСтроки[х - Смещение];
		
		Если СтрокаТайминга.ДатаОкончания < Период.ДатаНачала ИЛИ СтрокаТайминга.ДатаОкончания > Период.ДатаОкончания Тогда
			Продолжить;	
		КонецЕсли;  
		
		НС = ТаблицаВыводаОбъектаТЗ.Добавить();
		НС.ДатаСтрокойН 		= СтрокаТайминга.ДатаСтрокойН;
		НС.ДатаСтрокойК 		= СтрокаТайминга.ДатаСтрокойК;
		НС.ДатаНачала 			= СтрокаТайминга.ДатаНачала;
		НС.Задача 				= СтрокаТайминга.Задача;
		НС.Норма 				= СтрокаТайминга.НормаВремени;
		НС.Стадия 				= СтрокаТайминга.Стадия;
		НС.СтадияНаименование	= СтрокаТайминга.СтадияНаименование;
		НС.ВРаботе 				= СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ВРаботеКонструктора;
		НС.ДругиеРаботы			= Истина;
	КонецЦикла;
	
	
КонецФункции

Функция СоздатьТаблицуВывода()

	ОписаниеЧисла5_2 	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеБулево		= Новый ОписаниеТипов("Булево");
	
	ТаблицаВыводаОбъектаТЗ = Новый ТаблицаЗначений;
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Стадия", 				Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("СтадияНаименование", 	Новый ОписаниеТипов("Строка"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДатаНачала", 			Новый ОписаниеТипов("Дата"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДатаСтрокойН",			Новый ОписаниеТипов("Строка"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДатаСтрокойК",			Новый ОписаниеТипов("Строка"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Факт", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ФактЧасы", 			ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("План", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Норма", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("СтруктураНорма",		);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Задача",				);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ВРаботе", 				ОписаниеБулево);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДругиеРаботы",			ОписаниеБулево);

	Возврат ТаблицаВыводаОбъектаТЗ;
	
КонецФункции // СоздатьТаблицуВывода()  ДругиеРаботы

Функция ПолучитьВыходныеДниВПериоде()
	
	ВыходныеДни = Новый Массив;
	
	Отбор = Новый Структура("РабочиеЧасы", 0);
	
	Для каждого х Из омДаты.ПолучитьРабочиеДни(Период.ДатаНачала, Период.ДатаОкончания, Ложь).НайтиСтроки(Отбор) Цикл
		ВыходныеДни.Добавить(х.Дата);
	КонецЦикла;
	
	Возврат ВыходныеДни;
	
КонецФункции // ПолучитьВыходныеДниВПериоде()

#Область Команды
	
&НаКлиенте
Процедура Обновить(Команда)
	СформироватьОтчет(РабочееВремя);
КонецПроцедуры

#КонецОбласти                  
#Область ИсполнениеКоманд
	
Процедура СформироватьОтчет(РабочееВремя)

	ПолеВывода.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Конструктор) Тогда
		Возврат;
	КонецЕсли;
	
	СекундВСутках = 3600 * 24;
	
	МенеджерОтчета = Отчеты.ОтчетКонструкторов;
	
	Макет = МенеджерОтчета.ПолучитьМакет("Макет");
	
	ТекущаяОбласть = Макет.ПолучитьОбласть("Шапка");
	ТекущаяОбласть.Параметры.Заполнить(ЭтаФорма);
	ПолеВывода.Вывести(ТекущаяОбласть);
	ПолеВывода.ФиксацияСверху = ПолеВывода.ВысотаТаблицы;
	
	МенеджерРегистра = РегистрыСведений.ТаймингЗадач;
	
	ТекущаяОбласть 		= Макет.ПолучитьОбласть("Строка");
	
	ТаблицаТайминга 	= ПолучитьТаймингиЗадачКонструктор(Период,Конструктор).ТайминЗадач;
	
	ОбъектыТЗКонструктора = омТЧ_НаКлиентеСервере.КолонкуВМассив(ТаблицаТайминга, "ОбъектТЗ");
	
	ТаблицаТайминга.Сортировать("ОбъектТЗНаименование, ДатаНачала");
	Отбор = Новый Структура("ОбъектТЗ", );
	
	КоличестивоРабочихЧасовВДне = МенеджерРегистра.КоличествоРабочихЧасовСотрудника(РабочееВремя);
	ВыходныеДни					= ПолучитьВыходныеДниВПериоде();
	ИнформацияОДата = Новый Структура("КоличестивоРабочихЧасовВДне, ВыходныеДни, РабочееВремя", КоличестивоРабочихЧасовВДне, ВыходныеДни, РабочееВремя);
	
	
	ТекущийОбъектТЗ = Неопределено;
	
	НормаИтого = 0;
	
	ТаблицаВыводаОбъектаТЗ = СоздатьТаблицуВывода();
	
	Для каждого СтрокаЗадач Из ТаблицаТайминга Цикл
		
		Если НЕ ТекущийОбъектТЗ = СтрокаЗадач.ОбъектТЗ Тогда
		
			Отбор.ОбъектТЗ = СтрокаЗадач.ОбъектТЗ;
			ЗаполнитьТаблицуВывода(ТаблицаВыводаОбъектаТЗ, ТаблицаТайминга, Отбор, СекундВСутках, Период, ИнформацияОДата);
			
			Если ТаблицаВыводаОбъектаТЗ.Количество() = 0 Тогда
				Продолжить;	
			КонецЕсли;
			
			ТекущийОбъектТЗ = СтрокаЗадач.ОбъектТЗ;	
			
			Для каждого х Из ТаблицаВыводаОбъектаТЗ Цикл
				
					ТекущаяОбласть.Параметры.Заполнить(х);
					ТекущаяОбласть.Параметры.СтадияНаименование = СтрокаЗадач.ОбъектТЗНаименование + Символы.Таб + х.СтадияНаименование;
					ПолеВывода.Вывести(ТекущаяОбласть);
					НормаИтого = НормаИтого + х.Норма;
					Вработе = Истина;
				
			КонецЦикла;
		КонецЕсли;	
		
	КонецЦикла;
	
	ТекущаяОбласть = Макет.ПолучитьОбласть("Итого");
	ТекущаяОбласть.Параметры.Норма = НормаИтого;
	ПолеВывода.Вывести(ТекущаяОбласть); 
	
КонецПроцедуры 

#КонецОбласти

Функция ПолучитьТаймингиЗадачКонструктор(Период, Исполнитель) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадач.Задача КАК Задача
		|ПОМЕСТИТЬ втЗадачи
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|ГДЕ
		|	ТаймингЗадач.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТаймингЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором)
		|	И НЕ ЕСТЬNULL(ТаймингЗадач.Задача.ОбобщеннаяЗадача, ЛОЖЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаймингЗадач.Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаймингЗадач.Период КАК ДатаНачала,
		|	ТаймингЗадач.Задача КАК Задача,
		|	втЗадачи.Задача.Наименование КАК ЗадачаНаименование,
		|	ТаймингЗадач.Автор КАК Автор,
		|	ТаймингЗадач.Исполнитель КАК Исполнитель,
		|	ТаймингЗадач.Состояние КАК Состояние,
		|	ТаймингЗадач.Статус КАК Статус,
		|	ТаймингЗадач.ТипЗадачи КАК ТипЗадачи,
		|	ТаймингЗадач.НормаВремени КАК НормаВремени,
		|	ТаймингЗадач.Задача.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование,
		|	ТаймингЗадач.Задача.ОбъектТЗ КАК ОбъектТЗ,
		|	ТаймингЗадач.Задача.ОбъектТЗ.Проект КАК Проект,
		|	ТаймингЗадач.Исполнитель.Сотрудник КАК Сотрудник,
		|	ТаймингЗадач.Исполнитель.Сотрудник.НачалаРабочегоДня КАК НачалаРабочегоДня,
		|	ТаймингЗадач.Исполнитель.Сотрудник.ОкончаниеРабочегоДня КАК ОкончаниеРабочегоДня,
		|	ЗНАЧЕНИЕ(Справочник.СтадииКомплекта.ПустаяСсылка) КАК Стадия,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(14)) КАК ДатаСтрокойН,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(14)) КАК ДатаСтрокойК,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК СтадияНаименование,
		|	ЛОЖЬ КАК Ожидание,
		|	ЛОЖЬ КАК Доработка,
		|	0 КАК ПлановоеЗначение
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ТаймингЗадач.Задача = втЗадачи.Задача
		|ГДЕ
		|	(ТаймингЗадач.Исполнитель = &Исполнитель
		|			ИЛИ ТаймингЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором))
		|	И НЕ ТаймингЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПриостановкаКонструктором)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектТЗНаименование,
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("Исполнитель", 	Исполнитель);
	Запрос.УстановитьПараметр("ДатаНачала", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	Период.ДатаОкончания);
	
	СтруктураВозврата = Новый Структура("ТайминЗадач, ПлановоеЗначение", Новый ТаблицаЗначений);
	ТайминЗадач = Запрос.Выполнить().Выгрузить();
	
	ТайминЗадач.Колонки.Добавить("ДатаОкончания", 	Новый ОписаниеТипов("Дата"));
	ТайминЗадач.Колонки.Добавить("ПКД", 			Новый ОписаниеТипов("Булево"));

	ЗадачиКонструктора = Новый Массив;
	Для каждого х Из ТайминЗадач Цикл
	
		Если х.Исполнитель = Исполнитель Тогда
		
			Если ЗадачиКонструктора.Найти(х.Задача)  = Неопределено Тогда
			
				ЗадачиКонструктора.Добавить(х.Задача);	
			
			КонецЕсли;	
		
		КонецЕсли;	
	
	КонецЦикла;
	
	МассивДляУдаления 	= Новый Массив;
	МассивПКД 			= Новый Массив;
	
	ТипЗадачиПКД = Тип("ЗадачаСсылка.Задачи_ПКД");
	
	
	Для каждого х Из ТайминЗадач Цикл
		
		Если ЗадачиКонструктора.Найти(х.Задача) = Неопределено Тогда
			
			МассивДляУдаления.Добавить(х);
			
		Иначе
			
			х.ПКД = ТипЗнч(х.Задача) = ТипЗадачиПКД;
			
		КонецЕсли;	
	
	КонецЦикла;
	
	
	Для каждого х Из МассивДляУдаления Цикл
	
		ТайминЗадач.Удалить(х);	
	
	КонецЦикла;
	
	СтруктураВозврата.ТайминЗадач = ТайминЗадач.СкопироватьКолонки();
	
	МаксимальныйИндекс = ТайминЗадач.Количество() - 1;
	
	СтрокаНачалоработы = 0;
	Работа = Ложь;
	ПКД = Ложь;
	
	Для х = 0 По МаксимальныйИндекс Цикл
		
		СтрокаТайминга = ТайминЗадач[х];
		

		Если НЕ Работа И СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ВРаботеКонструктора Тогда
			
			Работа = Истина;
			СтрокаНачалоработы = х;
			ПКД = СтрокаТайминга.ПКД;
			
		ИначеЕсли Работа И СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ВРаботеКонструктора 
			И ПКД = СтрокаТайминга.ПКД Тогда
			Продолжить;	
		ИначеЕсли Работа И СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором 
			И ПКД = СтрокаТайминга.ПКД Тогда
			
			НС = СтруктураВозврата.ТайминЗадач.Добавить();	
			ЗаполнитьЗначенияСвойств(НС,  ТайминЗадач[СтрокаНачалоработы]);
			НС.ДатаОкончания	 = СтрокаТайминга.ДатаНачала;
			Работа = Ложь;
		Иначе
			Работа = Ложь;
		КонецЕсли;	
		
	КонецЦикла;
	
	
	ЗаполнитьСтадииЗадачи(СтруктураВозврата.ТайминЗадач);
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьТаймингиЗадач()  

Процедура ЗаполнитьСтадииЗадачи(ТайминЗадач)

	КэшСтадий = Новый ТаблицаЗначений;
	КэшСтадий.Колонки.Добавить("Стадия", 			Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	КэшСтадий.Колонки.Добавить("ТекущиеСостояние",	Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЗадач"));
	КэшСтадий.Колонки.Добавить("ТекущийСтатус", 	Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	КэшСтадий.Колонки.Добавить("ТекущийТипЗадачи", 	Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадачКонструирования")); 
	
	Отбор = Новый Структура("ТекущиеСостояние, ТекущийСтатус, ТекущийТипЗадачи", );
	
	МассивСтадий = Новый Массив;
	
	Для каждого СтрокаТайминга Из ТайминЗадач Цикл
		
		Отбор.ТекущиеСостояние 	= СтрокаТайминга.Состояние;
		Отбор.ТекущийТипЗадачи 	= СтрокаТайминга.ТипЗадачи;
		Отбор.ТекущийСтатус 	= СтрокаТайминга.Статус;
		
		НайденыеСтроки = КэшСтадий.НайтиСтроки(Отбор);
		Если НайденыеСтроки.Количество() = 0 Тогда
		
			СтрокаТайминга.Стадия = омЗадачиПКДСервер.ПолучитьСтадиюКомплеткаНаОснованииПараметров(Отбор);		
			
			НС = КэшСтадий.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Отбор);
			НС.Стадия = СтрокаТайминга.Стадия; 
			
			МассивСтадий.Добавить(НС.Стадия);
		
		Иначе
		
			СтрокаТайминга.Стадия = НайденыеСтроки[0].Стадия;		
		
		КонецЕсли;
		
		СтрокаТайминга.ДатаСтрокойН = Формат(СтрокаТайминга.ДатаНачала, "ДФ=dd.MM.yy") 
										+ " " + Формат(СтрокаТайминга.ДатаНачала, "ДФ=HH:mm");
		СтрокаТайминга.ДатаСтрокойК = Формат(СтрокаТайминга.ДатаОкончания, "ДФ=dd.MM.yy") 
										+ " " + Формат(СтрокаТайминга.ДатаОкончания, "ДФ=HH:mm");
		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплекта.Ссылка КАК Стадия,
		|	СтадииКомплекта.Ожидание КАК Ожидание,
		|	СтадииКомплекта.Доработка КАК Доработка,
		|	СтадииКомплекта.ПолноеНаименование КАК СтадияНаименование
		|ИЗ
		|	Справочник.СтадииКомплекта КАК СтадииКомплекта
		|ГДЕ
		|	СтадииКомплекта.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивСтадий);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Отбор = Новый Структура("Стадия", );
	
	Пока Выборка.Следующий() Цикл
		Отбор.Стадия = Выборка.Стадия;
		
		Для каждого х Из ТайминЗадач.НайтиСтроки(Отбор) Цикл
		
			ЗаполнитьЗначенияСвойств(х, Выборка);	
		
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#Область СобытияФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ГлавныйКонструктор") Тогда
		
		Если Параметры.Свойство("Конструктор") Тогда
			
			Конструктор = Параметры.Конструктор;	
			
		КонецЕсли;
		
	Иначе
		
		Конструктор = ПараметрыСеанса.ТекущийПользователь;	
		
	КонецЕсли;
	
	Период.ДатаОкончания 	= КонецДня(ТекущаяДата());
	Период.ДатаНачала		= НачалоМесяца(ДобавитьМесяц(Период.ДатаОкончания, -1));
	
КонецПроцедуры
	
&НаКлиенте
Процедура КонструкторПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Конструктор) Тогда
		РабочееВремя = омСотрудники.ПолучитьРабочееВремяПользователи(Конструктор)[0];
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	Если ЗначениеЗаполнено(Конструктор) Тогда
		РабочееВремя = омСотрудники.ПолучитьРабочееВремяПользователи(Конструктор)[0];
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыводаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
	
		СтандартнаяОбработка = Ложь;
		
		
		СтруктураПараметры = Новый Структура("Расшифровка, ТекущаяОбласть", Расшифровка, Элемент.ТекущаяОбласть);
		
		ОписаниеОповещания = Новый ОписаниеОповещения("ПослеВводаНормы", ЭтаФорма, СтруктураПараметры);
		ПоказатьВводЧисла(ОписаниеОповещания, Расшифровка.НормаВремени, "Норма", 4, 1);
	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти  

&НаКлиенте
Процедура ПослеВводаНормы(Норма, ДополнительныеПараметры) Экспорт

	Если Норма = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	Если ДополнительныеПараметры.Расшифровка.НормаВремени = Норма Тогда
		Возврат;
	КонецЕсли;
	
	//ДополнительныеПараметры.ТекущаяОбласть.Текст = Норма;
	ДополнительныеПараметры.ТекущаяОбласть.Расшифровка.НормаВремени = Норма;
	//
	ЗписатьВРегистрНаСервере(ДополнительныеПараметры.Расшифровка);
	СформироватьОтчет(РабочееВремя);

КонецПроцедуры // ПослеВводаНормы()


&НаСервереБезКонтекста
Процедура ЗписатьВРегистрНаСервере(Расшифровка)


	МенеджерЗаписи = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Расшифровка.Период;
	МенеджерЗаписи.Задача = Расшифровка.Задача;
	
	МенеджерЗаписи.Прочитать();

	МенеджерЗаписи.Период 		= Расшифровка.Период;
	МенеджерЗаписи.Задача 		= Расшифровка.Задача;
	МенеджерЗаписи.НормаВремени = Расшифровка.НормаВремени;
	
	МенеджерЗаписи.Записать();

КонецПроцедуры // ЗписатьВРегистрНаСервере(Расшифровка)
