
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Проект") Тогда 
		
		Проект = Параметры.Проект;
		Элементы.Проект.ТолькоПросмотр = Истина;
		Элементы.Список.Отображение = ОтображениеТаблицы.Список; 

		Если ЭтаФорма.Параметры.Свойство("ТолькоНеИспользованые") Тогда
			Если ЭтаФорма.Параметры.ТолькоНеИспользованые Тогда
				Список.ТекстЗапроса = "ВЫБРАТЬ
				                      |	спрИзделияЗаказчика.Ссылка КАК Ссылка,
				                      |	спрИзделияЗаказчика.Комментарий КАК Комментарий,
				                      |	ВЫБОР
				                      |		КОГДА спрИзделияЗаказчика.ЭтоГруппа
				                      |			ТОГДА спрИзделияЗаказчика.Наименование
				                      |		ИНАЧЕ ДанныеИзделияЗаказчика.НаименованиеСАртикулом
				                      |	КОНЕЦ КАК ПолноеНаименование,
				                      |	ДанныеИзделияЗаказчика.Актуальность КАК Актуальность,
				                      |	ДанныеИзделияЗаказчика.НомерПоПорядку КАК НомерПоПорядку,
				                      |	спрИзделияЗаказчика.Код КАК Код
				                      |ИЗ
				                      |	Справочник.ИзделияЗаказчика КАК спрИзделияЗаказчика
				                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК тчДоговораСделкиЭлементыСделки
				                      |		ПО (тчДоговораСделкиЭлементыСделки.ИзделиеЗаказчика = спрИзделияЗаказчика.Ссылка)
				                      |			И (НЕ тчДоговораСделкиЭлементыСделки.Ссылка = &СсылкаДоговор)
				                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
				                      |		ПО (ДанныеИзделияЗаказчика.ИзделиеЗаказчика = спрИзделияЗаказчика.Ссылка)
				                      |ГДЕ
				                      |	спрИзделияЗаказчика.Проект = &Проект
				                      |	И тчДоговораСделкиЭлементыСделки.Ссылка ЕСТЬ NULL
				                      |	И НЕ спрИзделияЗаказчика.ЭтоГруппа
				                      |	И НЕ спрИзделияЗаказчика.Ссылка В (&ТекущиеЭлементыСделк)";
				
									  
				Список.Параметры.УстановитьЗначениеПараметра("ТекущиеЭлементыСделк",ЭтаФорма.Параметры.ТекущиеИзделияЗаказчика);
				Список.Параметры.УстановитьЗначениеПараметра("СсылкаДоговор", Параметры.СсылкаДоговор);
			КонецЕсли;
			Список.Параметры.УстановитьЗначениеПараметра("Проект", Параметры.Проект);
		КонецЕсли;
		
		Если Параметры.Свойство("Отказ") Тогда
			Если Параметры.Отказ Тогда
				Список.ТекстЗапроса = "ВЫБРАТЬ
				                      |	спрИзделияЗаказчика.Ссылка КАК Ссылка,
				                      |	спрИзделияЗаказчика.Комментарий КАК Комментарий,
				                      |	спрИзделияЗаказчика.Наименование КАК Наименование,
				                      |	ДанныеИзделияЗаказчика.Актуальность КАК Актуальность,
				                      |	ДанныеИзделияЗаказчика.НомерПоПорядку КАК НомерПоПорядку,
				                      |	спрИзделияЗаказчика.Код КАК Код
				                      |ИЗ
				                      |	Справочник.ИзделияЗаказчика КАК спрИзделияЗаказчика
				                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК тчДоговораСделкиЭлементыСделки
				                      |		ПО (тчДоговораСделкиЭлементыСделки.ИзделиеЗаказчика = спрИзделияЗаказчика.Ссылка)
				                      |			И (НЕ тчДоговораСделкиЭлементыСделки.Ссылка = &СсылкаДоговор)
				                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
				                      |		ПО (ДанныеИзделияЗаказчика.ИзделиеЗаказчика = спрИзделияЗаказчика.Ссылка)
				                      |ГДЕ
				                      |	спрИзделияЗаказчика.Ссылка В(&ТекущиеЭлементыСделк)";
				
				
				Список.Параметры.УстановитьЗначениеПараметра("ТекущиеЭлементыСделк"
				,РегистрыСведений.ИтогоПроекта.ОстаткиПоДоговору(Параметры.Проект,Параметры.НомерПоПорядку).ВыгрузитьКолонку("ИзделияЗаказчика"));
				
				Элементы.Список.Отображение = ОтображениеТаблицы.Список; 
			КонецЕсли;
			
		ИначеЕсли Параметры.Свойство("НеПоказыватьИзделияЗаказчика") Тогда
			Список.ТекстЗапроса = "ВЫБРАТЬ
			                      |	спрИзделияЗаказчика.Ссылка КАК Ссылка,
			                      |	спрИзделияЗаказчика.Комментарий КАК Комментарий,
			                      |	спрИзделияЗаказчика.Наименование КАК Наименование,
			                      |	ДанныеИзделияЗаказчика.Актуальность КАК Актуальность,
			                      |	ДанныеИзделияЗаказчика.НомерПоПорядку КАК НомерПоПорядку,
			                      |	спрИзделияЗаказчика.Код КАК Код
			                      |ИЗ                                                                                        
			                      |	Справочник.ИзделияЗаказчика КАК спрИзделияЗаказчика
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
			                      |		ПО (ДанныеИзделияЗаказчика.ИзделиеЗаказчика = спрИзделияЗаказчика.Ссылка)
			                      |ГДЕ
			                      |	спрИзделияЗаказчика.Проект = &Проект
			                      |	И НЕ спрИзделияЗаказчика.Ссылка В (&НеПоказыватьИзделияЗаказчика)";
			
			
			Список.Параметры.УстановитьЗначениеПараметра("Проект", 							Параметры.Проект); 
			Список.Параметры.УстановитьЗначениеПараметра("НеПоказыватьИзделияЗаказчика", 	Параметры.НеПоказыватьИзделияЗаказчика); 
		КонецЕсли;
		
	Иначе
	
		Список.Параметры.УстановитьЗначениеПараметра("Проект", 	Справочники.Проекты.ПустаяСсылка());

	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура СделкаПриИзмененииНаСервере()
	Список.Параметры.УстановитьЗначениеПараметра("Проект",ЭтаФорма.Проект);
КонецПроцедуры

&НаКлиенте
Процедура СделкаПриИзменении(Элемент)
	СделкаПриИзмененииНаСервере();
КонецПроцедуры

           